//= Auriga Script ==============================================================
// Ragnarok Online Prontera Maze Monster Spawn Script　　Ep 10.4
//==============================================================================

//============================================================
// 迷宮の森 01 - prt_maze01.gat
//------------------------------------------------------------
prt_maze01.gat,179,20,21,21	monster	ポリン			1002,5,120000,40000,1
prt_maze01.gat,139,20,21,21	monster	ルナティック		1063,5,120000,40000,1
prt_maze01.gat,99,20,21,21	monster	ファブル		1007,5,120000,40000,1
prt_maze01.gat,99,20,21,21	monster	クリーミー		1018,1,120000,40000,1
prt_maze01.gat,59,20,21,21	monster	プパ			1008,5,120000,40000,1
prt_maze01.gat,19,20,21,21	monster	ポポリン		1031,5,120000,40000,1
prt_maze01.gat,179,60,21,21	monster	ロッカー		1052,5,120000,40000,1
prt_maze01.gat,139,60,21,21	monster	ビッグフット		1060,5,120000,40000,1
prt_maze01.gat,99,60,21,21	monster	スモーキー		1056,5,120000,40000,1
prt_maze01.gat,59,60,21,21	monster	スネイク		1025,5,120000,40000,1
prt_maze01.gat,19,60,21,21	monster	ウルフ			1013,5,120000,40000,1
prt_maze01.gat,179,100,21,21	monster	アルギオペ		1099,3,120000,40000,1
prt_maze01.gat,139,100,21,21	monster	アルゴス		1100,3,120000,40000,1
prt_maze01.gat,99,100,21,21	monster	チョンチョン		1011,5,120000,40000,1
prt_maze01.gat,59,100,21,21	monster	ホルン			1128,5,120000,40000,1
prt_maze01.gat,19,100,21,21	monster	ハンターフライ		1035,3,120000,40000,1
prt_maze01.gat,179,140,21,21	monster	マンティス		1139,3,120000,40000,1
prt_maze01.gat,139,140,21,21	monster	スタイナー		1174,5,120000,40000,1
prt_maze01.gat,99,140,21,21	monster	サイドワインダー	1037,3,120000,40000,1
prt_maze01.gat,59,140,21,21	monster	ヨーヨー		1057,4,120000,40000,1
prt_maze01.gat,59,140,21,21	monster	チョコ			1214,2,120000,40000,1
prt_maze01.gat,19,140,21,21	monster	スチールチョンチョン	1042,5,120000,40000,1
prt_maze01.gat,179,180,21,21	monster	コーコー		1104,5,120000,40000,1
prt_maze01.gat,139,180,21,21	monster	キャラメル		1103,5,120000,40000,1
prt_maze01.gat,99,180,21,21	monster	ダスティネス		1114,5,120000,40000,1
prt_maze01.gat,59,180,21,21	monster	マーティン		1145,5,120000,40000,1
prt_maze01.gat,19,180,21,21	monster	サベージベベ		1167,3,120000,40000,1
prt_maze01.gat,19,180,21,21	monster	サベージ		1166,5,120000,40000,1
prt_maze01.gat,0,0,0,0		monster	ハンターフライ		1035,1,0,0,0
prt_maze01.gat,0,0,0,0		monster	さすらい狼		1092,1,3600000,1800000,0
prt_maze01.gat,101,138,5,5	monster	輝く草			1083,1,1800000,900000,1
prt_maze01.gat,101,138,5,5	monster	白い草			1082,1,180000,90000,1
prt_maze01.gat,99,181,5,5	monster	白い草			1082,2,180000,90000,1
prt_maze01.gat,60,140,10,15	monster	青い草			1079,1,900000,450000,1
prt_maze01.gat,61,101,10,10	monster	黄色草			1081,1,600000,300000,1
prt_maze01.gat,141,100,10,10	monster	輝く草			1083,1,1800000,900000,1
prt_maze01.gat,141,100,10,10	monster	青い草			1079,1,900000,450000,1
prt_maze01.gat,0,0,0,0		monster	赤い草			1078,5,180000,90000,1
prt_maze01.gat,100,100,10,10	monster	青い草			1079,1,900000,450000,1
prt_maze01.gat,100,100,10,10	monster	黄色草			1081,1,600000,300000,1
prt_maze01.gat,176,132,5,5	monster	黒いきのこ		1084,3,180000,90000,1
prt_maze01.gat,181,149,3,3	monster	黒いきのこ		1084,2,180000,90000,1
prt_maze01.gat,178,60,10,10	monster	赤いきのこ		1085,3,180000,90000,1
prt_maze01.gat,168,60,3,3	monster	赤いきのこ		1085,2,180000,90000,1

//============================================================
// 迷宮の森 02 - prt_maze02.gat
//------------------------------------------------------------
prt_maze02.gat,0,0,0,0	monster	ポポリン	1031,25,0,0,0
prt_maze02.gat,0,0,0,0	monster	ビッグフット	1060,5,0,0,0
prt_maze02.gat,0,0,0,0	monster	サスカッチ	1243,1,900000,400000,0
prt_maze02.gat,0,0,0,0	monster	レイブオルマイ	1306,1,1800000,900000,0

//============================================================
// 迷宮の森 03 - prt_maze03.gat
//------------------------------------------------------------
prt_maze03.gat,0,0,0,0		monster	サイドワインダー	1037,10,0,0,0
prt_maze03.gat,0,0,0,0		monster	ハンターフライ		1035,30,0,0,0
prt_maze03.gat,0,0,0,0		monster	ゴーストリング		1120,1,6800000,3400000,1
prt_maze03.gat,0,0,0,0		monster	キラーマンティス	1294,1,0,0,0
prt_maze03.gat,150,50,70,70	monster	サイドワインダー	1037,20,300000,150000,0
prt_maze03.gat,150,50,70,70	monster	ボーカル		1088,1,1920000,1500000,1
prt_maze03.gat,50,150,70,70	monster	ステムワーム		1215,20,300000,150000,0
prt_maze03.gat,50,150,70,70	monster	さすらい狼		1092,1,1920000,1500000,1
prt_maze03.gat,170,170,70,70	monster	マンティス		1139,30,60000,30000,0
prt_maze03.gat,170,170,70,70	monster	エクリプス		1093,1,1920000,1500000,1
prt_maze03.gat,23,23,70,70	monster	マスターリング		1090,1,1920000,1500000,1
prt_maze03.gat,100,100,80,80	monster	バフォメットJr.		1101,25,0,0,0
prt_maze03.gat,0,0,0,0		monster	バフォメット		1039,1,7200000,3600000,1
prt_maze03.gat,61,98,10,10	monster	輝く草			1083,1,1800000,900000,1
prt_maze03.gat,61,98,10,10	monster	青い草			1079,1,900000,450000,1
prt_maze03.gat,61,98,10,10	monster	黄色草			1081,1,600000,300000,1
prt_maze03.gat,57,56,10,10	monster	輝く草			1083,1,1800000,900000,1
prt_maze03.gat,15,15,10,10	monster	輝く草			1083,1,1800000,900000,1
prt_maze03.gat,137,140,3,3	monster	輝く草			1083,1,1800000,900000,1
prt_maze03.gat,17,58,10,10	monster	輝く草			1083,1,1800000,900000,1
prt_maze03.gat,17,58,10,10	monster	青い草			1079,1,900000,450000,1
prt_maze03.gat,99,141,10,10	monster	青い草			1079,1,900000,450000,1
prt_maze03.gat,99,21,10,10	monster	青い草			1079,1,900000,450000,1
prt_maze03.gat,0,0,0,0		monster	赤い草			1078,5,180000,90000,1
prt_maze03.gat,99,21,10,10	monster	黒いきのこ		1084,3,180000,90000,1
prt_maze03.gat,54,15,10,10	monster	黒いきのこ		1084,3,180000,90000,1
prt_maze03.gat,171,180,3,3	monster	赤いきのこ		1085,2,180000,90000,1
prt_maze03.gat,174,187,3,3	monster	赤いきのこ		1085,3,180000,90000,1
