//= Athena Script ==============================================================
// Ragnarok Online Hugel Town Script	by Blaze
//==============================================================================

//============================================================
// Shop
//------------------------------------------------------------
hugel.gat,105,169,5	shop	牛乳商人	90,519
hugel.gat,77,167,3	shop	果物商人	892,522,512,513,515,516,535
hu_in01.gat,241,368,2	shop	道具商人	53,1750,611,501,502,503,504,506,645,656,601,602,1065
hu_in01.gat,252,368,3	shop	道具商人	90,717,2201,910,528
hu_in01.gat,100,390,3	shop	武器商人	86,1701,1707,1718,1714
hu_in01.gat,94,390,3	shop	武器商人	898,1116,1154,1354,1201
hu_in01.gat,94,313,3	shop	防具商人	86,2224,2232,2226,2101,2103,2401,2501,2307,2105

//============================================================
// フィゲルNPC
//------------------------------------------------------------
hugel.gat,85,165,5	script	村の少年	896,{
	mes "[村の少年]";
	mes "僕は欲しいものがあるんだ。";
	mes "でも、ママが買ってくれなくて……";
	close;
}

hugel.gat,175,115,5	script	村のお年寄り	897,{
	mes "[村のお年寄り]";
	mes "年を取っても、このあふれる筋肉は";
	mes "まったく衰えんわい。";
	mes "どうだ？　腕相撲でもしてみるか？";
	close;
}

hugel.gat,169,112,5	script	村のお婆さん	892,{
	mes "[村のお婆さん]";
	mes "ホホホホホホホ。";
	mes "この村では大勢の人がよく似てるの。";
	mes "きっと、長い間一緒に";
	mes "暮らしてきたせいね。";
	close;
}

hugel.gat,189,143,5	script	純粋な青年	898,{
	mes "[純粋な青年]";
	mes "……うわぁ。";
	mes "あんな大きな風船が";
	mes "空に浮かぶんだ……";
	mes "俺も腹に空気をいっぱい入れて";
	mes "空を飛んでみようかな？";
	close;
}

hugel.gat,71,197,3	script	リサ	90,{
	mes "[リサ]";
	mes "フィゲルは小さい村だから、";
	mes "一日で、誰に何があったのか";
	mes "すぐうわさが広まるの。";
	next;
	mes "[リサ]";
	mes "私はこんな田舎";
	mes "大っ嫌い。";
	mes "はやく大きい町に";
	mes "引っ越したいわ。";
	close;
}

hugel.gat,126,151,3	script	エミリ	90,{
	mes "[エミリ]";
	mes "この村は田舎ですけど、";
	mes "とても平和な所です。";
	mes "ここに来る方も皆";
	mes "良い人ばかりです。";
	next;
	mes "[エミリ]";
	mes "でも、私の姉さんは、";
	mes "この村を出ることばかり考えています。";
	mes "姉さんの話だと";
	mes "長く生きているから";
	mes "この村の恐ろしさがわかるみたいです。";
	mes "……私にはよくわかりません。";
	close;
}

//============================================================
// フィゲル室内NPC
//------------------------------------------------------------
hu_in01.gat,377,106,3	script	酒店のお婆さん	892,{
	mes "[酒店のお婆さん]";
	mes "最近、初めて見る人が";
	mes "どんどん増えているわ。";
	mes "少し忙しくなるけど、";
	mes "おいしい食べ物を食べて";
	mes "幸せそうな顔を見ていると";
	mes "疲れがすっきりとれるわ。ほほほ。";
	close;
}

hu_in01.gat,365,170,3	script	村の少女	793,{
	mes "[村の少女]";
	mes "ストーブ……あったかい……好き。";
	mes "ん……なんだか……眠く";
	mes "……クー……";
	close;
}

hu_in01.gat,111,386,4	script	クリス	86,{
	mes "[クリス]";
	mes "実はこの村では";
	mes "武器はあまり存在していません。";
	mes "狩りや採集、そしてその時";
	mes "自分の身を守るための物";
	mes "ぐらいしか用意してありません。";
	next;
	mes "[クリス]";
	mes "便利な生活をしたいなら";
	mes "大きい都市へ行かなければなりません。";
	close;
}

//============================================================
// おでん屋のアルバイトクエスト
//- Registry -------------------------------------------------
// HU_1QUE -> 0～10
//------------------------------------------------------------
hu_in01.gat,15,372,3	script	ジレット・レビト	74,{
	switch(HU_1QUE) {
	case 0:
		mes "[ジレット]";
		mes "はい、いらっしゃいませー";
		mes "いらっしゃいませー";
		next;
		mes "[ジレット]";
		mes "あっ！";
		mes "そこのあなた！";
		mes "初めて見る顔ね。";
		mes "ちょっと……";
		mes "ちょっとこっちに。";
		next;
		mes "[ジレット]";
		mes "やっぱり……";
		mes "この村の人じゃないわね。";
		mes "私はジレット・レビト。";
		mes "この村名物のおでんを売ってるわ。";
		next;
		mes "[ジレット]";
		mes "シュバルツバルド国内じゃ";
		mes "まだまだおでんを";
		mes "知っている人は少ないけど、";
		mes "いつか有名になってみせるわ。";
		next;
		mes "[ジレット]";
		mes "一応、フィゲルだったら";
		mes "かなり人気なんだけど……";
		mes "人手が足りなくて、";
		mes "調理と配達を同時にするのは";
		mes "無理があるの。";
		next;
		mes "[ジレット]";
		mes "そこでなんだけど……";
		mes "よかったら配達のバイトを";
		mes "してみる気は無い？";
		mes "報酬は、一つ配達する度に";
		mes "料理を一つ。";
		mes "どう？　やってみない？";
		next;
		switch(select("配達する","それよりおでんを買う","配達しない")) {
		case 1:
			mes "[ジレット]";
			mes "そんな簡単に頼まれてくれるなんて……";
			mes "まっ、とにかくありがと。";
			mes "それじゃあさっそく、";
			mes "今の配達先は……";
			next;
			set HU_1QUE,rand(1,4);
			getitem 584,1;
			switch(HU_1QUE) {
			case 1:
				mes "[ジレット]";
				mes "常連客のメワンさん。";
				mes "この仕事を始める時に";
				mes "私を手伝ってくれた人よ。";
				break;
			case 2:
				mes "[ジレット]";
				mes "私の同居人、ラヨマ。";
				mes "掃除好きだけど、";
				mes "黒くて早い虫を見ると";
				mes "固まっちゃう可愛い子よ。";
				break;
			case 3:
				mes "[ジレット]";
				mes "私の友達のネハ。";
				mes "彼女は常連さんでもあるわ。";
				break;
			case 4:
				mes "[ジレット]";
				mes "噂の貴族病、エルザンさん。";
				mes "ちょっと関わり辛いけど、";
				mes "根はいい人よ。";
				break;
			}
			mes "冷めると美味しくないから";
			mes "早く届けてね。";
			close;
		case 2:
			mes "[ジレット]";
			mes "あら、ごめんなさい。";
			mes "おでんが食べたかったのね。";
			mes "一人前100Zenyです。";
			next;
			if(select("買う","買わない")==2)
				break;
			if(Zeny < 100) {
				mes "[ジレット]";
				mes "あら？";
				mes "お金が足りないみたいよ。";
				close;
			}
			set Zeny,Zeny-100;
			getitem 584,1;
			mes "[ジレット]";
			mes "ありがとう。";
			mes "どうぞ召し上がって。";
			close;
		case 3:
			break;
		}
		mes "[ジレット]";
		mes "そう……";
		mes "気が変わったらまたどうぞ。";
		close;
	case 1:
	case 2:
	case 3:
	case 4:
		if(countitem(584) > 0) {
			mes "[ジレット]";
			mes "何をしているの？";
			mes "配達先は" +((HU_1QUE == 1)? "メワンさん": (HU_1QUE == 2)? "私の同居人、ラヨマ": (HU_1QUE == 3)? "私の友達、ネハ": "有名人のエルザンさん")+ "。";
			mes "冷めると美味しくないから";
			mes "早く届けてね。";
			close;
		}
		mes "[ジレット]";
		mes "あれ？　ちゃんと配達した？";
		mes "あ、もしかして無くした？";
		mes "もう……今度こそちゃんと";
		mes "届けてよ。";
		next;
		mes "[ジレット]";
		mes "でも、おでんは";
		mes "100Zenyで売っているわ。";
		if(Zeny < 100) {
			mes "けど、弁償すらできないのね……";
			mes "仕方ない。";
			mes "今回は犬に噛まれたと思う。";
			mes "配達はもうしなくていいわ。";
			set HU_1QUE,10;
			close;
		}
		mes "弁償として100Zenyもらうから。";
		mes "もう無くさないようにね。";
		set Zeny,Zeny-100;
		getitem 584,1;
		close;
	default:
		mes "[ジレット]";
		mes "はい、いらっしゃいませー";
		mes "いらっしゃいませー";
		close;
	case 9:
		mes "[ジレット]";
		mes "無事に届けれたみたいね。";
		mes "ご苦労様。";
		mes "これは感謝の印よ。";
		mes "よかったら食べてちょうだい。";
		set HU_1QUE,0;
		if(checkre())
			getexp 100,0;
		else
			getexp 1000,0;
		getitem 584,3;
		next;
		mes "[ジレット]";
		mes "また機会があれば";
		mes "立ち寄ってね。";
		mes "それと……";
		mes "おでんの宣伝もよろしくね。";
		close;
	case 10:
		mes "[ジレット]";
		mes "あ……悪いけど、";
		mes "一度信用を無くした人に";
		mes "もう一度機会を与えるほど";
		mes "私は寛大じゃないから。";
		close;
	}
}

hugel.gat,87,138,3	script	メワン	86,{
	if(HU_1QUE == 1 && countitem(584) > 0) {
		mes "[メワン]";
		mes "やや、これは！";
		mes "愛しのジレットさんお手製、";
		mes "おでんではありませんか！";
		next;
		mes "[メワン]";
		mes "届けてくれたのは嬉しいけど、";
		mes "遅すぎです！";
		mes "どれだけ待たされたのか、";
		mes "わかっているのですか!?";
		next;
		mes "[メワン]";
		mes "まぁ、^FF0000追憶のしおり^000000を一つ";
		mes "もってきたら許してあげましょう。";
		mes "私のコレクションに相応しい";
		mes "物ですからね。";
		next;
		mes "[メワン]";
		mes "さぁ、早く取ってきてください！";
		mes "それまで私は、ジレットさんの";
		mes "おでんを食べられる感動を";
		mes "モロクの砂漠ダンスで表現しましょう！";
		mes "クルルルルルル～クルルルルルル～";
		set HU_1QUE,5;
		close;
	}
	if(HU_1QUE == 5) {
		if(countitem(584) < 1 || countitem(7015) < 1) {
			mes "[メワン]";
			mes "ルルルルルル、ルルルルルル～";
			mes "はやく^FF0000追憶のしおり^000000を";
			mes "手に入れてきてくださ～い。";
			mes "ルルルルルル、ルルルルルル～";
			mes "もちろんおでんも忘れずに～";
			mes "ルルルルルル、ルルル～";
			close;
		}
		mes "[メワン]";
		mes "おぉ！　これは！";
		mes "なかなかセンスのいい物ですね！";
		mes "ありがとう。この幸せと共に";
		mes "ジレットさんのおでんを";
		mes "食べるとしましょう！";
		next;
		mes "[メワン]";
		mes "ああ、この香り！";
		mes "感動のモロクの砂漠歌を";
		mes "口ずさんでしまいそうだ！";
		next;
		mes "[メワン]";
		mes "あぁ、美味しかった。";
		mes "またよろしく頼むよ。";
		set HU_1QUE,9;
		delitem 584,1;
		delitem 7015,1;
		close;
	}
	mes "[メワン]";
	mes "人々は私をこう呼ぶ！";
	mes "センスマン！";
	mes "その名はメワン！";
	mes "アイテム収集家であり、";
	mes "砂漠の町、モロクの";
	mes "歌と踊りを愛する者！";
	close;
}

hugel.gat,84,125,3	script	ラヨマ	700,{
	if(HU_1QUE == 2 && countitem(584) > 0) {
		mes "[ラヨマ]";
		mes "遅かったわね。";
		mes "私をこんなに待たせるなんて";
		mes "いい度胸してるわ。";
		next;
		mes "[ラヨマ]";
		mes "でも、こんなに遅れるようじゃ";
		mes "ジレットの店の評判が落ちちゃうわよ。";
		next;
		mes "[ラヨマ]";
		mes "ま、見逃してあげない事もないわ。";
		mes "^FF0000毒キノコの胞子^000000を1つ持って来たら";
		mes "配達が遅れた事を黙っといてあげる。";
		next;
		mes "[ラヨマ]";
		mes "がんばって探してきてちょうだい。";
		set HU_1QUE,6;
		close;
	}
	if(HU_1QUE == 6) {
		if(countitem(584) < 1 || countitem(7033) < 1) {
			mes "[ラヨマ]";
			mes "私はきのこが大好き。";
			mes "だから、はやく^FF0000毒キノコの胞子^000000を";
			mes "手に入れてきて。";
			mes "おでんも忘れないでよね。";
			close;
		}
		mes "[ラヨマ]";
		mes "……これは！";
		mes "光輝く^FF0000毒キノコの胞子^000000！";
		mes "見事だわ……";
		next;
		mes "[ラヨマ]";
		mes "……いいわ。";
		mes "じゃ、約束どおり";
		mes "遅れた事は黙っといてあげる。";
		next;
		mes "[ラヨマ]";
		mes "あ……もう1つ……";
		mes "ジレットに今日は早く帰るように";
		mes "言っておいて。";
		mes "最近帰りが遅いのよ。";
		set HU_1QUE,9;
		delitem 584,1;
		delitem 7033,1;
		close;
	}
	mes "[ラヨマ]";
	mes "私は、きのこと歌が好きなラヨマ。";
	mes "同居人のジレットと";
	mes "一緒に暮らしているわ。";
	close;
}

hugel.gat,76,134,3	script	ネハ	101,{
	if(HU_1QUE == 3 && countitem(584) > 0) {
		mes "[ネハ]";
		mes "なに？";
		mes "何か用？";
		mes "……あぁ。";
		mes "ジレットの店の人ね。";
		mes "随分遅かったじゃない。";
		mes "ずっと待ってたのよ。";
		next;
		mes "[ネハ]";
		mes "うーん……";
		mes "美少年とまではいかないけど……";
		mes "可愛い顔してるし、";
		mes "許してあげない事もないわ。";
		mes "フフ……";
		next;
		mes "[ネハ]";
		mes "^FF0000ホイップ^000000を一つ買ってきて。";
		mes "それでチャラにしてあげる。";
		next;
		mes "[ネハ]";
		mes "ほら、早くいってきて。";
		mes "仕事を終わらせたいでしょ？";
		mes "^FF0000ホイップ^000000よ。";
		mes "間違えないでよ。";
		set HU_1QUE,7;
		close;
	}
	if(HU_1QUE == 7) {
		if(countitem(584) < 1 || countitem(1960) < 1) {
			mes "[ネハ]";
			mes "早く^FF0000ホイップ^000000を買ってきて。";
			mes "おでんも丁寧に扱うのよ。";
			close;
		}
		mes "[ネハ]";
		mes "うん、弾力のいい^FF0000ホイップ^000000ね。";
		mes "フフ、それじゃあ特別に";
		mes "心を込めて叩いてあ・げ・る。";
		mes "あなた、運がいいわね……";
		mes "悲鳴を上げても止めないわよ。";
		mes "フフフフフ。";
		next;
		mes "[ネハ]";
		mes "エイッ！";
		next;
		percentheal -25,0;
		mes "-ビシッ！-";
		next;
		mes "[ネハ]";
		mes "エイッ！";
		next;
		percentheal -25,0;
		mes "-ビシッ！-";
		next;
		mes "[ネハ]";
		mes "あら、1回だけのつもりが";
		mes "ついつい2回も叩いちゃったわ。";
		mes "フフ、サービスしすぎかしら。";
		next;
		mes "[ネハ]";
		mes "それじゃあ、";
		mes "おでんを受け取るわ。";
		mes "今なら幸せな気持ちで";
		mes "味わえそうだわ……";
		mes "フフフフフフ。";
		next;
		mes "[ネハ]";
		mes "それじゃ、ご苦労様。";
		mes "次もあなたに配達して欲しいわ。";
		mes "フフ……";
		set HU_1QUE,9;
		delitem 584,1;
		delitem 1960,1;
		close;
	}
	mes "[ネハ]";
	mes "うふふふふ。";
	mes "美少年はいないかしら。";
	mes "鞭で叩いた時の切なげな顔……";
	mes "あぁ、想像するだけで……";
	close;
}

hugel.gat,102,161,3	script	エルザン	100,{
	if(HU_1QUE == 4 && countitem(584) > 0) {
		mes "[エルザン]";
		mes "ふん、亀のように遅かったな。";
		mes "だが、君の歩く速度と違い、";
		mes "距離を超える程の";
		mes "おでんの香りは、まさしく";
		mes "優れた一品と言えるだろう。";
		mes "その香りは今も私を刺激している。";
		next;
		mes "[エルザン]";
		mes "しかし、それも無用の長物。";
		mes "いくら素晴らしいといえ、";
		mes "器がなければどうしようもあるまい。";
		mes "プランチェペシュ家の長男である、";
		mes "このエルザンニムが吟味する";
		mes "事ができないとは……";
		next;
		mes "[エルザン]";
		mes "せめて庶民が使うという";
		mes "^FF0000白い皿^000000があれば";
		mes "問題はないのだが……";
		set HU_1QUE,9;
		close;
	}
	if(HU_1QUE == 9) {
		if(countitem(584) < 1 || countitem(736) < 1) {
			mes "[エルザン]";
			mes "悲しいことだ……";
			mes "私の前に望む物があるというのに、";
			mes "それは器を持たぬ。";
			mes "^FF0000白い皿^000000でもない限り、";
			mes "私はこの食物を吟味する事が";
			mes "できない。";
			close;
		}
		mes "[エルザン]";
		mes "ふむ、相変わらず私を刺激する";
		mes "優雅な香りだが、器が……";
		mes "む？　君が持っているその皿。";
		mes "その純白色は品格があるように見える。";
		mes "よく見せてもらいたい。";
		next;
		mes "[エルザン]";
		mes "ん……やはり……";
		mes "プランチェペシュ家の長男である";
		mes "この私が使うには役不足な代物だ。";
		mes "だが、庶民の物としては立派な部類。";
		mes "少々気は乗らないが";
		mes "これを使うとしよう。";
		next;
		mes "[エルザン]";
		mes "品格は落ちてしまうが、";
		mes "これが君の限界だろう。";
		mes "しかし、立派な心構えだ。";
		mes "例え気品がないとはいえ、";
		mes "君は庶民の中では";
		mes "なかなかよい方の人間だ。";
		next;
		mes "[エルザン]";
		mes "君のような者が";
		mes "届けにきてくれるなら";
		mes "きっとこのおでんにも";
		mes "期待できるだろう。";
		mes "ふふ、失望させないでもらいたいな。";
		next;
		mes "[エルザン]";
		mes "では、ご苦労だった。";
		set HU_1QUE,9;
		delitem 584,1;
		delitem 736,1;
		close;
	}
	mes "[エルザン]";
	mes "なにかね。";
	mes "ここは由緒正しい家門、";
	mes "プランチェペシュ家の長男である";
	mes "この私、エルザンが休んでいる所だ。";
	next;
	mes "[エルザン]";
	mes "何か用でもあるのかね？";
	mes "でなければ、";
	mes "私の甘い一時を壊さないよう";
	mes "静かにしてもらいたい。";
	next;
	mes "[エルザン]";
	mes "どこかで見た事があるだと？";
	mes "ふ、気のせいではないかね。";
	mes "私のような優雅で品のある人物が";
	mes "二人もいるはずが無かろう。";
	next;
	mes "[エルザン]";
	mes "恐らく、私が";
	mes "こんな田舎に似合わないから";
	mes "何か勘違いでもしたのだろう。";
	close;
}

//============================================================
// 乳搾りクエスト
//- Registry -------------------------------------------------
// HU_2QUE -> 0～14
//------------------------------------------------------------
hugel.gat,56,104,3	script	クルペ	709,3,3,{
	switch(HU_2QUE) {
	case 0:
		mes "[クルペ]";
		mes "ワッ！　ワッ！　ワッ！";
		mes "大変な事になった！";
		mes "明日配達する牛乳！";
		mes "牛乳が！　牛乳が！";
		close;
	case 1:
		mes "[クルペ]";
		mes "ちょっとすまない。";
		mes "ブルプ、ブルプを見てないか？";
		mes "ブルプ！　ブルプ！";
		next;
		mes "[クルペ]";
		mes "明日、明日配達する牛乳！";
		mes "牛乳を用意しないといけないのに";
		mes "ブルプがいない！";
		mes "またどっかにいったんだ！";
		mes "働きたくなくて隠れてるんだ……";
		next;
		mes "[クルペ]";
		mes "その……";
		mes "ブルプを探してくれないか？";
		mes "何かお礼をするから……";
		mes "後生だから！";
		next;
		if(select("承諾する","断る")==2) {
			mes "[クルペ]";
			mes "あああああああ！";
			mes "ブルプ、ブルプ！";
			close;
		}
		mes "[クルペ]";
		mes "ああああ、ありがとう！";
		mes "ブルブルの牛乳はブルプじゃないと……";
		mes "必ず、必ず見つけてくれ！";
		next;
		mes "[クルペ]";
		mes "きっと、ブルプはまた村の外で";
		mes "ナイトになる特訓でも";
		mes "しているんだと思う。";
		set HU_2QUE,2;
		close;
	default:
		mes "[クルペ]";
		mes "牛乳、牛乳！";
		mes "配達、配達！";
		mes "ブルプ、ブルプを探さないと！";
		mes "村の外にいなかったか？";
		close;
	case 6:
		mes "[クルペ]";
		mes "え？　え？　え？　え？";
		mes "ブルプがそんな事を……";
		mes "レイピア、レイピア……";
		mes "それっていくらぐらいだったかな？";
		close;
	case 7:
		mes "[クルペ]";
		mes "え？　ブルプの代わりに牛乳を？";
		mes "ありがとう、ありがとう！";
		mes "ブルブルはすぐそこにいるから、";
		mes "後は頼んだよ。";
		set HU_2QUE,8;
		close;
	case 8:
		mes "[クルペ]";
		mes "牛乳を早く用意しないと。";
		mes "牛乳がいっぱいないと、";
		mes "配達ができないんだ！";
		close;
	case 9:
		mes "[クルペ]";
		mes "おぉー！";
		mes "牛乳、牛乳、牛乳ー！";
		mes "ありがとう、ありがとう！";
		mes "おかげで明日の牛乳配達も";
		mes "問題無いよ。";
		mes "これはお礼だ。";
		misceffect 71,"";
		set HU_2QUE,10;
		getitem 12063,3;
		if(checkre())
			getexp 10000,0;
		else
			getexp 100000,0;
		next;
		mes "[クルペ]";
		mes "私たちはいつも忙しいから、";
		mes "人手が必要なんだ。";
		mes "また今度手伝ってくれ。";
		close;
	case 10:
		mes "[クルペ]";
		mes "やぁ、こんにちは。";
		mes "また牛乳かな？";
		next;
		switch(select("牛乳をまた汲みたい","牛乳を汲んだら何かあるかな？","いえ、別に……")) {
		case 1:
			mes "[クルペ]";
			mes "それなら、一度ブルプに";
			mes "今日も牛乳を汲まないのか";
			mes "聞いてきてくれないかな？";
			set HU_2QUE,11;
			close;
		case 2:
			mes "[クルペ]";
			mes "牛乳を汲んでくれるなら、";
			mes "牛乳5個、紅ポーション5個、";
			mes "黄ポーション5個、ハチ蜜3個、";
			mes "食料包みの中のどれかをあげるよ。";
			mes "どうかな？";
			close;
		case 3:
			mes "[クルペ]";
			mes "そっか。";
			mes "まぁ、また来てくれ。";
			close;
		}
	case 11:
		mes "[クルペ]";
		mes "ブルプに一度聞いてみてくれ。";
		close;
	case 12:
	case 13:
		mes "[クルペ]";
		mes "牛乳、牛乳、牛乳～";
		mes "ブルブルから早く牛乳を";
		mes "取ってきてくれ！";
		if(HU_2QUE == 12)
			set HU_2QUE,13;
		close;
	case 14:
		mes "[クルペ]";
		mes "おぉー、すばらしい！";
		mes "最高だよ！　最高！";
		mes "さ、それじゃ何をあげようかな。";
		next;
		set HU_2QUE,10;
		set '@rand,rand(10);
		if('@rand <= 3) {
			getitem 519,5;
			mes "[クルペ]";
			mes "やっぱり新鮮な牛乳だな！";
			mes "牛乳～牛乳～";
			mes "白い愛～牛乳～";
		}
		else if('@rand <= 6) {
			getitem 502,5;
			mes "[クルペ]";
			mes "赤くて黄色な紅ポーション。";
			mes "12年前に購入しておいた物だよ。";
			mes "（にこにこにこにこ）";
			next;
			mes "[クルペ]";
			mes "12年越しの紅ポーション～";
			mes "よーく味わうといいよ！";
		}
		else if('@rand <= 9) {
			getitem 503,5;
			mes "[クルペ]";
			mes "んー、黄ポーションにするかな。";
			mes "うーん、この黄金色！";
			mes "とってもおいしそう！";
			next;
			mes "[クルペ]";
			mes "よく味わうといいよ。";
			mes "クセになるからね！";
		}
		else if(rand(10) <= 5) {
			getitem 518,3;
			mes "[クルペ]";
			mes "はい、ハチ蜜！";
			mes "とても甘～いハチ蜜！";
			mes "遠慮なくどうぞ！";
		}
		else {
			getitem 12111,1;
			mes "[クルペ]";
			mes "はい、食料包み！";
			mes "うーんこの微かな香り……";
			mes "もしかしたら、";
			mes "イグドラシルの種が";
			mes "出るかもしれない！";
		}
		close;
	}
OnTouch:
	if(HU_2QUE)
		end;
	if(BaseLevel < 50) {
		mes "[クルペ]";
		mes "ワッ！　ワッ！　ワッ！";
		mes "大変な事になった！";
		mes "明日配達する牛乳！";
		mes "牛乳が！　牛乳が！";
		close;
	}
	emotion 23;
	mes "[クルペ]";
	mes "ワッ！　ワッ！　ワッ！";
	mes "大変な事になった！";
	next;
	emotion 4;
	mes "[クルペ]";
	mes "明日配達する牛乳！";
	mes "牛乳が！　牛乳が！";
	mes "ブルプ！　ブルプ！";
	mes "どこだ？　どこにいったんだ？";
	set HU_2QUE,1;
	close;
}

hu_fild06.gat,217,270,3	script	ブルプ	896,3,3,{
	switch(HU_2QUE) {
	default:
		emotion 19;
		mes "[ブルプ]";
		mes "僕は最高のナイトになるんだ！";
		mes "はぁ！　せぃ！　たぁ！";
		mes "やぁ！　てぁ！　とぁ！";
		mes "シュッ！　シュッ！　シュッ！";
		close;
	case 3:
		emotion 19;
		mes "[ブルプ]";
		mes "はぁ！　せぃ！　たぁ！";
		mes "やぁ！　てぁ！　とぁ！";
		mes "シュッ！　シュッ！　シュッ！";
		next;
		emotion 6;
		mes "[ブルプ]";
		mes "いい武器さえあれば、";
		mes "口で音を出す必要もないのにな……";
		mes "風を切る音だけで";
		mes "モンスターが逃げ出すのに……";
		mes "えいッ！";
		set HU_2QUE,4;
		close;
	case 4:
		mes "[ブルプ]";
		mes "え、お爺さんがまた僕の事を";
		mes "探していたの？";
		mes "「ブルプ、ブルプを探してくれー」";
		mes "とか何とか言ってたんでしょう。";
		mes "まったくもう。";
		next;
		mes "[ブルプ]";
		mes "僕はもうブルブルの歌なんて";
		mes "聞きたくないんだ。";
		mes "諦めて帰ってよ。";
		next;
		mes "[ブルプ]";
		mes "僕はね、飛行船が村に来た時、";
		mes "輝く鎧に身を包んだ";
		mes "ナイトを見たんだ！";
		next;
		mes "[ブルプ]";
		mes "あの時、僕はその鎧と剣に";
		mes "運命を感じたんだ。";
		mes "ブルブルに僕の短い青春を";
		mes "使ってなんていられないんだ！";
		next;
		mes "[ブルプ]";
		mes "僕は自分の夢のために、";
		mes "一生懸命なんだ！";
		mes "はぁ！　せぃ！　たぁ！";
		mes "やぁ！　てぁ！　とぁ！";
		mes "シュッ！　シュッ！　シュッ！";
		set HU_2QUE,5;
		close;
	case 5:
		mes "[ブルプ]";
		mes "僕はナイトになるんだ。";
		mes "だから邪魔しないで！";
		mes "……ん……";
		mes "その装備……高そうだね……";
		mes "僕も何か装備が欲しいな……";
		next;
		mes "[ブルプ]";
		mes "よし、僕に何か装備をくれたら";
		mes "考え直してあげるよ。";
		mes "どう？";
		mes "そんな高い物じゃないよ。";
		mes "スロットが2個あるレイピアなら";
		mes "十分だよ。";
		next;
		if(select("承諾する","断る")==2) {
			mes "[ブルプ]";
			mes "なんだよ、それぐらいいいじゃんか！";
			mes "もう、邪魔だからどっかいってよね。";
			close;
		}
		mes "[ブルプ]";
		mes "やった！　ありがとう！";
		mes "レイピアだよ。";
		mes "僕が考えを変えないうちに、";
		mes "早くもってきてよね！";
		set HU_2QUE,6;
		close;
	case 6:
		if(countitem(1110) < 1) {
			mes "[ブルプ]";
			mes "スロットが2個あるレイピアを";
			mes "はやく持ってきてよ！";
			close;
		}
		set HU_2QUE,7;
		delitem 1110,1;
		mes "[ブルプ]";
		mes "ワッ！　ワッ！　ワッ！";
		mes "レイピアだ！　レイピア！";
		mes "ワ～イ！";
		next;
		mes "[ブルプ]";
		mes "それじゃ、良い事教えてあげるよ。";
		mes "こんなこともあろうかと、";
		mes "ブルブルの右上の方に";
		mes "マニュアル本を隠しておいたんだ。";
		next;
		mes "[ブルプ]";
		mes "それを読めばブルブルから";
		mes "牛乳が手に入るようになるよ。";
		mes "じゃ、レイピア、ありがとね！";
		close;
	case 11:
		mes "[ブルプ]";
		mes "ん？　いいよ。";
		mes "僕は剣術の練習ができるから";
		mes "何も文句はないよ。";
		mes "それじゃ、よろしくね！";
		set HU_2QUE,12;
		close;
	}
OnTouch:
	if(HU_2QUE == 2) {
		emotion 19;
		mes "[ブルプ]";
		mes "はぁ！　せぃ！　たぁ！";
		mes "やぁ！　てぁ！　とぁ！";
		mes "シュッ！　シュッ！　シュッ！";
		next;
		mes "[ブルプ]";
		mes "僕は最高のナイトになるんだ！";
		mes "はぁ！　せぃ！　たぁ！";
		mes "やぁ！　てぁ！　とぁ！";
		mes "シュッ！　シュッ！　シュッ！";
		set HU_2QUE,3;
		close;
	}
	if(HU_2QUE == 6) {
		emotion 19;
		mes "[ブルプ]";
		mes "はぁ！　せぃ！　たぁ！";
		mes "やぁ！　てぁ！　とぁ！";
		mes "シュッ！　シュッ！　シュッ！";
		close;
	}
	end;
}

hugel.gat,68,99,3	script	ブルブル	889,{
	mes "[ブルブル]";
	mes "ブブブブブブブウ";
	mes "ブウブブブブ～";
	if(HU_2QUE != 8 && HU_2QUE != 13)
		close;
	next;
	mes "^844200何だか話をしたがってるみたいだ。^000000";
	next;
	if(select("機嫌を取ってみる","やめておく")==2) {
		mes "もっとブルブルについて";
		mes "調べた方がいいだろう。";
		close;
	}
	if(countitem(645) < 3) {
		mes "繊細で敏感なブルブルは";
		mes "美容と健康に効果的な";
		mes "超豪華震動魔法櫛以外での";
		mes "くしけずりを拒否します。";
		mes "超豪華震動魔法櫛を使うには、";
		mes "スピードアップポーションが";
		mes "3個必要です。";
		close;
	}
	mes "ゲフェンの魔法学校に";
	mes "特別に注文したという巨大な櫛に、";
	mes "3つの穴が開いている。";
	mes "ここにスピードアップポーションを";
	mes "入れなければならないみたいだ。";
	next;
	delitem 645,3;
	mes "3つの穴にスピードアップポーションを";
	mes "入れると、櫛が振動し始めた。";
	mes "ブルブルは櫛に反応している。";
	next;
	set '@song,rand(1,5);
	soundeffect "cow_0"+'@song+".wav",1;
	mes "-ブルブルが自分の気持ちを";
	mes "歌っている-";
	next;
	soundeffect "cow_0"+'@song+".wav",2;
	mes "彼女の気持ちを考えて、";
	mes "^840084毛をとかす回数を決めよう。^000000";
	next;
	input '@num;
	if(('@song == 1 && '@num != 3) || ('@song == 2 && '@num != 5) || ('@song == 3 && '@num != 10) || ('@song == 4 && '@num != 0) || ('@song == 5 && '@num != 1)) {
		soundeffect "taming_fail.wav",0;
		mes "彼女はそっぽを向いてしまった。";
		mes "まるで失望しているかのようだ。";
		close;
	}
	soundeffect "cow_06.wav",1;
	mes "-ブルブルがとても";
	mes "満足しているように見える-";
	mes "-そして、彼女のセレナーデが";
	mes "広がった-";
	next;
	soundeffect "cow_06.wav",2;
	set '@song,rand(1,6);
	mes "[ブルブル]";
	mes "^FF0000ブル～ブル" +(('@song == 1)? "プ": "ブ")+ "ル～プブブ～";
	mes "^0000FF" +(('@song == 2)? "ル": "ブ")+ "ルルル～プブ～ブルブ～";
	mes "^FF0000ブルブルブル～ルル" +(('@song == 3)? "プ": "ブ")+ "～";
	mes "^0000FFルル～ブブルル～" +(('@song == 4)? "ブ": "プ")+ "ブル～";
	mes "^FF0000" +(('@song == 5)? "ブ": "プ")+ "ブブ～ルルル～ブルブルブ～";
	mes "^0000FFプ！" +(('@song == 6)? "プ": "ブ")+ "！プ～～～^000000";
	next;
	mes "ブルブルのセレナーデから、";
	mes "彼女が普段歌うセレナーデと";
	mes "微妙に違う部分を含んだ";
	mes "文節を言い直してください。";
	mes "「～」や「！」は必要ありません。";
	next;
	input '@word$;
	if(('@song == 1 && '@word$ != "ブルブル") || ('@song == 2 && '@word$ != "ブルルル") || ('@song == 3 && '@word$ != "ルルブ") || ('@song == 4 && '@word$ != "プブル") || ('@song == 5 && '@word$ != "プブブ") || ('@song == 6 && '@word$ != "ブ")) {
		soundeffect "taming_fail.wav",0;
		mes "ブルブルの目つきが急に";
		mes "鋭くなった。";
		mes "彼女の身に比べると";
		mes "か細い後ろ足ではあるが、";
		mes "人間の身で受け止めるのは";
		mes "とてもじゃないが無理だ。";
		mes "はやく彼女から離れよう。";
		close;
	}
	soundeffect "complete.wav",0;
	mes "ブルブルが大喜びで";
	mes "大量の牛乳を噴き出した。";
	mes "牛乳配達ボックスいっぱいに";
	mes "彼女の愛が満ちている。";
	mes "さっそくクルペさんに報告しよう。";
	set HU_2QUE,HU_2QUE+1;
	close;
}

hugel.gat,72,101,0	script	ブルプのマニュアル	844,{
	if(HU_2QUE < 7) {
		mes "^844200人間が書いた字にしては";
		mes "とても幾何学的だ。";
		mes "到底、文字を解読できそうもない。^000000";
		close;
	}
	mes "^844200地面に小さなノートが隠されている。";
	mes "人間が書いた字にしては";
	mes "とても幾何学的だ。";
	mes "ブルプの芸術的素質に";
	mes "拍手を送ってあげたい。^000000";
	next;
	mes "^844200-ブルプのブルブルと";
	mes "精神的交流を深めるマニュアル-";
	mes "親切に目次まで付いている。";
	mes "ブルプは意外と親切なようだ。";
	mes "目次を選んでみよう。^000000";
	next;
	switch(select("1-ブルブルとの接し方","2-ブルブルの扱い方","3-牛乳を得る前に")) {
	case 1:
		mes "ブルブルは非常に繊細なメス牛です。";
		mes "ブルブルは音楽的センスが";
		mes "とても優れた牛でもあります。";
		mes "ブルブルから牛乳を得るには";
		mes "ブルブルと同じ音楽的センスが";
		mes "なければなりません。";
		next;
		mes "ブルブルに近よると、";
		mes "ブルブルは自分の今の気持ちを";
		mes "歌い出します。";
		mes "ブルブルの歌を聞いて、";
		mes "ブルブルの気持ちに合わせた行動を";
		mes "取らなければなりません。";
		next;
		mes "彼女の歌を聞いて、その気持ちに";
		mes "合わせた回数分くしけずります。";
		mes "つまり、毛をとかして整えるのです。";
		mes "すると、彼女は気持ち良さそうな";
		mes "表情でもう一度歌を歌います。";
		next;
		mes "彼女の歌を聞いて、答えを言います。";
		mes "それが正しければ";
		mes "牛乳を得る事ができます。";
		mes "詳しくは次のページ2を見てください。";
		close;
	case 2:
		if(select("ブルブルの感情表現・対応法","ブルブルの歌")==1) {
			mes "ブルブルは5種類の感情を";
			mes "表現します。";
			mes "歓喜、平凡、憂鬱、怒り、愛の";
			mes "感情によってそれぞれ表現が";
			mes "違います。";
			mes "感情の状態をしっかりと把握";
			mes "しなければなりません。";
			next;
			mes "^840084とても嬉しい彼女^000000。";
			mes "嬉しい気持ちの時は";
			mes "^8400843回^000000毛をとかしてあげます。";
			next;
			mes "^840084日頃の彼女^000000。";
			mes "日頃の彼女は";
			mes "くしけずりを楽しみにしています。";
			mes "^8400845回ほど^000000毛をとかしてあげます。";
			next;
			mes "^840084憂鬱な彼女^000000。";
			mes "憂鬱な彼女はくしけずりを";
			mes "欲しがります。";
			mes "^84008410回は^000000毛をとかさないといけません。";
			next;
			mes "^840084怒った彼女！^000000";
			mes "怒った彼女の";
			mes "^8400841毛をとかすのは禁物^000000です。";
			next;
			mes "^840084愛に目覚めた彼女^000000。";
			mes "恐ろしい彼女……";
			mes "目に桃色オーラが漂ってます。";
			mes "こういうときは^8400841回だけ^000000";
			mes "にしておきましょう。";
			next;
			mes "以上、説明した彼女の状態を";
			mes "よく憶えておいてください。";
			close;
		}
		mes "次はブルブルの音楽世界。";
		mes "彼女の音楽的趣向を";
		mes "十分に熟知する必要があります。";
		next;
		mes "^004200-ブルブルSong-^000000";
		mes "必ず憶えてください。";
		next;
		mes "^FF0000ブル～ブルブル～プブブ～";
		mes "^0000FFブルルル～プブ～ブルブ～";
		mes "^FF0000ブルブルブル～ルルブ～";
		mes "^0000FFルル～ブブルル～プブル～";
		mes "^FF0000プブブ～ルルル～ブルブルブ～";
		mes "^0000FFプ！ブ！プ～～～^000000";
		next;
		mes "ブルブルが普段楽しんで";
		mes "歌う歌ですが、牛乳をしぼる時は";
		mes "微妙に違う歌を歌います。";
		mes "そこで、微妙に違う部分を";
		mes "正確に把握して、普段の通りの";
		mes "歌詞の文節を口ずさみます。";
		mes "これでようやく牛乳を得られます。";
		close;
	case 3:
		mes "まず、牛乳を得るためには";
		mes "近くにいるクルペおじさんから";
		mes "許可を得ます。";
		mes "そうしないと、クルペおじさんが";
		mes "とっても怒ります。";
		mes "気を付けてください。";
		next;
		mes "そして、ブルブルの毛をとかすためには";
		mes "^840084スピードアップポーションが3個^000000";
		mes "必要です。";
		next;
		mes "なぜなら、繊細で敏感なブルブルは";
		mes "美容と健康に効果的な";
		mes "超豪華震動魔法櫛以外で";
		mes "毛をとかされるのを拒否します。";
		mes "その、超豪華震動魔法櫛を使うために";
		mes "スピードアップポーションが";
		mes "3個必要です。";
		close;
	}
}

//============================================================
// 行方不明の父親クエスト
//- Registry -------------------------------------------------
// HU_3QUE -> 0～9
//------------------------------------------------------------
hugel.gat,107,67,3	script	トピ	706,{
	switch(HU_3QUE) {
	case 0:
		mes "[トピ]";
		mes "あぁぁぁん!!";
		mes "パパー、どこー！";
		if(BaseLevel < 50)
			close;
		mes "あぁぁぁ～～～ん！";
		next;
		if(select("どうしたのか聞いてみる","そのまま通り過ぎる")==2) {
			mes "[トピ]";
			mes "あぁぁぁぁぁん！";
			mes "パパー！　ママー！";
			close;
		}
		mes "[" +strcharinfo(0)+ "]";
		mes "どうしたの？";
		next;
		mes "[トピ]";
		mes "うっ、ひっく……";
		mes "あのね……";
		next;
		mes "[トピ]";
		mes "仕事で……パパが。";
		mes "パパが家に帰ってこないの。";
		mes "もう何日も……";
		mes "ねぇ、お願い！";
		mes "パパを探して！";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "うーん。";
		mes "もうちょっと詳しく教えて。";
		next;
		mes "[トピ]";
		mes "数日前のお昼ぐらいに";
		mes "パパとかくれんぼをしたの。";
		mes "隠れたパパを探したんだけど……";
		mes "ずっと、ずっと探したのに";
		mes "全然見つけれないの！";
		mes "あぁぁぁん！";
		next;
		if(select("もっと詳しく聞く","厄介事には関わらない")==2) {
			emotion 9,"";
			mes "^830083こんな事には関わらないのが";
			mes "賢明だと判断した。";
			mes "早くこの場を離れよう。^000000";
			close;
		}
		mes "[トピ]";
		mes "ママが心配になって";
		mes "村の外までパパを探しに行ったの。";
		mes "そしたらママも……";
		mes "あぁぁぁぁぁん!!";
		next;
		emotion 9,"";
		mes "^830083あんまり泣くので";
		mes "可愛そうな気がしてきた。";
		mes "村の外に出たという";
		mes "トピのママを探してみよう。^000000";
		set HU_3QUE,1;
		close;
	default:
		mes "[トピ]";
		mes "早く、早くパパを探して！";
		mes "トピもう泣かないから！";
		close;
	case 2:
		mes "[トピ]";
		mes "え、村の外にママがいるの？";
		mes "うん、わかった。";
		mes "それじゃ、ボクはここで";
		mes "パパが来ないか待ってるよ。";
		set HU_3QUE,3;
		close;
	case 6:
		mes "[トピ]";
		mes "ホント！？";
		mes "パパがそこにいるの？";
		mes "…………";
		mes "クックック……";
		mes "あっはっはっは！";
		mes "いやぁったぁーー!!!!";
		next;
		mes "[トピ]";
		mes "はっはっは！";
		mes "……あ、そうだ！";
		mes "ママに早く帰ってきてって";
		mes "言っておいてよ。";
		mes "ほら、早く！";
		next;
		emotion 9,"";
		mes "^830083この子は本当にさっきの子？";
		mes "泣いていた時と全然雰囲気が違う。";
		mes "子供とは思えない、";
		mes "なんともいえない腹黒さを感じる。";
		mes "どうも騙されていた気がする……^000000";
		set HU_3QUE,7;
		close;
	case 7:
		mes "[トピ]";
		mes "ママは村の外にいるんでしょ？";
		mes "ねぇ、はやくはやく！";
		next;
		emotion 9,"";
		mes "^830083子供っぽい素振りをしている。";
		mes "しかし、先ほど垣間見た姿は、";
		mes "プロの暗殺者が夜の闇に";
		mes "溶け込むように自然だった。";
		mes "本当に恐ろしい子供だ……^000000";
		close;
	case 8:
		emotion 9,"";
		mes "^830083子供の一人言が聞こえる。^000000";
		next;
		mes "[トピ]";
		mes "クックック。";
		mes "酔っ払った父さんなら";
		mes "これぐらい簡単だったな。";
		mes "まさに計画通り！";
		next;
		mes "[トピ]";
		mes "もうきれいでセクシーなお嫁さんを";
		mes "探してくれてるのかな？";
		mes "一体どんな子なのかなぁ～？";
		mes "クックック……";
		mes "あっはっはっは！";
		mes "俺の人生はバラ色だ！";
		set HU_3QUE,9;
		close;
	case 9:
		emotion 9,"";
		mes "^830083あの年で父親に";
		mes "セクシーなお嫁さんを要求する";
		mes "あの勇気と雄大な願望は";
		mes "すごいと褒めるべきか……^000000";
		close;
	}
}

hu_fild06.gat,190,367,3	script	トピのママ	701,{
	switch(HU_3QUE) {
	case 0:
		mes "[トピのママ]";
		mes "あの人、一体どこに行ったの？";
		mes "心配ばかりかけて……";
		close;
	case 1:
		mes "[トピのママ]";
		mes "トピがそんな事を……";
		mes "心細かったのね。";
		mes "あの人は狩人だから";
		mes "二日位帰ってこないのは";
		mes "よくある事なんです。";
		next;
		mes "[トピのママ]";
		mes "でももう4日も帰ってこなくて……";
		mes "何かあったのか心配だわ。";
		next;
		mes "[トピのママ]";
		mes "トピが泣いているなら";
		mes "すぐにでも家に帰りたい。";
		mes "でも、あの人がまだ……";
		next;
		mes "[トピのママ]";
		mes "あの人がよく行く所は";
		mes "全部探してみました。";
		mes "それでも見つからなくて……";
		mes "もしかして事故にでも";
		mes "巻き込まれたのかしら!?";
		next;
		mes "[トピのママ]";
		mes "もうちょっと探して";
		mes "それでも見つからないようなら、";
		mes "村に戻ります。";
		mes "友達の家にでもいたら";
		mes "いいんですが……";
		mes "ふぅ…………";
		next;
		mes "[トピのママ]";
		mes "あの、一つお願いがあります。";
		mes "トピに私はすぐに帰るから";
		mes "心配するなと伝えてくれますか？";
		mes "あと……タルを用意しておくようにと。";
		set HU_3QUE,2;
		close;
	case 2:
		mes "[トピのママ]";
		mes "トピに心配しないようにと";
		mes "伝言をお願いします。";
		mes "あと、タルを用意しておくようにと。";
		mes "あの人、大きなタルがあると";
		mes "何故か入ろうとするから……";
		close;
	default:
		mes "[トピのママ]";
		mes "一体どこに隠れているの？";
		mes "村の中にでもいるの？";
		mes "あなた！";
		mes "早く帰ってきなさい！";
		close;
	case 6:
	case 7:
		mes "[トピのママ]";
		mes "え!?　やっぱりタルの中に!?";
		mes "トピが変な要求をしたから!?";
		mes "はぁ…………";
		mes "とにかく、あの人を探してくれて";
		mes "ありがとうございました。";
		mes "あの人は本当に無茶ばかりするの。";
		next;
		mes "[トピのママ]";
		mes "それにわざわざ料理まで……";
		mes "ご迷惑をおかけしました。";
		mes "あの、よかったらこれを。";
		misceffect 71,"";
		set HU_3QUE,8;
		getitem 12065,3;
		close;
	case 8:
		mes "[トピのママ]";
		mes "たまに、トピが幼いのか";
		mes "あの人が幼いのか";
		mes "わからなくなるわ。";
		close;
	case 9:
		emotion 9,"";
		mes "^830083結婚相手を探してくるという";
		mes "賭けを何故か鬼ごっこで……";
		mes "妙に腹黒い感じのする息子と";
		mes "何も理解していない母親……^000000";
		next;
		emotion 9,"";
		mes "^830083トピが幼いのかあの人が幼いのか";
		mes "わからなくなると言った彼女は、";
		mes "自分自身が一番幼くて";
		mes "純粋な心を持っていることを";
		mes "わかっているのだろうか？^000000";
		close;
	}
}

hugel.gat,100,176,0	script	タル#hu	111,{
	switch(HU_3QUE) {
	default:
		emotion 9,"";
		mes "^840084何か変な音が聞こえる。";
		mes "小さい穴の間から";
		mes "かなり低い音が聞こえる。";
		mes "……気のせいか。^000000";
		close;
	case 3:
		mes "[グェイン]";
		mes "腹が……へった……";
		mes "俺に……料理を……";
		mes "腹がへって……力が……";
		mes "蒸しガニを食べれば……";
		mes "すぐにでも力が…………";
		next;
		emotion 9,"";
		mes "^840084タルがしゃべっている。";
		mes "ありえない……";
		mes "世界の終末か!?";
		mes "それとも中に人が？";
		mes "むしろタルは人だった!?";
		mes "……とにかく、タルの願い事を^000000";
		next;
		if(select("かなえてあげる","いや、時間が無い")==2) {
			mes "[グェイン]";
			mes "なんてやつだ!!";
			mes "天罰を受けろ!!";
			next;
			emotion 9,"";
			mes "^840084天罰よりタルを相手に話す方が";
			mes "100倍は危ないだろう。";
			mes "それにしても……";
			mes "たった5秒前までは";
			mes "あんなに元気が無かったタルが";
			mes "いきなり怒鳴り声を上げるなんて……";
			mes "……妙に怪しい。^000000";
			close;
		}
		mes "[グェイン]";
		mes "蒸しガニは";
		mes "かにニッパ10個、緑ハーブ10個、";
		mes "黄ポーション1個";
		mes "で作れるVIT強化型の料理だ!!";
		next;
		emotion 9,"";
		mes "^840084お腹がすいて力が出ないと";
		mes "言っていたのに……";
		mes "たった一言で元気になるとは。";
		mes "さすがはタルである。";
		mes "どこがさすがなのか";
		mes "よくわからないが。^000000";
		next;
		mes "[グェイン]";
		mes "蒸しガニにはVIT+1の効果がある!!";
		mes "あぁ……蒸しガニ……";
		mes "頼む……それを……";
		next;
		emotion 9,"";
		mes "^840084タルがこれほどまでに願うなら";
		mes "なんとか手に入れてきてみよう。";
		mes "もしかするとタルが宝箱に変わって";
		mes "「お礼に私を持って行って！」";
		mes "という事になるかもしれない！^000000";
		set HU_3QUE,4;
		close;
	case 4:
	case 5:
		if(countitem(12051) <1) {
			mes "[グェイン]";
			mes "頼む……早く……";
			mes "蒸し……ガニ……";
			mes "料理で…………";
			close;
		}
		mes "[グェイン]";
		mes "ふおぉぉ!!";
		mes "このにおい！　この香り!!";
		mes "ここからでも見える";
		mes "その赤い物体は!!";
		mes "見ているだけで力が湧く!!";
		next;
		set HU_3QUE,5;
		delitem 12051,1;
		emotion 9,"";
		mes "^840084私もタルが宝箱に変わると思うと";
		mes "力が湧いてくる！";
		mes "さぁ、はやく食べて宝箱に！^000000";
		next;
		mes "[グェイン]";
		mes "バリ！　ボリ！";
		mes "ゴキ！　ガリリ！";
		mes "ふぅ～すばらしい味だ。";
		mes "満腹でとても幸せだ！";
		close2;
		hideoffnpc "グェイン#hu";
		initnpctimer "グェイン#hu";
		hideonnpc;
		end;
	case 6:
		emotion 9,"";
		mes "^840084タルの中身となった彼と";
		mes "話を続けるより、";
		mes "彼の家族にこのタルの事を";
		mes "話す方が精神的によさそうだ。^000000";
		close;
	case 7:
		emotion 9,"";
		mes "^840084トピのママにもこのタルは";
		mes "ただのタルではないということを";
		mes "知らせてあげなければ。^000000";
		close;
	case 8:
		emotion 9,"";
		mes "^840084あのタルの中であの人は";
		mes "いつまで隠れるつもりなんだろう……^000000";
		close;
	case 9:
		emotion 9,"";
		mes "^830083あのタルは鬼ごっこで";
		mes "お嫁さんを探すという約束を";
		mes "必ず守らないという";
		mes "男の固い意志を称える";
		mes "象徴的構造物となるだろう。^000000";
		close;
	}
}

hugel.gat,100,174,3	script	グェイン#hu	898,{
	if(HU_3QUE != 5) {
		mes "[グェイン]";
		mes "ふぅ～";
		mes "満腹まんぷくー";
		close;
	}
	emotion 9,"";
	mes "^840084な、なんてことだ！";
	mes "タルが宝箱ではなく人間に！";
	mes "私の……私の夢が……";
	mes "いや、人間ならなおさら";
	mes "お礼をくれるかもしれない！^000000";
	next;
	mes "[グェイン]";
	mes "ふぅ～";
	mes "満腹まんぷくー";
	mes "さて、またタルの中に入るか。";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "ちょ、ちょっと！";
	mes "どうしてまたそこに入るの!?";
	next;
	mes "[グェイン]";
	mes "たいしたことじゃないよ。";
	mes "息子とかくれんぼをしているから";
	mes "ここに隠れているだけだ。";
	next;
	emotion 9,"";
	mes "^840084息子とかくれんぼ？";
	mes "どこかで聞いたような……";
	mes "もしかして……^000000";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "もしかして……";
	mes "トピのお父さん？";
	next;
	mes "[グェイン]";
	mes "ハッハッハ。";
	mes "俺はそんなに有名だったのか？";
	mes "それともトピが有名なのかな？";
	mes "この私、天才狩人とその息子。";
	mes "どうやら人気者らしいな。";
	mes "いや、参った参った。";
	next;
	emotion 9,"";
	mes "^840084なんという誇大妄想……";
	mes "こんな人とこれ以上会話を";
	mes "続けたら、お礼の代わりに";
	mes "疲労をもらうことになる……^000000";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "奥さんと息子さんが心配しています。";
	mes "早く家に帰ってください。";
	next;
	mes "[グェイン]";
	mes "だめ！　無理！";
	mes "あいつと賭けで俺は……";
	mes "俺はあいつの恐ろしい要求を……";
	mes "…………";
	mes "っということなんで！";
	mes "俺は隠れる！";
	next;
	emotion 9,"";
	mes "^840084様子を見る限り";
	mes "とてもすごい要求らしい。";
	mes "トピとトピの母親に";
	mes "事情を聞いた方が早いだろう。^000000";
	set HU_3QUE,6;
	close2;
OnTimer60000:
	stopnpctimer;
	hideoffnpc "タル#hu";
OnInit:
	hideonnpc;
	end;
}

//============================================================
// 思い出の木クエスト
//- Registry -------------------------------------------------
// HU_4QUE -> 0～12
//------------------------------------------------------------
hugel.gat,198,169,0	script	木	139,2,2,{
	if(HU_4QUE == 6) {
		misceffect 57,"";
		mes "-何!?　この感じ!?-";
		mes "-これは……ニブルヘイム!?-";
		mes "-何故急にニブルヘイムが!?-";
		close;
	}
	mes "-誰もが好むような暖かさと";
	mes "和やかな雰囲気を感じる-";
	if(BaseLevel >= 60 && HU_4QUE == 0)
		set HU_4QUE,1;
	close;
}

hugel.gat,191,172,3	script	マナイン	893,{
	switch(HU_4QUE) {
	default:
		mes "[マナイン]";
		mes "小さいけど楽しい村です。";
		mes "この平和が永遠ならいいのに……";
		close;
	case 1:
	case 2:
		mes "[マナイン]";
		mes "この木は、ずっとここにあるべき。";
		mes "そう思いませんか？";
		mes "でも、エルシャングトという男は";
		mes "この木を倒して、";
		mes "自分の店を建てようとしてます……";
		next;
		mes "[マナイン]";
		mes "みんなの思い出が木と共に呼吸している。";
		mes "みんなの好きなこの場所を";
		mes "無くそうとするなんて……";
		mes "……最低。";
		next;
		mes "[マナイン]";
		mes "エルシャングトなら、";
		mes "すぐそこにいる人。";
		mes "……最低な男……エルシャングト。";
		if(HU_4QUE == 1)
			set HU_4QUE,2;
		close;
	case 5:
		mes "[マナイン]";
		mes "エルシャングトは昔、私の姉……";
		mes "カナインと付き合ってました。";
		mes "あの頃の二人は、よくここにきていて、";
		mes "とても楽しそうでした……";
		mes "私はそんな二人を見て、";
		mes "二人の愛は変わらないと思ってた……";
		next;
		mes "[マナイン]";
		mes "でも……運命のいたずらでしょうか。";
		mes "姉さんは病気でこの世を去り、";
		mes "エルシャングトは随分落ち込みました。";
		mes "最近、ようやく立ち直ったんですが、";
		mes "以前の彼とはまるで別人……";
		next;
		mes "[マナイン]";
		mes "元々、彼は優しくて大人しい";
		mes "純情な人でした……";
		mes "でも、今は血も涙もない金の亡者！";
		next;
		set HU_4QUE,6;
	case 6:
		mes "[マナイン]";
		mes "あの世の姉さんが今の彼を見て";
		mes "何と言うか……";
		mes "きっと、あんな男と付き合ってたことを";
		mes "後悔しているはずです……";
		close;
	case 7:
		mes "[マナイン]";
		mes "姉さんに会った!?";
		mes "……そうですか……";
		mes "とても信じられないけど、";
		mes "あなたがそんなウソをつくのも";
		mes "考えられない……";
		next;
		mes "[マナイン]";
		mes "慰めるとか……";
		mes "励ますような次元じゃない……";
		mes "言葉で説明することができない";
		mes "何かをあなたから感じるんです。";
		next;
		mes "[マナイン]";
		mes "でも……";
		mes "嘘じゃないってわかってても";
		mes "信じられないような話……";
		mes "もっとよく聞かせてください。";
		next;
		mes "[マナイン]";
		mes "でも……ちょっとだけ……";
		mes "何だか寒気がして……";
		mes "少し休んできますね。";
		set HU_4QUE,8;
		close;
	case 8:
		mes "[マナイン]";
		mes "…………";
		next;
		mes "[マナイン]";
		mes "寒気がする……";
		mes "天気はいいのに……";
		mes "どうし…………";
		next;
		mes "[マナイン]";
		mes "!?";
		next;
		mes "[マナイン]";
		mes "！";
		next;
		mes "[マナイン]";
		mes "…………";
		set HU_4QUE,9;
		close;
	case 9:
		mes "[マナイン]";
		mes "…………私は……";
		mes "私はカナイン……";
		mes "妹の体を借りて、";
		mes "現世に干渉しようとする";
		mes "許されない罪人……";
		next;
		mes "[マナイン]";
		mes "あなたは……";
		mes "ニブルヘイムで……";
		mes "……ありがとう。";
		mes "今まで気を使ってもらって。";
		next;
		mes "[マナイン]";
		mes "私に与えられた時間は";
		mes "とても短い……";
		mes "失礼ですが、";
		mes "まずは彼と……";
		mes "エルシャングトと話しを……";
		next;
		mes "[マナイン]";
		mes "エルシャングト……";
		mes "エルシャングト？";
		next;
		mes "[エルシャングト]";
		mes "ん？　なんだ？";
		mes "あぁ、マナインか？";
		mes "悪いが今は暇じゃないんだ。";
		mes "それに、俺はお前よりずっと年上だ。";
		mes "名前にさんを付けてくれないか。";
		next;
		mes "[マナイン]";
		mes "エルシャングト……";
		mes "ばかなエルシャングト……";
		mes "私よ……カナイン……";
		mes "もう忘れたの？";
		mes "私の愛しい人……";
		mes "エルシャングト……";
		next;
		mes "[エルシャングト]";
		mes "……マナイン。";
		mes "俺はそういった冗談は嫌いだ。";
		mes "それに、私の前でカナインの事を";
		mes "話さないでくれ。";
		mes "俺を怒らせたいのか？";
		next;
		mes "[マナイン]";
		mes "バカな人……";
		mes "いつまでたっても";
		mes "口だけなんだから……";
		next;
		mes "[エルシャングト]";
		mes "…………";
		set HU_4QUE,10;
		close;
	case 10:
		mes "[マナイン]";
		mes "…………私はカナイン。";
		mes "あなたに会うために、";
		mes "妹の体を借りなければならない";
		mes "魂だけの存在……";
		mes "エルシャングト……";
		mes "あなたの恋人……";
		next;
		mes "[エルシャングト]";
		mes "ッ！　馬鹿らしい！";
		mes "そんな事あるわけないじゃないか！";
		mes "そんな話で、";
		mes "人を馬鹿にするんじゃない！";
		mes "そんな……そんな非現実的な話が";
		mes "あるわけないだろうが！";
		next;
		mes "[マナイン]";
		mes "……………………";
		mes "……君が風になったら、";
		mes "僕は果てしない空になって";
		mes "自由にしてあげる。";
		next;
		mes "[エルシャングト]";
		mes "!?";
		next;
		mes "[マナイン]";
		mes "この空の太陽みたいに";
		mes "君を明るく照らす";
		mes "僕の魂は君を慈しむ。";
		next;
		mes "[エルシャングト]";
		mes "な……ふざけるのもいいかげん！";
		next;
		mes "[マナイン]";
		mes "夢の中の美しい君の瞳に映った";
		mes "清い海をいつか一緒に見たい。";
		next;
		mes "[エルシャングト]";
		mes "！";
		mes "そ……そんな……";
		next;
		mes "[マナイン]";
		mes "海の向こうに見えた君の姿は";
		mes "夢ではなかった。";
		mes "その姿を、私はこの二つの目に刻む。";
		mes "さびしい夜に君の天使と同じ";
		mes "声を聞く……";
		next;
		mes "[エルシャングト]";
		mes "……マナイン……";
		mes "なぜその歌を知っている……";
		mes "その歌は……";
		next;
		mes "[マナイン]";
		mes "マナインじゃないわ……";
		mes "そう……この歌は、あなたが私に";
		mes "教えてくれた歌……";
		next;
		mes "[マナイン]";
		mes "でもこれは未完成……";
		mes "歌は完成したの？";
		mes "完成した美しい歌を";
		mes "みんなに聞かせようとした";
		mes "あなたの優しい姿……";
		mes "その姿はどこに行ったの？";
		next;
		mes "[エルシャングト]";
		mes "嘘……冗談だろ……";
		mes "マナイン、お姉さんから";
		mes "聞いた話をしてるんだろ？";
		mes "そんな馬鹿な話……";
		mes "ハハハ……";
		next;
		mes "[マナイン]";
		mes "……まだわからないの？";
		mes "私はカナイン。";
		mes "あなたを世界で一番愛し、";
		mes "あなたが作詞作曲した";
		mes "歌を歌ったカナイン……";
		next;
		mes "[エルシャングト]";
		mes "……カナイン……";
		mes "カナインなのか？";
		mes "本当に……";
		mes "私の……カナイン……";
		mes "本当に……本当に？";
		next;
		mes "[マナイン]";
		mes "ようやくわかったのね……";
		mes "ホント……";
		mes "バカな人なんだから……";
		set HU_4QUE,11;
		close;
	case 11:
		mes "[マナイン]";
		mes "エルシャングト……";
		close;
	case 12:
		mes "-泣いている彼女に、何も言えない-";
		close;
	}
}

hugel.gat,196,164,3	script	エルシャングト	50,{
	switch(HU_4QUE) {
	default:
		mes "[エルシャングト]";
		mes "思い出なんて感情は";
		mes "生きるのに全然必要ない。";
		mes "重要なのは目の前の利益だ。";
		mes "……俺の店を建てるなら";
		mes "ここはいい立地条件だな。";
		close;
	case 2:
		mes "[エルシャングト]";
		mes "なんだ？";
		mes "マナインの話を聞いてきたのか。";
		mes "思い出？";
		mes "そんな物は必要ない。";
		mes "他人の事情なんて知った事か。";
		next;
		mes "[エルシャングト]";
		mes "思い出なんかあったところで";
		mes "辛いだけだ。";
		mes "そんな物にこだわるぐらいなら、";
		mes "自分の利益のために努力したほうが";
		mes "よっぽど報われる。";
		next;
		mes "[エルシャングト]";
		mes "立地条件もいいし、";
		mes "ちょうど父さんも";
		mes "この土地を欲しがってたんだ。";
		set HU_4QUE,3;
		close;
	case 3:
		mes "[エルシャングト]";
		mes "ここなら店を建てるのに";
		mes "いい場所だ。";
		mes "父さん以外にも";
		mes "狙っている奴がいるぐらい";
		mes "立地条件がいいんだ。";
		next;
		mes "[エルシャングト]";
		mes "こんな場所にこんなでかい木を";
		mes "立てておくような浪費家はいない。";
		mes "建設計画が決まれば、こんな木は";
		mes "すぐに切り倒す。";
		close;
	case 4:
		mes "[エルシャングト]";
		mes "父さんに会ってきたのか。";
		mes "無駄なことを……";
		mes "木を切るのを止めるよう";
		mes "説得したかったんだろうが、";
		mes "時間の無駄だったな。";
		mes "父さんは絶対に考えを変えない。";
		next;
		set HU_4QUE,5;
	case 5:
		mes "[エルシャングト]";
		mes "昔は俺もこの場所がとても";
		mes "好きだった……";
		mes "だが、それも過去の話だ。";
		mes "俺に過去なんかいらない。";
		close;
	case 7:
		mes "[エルシャングト]";
		mes "ばかばかしい……";
		mes "カナインに会って来ただと？";
		mes "たちの悪い冗談だ。";
		mes "俺は冗談でも";
		mes "そんな非現実的な話は嫌いだ！";
		next;
		mes "[エルシャングト]";
		mes "そんな話で";
		mes "俺を説得しようとしたのか？";
		mes "そんな事しても無駄だ。";
		mes "わかったら黙ってろ！";
		close;
	case 10:
		mes "[エルシャングト]";
		mes "カナインだって？";
		mes "そんなわけない。";
		mes "非現実的だ！";
		next;
		mes "[マナイン]";
		mes "…………";
		close;
	case 11:
		mes "[エルシャングト]";
		mes "カナイン……カナイン……カナイン！";
		mes "カナ……ぐっ……ひっく……";
		mes "なんで……どうして死んだんだ！";
		mes "……なんで…………";
		next;
		mes "[マナイン]";
		mes "……運命だったの……";
		mes "どうする事もできない運命……";
		mes "可哀相なエルシャングト……";
		mes "……エルシャングト……";
		next;
		mes "[エルシャングト]";
		mes "ッ……カナイン……";
		mes "僕は君を忘れられない！";
		mes "……つらい……つらいんだ！";
		mes "ひっく……っく……カナイン……";
		next;
		mes "[マナイン]";
		mes "……それでなの？";
		mes "私たちと同じ時を過ごした";
		mes "この木を見る度に昔を思い出して……";
		mes "つらいから……";
		mes "だからいっそ無くそうと？";
		next;
		mes "[エルシャングト]";
		mes "そう……そうだ……";
		mes "……とてもつらい……";
		mes "この木を……この場所を……";
		mes "ここを無くしてでも……";
		mes "君への思いを……この苦しみを";
		mes "振り払いたかった！";
		next;
		mes "[マナイン]";
		mes "木を倒して……";
		mes "この場所を無くせば";
		mes "忘れることができるの？";
		mes "その苦しみが消えるの？";
		next;
		mes "[エルシャングト]";
		mes "わからない……わからない！";
		mes "……でも……";
		mes "そうでもしないと狂いそうなんだ！";
		mes "君の事を……忘れたくない……";
		mes "でも……でも！";
		next;
		mes "[マナイン]";
		mes "あなたは……忘れることができない。";
		mes "例えこの場所は無くなっても、";
		mes "あなたの中にずっと残る……";
		mes "思い出とはそういうもの……";
		mes "それとも、思い出も全部捨てたいの？";
		next;
		mes "[エルシャングト]";
		mes "………………";
		next;
		mes "[マナイン]";
		mes "思い出に罪があるの？";
		mes "私との思い出のために、";
		mes "他の人の思い出も消すの？";
		mes "あなたはそんな残酷な人だった？";
		next;
		mes "[エルシャングト]";
		mes "…………";
		next;
		mes "[マナイン]";
		mes "……あなたはそんな人じゃない……";
		mes "繊細で……優しかったあなたは";
		mes "どこに行ってしまったの？";
		mes "大丈夫……もう少し力を出して……";
		mes "ね？　笑って……";
		next;
		mes "[マナイン]";
		mes "今の大きな苦しみも……";
		mes "時間が経てば、いつのまにか";
		mes "小さな思い出に変わっていくの……";
		next;
		mes "[マナイン]";
		mes "思い出して……";
		mes "純粋で優しかった愛しい人……";
		mes "そしてわかって……";
		mes "人は出会えば……いつか別れる……";
		next;
		mes "[エルシャングト]";
		mes "カナイン……";
		next;
		mes "[マナイン]";
		mes "……もう行かなきゃ……";
		mes "さようなら……エルシャングト……";
		next;
		mes "[エルシャングト]";
		mes "……ま、まってくれ、カナイン！";
		mes "こんな……こんなに早く";
		mes "行かなければならないのか!?";
		mes "待ってくれ……もう少しだけ！";
		mes "もう少しだけ一緒にいてくれ！";
		next;
		mes "[マナイン]";
		mes "私は……";
		mes "この世界にいてはならない存在……";
		mes "あまりここにはいられないの……";
		mes "どうか……歌を完成させて……";
		mes "そして……木を……";
		next;
		mes "[エルシャングト]";
		mes "わかった！";
		mes "わかったから！";
		mes "君がいるあの世にまで届く";
		mes "素晴らしい歌を作る！";
		mes "だから……だから！";
		next;
		mes "[マナイン]";
		mes "エルシャングト……";
		mes "私は……まだ……あなたを……";
		next;
		mes "[エルシャングト]";
		mes "まだ……何？";
		mes "何て言ったの？";
		next;
		mes "[マナイン]";
		mes "…………";
		mes "………………";
		next;
		mes "[エルシャングト]";
		mes "カナイン！";
		mes "何て言ったんだ！";
		mes "カナイン……";
		mes "……カナイン？";
		next;
		mes "[マナイン]";
		mes "…………";
		next;
		mes "[エルシャングト]";
		mes "カナイン……";
		mes "……カナイン……";
		next;
		mes "[マナイン]";
		mes "……エル……シャング……ト？";
		mes "……兄さん……";
		next;
		mes "[エルシャングト]";
		mes "マナイン!?";
		mes "カナ……カナインは！";
		next;
		mes "[マナイン]";
		mes "姉さんは……帰りました……";
		mes "私たちの行けない所に……";
		mes "うっ……ぅ……";
		mes "姉さん……姉さん……";
		next;
		mes "[エルシャングト]";
		mes "カナイン……";
		misceffect 71,"";
		set HU_4QUE,12;
		if(checkre())
			getexp 5000,0;
		else
			getexp 50000,0;
		getitem 603,1;
		close;
	case 12:
		mes "[エルシャングト]";
		mes "……少し……このまま……";
		mes "お願いします……";
		close;
	}
}

hugel.gat,100,103,3	script	ペルピツ	866,{
	if(HU_4QUE == 3) {
		mes "[ペルピツ]";
		mes "最近、息子のやつが変わっての。";
		mes "昔は、木を切り倒して";
		mes "そこに店を建てようとしたら、";
		mes "絶対にだめだ、木は自分が育てる";
		mes "と言っていたのじゃが……";
		next;
		mes "[ペルピツ]";
		mes "ようやく、ワシの子も";
		mes "まともに金儲けをする方法が";
		mes "わかったようじゃな。";
		mes "ワシとしては嬉しい限りじゃ。";
		mes "ほっほっほ。";
		next;
		set HU_4QUE,4;
	}
	if(HU_4QUE == 4) {
		mes "[ペルピツ]";
		mes "最近のエルシャングトを見ると";
		mes "どこか毒気があるような……";
		mes "少し恐いぐらいじゃ。";
		mes "それだけ、店の開業に";
		mes "熱意があるのじゃろう。";
		close;
	}
	mes "[ペルピツ]";
	mes "老いたワシにとって、";
	mes "信じられるのは金だけじゃ。";
	mes "早く店を開業して、";
	mes "もっと大金を稼ぐんじゃ。";
	close;
}

niflheim.gat,90,106,3	script	死者の魂	802,{
	if(HU_4QUE == 6) {
		mes "[死者の魂]";
		mes "エルシャングト……マナイン……";
		mes "なつかしい名前……";
		mes "そう……";
		mes "生きている時の私の名前はカナイン。";
		mes "マナインの姉。";
		mes "エルシャングトの恋人だった女。";
		next;
		mes "[カナインの魂]";
		mes "でも、それも生きている時の話……";
		mes "今は現世に関われない、";
		mes "魂だけの存在……";
		next;
		mes "[カナインの魂]";
		mes "エルシャングト……";
		mes "すっかり変わってしまった……";
		mes "でも、それも仕方ない事……";
		next;
		mes "[カナインの魂]";
		mes "私にはどうしようもない……";
		mes "出来る事なら、妹の体を借りてでも";
		mes "あの人に会いたい……";
		mes "でも……でも……";
		next;
		mes "[カナインの魂]";
		mes "……いえ……";
		mes "これ以上見ているだけなんて";
		mes "できない……";
		mes "わざわざここまで来てくれた";
		mes "人がいるのに……";
		next;
		mes "[カナインの魂]";
		mes "私がなんとかしてみます……";
		mes "あなたも、これ以上ここに……";
		mes "留まる理由はないでしょう……";
		next;
		mes "[カナインの魂]";
		mes "私の力であなたをフィゲルに";
		mes "お送りします……";
		set HU_4QUE,7;
		close2;
		warp "hugel.gat",78,148;
		end;
	}
	if(HU_4QUE == 7) {
		mes "[カナインの魂]";
		mes "まだ行っていないのですか？";
		mes "はやく行ってください……";
		mes "ここは、あなたのように";
		mes "生きている人にとって、";
		mes "とても危険な所です……";
		close2;
		warp "hugel.gat",78,148;
		end;
	}
	mes "[死者の魂]";
	mes "生きている人……あなたは";
	mes "ここへ来てはいけません。";
	mes "もう少し、生きている自分を";
	mes "大切にしてください。";
	next;
	mes "[死者の魂]";
	mes "ここに留まると";
	mes "大切な人に二度と会えなくなる……";
	mes "命を……大事にしてください……";
	close;
}

//============================================================
// 寝床の父親クエスト
//- Registry -------------------------------------------------
// HU_5QUE -> 0～13
//------------------------------------------------------------
hu_in01.gat,387,245,1	script	エロン・シュイル	849,2,2,{
	switch(HU_5QUE) {
	case 0:
		if(BaseLevel < 50)
			break;
		mes "[エロン]";
		mes "あぁ、もう駄目だ。";
		mes "私はこのまま死んでしまうんだ。";
		mes "こんなにも体が痛いのだ。";
		mes "そうだ、もう死ぬ。死んでしまう。";
		next;
		mes "[エロン]";
		mes "思い出すのは我が息子。";
		mes "幼い時は聞く可愛いやつだったが、";
		mes "大きくなってからは……";
		next;
		mes "[エロン]";
		mes "この痛みを止める特別な薬を";
		mes "買って来るように言ったが、";
		mes "一体いつになったら……";
		mes "どうせ今頃、女の子と";
		mes "遊んでいるんだろう！";
		next;
		mes "[エロン]";
		mes "…………ということで。";
		mes "私の息子の名はポスティール。";
		mes "君があいつに薬をはやく";
		mes "買って来るように";
		mes "言ってはくれまいか！";
		next;
		if(select("わかりました","いやです")==2) {
			mes "[エロン]";
			mes "再考の余地もないのかね。";
			mes "そのような太くて短い返事、";
			mes "とても残酷だ！";
			mes "……息子よ……私を助けてくれ。";
			close;
		}
		mes "[エロン]";
		mes "ありがとう。";
		mes "では、コールバンAを";
		mes "早く買ってくるように言ってくれ。";
		mes "あいつは多分、";
		mes "村を南に出ればいるはずだ。";
		next;
		mes "[エロン]";
		mes "そして、もう一言だけ";
		mes "伝えてもらいたい。";
		mes "もし買って来なかったら……";
		next;
		mes "[エロン]";
		mes "愛する我が息子、ポスティールよ。";
		mes "一生懸命お前が収集してきた";
		mes "「町内のご令嬢・極秘ノート」を";
		mes "お前の彼女に見せ、";
		mes "真正な愛があるか確かめるぞ！";
		mes "…………とな。";
		set HU_5QUE,1;
		close;
	case 2:
		mes "[エロン]";
		mes "ぐぉぉぉぉぉぉぉ！";
		mes "父が死にそうだというのに、";
		mes "我が息子は遊び呆けておるのか！";
		mes "あの馬鹿息子め！";
		mes "ドロップキックで";
		mes "ぶっ飛ばぁぁぁぁぁぁぁぁぁぁす！";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "-どう見ても元気そうだが……-";
		mes "-本当に具合が悪いのか？-";
		next;
		mes "[エロン]";
		mes "しかし、そんな息子も";
		mes "親孝行と言っていたとは……";
		mes "恩知らずな息子に育ててしまったと";
		mes "思っていたが、今は頼もしく見える。";
		mes "君が正しい道に導いてくれたのでは";
		mes "ないのか？";
		next;
		mes "[エロン]";
		mes "今気づいたんだが、";
		mes "君は頼もしそうじゃないか！";
		mes "いや、これは憶測ではない！";
		next;
		mes "[エロン]";
		mes "私がリヒタルゼンで働いていた時でも、";
		mes "君のような立派な人物は";
		mes "見た事がない！";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "え？　リヒタルゼン？";
		mes "そこに住んでいたんですか？";
		next;
		mes "[エロン]";
		mes "え？　あ……いや……";
		mes "それは……ウッ……";
		mes "ゴフッ！　ゴフッ！";
		mes "うぅ……急に痛みが！";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "…………";
		next;
		mes "[エロン]";
		mes "悪いが……";
		mes "白ポーションを1つくれないか？";
		mes "それがあれば少しは";
		mes "痛みが引くんだが……";
		mes "ぐふ！　げふぶほぉぁ！";
		next;
		if(select("あげる","あげない")==2) {
			mes "[エロン]";
			mes "な！　貴様！　正気か!?";
			mes "不遇に包まれ死んでいく";
			mes "このおいぼれを無視するのか！";
			mes "な、なんてやつだ！";
			mes "ぐ、がは！　げふ！";
			mes "……し、死んでしまう！";
			next;
			mes "[エロン]";
			mes "私が死んだら";
			mes "全部お前のせいだからな！";
			mes "バーカ、アーホ、まぬけ、";
			mes "ハゲ頭、七面鳥！";
			mes "げふ！　ぐっ！　がは！";
			mes "た、頼む、助けてくれ！";
			close;
		}
		if(countitem(504) < 1) {
			mes "[エロン]";
			mes "……1つも持っていないのか……";
			mes "ぐ……げ、げはぁ！";
			mes "だ、だめだ、死んでしまう！";
			mes "はやく私に……ぐぼぅあ！";
			mes "白……ぶふぅ！　白ポーションを！";
			close;
		}
		delitem 504,1;
		mes "[エロン]";
		mes "すまないな！";
		mes "やはり君は頼りになる！";
		mes "ウホホホッ。";
		mes "キュキュキュ……ごくごく……";
		next;
		mes "[エロン]";
		mes "…………";
		next;
		mes "[エロン]";
		mes "ぷは！　さすがに効くな！";
		mes "だが、まだ少し痛む……";
		mes "やはりちゃんとした薬がないとダメか。";
		next;
		mes "[エロン]";
		mes "あぁ……息子は薬を買いに行ったが、";
		mes "やはりすぐには帰ってこないだろう。";
		mes "君、もしよかったら";
		mes "息子が帰ってくるまで";
		mes "私を看病してくれないか？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……はいはい。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "-うっかり返事をしてしまった……-";
		set HU_5QUE,3;
		close;
	case 3:
		mes "[エロン]";
		mes "げふ！　げは！　げばらぁ！";
		mes "隣の部屋の棚に";
		mes "応急処置用の薬がある……";
		mes "ぐ！　ぐふぁ！　ぐほぁ！";
		next;
		mes "[エロン]";
		mes "ま、まだいいが、";
		mes "私がくれと言ったら";
		mes "引き出しから取ってきてくれ……";
		mes "げふ！　げふ！　ごほ！";
		set HU_5QUE,4;
		close;
	case 4:
	case 7:
		mes "[エロン]";
		mes "ごほ！　ごほ！　ごほ！";
		mes "ぐ！　ごほ！　げふ！";
		mes "こ、こっちへ……";
		mes "げふ！　げほぁ！";
		close;
	case 6:
	case 9:
		mes "-エロンに水薬を渡した-";
		next;
		mes "[エロン]";
		mes "ん、すまない……";
		next;
		mes "[エロン]";
		mes "キュッキュッキュッキュ……";
		mes "ごく……ごく……ごく……";
		mes "……ふー";
		mes "少し楽になったようだ。";
		if(HU_5QUE == 6) {
			set HU_5QUE,7;
			close;
		}
		if(rand(5)) {
			mes "……息子はまだ来ないのか？";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "-どれだけ薬を飲むつもりなんだ……-";
			mes "-息子さんはまだ来ないのか……-";
			set HU_5QUE,7;
			close;
		}
		mes "そろそろ息子が来る頃か……";
		set HU_5QUE,10;
		close;
	case 10:
		mes "[エロン]";
		mes "ぐ、ぐぁああ！";
		mes "ぐぉぉぉぉぉ！";
		mes "こ、この痛みは！";
		mes "頭が肩が膝が……";
		mes "足！　膝！　足！";
		mes "痛みが……痛みがぁ！";
		next;
		hideoffnpc "ポスティール・シュイル#hu";
		mes "[エロン]";
		mes "ハッ！　息子よ！";
		next;
		misceffect 178,"ポスティール・シュイル#hu";
		mes "[ポスティール]";
		mes "父さんのため！";
		mes "ボクのシャイニングハートに";
		mes "火が灯り！";
		mes "光よりも早く駆けつける！";
		mes "キングオブ親孝行！";
		mes "ポスティール！　只今参上!!";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "-………………-";
		mes "-一体いつの間に……-";
		mes "-まさか隠れていた？-";
		next;
		mes "[エロン]";
		mes "おぉ、我が愛しい息子よ。";
		mes "繊細な私を、過酷なルティエの";
		mes "寒風のように襲う痛みに効く特効薬。";
		mes "コールバンAを持って来たか！";
		next;
		mes "[ポスティール]";
		mes "当然至極！";
		next;
		mes "[エロン]";
		mes "おぉ！";
		mes "お前だけは信じていたぞ！";
		mes "さあ、コールバンAを！";
		next;
		mes "[ポスティール]";
		mes "ここに！";
		next;
		mes "[エロン]";
		mes "よし、さっそく……";
		mes "ゴクゴクゴク……";
		mes "ごくごく……ぷは……";
		mes "…………";
		next;
		emotion 4,"ポスティール・シュイル#hu";
		mes "[エロン]";
		mes "……む……";
		mes "何かおかしい……";
		mes "この味は……";
		mes "本当にコールバンAなのか？";
		next;
		mes "[ポスティール]";
		mes "ふぅ。";
		mes "やっぱり……";
		mes "父さんの味覚は誤魔化せないかぁ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "…………";
		next;
		mes "[エロン]";
		mes "な、お前！";
		next;
		mes "[ポスティール]";
		mes "アハハハハ！";
		mes "しょうがない。";
		mes "ちゃんと薬を買ってくるよ。";
		close2;
		hideonnpc "ポスティール・シュイル#hu";
		emotion 4,"";
		emotion 4;
		set HU_5QUE,11;
		close;
	case 11:
	case 12:
		mes "[エロン]";
		mes "あいつ、根はいいのだが……";
		mes "たまに……";
		mes "リヒタルゼンでもうちょっと";
		mes "立場がよかったら、";
		mes "教育もちゃんとできていたのだが……";
		next;
		mes "[エロン]";
		mes "まぁ、薬は違ったが";
		mes "効き目はあったみたいだ。";
		mes "ありがとう。";
		mes "そこの棚の引き出しの中に";
		mes "箱がある。";
		next;
		mes "[エロン]";
		mes "よかったら持っていってくれ。";
		mes "ほんのお礼だ。";
		if(HU_5QUE == 11)
			set HU_5QUE,12;
		close;
	case 13:
		mes "[エロン]";
		mes "私の大切にしてきた箱……";
		mes "その中には、12年寄り添った靴下や";
		mes "3年間熟成されたゼロピーが";
		mes "入っているかもしれんがな……";
		close;
	}
	mes "[エロン]";
	mes "あぁ……腰が……";
	mes "くそ、なぜ私ばかり";
	mes "このような苦痛を";
	mes "受けねばならんのだ？";
	next;
	mes "[エロン]";
	mes "それでも信じられるのは、";
	mes "遊ぶ事しか考えていない息子だけ。";
	mes "小さいころは言うことを聞く";
	mes "可愛いやつだったが、";
	mes "大きくなってからというもの……";
	close;
OnTouch:
	if(HU_5QUE == 4 || HU_5QUE == 7) {
		mes "[エロン]";
		mes "ごふ！　ごふ！　ごふ！";
		mes "げ！　げは！　ごは！";
		mes "薬を……薬を取ってくれ！";
		mes "げふ！　げふ！　ごふ！";
		set HU_5QUE,HU_5QUE+1;
		initnpctimer "上の引き出し#hu";
		close;
	}
	end;
}

hu_fild06.gat,34,123,3	script	ポスティール・シュイル	97,{
	if(HU_5QUE == 0) {
		mes "[ポスティール]";
		mes "遊ぼうよー";
		next;
		mes "[ポスティール]";
		mes "ねー遊ぼうよー";
		next;
		mes "[ポスティール]";
		mes "ねーってばー";
		close;
	}
	if(HU_5QUE > 1) {
		mes "[ポスティール]";
		mes "ボクは若いんだし、";
		mes "まだまだ遊んでいたいよ。";
		next;
		mes "[ポスティール]";
		mes "ハハハ……";
		mes "はいはい、すぐに行くよ……";
		close;
	}
	mes "[ポスティール]";
	mes "空気も水もきれい……";
	mes "それに平和だし……";
	mes "これ以上住み心地がいい";
	mes "所はないよね～";
	next;
	mes "[ポスティール]";
	mes "え？　薬？";
	mes "……あぁ、父さんの病気でしょ。";
	mes "そんなに心配しなくていいよ。";
	mes "よくあることなんだから。";
	mes "ほっときゃ治るよ。";
	next;
	mes "[ポスティール]";
	mes "それよりさ。";
	mes "今はボクと一緒に遊ぶ方が";
	mes "楽しいと思わない？";
	next;
	if(select("それより、伝言があります","確かに、楽しそうだ")==2) {
		mes "[" +strcharinfo(0)+ "]";
		mes "-でも、今遊ぶのは……-";
		mes "-エロンさんは病気だし……-";
		close;
	}
	mes "[エロンの声]";
	mes "愛する我が息子、ポスティールよ。";
	mes "一生懸命お前が収集してきた";
	mes "「町内のご令嬢・極秘ノート」を";
	mes "お前の彼女に見せ、";
	mes "真正な愛があるか確かめるぞ！";
	next;
	mes "[ポスティール]";
	mes "わ!?　すごい！";
	mes "似てる似てる！";
	mes "いや、それよりも……";
	mes "うーん、これは命がけの問題だな……";
	next;
	mes "[ポスティール]";
	mes "ふぅ……仕方ないな。";
	mes "薬を取りに行ってくるよ。";
	mes "あ、その間、父さんの面倒を";
	mes "見ていてよ。";
	mes "変なことさせないように！";
	next;
	mes "[ポスティール]";
	mes "ウオォォォ!!";
	mes "親孝行モード、オン！";
	mes "新！　ポスティールV!!";
	mes "8体合体！　ポスティール!!";
	mes "Go！　Go！";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "-………………-";
	mes "-と、とりあえず、";
	mes "エロンさんの元へ戻ろう-";
	set HU_5QUE,2;
	close;
}

hu_in01.gat,370,255,0	script	上の引き出し#hu	111,2,2,{
	end;
OnTouch:
	switch(HU_5QUE) {
	case 1:
	case 2:
	case 3:
	case 4:
		mes "-数冊の本と水薬がある-";
		close;
	default:
		break;
	case 5:
	case 8:
		if(getnpctimer(1)) {
			mes "-水薬を見つけた-";
			set HU_5QUE,HU_5QUE+1;
			close;
		}
		mes "[エロン]";
		mes "ぁ、痛みが止んだようだ。";
		mes "やっぱり薬はいい。";
		set HU_5QUE,HU_5QUE-1;
		next;
		if(rand(2))
			break;
		mes "[" +strcharinfo(0)+ "]";
		mes "-………………-";
		close;
	case 12:
		mes "-本棚の奥に箱が1つあった-";
		close2;
		misceffect 71,"";
		set HU_5QUE,13;
		if(checkre())
			getexp 5000,0;
		else
			getexp 50000,0;
		getitem 603,1;
		end;
	}
	if(rand(2)) {
		mes "[エロンの日記]";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "-日記帳だ-";
		mes "-退屈だし、読んでみよう-";
		mes "-……………………-";
		mes "-……紙の損傷が激しい-";
		mes "-文として読むのは無理だ-";
		next;
		mes "[企業……リヒタルゼン……スラム街]";
		mes "[莫大な金……シルホムチェ……研究所]";
		mes "[逃走……フィゲル……副作用]";
		mes "[モリペン博士……]";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "-これだけしか読み取れない-";
		mes "-何の事だろう？-";
		mes "-これでは全然わからない-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "-暇つぶしにはなった-";
		mes "-これ以上他人の私生活に";
		mes "関わらなくてもいいだろう-";
	}
	else {
		mes "-引き出しの中に古い本がある-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "ん？";
		next;
		mes "[リヒタルゼンにいらっしゃい!!]";
		mes "著者：トプソ・イルテクカ";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "…………";
		next;
		mes "[リヒタルゼンにいらっしゃい!!2]";
		mes "著者：トプソ・イルテクカ";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……………………";
		next;
		mes "[リヒタルゼンにいらっしゃい!!3]";
		mes "著者：トプソ・イルテクカ";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "-本当にエロンさんは";
		mes "リヒタルゼンで暮らしていたのか？-";
		mes "-こんなよくわからないパンフレットを";
		mes "いくつも持っているのに？-";
	}
	next;
	mes "[エロン]";
	mes "げっほ！　ごふ！　ごは！";
	mes "ごふ！　ごふ！　ごふ！";
	mes "ごぉっほ！　ごほ！";
	close;
OnTimer5000:
	stopnpctimer;
	end;
}

hu_in01.gat,385,247,5	script	ポスティール・シュイル#hu	97,{
	mes "[ポスティール]";
	mes "今、忙しいんだ。";
	close;
OnInit:
	hideonnpc;
	end;
}

//============================================================
// 薬の調剤クエスト
//- Registry -------------------------------------------------
// HU_6QUE -> 0～9
//------------------------------------------------------------
ein_in01.gat,16,36,3	script	モリペン	86,{
	switch(HU_6QUE) {
	case 0:
		if(HU_5QUE < 13) {
			mes "[モリペン]";
			mes "う……今日は";
			mes "体調が良くないな……";
			mes "今日も店を閉めるか……";
			mes "……ごほ！";
			close;
		}
		mes "[モリペン]";
		mes "ん……？　誰だ？";
		mes "何の用で来たか知らないが、";
		mes "買い物ならまた今度にしてくれ。";
		mes "見ての通り、";
		mes "具合が悪いんだ……";
		next;
		mes "[モリペン]";
		mes "ごほ！　げほ！　げほ！";
		mes "がは！　ごほ……";
		mes "ごほ！　ごほん!!";
		next;
		mes "-男の口から血が出た-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "わっ！　だ、大丈夫ですか!?";
		mes "血が……";
		mes "それに、私はただ通り過ぎただけで……";
		next;
		mes "[モリペン]";
		mes "ごほ！　ごほ！";
		mes "ぐほ！　ごふぅ！";
		mes "な、なんだ。そうなのか。";
		mes "勘違いしてすまない。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "-うーん……";
		mes "具合が悪いどころじゃないみたいだ-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "体の調子が悪いようですね。";
		mes "病院に行ってみたらどうですか？";
		next;
		mes "[モリペン]";
		mes "…………";
		mes "私は病院に行けない身だ……";
		next;
		mes "[モリペン]";
		mes "それに、病院に行かなくても";
		mes "私には薬がある。";
		next;
		mes "[モリペン]";
		mes "でも、家に何ヶ月も帰ってないから";
		mes "薬が……";
		mes "ぐぉふ！　げふごは！";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "-どうする……-";
		next;
		if(select("立ち去る","男を助ける")==1) {
			mes "[" +strcharinfo(0)+ "]";
			mes "私が手伝えることは";
			mes "なさそうですね。";
			next;
			mes "[モリペン]";
			mes "ぐぉほ！　ごほ！";
			mes "……そうだ……";
			mes "わかったらほっといてくれ。";
			close;
		}
		mes "[" +strcharinfo(0)+ "]";
		mes "何か手伝いましょうか？";
		next;
		mes "[モリペン]";
		mes "必要ない……";
		mes "もうほっといて……";
		mes "げふ！　ごふふ！　ごは！";
		mes "げほ！　ごほん！";
		mes "ごふ！　ごふ！　ごふん！";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……";
		next;
		mes "[モリペン]";
		mes "げふ！　げふ！　げふ！";
		mes "ごほん！　ごほ！　ごほ！";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "やっぱり手伝いますよ。";
		mes "遠慮しないでください。";
		mes "そんな体じゃ持ちませんよ？";
		next;
		mes "[モリペン]";
		mes "……本当か？";
		mes "君、いい奴だな。";
		mes "ごほ！　ごほ！　げふ！";
		next;
		mes "[モリペン]";
		mes "私の家はフィゲルにある。";
		mes "そこにいる私の妻、";
		mes "シリアに会って事情を言って";
		mes "薬をもらってきてくれ。";
		next;
		mes "[モリペン]";
		mes "私の容態は絶対に言うな。";
		mes "薬が無くなってきているから";
		mes "代わりに取りに来たとだけ言ってくれ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "わかりました。";
		next;
		mes "[モリペン]";
		mes "本当に助かる。";
		mes "ごほ！　ごほ！　ごほ！";
		mes "げほ！　げほ！　ごほ！";
		next;
		mes "[モリペン]";
		mes "がふ！　おふ！　ごほ！";
		mes "はー、はー、はー。";
		mes "ごふ！　ごふ！　げほ！";
		next;
		mes "[モリペン]";
		mes "ごふ！　ごふふ！";
		mes "げふ！　げほ！　げほ！";
		mes "ごほ！　ごほ！";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "…………";
		mes "……じゃ、じゃあ";
		mes "行ってきます……";
		set HU_6QUE,1;
		close;
	case 1:
		mes "[モリペン]";
		mes "ごほ！　ごほ！　私の……";
		mes "家は……ごほ！　げふ！";
		mes "ごふ！　フィゲル……げほ！";
		mes "ごほ！　ごふ！";
		mes "ごは！　げふ！　ごはぁ！";
		close;
	default:
		mes "[" +strcharinfo(0)+ "]";
		mes "-モリペンさんの";
		mes "容態が良くない-";
		mes "-はやくフィゲルに行って、";
		mes "シリアさんから薬を受け取ってこよう-";
		close;
	case 6:
		mes "[" +strcharinfo(0)+ "]";
		mes "-倒れているモリペンさんに";
		mes "薬を飲ませた-";
		next;
		mes "[モリペン]";
		mes "ううぅ……ぅ……はぁ……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "気がつきましたか？";
		next;
		mes "[モリペン]";
		mes "う……ん……ここは……";
		mes "私は死んだのか？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "いや、違うから";
		next;
		mes "[モリペン]";
		mes "君は……来てくれたのか。";
		mes "何年ぶりだろう……";
		mes "人を信じて待ち続けるなんて……";
		next;
		mes "[モリペン]";
		mes "妻から薬を受け取って";
		mes "きたみたいだな。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "いえ、シリアさんも";
		mes "薬が全部無くなったそうなので、";
		mes "ドノーという人に頼んで";
		mes "薬をもらってきました。";
		next;
		mes "[モリペン]";
		mes "な!?";
		mes "確かに妻もこの薬を";
		mes "使っているが……";
		next;
		mes "[モリペン]";
		mes "悪いが、残りの薬を";
		mes "妻に届けてくれ！";
		next;
		mes "[モリペン]";
		mes "薬を飲まずに何日もたつと";
		mes "手遅れになるかもしれないんだ！";
		next;
		mes "[モリペン]";
		mes "頼む！";
		mes "何でもする！";
		mes "このとおりだ！";
		mes "妻に薬を届けてくれ！";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "は、はい。わかりました。";
		mes "-こんなに頼まれたら";
		mes "断ることができない-";
		next;
		mes "[モリペン]";
		mes "ありがとう！";
		mes "ありがとう！";
		mes "この恩は絶対に忘れない！";
		next;
		set HU_6QUE,7;
	case 7:
		mes "[" +strcharinfo(0)+ "]";
		mes "-フィゲルのシリアさんへ";
		mes "薬を届けに行こう-";
		close;
	case 8:
		mes "[モリペン]";
		mes "どうだ！　どうだった！";
		mes "私の妻は！　妻の容態は！";
		mes "……まさか!?";
		next;
		mes "[モリペン]";
		mes "まさか間に合わなかったのか！";
		mes "もし私の妻に何かあったのなら";
		mes "君はどうなるかわかってるのか！";
		next;
		mes "[モリペン]";
		mes "この世界から君の存在を";
		mes "消し去ってやるぞ！";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "…………";
		next;
		mes "[モリペン]";
		mes "あぁぁぁぁ。";
		mes "ごめんなさい！";
		mes "ほんとごめんなさい！";
		mes "私が悪かった！";
		mes "だから、妻は！";
		mes "妻はぁぁぁぁぁ！";
		next;
		mes "[モリペン]";
		mes "頼むから無事だと言ってくれ……";
		mes "さっきは悪かった……";
		mes "だから……だから……";
		mes "ぅ……うぅぅ…………";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……無事です。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "まったく、たまには家に帰って";
		mes "ちゃんと薬を用意してくださいよ。";
		mes "二人ともあんなになるまで我慢して……";
		mes "周りの人が大変なんですからね。";
		next;
		mes "[モリペン]";
		mes "すまない……";
		mes "色々と忙しくて……";
		mes "ぐすっ……";
		mes "本当にありがとう、ありがとう……";
		mes "ぐすっぐすっ……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "もういいですよ。";
		mes "わかってくれればいいんです。";
		next;
		mes "[モリペン]";
		mes "ぐすっ……あ、そうだ……";
		mes "私も約束を守らないとな。";
		mes "さて、何をしてほしい？";
		next;
		mes "[モリペン]";
		mes "君は私の妻と";
		mes "私の命を救ってくれた。";
		mes "君は私の命そのものなんだ。";
		next;
		mes "[モリペン]";
		mes "ふむ……そうだな。";
		mes "私は君の犬だ！";
		mes "わんわん！　なんでもするわん！";
		mes "ハッハッハッハッ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "や、やめてください！";
		next;
		mes "[モリペン]";
		mes "なにをいうか！";
		mes "私は君の奴隷だ！";
		mes "見ての通り頭が弱いから";
		mes "君の願いが手に負えないなら";
		mes "何とかしてごまかすぞ！";
		next;
		mes "[モリペン]";
		mes "さぁなんでも言うがいい！";
		mes "こんな機会はそうそうない！";
		mes "お得サービスデーだ！";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "…………";
		next;
		mes "[モリペン]";
		mes "ほら、何かいってみろ！";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "わかりました……それなら……";
		mes "……私の願い事は……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "そうですね……";
		mes "あなたとドノーさん、";
		mes "そしてシリアさん。";
		mes "三人に昔何があったか、";
		mes "その話を聞きたいです。";
		next;
		mes "[モリペン]";
		mes "…………";
		next;
		mes "[モリペン]";
		mes "妻に聞いたのか……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "モリペンさんに";
		mes "大きな恩をきせて生きている";
		mes "罪人だと言ってました。";
		next;
		mes "[モリペン]";
		mes "……ふぅ……";
		mes "そんな風に思っていたのか。";
		mes "まったく……";
		next;
		mes "[モリペン]";
		mes "……わかった。";
		mes "君には色々としてもらった。";
		mes "全て話そう。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "…………";
		next;
		mes "[モリペン]";
		mes "私はレッケンベルで";
		mes "武器研究プロジェクトの責任者だった。";
		mes "ステドラ・モリペンと言う。";
		next;
		mes "[モリペン]";
		mes "そしてドノーは幼い頃からの";
		mes "親しい友人で、";
		mes "レッケンベル生体実験の";
		mes "総責任者を任されていた。";
		next;
		mes "[モリペン]";
		mes "ドノーとは違う分野だったが、";
		mes "お互いに不足している部分を";
		mes "協力して補っていた。";
		next;
		mes "[モリペン]";
		mes "そんなある日……";
		mes "ドノーの研究室へ行くと、";
		mes "私の人生最大の……";
		mes "そうだな……運命の出会いを";
		mes "することになった。";
		next;
		mes "[モリペン]";
		mes "ガラスの向こうから見える";
		mes "美しい容姿。";
		mes "我を忘れるほど魅了された……";
		next;
		mes "[モリペン]";
		mes "しかしドノーは彼女を";
		mes "どうでもいいただの実験体、";
		mes "それ以上でもそれ以下でもないと";
		mes "言った。";
		next;
		mes "[モリペン]";
		mes "……だが、";
		mes "私にはそれこそどうでもよかった。";
		mes "そこでいつも会え、";
		mes "見つめることができる……";
		mes "それだけで幸せだった。";
		next;
		mes "[モリペン]";
		mes "そんな日々がずっと続くと思ってた……";
		mes "だが、あの日。";
		mes "私の全てが崩れようとしていた。";
		next;
		mes "[モリペン]";
		mes "進行中の実験が成果を上げれないため、";
		mes "ドノーのプロジェクトに関わる";
		mes "全てを廃棄処分する。";
		mes "という通達があった。";
		mes "……彼女もその中に含まれていた。";
		next;
		mes "[モリペン]";
		mes "私はそれを聞いた瞬間、";
		mes "決意した。";
		next;
		mes "[モリペン]";
		mes "あの日は風が強く、";
		mes "目を開けていられない程の";
		mes "雪が降る夜だった。";
		mes "しかし、月明りのため";
		mes "あまり暗くはなかった……";
		next;
		mes "[モリペン]";
		mes "手の感覚を失うほどの";
		mes "寒さだったが、";
		mes "止める気はなかった。";
		next;
		mes "[モリペン]";
		mes "…………";
		mes "私は魔法スクロールを使って、";
		mes "研究所を爆破した。";
		next;
		mes "[モリペン]";
		mes "そして、その混乱に紛れて、";
		mes "私が愛する彼女を探した。";
		next;
		mes "[モリペン]";
		mes "彼女を探す間、爆発、引火によって";
		mes "生体研究所にあった多くの薬品が";
		mes "破裂、混合、化学反応を引き起こした。";
		mes "今の私の体がその結果だ。";
		next;
		mes "[モリペン]";
		mes "それでも、なんとか彼女を";
		mes "見つけることができた。";
		mes "私は、目さえ開けることができない";
		mes "彼女を連れて山を越えるつもりでいた。";
		next;
		mes "[モリペン]";
		mes "雪の中をやみくもに歩き……";
		mes "もう何も考えていなかった。";
		next;
		mes "[モリペン]";
		mes "だが……ふと後ろを振り返ると、";
		mes "研究所は炎で燃え上がり、";
		mes "まるでお祭りでもしているように";
		mes "明るかった。";
		next;
		mes "[モリペン]";
		mes "そして、私の前は一寸先も";
		mes "見えない闇と吹雪。";
		next;
		mes "[モリペン]";
		mes "全身の力が抜け落ちた。";
		mes "……自分のした事が";
		mes "急に怖くなったんだ……";
		next;
		mes "[モリペン]";
		mes "子供が過ちを犯した後のように、";
		mes "後悔と恐怖が";
		mes "私の心に押し寄せてきた。";
		next;
		mes "[モリペン]";
		mes "死んでいく私の体が";
		mes "楽になろうとしたその瞬間。";
		mes "誰かが私を助けてくれた……";
		next;
		mes "[モリペン]";
		mes "あれは夢だったのか。";
		mes "私が見た幻なのか……";
		next;
		mes "[モリペン]";
		mes "高い身長。";
		mes "顔が見えないローブ……";
		mes "確かマウォングと";
		mes "名乗っていた……";
		next;
		mes "[モリペン]";
		mes "-行き場を失った者……-";
		mes "-オーディンの影に生まれ……-";
		mes "-忘れられた者等の安息の地……-";
		mes "-そこはフィゲル……-";
		next;
		mes "[モリペン]";
		mes "私はその声を聞いて";
		mes "意識を失った……";
		next;
		mes "[モリペン]";
		mes "気が付くと、";
		mes "何の話も聞き分けることができない";
		mes "彼女と、満身創痍になった";
		mes "私はフィゲルにいた……";
		next;
		mes "[モリペン]";
		mes "フィゲルの人々は、";
		mes "異邦人である私たちを";
		mes "誰も拒絶しなかった。";
		mes "まるで故郷のように……";
		mes "元々そこで暮らしていたかのように";
		mes "私たちを受け入れてくれた。";
		next;
		mes "[モリペン]";
		mes "私は彼女に言葉を教え、";
		mes "名前を付けてあげた。";
		mes "私にとって彼女は実験体じゃない。";
		mes "愛する人だ。";
		next;
		mes "[モリペン]";
		mes "しかし、彼女と二人で生きるのは";
		mes "フィゲルのような田舎でも";
		mes "たやすい事ではなかった……";
		mes "私は働くために、";
		mes "アインブロックとリヒタルゼンに";
		mes "行かなければならなかった……";
		next;
		mes "[モリペン]";
		mes "そんな中、";
		mes "リヒタルゼンで一番安いという";
		mes "薬草店で、ドノーと出会った……";
		mes "お互いの顔を見た瞬間、";
		mes "私は死を覚悟した……";
		next;
		mes "[モリペン]";
		mes "例え殺すと言われても、";
		mes "受け入れなければならなかった。";
		mes "私は彼の夢、未来、";
		mes "全てを壊してしまった。";
		next;
		mes "[モリペン]";
		mes "しかし、ドノーはそんな私の事を";
		mes "許してくれた……";
		mes "いや……もしかしたら";
		mes "それは私の希望であって、";
		mes "一生呪うつもりかもしれない……";
		next;
		mes "[モリペン]";
		mes "しかし、私がした事に";
		mes "後悔はない……";
		next;
		mes "[モリペン]";
		mes "彼女は戦闘兵器として";
		mes "作られていた……";
		mes "しかし、実験過程で";
		mes "戦う意志を拒否したため、";
		mes "廃棄処分命令を受けた。";
		next;
		mes "[モリペン]";
		mes "私はそんな彼女の命を弄ぶ企業で、";
		mes "製造、納品を行っていたんだ。";
		mes "しかし、企業がシュバルツバルドに";
		mes "振り撒く武器の技術は、";
		mes "極めて一部に過ぎない……";
		next;
		mes "[モリペン]";
		mes "一番強く、凶悪な性能の武器は";
		mes "全て奴らの私物だ……";
		mes "奴らは自分たちをアルナペルツ";
		mes "と言っていた……";
		next;
		mes "[モリペン]";
		mes "シュバルツバルド全域で起きる";
		mes "全ての怪事件は奴らの仕業という";
		mes "話だ……";
		next;
		mes "[モリペン]";
		mes "そして、私が研究していた武器は";
		mes "エクスキューショナー。";
		mes "呪われた遺産と言われる";
		mes "伝説の殺人剣。";
		next;
		mes "[モリペン]";
		mes "しかし私の実験資料も灰になった。";
		mes "多分、完璧なエクスキューショナーは";
		mes "もう作ることはできないだろう……";
		next;
		mes "[モリペン]";
		mes "そう……";
		mes "あの日、私が起こした火事で";
		mes "多くの研究員がクビにされた。";
		mes "その人たちは";
		mes "企業に監視されながら";
		mes "一生を過ごすことになる。";
		next;
		mes "[モリペン]";
		mes "……ドノーも同じだ。";
		mes "多分、君と話をしたということで、";
		mes "また面倒な事になっているだろう。";
		next;
		mes "[モリペン]";
		mes "しかし、ドノーは私の事、";
		mes "彼女の事を話さないでいてくれる。";
		next;
		mes "[モリペン]";
		mes "私はドノーに";
		mes "永遠に恩を返すことはできない。";
		mes "そして、私はもう彼にとって";
		mes "友人ではないのかも知れない。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……いいえ";
		mes "そんな事はありません。";
		mes "ドノーさんはそんな事";
		mes "思っていません。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "ドノーさんは言っていました。";
		mes "友達じゃなかったら";
		mes "首を絞めているところだって。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "それに、今度は自分で薬を";
		mes "取りに来るようにと言ってました。";
		mes "ドノーさんはモリペンさんの事を";
		mes "今でも友達だと思っています。";
		next;
		mes "[モリペン]";
		mes "……ハ……ハハ。";
		mes "そうか…………";
		mes "う……うぅ……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "ほら、泣かないでください。";
		mes "ドノーさんも許してくれてるんです。";
		mes "もっと幸せになってください。";
		next;
		mes "[モリペン]";
		mes "ありがとう、ありがとう……";
		mes "ぅ……ひっく……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "もぅ、泣かないでって。";
		next;
		mes "[モリペン]";
		mes "ぐす……";
		mes "私が話をしていたのに、";
		mes "また君に借りができたみたいだね。";
		mes "何かあったら何でも言ってくれ。";
		mes "できることなら何だってするよ。";
		next;
		mes "[モリペン]";
		mes "そう、これも何かの縁だ。";
		mes "用がなくても、";
		mes "いつでも遊びに来てくれ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "その時、また倒れてたら";
		mes "怒りますからね！";
		mes "……フフ。";
		next;
		mes "[モリペン]";
		mes "ハハハ。";
		mes "心配しないで。";
		mes "じゃ、また来てくれよ。";
		set HU_6QUE,9;
		if(checkre())
			getexp 70000,0;
		else
			getexp 700000,0;
		close;
	case 9:
		mes "[モリペン]";
		mes "ありがとう。";
		mes "君のおかげで私も妻も";
		mes "元気にしているよ。";
		next;
		mes "[モリペン]";
		mes "また遊びに来てくれ。";
		mes "いや、今度は妻との";
		mes "正式な結構式で……かな？";
		mes "ハハハ。";
		close;
	}
}

hu_in01.gat,326,307,3	script	シリア	90,{
	switch(HU_6QUE) {
	case 0:
		mes "[シリア]";
		mes "誰ですか？";
		mes "誰かわかりませんが";
		mes "はやく出ていってください。";
		close;
	case 1:
		mes "[シリア]";
		mes "う……ん？";
		mes "どちらさまですか？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "あ……";
		mes "-彼女はとても細い体をしている-";
		mes "-それに、モリペンさんの奥さんには";
		mes "思えないぐらい若くて綺麗な人だ-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "あ……その……";
		mes "モリペンという人から";
		mes "薬を取ってくるように";
		mes "言われてきました。";
		next;
		mes "[シリア]";
		mes "！";
		mes "あの人に何かあったんですか！";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "-彼女は焦点の定まらない目で";
		mes "慌てて動いたせいで";
		mes "つまずいてしまった-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "大丈夫ですか!?";
		next;
		mes "[シリア]";
		mes "あ……大丈夫です。";
		mes "急に目が……";
		mes "それよりあの人は!?";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "体調がちょっと悪いようです。";
		mes "私が代わりに薬を";
		mes "取りに来ました。";
		next;
		mes "[シリア]";
		mes "そうですか……";
		mes "あぁ、どうしましょう。";
		mes "薬は全部無くなっていて、";
		mes "調剤してもらわなければ";
		mes "なりません。";
		next;
		mes "[シリア]";
		mes "調剤はあの人の友達に";
		mes "頼まなければならないのに……";
		mes "私もリヒタルゼンにいらっしゃるとしか";
		mes "知らないんです……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "リヒタルゼン……";
		mes "わかりました。";
		mes "そこで探してみます。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "その友達の名前は？";
		next;
		mes "[シリア]";
		mes "お名前はドノーといいます。";
		mes "コホ……コホン……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "-シリアさんも体調が悪いのか、";
		mes "顔色が急に悪くなった-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "あの……大丈夫ですか？";
		next;
		mes "[シリア]";
		mes "私は大丈夫です。";
		mes "お気になさらずに。";
		mes "それより、どうか";
		mes "薬をあの人に届けてください。";
		mes "……コホン。";
		next;
		mes "[シリア]";
		mes "あの人に何かあったら";
		mes "私は生きていけません。";
		mes "……コホン、コホン。";
		mes "どうかお願いします。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "体の調子は悪いですが、";
		mes "そこまで深刻ではありません。";
		mes "薬は必ず届けます。";
		mes "だから心配しないでください。";
		next;
		mes "[シリア]";
		mes "本当にありがとうございます。";
		mes "このご恩は忘れません。";
		next;
		mes "[シリア]";
		mes "あの人は身も心も傷ついてます。";
		mes "私のような女のために";
		mes "一生を費やしてくださってます。";
		mes "私もあの人がいなければ";
		mes "生きる事ができません。";
		mes "だから、どうかお願いします。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "はい……わかりましたから。";
		mes "だからそう心配しないでください。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "-リヒタルゼンの";
		mes "ドノーという人か……-";
		set HU_6QUE,2;
		close;
	case 2:
		mes "[シリア]";
		mes "リヒタルゼンのドノーという方に";
		mes "あってください。";
		mes "その方が薬を調剤できます。";
		close;
	default:
		mes "[シリア]";
		mes "ドノーさんに会えましたか？";
		mes "私どものために、";
		mes "いつも苦労してくださる方です。";
		close;
	case 6:
		mes "[シリア]";
		mes "私は大丈夫です。だからはやく";
		mes "あの人に薬を届けてください。";
		close;
	case 7:
		mes "[" +strcharinfo(0)+ "]";
		mes "-倒れているシリアさんに";
		mes "薬を飲ませると、";
		mes "顔に生気が戻ってきた-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……気がつきましたか？";
		mes "私がわかりますか？";
		next;
		mes "[シリア]";
		mes "……はい…………";
		mes "なんとか……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "-まだ視力が完全じゃないみたいだ-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "手遅れにならなくてよかった。";
		mes "シリアさんも薬が不足しているという";
		mes "話を聞いて、モリペンさんが";
		mes "とても心配していましたよ。";
		next;
		mes "[シリア]";
		mes "そうですか……";
		mes "本当にありがとうございます。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "もう大丈夫ですか？";
		next;
		mes "[シリア]";
		mes "私の事はそんなに";
		mes "気にしなくてもいいのです。";
		mes "私はただあの人に恩を";
		mes "きせているだけの罪人です。";
		mes "あの人はこんな私の";
		mes "面倒を見てくださって……";
		next;
		mes "[シリア]";
		mes "私のせいで、あの人もドノーさんも";
		mes "こんな生活をするはめになったのに……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "何の話かわかりませんが、";
		mes "とにかく目は見えるんですね？";
		next;
		mes "[シリア]";
		mes "はい、まだ少しぼやけていますが……";
		mes "命を救ってくださったことだけでも";
		mes "感謝しています。";
		mes "本当にありがとうございます。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "いいんですよ。";
		mes "これくらい。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "それでは、私はまた";
		mes "モリペンさんの所に戻りますから。";
		next;
		mes "[シリア]";
		mes "あ、何かお礼を";
		mes "したいのですが……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "いえ、気にしないでください。";
		mes "そのようなものを望んで";
		mes "助けたわけじゃないので。";
		mes "本当にいいです。";
		next;
		mes "[シリア]";
		mes "そうですか……";
		mes "元より何もありませんが、";
		mes "何かありましたら";
		mes "お手伝いさせてください。";
		set HU_6QUE,8;
		if(checkre())
			getexp 50000,0;
		else
			getexp 500000,0;
		close;
	case 8:
		mes "[シリア]";
		mes "あの人には";
		mes "私は大丈夫だとお伝えください。";
		close;
	case 9:
		mes "[シリア]";
		mes "以前は本当にありがとうございました。";
		mes "いつでもまたいらしてください。";
		close;
	}
}

lighthalzen.gat,88,79,7	script	ドノー	85,{
	switch(HU_6QUE) {
	case 0:
	case 1:
		mes "[ドノー]";
		mes "ったくめんどくせぇ……";
		mes "こんな人生、はやく";
		mes "終わっちまえばいいんだ。";
		close;
	case 2:
		mes "[ドノー]";
		mes "ん？　何だお前？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "ドノーさんですか？";
		next;
		mes "[ドノー]";
		mes "唐突だな……";
		mes "お前は誰だ？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "モリペンさんの事で来ました。";
		next;
		mes "[ドノー]";
		mes "……フン。";
		mes "モリペンか……";
		mes "薬でも必要になったのか？";
		mes "……ったく、まだ死なねぇのか。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "-二人は友達じゃ……？-";
		next;
		mes "[ドノー]";
		mes "シリアはどうなんだ？";
		mes "生きているのか？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……当然です。";
		next;
		mes "[ドノー]";
		mes "ふん、そうか……";
		mes "初めて見る顔だな。";
		mes "新しく入った店員か？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "…………";
		next;
		mes "[ドノー]";
		mes "まぁ何でもいいか……";
		mes "薬を取りに来たんだったな？";
		next;
		mes "[ドノー]";
		mes "それなんだがな。";
		mes "いつも薬を二人分用意してたんだが、";
		mes "今回はすっかり忘れててな。";
		mes "薬が無いんだ。";
		next;
		mes "[ドノー]";
		mes "確かにそろそろモリペンと";
		mes "一応奥さんということになってるやつの";
		mes "薬が必要なんだったな……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "え？　シリアさんですか？";
		next;
		mes "[ドノー]";
		mes "そうそいつだ。";
		mes "ったく……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "シリアさんも体の調子が";
		mes "悪いんですか？";
		next;
		mes "[ドノー]";
		mes "お前の目は節穴か？";
		mes "普通なら気づくはずだぞ。";
		mes "あいつが健康そうに見えるか？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "そういえば、目が……";
		next;
		mes "[ドノー]";
		mes "何!?";
		mes "目が見えないのか!?";
		mes "……ったく。";
		mes "何でそこまで我慢するんだ。";
		mes "俺がいなかったら二人とも死んでたぞ。";
		next;
		mes "[ドノー]";
		mes "まぁ、それは一時的なものだから";
		mes "薬さえ飲めばすぐ直る。";
		mes "お前がちょっと苦労しないと";
		mes "薬が無いんだけどな。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "………………";
		next;
		mes "[ドノー]";
		mes "んー？";
		mes "面倒ならそれでもいいんだが。";
		next;
		mes "[ドノー]";
		mes "まぁ、今日中にでも薬を飲まないと";
		mes "二人とも、十中八九死ぬな。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "あ……いえいえ！";
		mes "何でもしますから！";
		mes "ハハ……";
		mes "-なんなんだこの人は……-";
		next;
		mes "[ドノー]";
		mes "あーそう？";
		mes "悪いな。";
		mes "まぁ、薬の材料が足りないんだ。";
		mes "ちょっと材料を手に入れてきてくれ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "わかりました。";
		mes "ハハ……";
		mes "-やっぱりか……-";
		next;
		mes "[ドノー]";
		mes "耳かっぽじってよく聞けよ。";
		mes "必要なものは……";
		next;
		mes "[ドノー]";
		mes "ディトリミン3個、石炭5個、";
		mes "まだ熟してないリンゴ1個、あと……";
		mes "赤、黄、青、緑、白ハーブを";
		mes "それぞれ1個ずつ、ブリガン5個、";
		mes "サイファー5個、そしてかたい皮20個。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "ちょ！　多すぎませんか!?";
		next;
		mes "[ドノー]";
		mes "あん？";
		mes "これでもギリギリの分量だぞ。";
		mes "お前、それでもモリペンとこの店員か？";
		mes "これも仕事だ、仕事。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "だ！　誰が店員ですか！";
		next;
		mes "[ドノー]";
		mes "あー、もうごちゃごちゃうるせぇ。";
		mes "足りないもんは足りないんだよ。";
		mes "一個でも減らすと薬が出来ないんだよ。";
		mes "それぐらいわかんだろ！";
		next;
		mes "[ドノー]";
		mes "材料もできるだけ";
		mes "入手しやすいやつにしてある。";
		mes "本当はもっと色々といるんだよ！";
		next;
		mes "[ドノー]";
		mes "まぁ、俺も今回の材料は初めてだから、";
		mes "ちゃんとうまくできるか知らんけどな。";
		mes "もしうまくできなかったら他の方法を";
		mes "試してやるよ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "…………";
		next;
		mes "[ドノー]";
		mes "ほら、さっさと行け！";
		mes "あんまり時間がかかると";
		mes "あいつら二人とも黄泉へと";
		mes "旅立っちまうぞ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "…………クッ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "-人命がかかっている事だし、";
		mes "早く探しに行こう-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "-手に入れてくるのは";
		mes "ディトリミン3個、石炭5個、";
		mes "まだ熟してないリンゴ1個、";
		mes "赤、黄、青、緑、白ハーブを";
		mes "それぞれ1個ずつ、ブリガン5個、";
		mes "サイファー5個、かたい皮20個-";
		set HU_6QUE,3;
		close;
	case 3:
		if(countitem(971) < 3 || countitem(1003) < 5 || countitem(619) < 1 || countitem(507) < 1 || countitem(508) < 1 || countitem(510) < 1 || countitem(511) < 1 || countitem(509) < 1 || countitem(7054) < 5 || countitem(7053) < 5 || countitem(935) < 20) {
			mes "[" +strcharinfo(0)+ "]";
			mes "-手に入れてくるのは";
			mes "ディトリミン3個、石炭5個、";
			mes "まだ熟してないリンゴ1個、";
			mes "赤、黄、青、緑、白ハーブを";
			mes "それぞれ1個ずつ、ブリガン5個、";
			mes "サイファー5個、かたい皮20個-";
			close;
		}
		delitem 971,3;
		delitem 1003,5;
		delitem 619,1;
		delitem 507,1;
		delitem 508,1;
		delitem 510,1;
		delitem 511,1;
		delitem 509,1;
		delitem 7054,5;
		delitem 7053,5;
		delitem 935,20;
		mes "[ドノー]";
		mes "ほぅ。";
		mes "ちゃんと持ってきたようだな。";
		mes "ちょっと待ってろ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "-ドノーさんは何かを作り始めた-";
		next;
		mes "[ドノー]";
		mes "-ゴリゴリゴリ-";
		mes "ったく、前は楽な仕事だったのによ。";
		mes "今じゃこんなめんどくせぇ仕事だ。";
		mes "どんな人生だよ、ったく。";
		next;
		mes "[ドノー]";
		mes "レッケンベルはなんでもそろってて";
		mes "楽だったなぁ……くそ。";
		next;
		mes "[ドノー]";
		mes "-ゴリゴリゴリ-";
		mes "うーん…………";
		mes "こんなもんか？";
		mes "まぁ、一度試してみるか。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "-ドノーさんは、水が入ったコップに";
		mes "さっきから作ってた粉を注いだ-";
		mes "-水の色が青色に変わった-";
		next;
		mes "[ドノー]";
		mes "あん？　何だこれ？";
		mes "成分含有率は合ってんだろ！";
		mes "この、ふざけやがって！";
		mes "モリペンめ！";
		mes "くそ！";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "………………";
		next;
		mes "[ドノー]";
		mes "おい、お前。";
		mes "次の仕事だ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "………………";
		mes "………………";
		next;
		mes "[ドノー]";
		mes "貧民街の居酒屋で";
		mes "マキというやつに会って、";
		mes "モリペンの薬に入れる";
		mes "赤い植物の茎の粉を";
		mes "ちょっとくれって言ってこい。";
		mes "俺の名前も言えばわかるはずだ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "自分で行けばいいんじゃ……";
		next;
		mes "[ドノー]";
		mes "はぁ？";
		mes "ふざけんな！";
		mes "面倒だろうが！";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "………………";
		mes "………………";
		mes "………………";
		mes "………………";
		mes "………………";
		mes "………………";
		next;
		mes "[ドノー]";
		mes "歩いて一分ぐらいなんだ！";
		mes "さっさといってこい！";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "トホホ……";
		next;
		set HU_6QUE,4;
	case 4:
		mes "[" +strcharinfo(0)+ "]";
		mes "-貧民街にいるという";
		mes "マキという人に";
		mes "赤い植物の茎の粉を";
		mes "もらいに行こう-";
		close;
	case 5:
		mes "[ドノー]";
		mes "ちゃんと持ってきたな。";
		mes "……妙に多いな。";
		mes "まぁ、少し待ってろ。";
		mes "すぐに終わる。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "-先ほどのコップに";
		mes "取りに行った粉を振り掛けると、";
		mes "水の色が赤色に変わった-";
		next;
		mes "[ドノー]";
		mes "よし、これでいい。";
		mes "薬の完成だ。";
		mes "他に何かあるか？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "モリペンさんとドノーさんは";
		mes "レッケンベルで働いていたんですか？";
		next;
		mes "[ドノー]";
		mes "……マキが話したのか？";
		mes "ったく、あいつの口も問題だな。";
		mes "そうだな、知っているなら";
		mes "隠すこともない。";
		next;
		mes "[ドノー]";
		mes "俺とモリペンはレッケンベルで";
		mes "別々の実験研究を担当していた。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "どうして今はこんな所で……";
		next;
		mes "[ドノー]";
		mes "……ふん！";
		mes "あのロマンチストな";
		mes "モリペンのせいに決まってる！";
		mes "あの時、馬鹿なあいつが";
		mes "俺の仕事を全部奪ったんだ！";
		next;
		mes "[ドノー]";
		mes "今まで研究してきた物を";
		mes "全てふっ飛ばしてくれた。";
		mes "くそ……思い出したら";
		mes "また頭にきたぞ…………";
		next;
		mes "[ドノー]";
		mes "友達じゃなかったら";
		mes "首を絞めているところだ！";
		mes "なのにあいつめ……";
		next;
		mes "[ドノー]";
		mes "ほら、薬を持ってさっさと行け！";
		mes "今度薬が必要になったら";
		mes "自分で取りに来いって言っとけよ。";
		mes "俺は山ほど話したいことがあるんだ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "あ……はい……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "-何だかんだ言って";
		mes "嫌っているわけじゃないみたいだ-";
		set HU_6QUE,6;
		close;
	case 6:
		mes "[ドノー]";
		mes "早く行けよ。";
		mes "あいつが死んでしまうぞ？";
		close;
	default:
		mes "[ドノー]";
		mes "あいつはまだ生きているのか？";
		mes "薬の事を忘れないように言っとけ。";
		mes "これからは薬も取りにちょくちょく";
		mes "来いとも言っておけよ。";
		close;
	}
}

lhz_in03.gat,193,28,3	script	マキ	83,{
	switch(HU_6QUE) {
	case 0:
	case 1:
	case 2:
	case 3:
		mes "[マキ]";
		mes "私はここに新しく来た店員、";
		mes "マキです。";
		mes "よろしくお願いします。";
		close;
	case 4:
		mes "[マキ]";
		mes "ん？";
		mes "どなたですか？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "ドノーさんに頼まれて、";
		mes "赤い植物の茎の粉を";
		mes "取りに来ました。";
		next;
		mes "[マキ]";
		mes "そうですか。";
		mes "赤い植物の茎の粉ということは";
		mes "モリペンさんの薬の材料みたいですね。";
		mes "すぐ用意します。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "-粉を待っている間に";
		mes "テーブルの上を見ると、";
		mes "モリペンさんとドノーさん、";
		mes "そしてマキという人が";
		mes "研究員の服装をした写真があった-";
		next;
		mes "[マキ]";
		mes "あぁ、それは以前";
		mes "レッケンベルで一緒に";
		mes "働いていた時に撮った写真です。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "-レッケンベル……-";
		next;
		mes "[マキ]";
		mes "二人共、ちょっと無愛想で";
		mes "気むずかしいですが、";
		mes "そういう性格なのだと";
		mes "理解してあげてください。";
		next;
		mes "[マキ]";
		mes "……私たちのような人間は";
		mes "お互いに助けあって";
		mes "いかなければならないんです。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……はい？";
		next;
		mes "[マキ]";
		mes "ああ、そうですね。";
		mes "ちゃんと話さないとわかりませんよね。";
		next;
		mes "[マキ]";
		mes "以前、モリペンさんとドノーさんは";
		mes "同じ所で働いていました。";
		mes "ドノーさんは生命工学研究。";
		mes "モリペンさんはその他の";
		mes "実験のチーフでした。";
		next;
		mes "[マキ]";
		mes "私はその時ドノーさんの下で";
		mes "働いていました。";
		next;
		mes "[マキ]";
		mes "そう、今のこの仕事は";
		mes "私の最初の職ではないのです。";
		next;
		mes "[マキ]";
		mes "実は当時、私は入社したばかりで";
		mes "研究所内の事情にはうとくて……";
		mes "ハハ。";
		next;
		mes "[マキ]";
		mes "そんなある日、";
		mes "ドノーさんに関わる者は全員解雇。";
		mes "そしてモリペンさんは行方不明という";
		mes "通達がありました。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "………………";
		next;
		mes "[マキ]";
		mes "いきなり解雇と聞いたとき、私には";
		mes "現実感がほとんどありませんでした。";
		mes "後で聞くと、前日の夜から朝まで";
		mes "研究所で大きな火事が";
		mes "あったそうです。";
		next;
		mes "[マキ]";
		mes "その責任を当時の研究チーフだった";
		mes "ドノーさんと、彼の助手だった";
		mes "私を含めた研究員全員が";
		mes "責任を負わされたのです。";
		next;
		mes "[マキ]";
		mes "そして、今の私とドノーさんは";
		mes "こういう仕事をしているのです。";
		next;
		mes "[マキ]";
		mes "私のこの仕事は";
		mes "ドノーさんの紹介です。";
		mes "昔と今では生活が全然違いますが、";
		mes "特に不満の無い毎日を過ごしています。";
		next;
		mes "[マキ]";
		mes "ですが、ここはレッケンベルと違い、";
		mes "設備が十分ではありません。";
		mes "ですから、先ほど言ったように";
		mes "お互いに助け合わないと";
		mes "生活することはできないのです。";
		next;
		mes "[マキ]";
		mes "そうそう、仕事を始めてすぐ";
		mes "ドノーさんの仕事場に、";
		mes "行方不明だったモリペンさんが、";
		mes "全身に怪我をして訪ねてきました。";
		next;
		mes "[マキ]";
		mes "研究所での火事に巻き込まれたのかと";
		mes "心配してましたが、幸いでした。";
		next;
		mes "[マキ]";
		mes "それで、ドノーさんはモリペンさんの";
		mes "体を治療しているんです。";
		next;
		mes "[マキ]";
		mes "元々、研究所にいた頃からの";
		mes "友達だったみたいですし。";
		next;
		mes "[マキ]";
		mes "モリペンさんは自分の体を";
		mes "いつも治療してくれるドノーさんに";
		mes "すまないとばかり言っています。";
		next;
		mes "[マキ]";
		mes "とにかく、お二人共";
		mes "友情に嘘偽りはなさそうですね。";
		mes "ハハハ。";
		next;
		mes "[マキ]";
		mes "ちょっと話がずれてしまいましたね。";
		mes "……はい、この袋に";
		mes "赤い植物の茎の粉を";
		mes "入れておきました。";
		mes "このまま持って行けばいいですよ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "-マキさんから赤い植物の茎の粉";
		mes "が入った袋を受け取った-";
		mes "それでは、これで。";
		next;
		mes "[マキ]";
		mes "さようなら";
		set HU_6QUE,5;
		close;
	case 5:
		mes "[マキ]";
		mes "先ほど渡した物に間違いはありません。";
		mes "赤い植物の茎の粉ですよね？";
		mes "持って行けば大丈夫なはずです。";
		close;
	default:
		mes "[マキ]";
		mes "モリペンさん夫婦、";
		mes "ドノーさんは元気ですか？";
		close;
	}
}

//============================================================
// 婚約者の行方クエスト
//- Registry -------------------------------------------------
// HU_7QUE -> 0～12
//------------------------------------------------------------
yuno.gat,111,156,3	script	ユスラン	90,{
	switch(HU_7QUE) {
	case 0:
		mes "[ユスラン]";
		mes "ごほ……ごほんごほん……ごほん……";
		mes "ごほん……しくしくしく……";
		if(BaseLevel < 60)
			close;
		next;
		if(select("無視する","泣いている少女に声をかける")==1) {
			mes "[ユスラン]";
			mes "しくしく……しくしく……";
			mes "ごほんごほん……";
			close;
		}
		mes "-泣いているせいか、返事がない-";
		set HU_7QUE,1;
		close;
	case 1:
		mes "[ユスラン]";
		mes "ごほ……ごほんごほん……ごほん……";
		mes "ごほん……しくしくしく……";
		next;
		if(select("無視する","もう一度声をかけてみる")==1) {
			mes "[ユスラン]";
			mes "しくしく……しくしく……";
			mes "ごほんごほん……";
			close;
		}
		mes "[ユスラン]";
		mes "しくしく……しくしく……";
		mes "……ごほ……";
		mes "？";
		next;
		mes "[ユスラン]";
		mes "えっと……";
		mes "私に何か？";
		mes "ごほんごほん……";
		next;
		if(select("あなたの勘違いです","泣いているみたいだから")==1) {
			mes "[ユスラン]";
			mes "あ……ごほん……";
			next;
			mes "[ユスラン]";
			mes "すいません……ごほ……";
			mes "気のせいだったみたいですね。";
			close;
		}
		mes "[ユスラン]";
		mes "あ……ごほん……";
		next;
		mes "[ユスラン]";
		mes "見ず知らずの人にまで";
		mes "余計な心配を";
		mes "おかけしてしまいましたか。";
		mes "ごほんごほん……";
		next;
		mes "[ユスラン]";
		mes "私はユスランといいます。";
		mes "婚約者が行方不明になって……";
		mes "とても心配で探しに行きたいのですが、";
		mes "見ての通り体調が悪くて……";
		mes "ごほんごほん……";
		next;
		mes "[ユスラン]";
		mes "医者の話によると";
		mes "治す事ができない病気みたいです。";
		mes "それに、彼に会いたいと思うと";
		mes "勝手に涙が……";
		mes "ごほんごほん……";
		next;
		mes "[ユスラン]";
		mes "ティオリ……";
		mes "いつ帰ってきてくれるんですか……";
		mes "しくしくしく……";
		next;
		mes "-会話の途中で";
		mes "婚約者の事を思い出したせいか、";
		mes "彼女はまた泣き始めた-";
		next;
		mes "-彼女のために";
		mes "何かしてあげれないか？-";
		next;
		if(select("こんな時は一人にしておいたほうがいい","婚約者の行方を調べる")==2)
			break;
		mes "[ユスラン]";
		mes "ティオリ……しくしく……";
		set HU_7QUE,2;
		close;
	case 2:
		mes "[ユスラン]";
		mes "ティオリ……しくしく……";
		next;
		mes "-泣き続けている彼女に";
		mes "何かしてあげれないか？-";
		next;
		if(select("こんな時は一人にしておいたほうがいい","婚約者の行方を調べる")==2)
			break;
		mes "[ユスラン]";
		mes "ティオリ……しくしく……";
		close;
	case 3:
	case 4:
		mes "-彼女は相変わらず";
		mes "ティオリを待っているようだ-";
		mes "-だが、以前のように";
		mes "悲しみに沈んではいないように見える-";
		next;
		mes "-シュバルツバルド国内線の飛行船で";
		mes "ティオリの行方を調べてくださいと";
		mes "彼女に頼まれた-";
		close;
	case 5:
		mes "[ユスラン]";
		mes "あ…………";
		next;
		mes "[ユスラン]";
		mes "ティオリは今……ごほんごほん";
		mes "…………";
		mes "……";
		next;
		mes "[ユスラン]";
		mes "どこにいるかわかりましたか？";
		next;
		menu "ティオリはフィゲルに行ったと教える",-;
		mes "-飛行船で聞いた話を";
		mes "ユスランに教えると、";
		mes "彼女は一瞬驚いた顔をしたが";
		mes "どこか安心したように見える-";
		next;
		mes "[ユスラン]";
		mes "ケージ姉さまと";
		mes "飛行船であったのですね。";
		mes "姉さまと会ってみたいけど";
		mes "体がこれじゃ…………ごほ……";
		next;
		mes "[ユスラン]";
		mes "ティオリがフィゲルに";
		mes "行ったのは予想外でした。";
		mes "あぁいう場所は";
		mes "苦手な人だったから……";
		mes "ごほんごほん…………";
		next;
		mes "[ユスラン]";
		mes "あの……もう一つだけ";
		mes "お願いを聞いてもらえませんか？";
		mes "フィゲルでティオリを探して";
		mes "私の事を話してください。";
		mes "ティオリも私の容体は";
		mes "気にしていると思うんです。";
		next;
		mes "[ユスラン]";
		mes "フィゲルには私の兄さまが";
		mes "住んでいます……ごほん……";
		mes "兄さまならもしかすると";
		mes "ティオリと会っているかもしれません。";
		next;
		mes "[ユスラン]";
		mes "兄さまはフィゲルでビンゴゲームの";
		mes "司会者を担当しています。";
		mes "兄さまの名前は「ユクラン」です。";
		mes "どうかお願いします。";
		next;
		mes "-私が承諾すると";
		mes "彼女は安心したように微笑んだ-";
		set HU_7QUE,6;
		close;
	case 6:
		mes "[ユスラン]";
		mes "フィゲルにいる兄さま。";
		mes "ユクランを訪ねてみてください。";
		mes "そして、兄さまにティオリを知らないか";
		mes "聞いてみてください。";
		mes "お願いします。";
		mes "ごほんごほん……";
		close;
	default:
		mes "-彼女は相変わらずここで";
		mes "ティオリを待っている-";
		mes "-いや、正確にいうと";
		mes "私からの報告だろう-";
		close;
	case 11:
		mes "[ユスラン]";
		mes "……あ!!";
		mes "ごほんごほん……";
		next;
		mes "[ユスラン]";
		mes "ティオリに会えましたか!?";
		next;
		mes "-私を見るやいなや";
		mes "上気した顔でティオリの事を聞く彼女に";
		mes "私は今までの事を説明した-";
		next;
		mes "[ユスラン]";
		mes "…………";
		next;
		mes "[ユスラン]";
		mes "ああ……ばかみたいな人……";
		mes "私みたいなつまらない女のために……";
		mes "……ごほん……";
		mes "そんな苦労を……しくしく……";
		next;
		mes "-自分のために苦労している";
		mes "ティオリを思い、彼女は泣き崩れた-";
		mes "-ようやく彼女が泣き止んだ時、";
		mes "ティオリから受け取った薬を";
		mes "彼女に渡した-";
		next;
		mes "[ユスラン]";
		mes "なんて言えばいいか……";
		mes "本当に、本当にありがとうございます。";
		mes "……ごほん……";
		next;
		mes "[ユスラン]";
		mes "私は……ずっとここで彼を";
		mes "……ごほん……待っています。";
		mes "……もう泣く事はありません。";
		next;
		mes "[ユスラン]";
		mes "彼を笑顔で迎え入れたいから。";
		next;
		mes "[ユスラン]";
		mes strcharinfo(0)+ "さん、";
		mes "今までの事は";
		mes "絶対に忘れません。";
		mes "どうかお元気で……";
		next;
		mes "[ユスラン]";
		mes "……本当にありがとうございました。";
		close2;
		misceffect 253,"";
		set HU_7QUE,12;
		if(checkre())
			getexp 90000,60000;
		else
			getexp 900000,600000;
		end;
	case 12:
		mes "-彼女の容体は";
		mes "良くなっているように見える-";
		mes "-以前のようにティオリの事を";
		mes "待ち続けているが、彼女の顔には";
		mes "悲しみの代わりに希望が";
		mes "宿っているように見える-";
		close;
	}
	//2,3の続き
	mes "-行方を調べてくると言うと、";
	mes "彼女は泣き止み、少しだけ";
	mes "明るくなった顔で私を見た-";
	next;
	mes "[ユスラン]";
	mes "ぇ…………えッ!?";
	mes "本当にティオリが今どこにいるか";
	mes "調べることができるんですか？";
	mes "あぁ……本当にありがとうございます。";
	mes "……ぐすッ。";
	next;
	mes "[ユスラン]";
	mes "ティオリは私の病気を治す方法を";
	mes "探すと言って出ていきました。";
	mes "……ごほんごほん……";
	mes "その後は飛行船に乗って";
	mes "どこかに行ったそうです。";
	next;
	mes "[ユスラン]";
	mes "飛行船で働いている人に";
	mes "聞いてみれば、ティオリがどこへ……";
	mes "……ごほ…………";
	mes "どこへ行ったのか";
	mes "教えてもらえるかもしれません。";
	mes "ごほんごほん……";
	next;
	mes "[ユスラン]";
	mes "ティオリがどこへ行ったのかわかったら";
	mes "どうか私に教えてください。";
	mes "お願いします。";
	mes "ごほんごほん……";
	next;
	mes "-悲しみのせいか、";
	mes "随分痩せているように見えるが、";
	mes "希望という一筋の光が";
	mes "彼女の顔にほほ笑みを宿している-";
	set HU_7QUE,3;
	close;
}

que_bingo.gat,49,12,0	script	ビンゴゲーム会場	139,4,4,{
	if(HU_7QUE != 6)
		end;
	mes "[ゲーム会場オーナー]";
	mes "ビンゴゲーム会場にようこそ。";
	mes "さっそくゲームをしますか？";
	next;
	menu "ここの司会者に会えるか聞く",-;
	mes "[ゲーム会場オーナー]";
	mes "ハハ！";
	mes "我らが誇る司会者に簡単に会えたら";
	mes "ゲームの楽しみが減っちゃいますよ？";
	mes "もしゲームをするのなら、";
	mes "途中で会えるかも！";
	next;
	mes "[ゲーム会場オーナー]";
	mes "さぁさぁ、どうしますか？";
	mes "どうしても会いたいなら";
	mes "是非ともゲームに参加してください！";
	close;
}

que_bingo.gat,53,190,7	script	ユクラン	778,{
	if(HU_7QUE != 6)
		end;
	mes "[ユクラン]";
	mes "おや……ゲームに参加した方ですね。";
	mes "私に会いにきたのですか？";
	next;
	menu "事情を説明する",-;
	mes "-妹さんがティオリを探している事、";
	mes "二人に何が起きたかを説明すると、";
	mes "ユクランは涙を流しながら";
	mes "自分を責め出した-";
	next;
	mes "[ユクラン]";
	mes "ユスランが……そんな病気が……";
	mes "そんなことも知らずに私は……";
	mes "……うぅ……ぅ……";
	next;
	mes "-しばらく泣き続けたユクランは";
	mes "落ち着いたのか、涙をぬぐって";
	mes "ティオリについて話し始めた-";
	next;
	mes "[ユクラン]";
	mes "……実は一ヶ月程前に私は";
	mes "ティオリに会っています。";
	mes "だが、妹の病気について";
	mes "一言も聞いていません。";
	mes "どこか悲しそうだったあいつの目は";
	mes "このせいだったんですね……";
	next;
	mes "[ユクラン]";
	mes "何の目的かは聞きませんでしたが、";
	mes "オーディン神殿に";
	mes "行くと言っていました。";
	mes "それ以来会ってはいません。";
	mes "一体、オーディン神殿に何が……";
	next;
	mes "[ユクラン]";
	mes "あいつに会ったら伝えてください。";
	mes "今のユスランに一番効く薬は";
	mes "まさにお前だと……";
	close2;
	set HU_7QUE,7;
	warp "que_bingo.gat",37,24;
	end;
}

odin_tem01.gat,129,127,0	script	話し声	139,3,3,{
	if(HU_7QUE >= 8 || HU_7QUE <= 10) {
		hideoffnpc "青年#hu";
		initnpctimer;
		end;
	}
	if(HU_7QUE != 7)
		end;
	mes "-どこからか話し声が聞こえる-";
	next;
	mes "[怪しい男]";
	mes "おい、研究はどうなっている？";
	mes "全然成果が上がってないじゃないか！";
	next;
	mes "[青年]";
	mes "……今度のは以前と違って";
	mes "少し時間がかかります。";
	mes "研究というのは投資した時間と";
	mes "同じぐらいの成果が出るものです。";
	mes "わかったらもう少し待ってください。";
	next;
	mes "[怪しい男]";
	mes "なに……待てだと？";
	mes "そうだなぁ、俺たちは待てるな。";
	mes "しかし、病気で苦しんでいる";
	mes "お前の彼女に待つ時間があるのか？";
	next;
	mes "[青年]";
	mes "……………………";
	next;
	mes "[怪しい男]";
	mes "お前だってさっさと終わらせたいだろ？";
	mes "お互い笑いながら家に帰りたいだろ？";
	mes "俺の言っている意味がわかるよな？";
	next;
	mes "[青年]";
	mes "…………わかりました。";
	mes "だからもうちょっと、";
	mes "もうちょっとだけ待ってください。";
	next;
	mes "-怪しそうな男がどこかに消えて、";
	mes "青年一人だけが残った-";
	close2;
	hideoffnpc "青年#hu";
	initnpctimer;
	end;
OnTimer180000:
	stopnpctimer;
OnInit:
	hideonnpc "青年#hu";
	end;
}

odin_tem01.gat,130,134,4	script	青年#hu	774,{
	switch(HU_7QUE) {
	default:
		mes "[研究員]";
		mes "ふぅ……もう少しで……";
		mes "……ユスラン…………";
		close;
	case 7:
		mes "[青年]";
		mes "ふぅ……";
		next;
		mes "[青年]";
		mes "おや……？";
		mes "こんな所まで何をしに";
		mes "来たのか知りませんが、";
		mes "早く帰ったほうがいいですよ。";
		next;
		menu "ティオリ本人かどうか聞く",-;
		mes "[ティオリ]";
		mes "………………!?";
		mes "どうして私の名前を";
		mes "知っているんですか？";
		mes "有名になるような仕事を";
		mes "した覚えはありませんが……";
		next;
		menu "今までの経緯を説明する",-;
		mes "-ユスランがティオリの事を";
		mes "気にしていると話すと、";
		mes "ティオリは軽く苦笑した-";
		mes "-まるで自分を責めているような";
		mes "自虐的な微笑みだ-";
		next;
		mes "[ティオリ]";
		mes "……多くの人にご迷惑をかけましたね。";
		mes "ユスランに伝えてもらえますか？";
		mes "すぐに帰ると……";
		mes "私を信じて待っていてくれと……";
		next;
		menu "ここで何をしているのか聞く",-;
		mes "[ティオリ]";
		mes "……申し訳ありません。";
		mes "それは話す事ができません。";
		mes "このまま彼女の元へ戻って、";
		mes "君の病気を治すために";
		mes "がんばっているとだけ伝えてください。";
		next;
		mes "-先ほど怪しい男としていた話が";
		mes "気になったが、深く問い詰めるのは";
		mes "やめておいた-";
		set HU_7QUE,8;
		close;
	case 8:
		mes "[ティオリ]";
		mes "彼女に……私を信じて";
		mes "待っていてくれと";
		mes "伝えてください。";
		close;
	case 9:
		mes "[ティオリ]";
		mes "また来たのですか。";
		mes "私に何か用が残っているのですか？";
		next;
		menu "怪しい男たちの事を教える",-;
		mes "[ティオリ]";
		mes "!?!?!?!!";
		next;
		mes "[ティオリ]";
		mes "……やはりやつらにとって";
		mes "私はただの消耗品でしたか……";
		mes "でも……私は今";
		mes "ここを離れることはできません。";
		next;
		menu "もう一度ここで何をしているのか聞く",-;
		mes "[ティオリ]";
		mes "こうなった以上、";
		mes "隠す必要はありませんね。";
		mes "さて、どこから説明したものか……";
		next;
		mes "[ティオリ]";
		mes "ユスランと一緒に";
		mes "幸せな毎日を過ごしていると、";
		mes "ある日ユスランが非常に珍しい";
		mes "病気にかかってしまいました。";
		next;
		mes "[ティオリ]";
		mes "その時はまるで";
		mes "世界が崩れ落ちたような";
		mes "錯覚に陥りました。";
		next;
		mes "[ティオリ]";
		mes "世界中を旅している";
		mes "マウォング先生がユスランを見ると、";
		mes "この病気は以前見たことがある";
		mes "と話してくれました。";
		next;
		mes "[ティオリ]";
		mes "マウォング先生の話では、";
		mes "この病気の治療薬は";
		mes "フィゲルの近くにあるオーディン神殿に";
		mes "あるとのことでした。";
		mes "その時の私に迷いはありませんでした。";
		next;
		mes "[ティオリ]";
		mes "ちょうど飛行船にフィゲル路線が";
		mes "追加されるという話を聞いていました。";
		mes "ユスランに心配をせず、";
		mes "ただ待っていてくれとだけ言って";
		mes "フィゲルに向かう飛行船に飛び込んで";
		mes "ここまで来ました。";
		next;
		mes "[ティオリ]";
		mes "しかし、いざここへ来ても";
		mes "私には何もできませんでした。";
		mes "何をすればいいのかわからなかった";
		mes "というべきでしょう。";
		next;
		mes "[ティオリ]";
		mes "そんな中で出会ったんです。";
		mes "あの怪しい男たちと。";
		next;
		mes "[ティオリ]";
		mes "初めは私も奴らが何者か";
		mes "わかっていませんでした。";
		mes "でも、色々と世話を焼いてくれるので";
		mes "ついついフィゲルに来た理由を";
		mes "話してしまいました。";
		next;
		mes "[ティオリ]";
		mes "何も期待せず、";
		mes "ポロっと話した事なのに、";
		mes "奴らの反応は意外なものでした。";
		next;
		mes "[ティオリ]";
		mes "私たちの研究内容に";
		mes "その病の治療薬を作ることもある。";
		mes "私たちの研究を手伝わないか？";
		mes "そう言ったんです。";
		next;
		mes "[ティオリ]";
		mes "私は喜んで参加すると言いました。";
		mes "そんな私に対して奴らは";
		mes "薬を作るために必要な研究と言って";
		mes "オーディン神殿に関わる";
		mes "あらゆる研究をしてくれと言いました。";
		next;
		mes "[ティオリ]";
		mes "私は何も疑わずに奴らの";
		mes "言うとおりに研究を始めました。";
		mes "治療薬を作ることを夢見て。";
		next;
		mes "[ティオリ]";
		mes "そんなある日、私は偶然";
		mes "奴らの話を聞いてしまいました。";
		mes "奴らの目的、そして正体を……";
		next;
		mes "[ティオリ]";
		mes "奴らはレッケンベルの秘密組織でした。";
		mes "そして……奴らが私を利用した研究は、";
		mes "オーディン神殿にある";
		mes "ギガンテスの遺跡を使って";
		mes "不完全なガーディアンを補う事。";
		next;
		mes "[ティオリ]";
		mes "そう、治療薬とは全然関係ない";
		mes "研究だったんです！";
		next;
		mes "[ティオリ]";
		mes "やつらに利用され、";
		mes "無駄な時間を過ごしていたことに";
		mes "怒りを感じましたが、";
		mes "すぐに研究をやめれるような";
		mes "相手ではありませんでした。";
		next;
		mes "[ティオリ]";
		mes "私はやけになっていました……";
		mes "どうしようもない怒りを";
		mes "奴らの書類にぶつけていたら、";
		mes "偶然、ある本を見つけました。";
		next;
		mes "[ティオリ]";
		mes "そこに書かれていたのは";
		mes "私が望んでいた治療薬の製法でした！";
		mes "そして、製造に必要な材料は";
		mes "このオーディン神殿にあるのです！";
		next;
		mes "[ティオリ]";
		mes "しかし、問題はその材料でした。";
		mes "オーディン神殿には強いモンスターが";
		mes "そこら中を歩き回っていて、";
		mes "私一人では材料を集める事が";
		mes "できませんでした。";
		next;
		mes "[ティオリ]";
		mes "しかし、レッケンベルの奴らは";
		mes "ガーディアンを使って";
		mes "材料を入手しているので";
		mes "安全に研究を進めることができます。";
		next;
		mes "[ティオリ]";
		mes "そこで私は思いました。";
		mes "奴らの前で研究をする振りをしながら";
		mes "治療薬の材料を集めようと……";
		mes "しかし、気づかれないように集めるには";
		mes "どうしても時間がかかります。";
		next;
		mes "[ティオリ]";
		mes "時間がかかってでも材料を集め、";
		mes "隙を見て奴らから";
		mes "逃げ出すつもりでしたが、";
		mes "やつらが私を狙う以上";
		mes "もう時間がありません。";
		mes "お願いです。力を貸してください！";
		next;
		mes "[ティオリ]";
		mes "私の命はどうなってもいい。";
		mes "でも、ユスランだけは……";
		mes "ユスランのために、絶対に治療薬は";
		mes "完成させなければならないんです！";
		next;
		mes "[ティオリ]";
		mes "治療薬の完成まで、まだ少し材料が";
		mes "足りません。";
		mes "その材料は^FF0000闇のルーン^000000です。";
		mes "私は45個持っているので、後5個あれば";
		mes "治療薬は完成します。";
		next;
		mes "[ティオリ]";
		mes "お願いです。";
		mes "なんとか手に入れてきてください。";
		mes "私は奴らに見つからないよう";
		mes "ここに隠れていますので、";
		mes "材料が集まったらまた来てください。";
		set HU_7QUE,10;
		close;
	case 10:
		if(countitem(7511) < 5) {
			mes "[ティオリ]";
			mes "まだ材料が足りないようです。";
			mes "^FF0000闇のルーン5個^000000が必要です。";
			mes "材料が集まったらまた来てください。";
			close;
		}
		mes "[ティオリ]";
		mes "これは……材料が集まりました。";
		mes "本当にありがとうございます。";
		next;
		mes "[ティオリ]";
		mes "………………";
		mes "…………";
		mes "……";
		next;
		mes "-薬を作ることができる";
		mes "喜びのせいなのか、";
		mes "彼はどこか遠い所を見て";
		mes "考え込んでいるようだ-";
		next;
		mes "[ティオリ]";
		mes "あ、すみません。";
		mes "薬が完成することを考えると";
		mes "つい感情が先走って……";
		next;
		mes "[ティオリ]";
		mes "少し待っていてください。";
		mes "すぐに薬を調合します。";
		next;
		mes "-彼は胸の中にある本を取り出し、";
		mes "自分が持っていた闇のルーンと";
		mes "私が持って来た闇のルーンで";
		mes "薬を調合し始めた-";
		next;
		mes "[ティオリ]";
		mes "これで……やっと……";
		mes "ユスランを……";
		next;
		mes "[ティオリ]";
		mes "……よし。";
		mes "薬が完成しました。";
		mes "この薬をユスランに";
		mes "届けてもらえませんか？";
		next;
		mes "[ティオリ]";
		mes "私もすぐにユスランに会いたいけど、";
		mes "奴らが私を追って来たら";
		mes "私だけでなく……";
		mes "ユスランまで危険に";
		mes "さらされてしまいます。";
		next;
		mes "[ティオリ]";
		mes "いつか必ずユスランに会いに行きます。";
		mes "だから今は" +strcharinfo(0)+ "さんが";
		mes "私の代わりに薬を届けてください……";
		mes "お願いします……";
		next;
		mes "-婚約者の身の安全を考え、";
		mes "自分は帰らないと言っているが、";
		mes "ユスランに会えない悲しみは";
		mes "彼の言葉が曇っていく所から";
		mes "十分に伝わった-";
		mes "-私はティオリから薬を受け取った-";
		set HU_7QUE,11;
		close;
	case 11:
		mes "[ティオリ]";
		mes "ユスランに必ず薬を";
		mes "渡してください。";
		mes "すぐには戻れませんが……";
		mes "いつか必ず……";
		mes "必ず帰ると伝えてください。";
		close;
	}
}

odin_tem01.gat,111,144,0	script	怪しい男	139,2,2,{
	if(HU_7QUE != 8)
		end;
	mes "-ん!?-";
	mes "さっきティオリと話していた";
	mes "怪しい男がさらに怪しい男と";
	mes "話している-";
	mes "-……怪しすぎる-";
	mes "-こっそり盗み聞きしてみよう-";
	next;
	mes "[怪しい男]";
	mes "ち！　ティオリのやつめ……";
	mes "何か気づいたのか";
	mes "研究が全然進まない。";
	mes "あいつはもうダメだ。";
	mes "ここらで処分した方がいいだろう。";
	next;
	mes "[怪しい男]";
	mes "あいつが今やっている";
	mes "研究が終わったら、";
	mes "すぐに処分しろ。いいな？";
	next;
	mes "[もっと怪しい男]";
	mes "あぁ、わかった。";
	mes "証拠が残らないように";
	mes "処分しておこう。";
	next;
	mes "-……なんてことだ-";
	mes "-何の研究をしているのか";
	mes "わからないが、間違いなく";
	mes "ティオリの身が危ない-";
	mes "-早くティオリに";
	mes "今の話を伝えよう-";
	set HU_7QUE,9;
	close;
}

//============================================================
// オーディン神殿発掘団クエスト
//- Registry -------------------------------------------------
// HU_8QUE -> 0～21
//------------------------------------------------------------
hugel.gat,91,152,3	script	看板	837,{
	if(HU_8QUE > 20) {
		mes "　　**　募集中　**";
		mes "　　今日もさわやか";
		mes "　　　魔術同好会!";
		mes " ";
		mes "　フィゲル魔術同好会";
		close;
	}
	mes "　　　　**　募集中　**";
	mes "オーディン神殿をボランティアで";
	mes "　　　探検できる冒険者を";
	mes "　　　大勢募集しています";
	mes "　　　　　神殿発掘団";
	if(HU_8QUE == 0)
		set HU_8QUE,1;
	close;
}

hu_in01.gat,19,161,0	script	アレックス	803,{
	switch(HU_8QUE) {
	case 0:
		cutin "hu_alex02",2;
		mes "[アレックス]";
		mes "セールスですか？";
		mes "何も買いません。";
		mes "早く出ていってください。";
		break;
	case 1:
		cutin "hu_alex01",2;
		mes "[アレックス]";
		mes "何の用ですか？";
		next;
		if(select("え……あの……","公告を見て来ました")==1) {
			mes "[アレックス]";
			mes "何の用もないなら";
			mes "早く出ていってください。";
			break;
		}
		mes "[アレックス]";
		mes "村の入口においた看板の事？";
		mes "ふーん…………";
		mes "……そうねぇ…………";
		next;
		if(BaseLevel < 60) {
			cutin "hu_alex02",2;
			mes "[アレックス]";
			mes "……こんな細い手首で";
			mes "一体何をするつもりなの？";
			mes "これだから貧乏人は……";
			mes "もうちょっと体を鍛えるなり";
			mes "何かしら努力してみたらどう？";
			break;
		}
		mes "[アレックス]";
		mes "いいわ。";
		mes "ちょうど力仕事があるのよ。";
		mes "でも、その前に";
		mes "話しておくことがあるわ。";
		next;
		cutin "hu_alex03",2;
		mes "[アレックス]";
		mes "まずは自己紹介から。";
		mes "私はオーディン神殿発掘団";
		mes "シュバルツバルドの代表者、";
		mes "アレックス・ヘルムトよ。";
		mes "あの子は私の弟、ジュリアン。";
		next;
		mes "[アレックス]";
		mes "元々遺跡の発掘と言えば";
		mes "何か出たその周辺の土地を、";
		mes "過去の歴史を参考にして";
		mes "慎重に掘り起こしていくと";
		mes "決まっているのはご存知？";
		next;
		mes "[アレックス]";
		mes "でも、今の私たちの目的は";
		mes "純粋な発掘ではなく、";
		mes "オーディン神殿にあるかも知れない";
		mes "何か価値のある物を発見すること。";
		mes "つまり神殿の保持には";
		mes "まったく関心がないのよ。";
		next;
		mes "[アレックス]";
		mes "発掘といえば調査隊や";
		mes "考古学者が行くのが普通でしょ？";
		mes "でも、あそこでそんな悠長な事";
		mes "してられないの。";
		mes "それほど危険な場所なのよ。";
		next;
		mes "[アレックス]";
		mes "仕事を引き受けたいなら";
		mes "一度神殿を見てきなさい。";
		mes "今の話が簡単に理解できるはずよ。";
		mes "その後でまた話を続けましょう。";
		set HU_8QUE,2;
		break;
	case 2:
		cutin "hu_alex03",2;
		mes "[アレックス]";
		mes "なにしてるの？";
		mes "早く行きなさい。";
		mes "その方が口で説明するより";
		mes "ちゃんと理解できるのよ。";
		break;
	case 3:
		cutin "hu_alex01",2;
		mes "[アレックス]";
		mes "見てきたみたいね。";
		mes "どう？";
		mes "まだ手伝う気はあるの？";
		next;
		switch(select("ところで、別の部屋の……","その……","もちろんです")) {
		case 1:
			cutin "hu_alex02",2;
			mes "[アレックス]";
			mes "あの白髪女ね……";
			mes "…………";
			mes "私たちの仲間よ。";
			mes "必要ない人員を補充するため、";
			mes "ルーンミッドガッツ王国に";
			mes "派遣してもらったのよ。";
			next;
			mes "[アレックス]";
			mes "私たちだけで十分人員は足りていると";
			mes "上層部に話したけど……";
			mes "国際関係の問題とやらで";
			mes "仕方なく受け入れたのよ。";
			next;
			cutin "hu_alex04",2;
			mes "[アレックス]";
			mes "名目上では自分たちの宗教的";
			mes "遺産だとか言ってるけど……";
			mes "一体何の遺産かわかってないくせに。";
			mes "まったく、教養の無い女は";
			mes "これだから…………";
			next;
			cutin "hu_alex02",2;
			mes "[アレックス]";
			mes "……あら。";
			mes "私ったらついつい……";
			mes "ほほほほほほ……";
			next;
			mes "[アレックス]";
			mes "……また後で来てくれない？";
			mes "今は仕事の話をする気にならないわ。";
			break;
		case 2:
			mes "[アレックス]";
			mes "仕事の内容は大変よ。";
			mes "よく考えてみることね。";
			break;
		case 3:
			mes "[アレックス]";
			mes "そう……それじゃ話を続けるわ。";
			mes "私たちは発掘した物を";
			mes "歴史的事実の証明という目的で";
			mes "使用するわけではないわ。";
			next;
			mes "[アレックス]";
			mes "品質は問わないってことよ。";
			mes "そして、報酬として……";
			mes "ま、ちゃんと誠意は見せるわ。";
			mes "とりあえず、まずは";
			mes "^3355FF闇のルーン^000000を5個";
			mes "集めてきてちょうだい。";
			next;
			mes "[アレックス]";
			mes "あなたの能力に";
			mes "期待しているわよ。";
			set HU_8QUE,4;
			break;
		}
		break;
	case 4:
		cutin "hu_alex02",2;
		mes "[アレックス]";
		mes "何をしてるの？";
		mes "はやく行きなさい。";
		next;
		if(select("何を手に入れてくるんでしたっけ？","行ってきます")==1) {
			cutin "hu_alex03",2;
			mes "[アレックス]";
			mes "記憶力が無いの？";
			mes "^3355FF闇のルーン^0000005個よ。";
			mes "頼んだわよ。";
			break;
		}
		mes "[アレックス]";
		mes "できるだけ早くね。";
		mes "……まったく。";
		mes "あの女さえいなければ";
		mes "こんな仕事なんて";
		mes "すぐ終わるのに……";
		break;
	case 5:
		cutin "hu_alex01",2;
		mes "[アレックス]";
		mes "^3355FF闇のルーン^000000を5個、";
		mes "全部手に入れてきたの？";
		next;
		if(select("まだ……","ここにあります")==1) {
			cutin "hu_alex02",2;
			mes "[アレックス]";
			mes "早くしてもらわないと困るわ。";
			mes "まずそれがないと他の仕事を";
			mes "進められないんですから。";
			next;
			emotion 2,"ジュリアン#hu1";
			mes "[ジュリアン]";
			mes "姉ちゃんの考え方が甘いんだよ。";
			next;
			cutin "hu_alex03",2;
			emotion 6;
			mes "[アレックス]";
			mes "何の話よ。";
			next;
			cutin "hu_alex02",2;
			mes "[ジュリアン]";
			mes "お金をもらえないんじゃ";
			mes "やる気なんてでないよ。";
			mes "そういえば昨日も沢山";
			mes "冒険者があっちの方に行ってたなぁ。";
			next;
			cutin "hu_alex04",2;
			mes "[アレックス]";
			mes "……………あの白髪女……";
			mes "……ふん、それこそ";
			mes "教養が無い証拠よ！";
			next;
			cutin "hu_alex01",2;
			mes "[アレックス]";
			mes "…………ぁ。";
			mes "何でもないのよ。ほほほ。";
			mes "早く闇のルーンを";
			mes "持って来てね……";
			mes "ほほほほほほ……";
			break;
		}
		if(countitem(7511) < 5) {
			cutin "hu_alex02",2;
			mes "[アレックス]";
			mes "あら？";
			mes "私には5個もあるようには";
			mes "見えないわよ。";
			break;
		}
		mes "[アレックス]";
		mes "ありがとう。";
		mes "これで少しは研究を";
		mes "しやすくなるわ。";
		mes "これは気持ちよ。";
		mes "よかったら受け取って。";
		set HU_8QUE,6;
		delitem 7511,5;
		getitem 603,1;
		next;
		mes "[ジュリアン]";
		mes "まっ、研究なんて";
		mes "遊びながらだけどね。";
		next;
		cutin "hu_alex03",2;
		mes "[アレックス]";
		mes "何ですって!?";
		next;
		mes "[ジュリアン]";
		mes "なんだよ、どうせ";
		mes "このがらくたの手入れも";
		mes "ボクがしなきゃいけないんだろ？";
		mes "それに位置の調査も……";
		next;
		cutin "hu_alex04",2;
		mes "[アレックス]";
		mes "ジュリアン！";
		next;
		mes "[ジュリアン]";
		mes "あぁ、お客さんがいたんだっけ。";
		mes "アハハ。";
		next;
		cutin "hu_alex02",2;
		mes "[アレックス]";
		mes "……ごめんなさいね。";
		mes "今は帰って。";
		mes "本当に感謝してるわ。";
		break;
	case 6:
		cutin "hu_alex02",2;
		mes "[アレックス]";
		mes "…………";
		mes "一体どこにあるの……";
		next;
		mes "[アレックス]";
		mes "……それに、あの白髪女は";
		mes "何か気づいてるの？";
		mes "……";
		next;
		cutin "hu_alex01",2;
		emotion 23;
		mes "[アレックス]";
		mes "あら？";
		mes "そんな所にいらしたの？";
		mes "な、何でもないです。";
		mes "そう、何でもないのよ！";
		mes "ほほほほほほほ。";
		break;
	case 7:
	case 8:
	case 9:
	case 10:
	case 11:
		cutin "hu_alex03",2;
		mes "[アレックス]";
		mes "……ええ!?";
		mes "白髪女のバイトを受けた？";
		mes "それも無報酬？";
		next;
		mes "[アレックス]";
		mes "あの女は本当に";
		mes "人をこき使うことだけは";
		mes "好きなんだから……";
		mes "私ならそんなことは……";
		mes "ぁ、ごめんなさいね。";
		next;
		cutin "hu_alex01",2;
		mes "[アレックス]";
		mes "私はオーディン神殿発掘団の";
		mes "責任者、アレックス・ヘルムト。";
		mes "あの子は私の弟、ジュリアン。";
		next;
		cutin "hu_alex02",2;
		mes "[アレックス]";
		mes "あんな教養が無い女と一緒に";
		mes "仕事なんてできなくて……";
		mes "おかげで全然仕事が進まないのよ。";
		mes "責任者としてどうかと思ってるわ……";
		next;
		mes "[アレックス]";
		mes "……フゥ……";
		break;
	default:
		cutin "hu_alex02",2;
		mes "[アレックス]";
		mes "？";
		next;
		mes "[アレックス]";
		mes "私は忙しいのよ。";
		mes "邪魔しないでください。";
		break;
	}
	close2;
	cutin "hu_alex02",255;
	end;
}

hu_in01.gat,14,11,4	script	ラウラ	70,{
	switch(HU_8QUE) {
	case 0:
		cutin "hu_laura02",2;
		mes "[ラウラ]";
		mes "何か用なの？";
		mes "まったく、忙しいのに……";
		mes "アッシュ、この人追い出して！";
		close2;
		cutin "hu_laura02",255;
		warp "hu_in01.gat",15,76;
		end;
	case 1:
		cutin "hu_laura04",2;
		mes "[ラウラ]";
		mes "なに？";
		mes "募集公告を見たって？";
		mes "ふーん…………";
		next;
		if(BaseLevel < 60) {
			cutin "hu_laura01",2;
			mes "[ラウラ]";
			mes "……全然ダメね。";
			mes "とても力仕事ができるとは思えない。";
			mes "そんな体で何するってのよ。";
			mes "ほら、帰って帰って。";
			break;
		}
		mes "[ラウラ]";
		mes "一応、自己紹介をするわ。";
		mes "オーディン神殿発掘団";
		mes "ルーンミッドガッツ代表";
		mes "ラウラ・ローレンス。";
		mes "あっちはアッシュ・ミルトン。";
		next;
		emotion 18,"アッシュ#hu1";
		mes "[アッシュ]";
		mes "こんにちは。";
		next;
		mes "[ラウラ]";
		mes "公告を見たなら";
		mes "わかっていると思うけど、";
		mes "私たちの目的は神殿の";
		mes "遺物を入手すること。";
		next;
		mes "[ラウラ]";
		mes "ところが、私たちが行くには";
		mes "あそこは危険すぎるのよ。";
		next;
		cutin "hu_laura01",2;
		mes "[ラウラ]";
		mes "見ての通り、片手に遺物、";
		mes "片手にペンを握ることしかできない";
		mes "か弱い発掘家が行くには";
		mes "無理があると思わない？";
		next;
		mes "[ラウラ]";
		mes "それに、このプロジェクトは";
		mes "国家的な次元で遂行されるものなの。";
		mes "だから私たちが払える報酬は";
		mes "ほとんどないのと同じ。";
		mes "……いえ、無いといってもいいわ。";
		next;
		cutin "hu_laura04",2;
		mes "[ラウラ]";
		mes "……でも考えて見て。";
		mes "ここは神さまが降りた所なの。";
		mes "いわばあなたは";
		mes "神さまが選んだ使者なのよ！";
		next;
		if(select("……ラウラさんが選ぶんじゃ？","なるほど！　そうだったんですか")==1) {
			cutin "hu_laura01",2;
			mes "[ラウラ]";
			mes "何を言ってるの？";
			mes "今の私たちの使命は";
			mes "神々を奉じた時代の文明を";
			mes "解き明かす事！";
			next;
			mes "[ラウラ]";
			mes "ところが！";
			mes "その探索を引き受けた私たちが";
			mes "行くことができないと嘆くその時！";
			mes "あなたが救世主のように舞い降りて";
			mes "私たちを助けてくれると言うのよ？";
			next;
			mes "[ラウラ]";
			mes "それなのにあなたは神の意思";
			mes "ではないと言うの？";
			mes "そんなことないわ！";
			next;
			mes "[ラウラ]";
			mes "あなたしかいないのよ！";
			mes "だから手伝って。";
			mes "手伝ってくれるわね？";
			mes "手伝うのよね？　ね？";
			next;
			if(select("報酬は本当に無いの？","わかりました")==1) {
				cutin "hu_laura04",2;
				mes "[ラウラ]";
				mes "ない。";
				next;
				mes "[ラウラ]";
				mes "…………";
				next;
				cutin "hu_laura01",2;
				mes "[ラウラ]";
				mes "……お金がないのよ。";
				mes "研究費がまともに出れば";
				mes "私たちもあんな公告出さないし、";
				mes "シュバルツバルドの奴らみたいに";
				mes "沢山の人を連れてきたわよ。";
				next;
				cutin "hu_laura02",2;
				mes "[ラウラ]";
				mes "あーぁ、やめやめ。";
				mes "どうせ神さまのためにボランティアを";
				mes "させるって考え方が間違いだったわよ。";
				mes "ったく、最近の奴は……";
				break;
			}
		}
		mes "[ラウラ]";
		mes "そうなのよ！";
		mes "わかってくれたわね。";
		mes "それじゃまず最初に";
		mes "あなたがする事は、";
		mes "一度神殿に行ってみる事。";
		next;
		mes "[ラウラ]";
		mes "何をしてるの？";
		mes "はやく行って行って。";
		set HU_8QUE,7;
		break;
	case 2:
	case 3:
	case 4:
	case 5:
		mes "[" +strcharinfo(0)+ "]";
		mes "あの……ここは";
		mes "何をするところですか？";
		next;
		cutin "hu_laura04",2;
		mes "[ラウラ]";
		mes "何をするですって？";
		mes "神殿発掘団事務所よ、ここは。";
		next;
		if(select("別の部屋の……","そうですね")==2) {
			cutin "hu_laura01",2;
			mes "[ラウラ]";
			mes "わかってるなら、";
			mes "邪魔しないでよね。";
			break;
		}
		cutin "hu_laura01",2;
		mes "[" +strcharinfo(0)+ "]";
		mes "あっちの人も神殿発掘団って";
		mes "言っていますが？";
		next;
		cutin "hu_laura02",2;
		mes "[ラウラ]";
		mes "あなたバイト？";
		mes "ここはルーンミッドガッツの事務所。";
		mes "あっちはシュバルツバルド。";
		mes "私、常識のない女とは";
		mes "仕事なんてできないのよ。";
		next;
		cutin "hu_laura04",2;
		mes "[ラウラ]";
		mes "紹介が遅れたわね。";
		mes "私はオーディン神殿発掘団";
		mes "ルーンミッドガッツ代表。";
		mes "ラウラ・ローレンス。";
		mes "あっちはアッシュ・ミルトン。";
		next;
		emotion 18,"アッシュ#hu1";
		mes "[アッシュ]";
		mes "こんにちは。";
		next;
		mes "[ラウラ]";
		mes "あの女にうんざりしたら";
		mes "また来るといいわ。";
		break;
	case 6:
		cutin "hu_laura04",2;
		mes "[ラウラ]";
		mes "あら、いい所へ来たわね。";
		mes "あなたが何度も";
		mes "あっちの部屋に出入りしてるの";
		mes "私はちゃんと知ってるのよ。";
		mes "どう？　私の事を";
		mes "ちょっと手伝うつもりはない？";
		next;
		cutin "hu_laura01",2;
		mes "[ラウラ]";
		mes "今からあなたがする事は、";
		mes "あの女が何をするのか探って";
		mes "私に知らせる事よ。";
		next;
		cutin "hu_laura03",2;
		mes "[ラウラ]";
		mes "……まさかとは思うけど……";
		mes "あいつら、私が知らないものを";
		mes "自分たちだけで持ち帰る";
		mes "つもりじゃないでしょうね？";
		next;
		mes "[ラウラ]";
		mes "……";
		mes "……";
		next;
		mes "[ラウラ]";
		mes "……";
		mes "……";
		mes "……";
		mes "……";
		next;
		mes "[ラウラ]";
		mes "わからないなら";
		mes "わからないといいなさい！";
		mes "黙ってんじゃないわよ！";
		next;
		cutin "hu_laura04",2;
		mes "[ラウラ]";
		mes "ほら、こっそりばれないように";
		mes "何を話してるか聞いてくるの。";
		mes "どう、わかった？";
		next;
		cutin "hu_laura02",2;
		mes "[ラウラ]";
		mes "わかった？";
		next;
		cutin "hu_laura03",2;
		mes "[ラウラ]";
		mes "……わかったの！";
		next;
		menu "わかりました",-,"わかりました",-,"わかりました",-,"わかりました",-;
		cutin "hu_laura04",2;
		mes "[ラウラ]";
		mes "ふふ、いい子ね。";
		mes "それじゃ、よろしく。";
		set HU_8QUE,12;
		break;
	case 7:
		cutin "hu_laura02",2;
		mes "[ラウラ]";
		mes "ほら、行ってきなさいよ。";
		mes "一応これであなたの実力を";
		mes "判断しているんだからね。";
		next;
		mes "[ラウラ]";
		mes "人の見た目なんて";
		mes "いくらでも変えれるんだから、";
		mes "こうでもしないとあなたが";
		mes "本当に使えるのか";
		mes "わからないのよ。";
		next;
		mes "[ラウラ]";
		mes "だから早く";
		mes "オーディン神殿がある島に";
		mes "行ってきてちょうだい。";
		break;
	case 8:
		cutin "hu_laura04",2;
		mes "[ラウラ]";
		mes "あら、どうしたの？";
		mes "死にそうな顔をしているわね。";
		next;
		mes "[ラウラ]";
		mes "別に私だってあなたを";
		mes "殺そうとしたわけじゃないのよ？";
		mes "現状をちゃんと理解してもらうこと。";
		mes "それが目的だったのよ。";
		next;
		menu "なるほど",-,"ごもっとも",-,"さすがです",-;
		mes "[ラウラ]";
		mes "ふっふーん、わかってるじゃない。";
		mes "……っで、あっちで何か";
		mes "珍しいものとか見つけなかった？";
		next;
		if(select("ゼロピー","いいえ")==1) {
			cutin "hu_laura01",2;
			mes "[ラウラ]";
			mes "ゼロピーなんてどこでもあるじゃない。";
			mes "……まったくもう……";
		}
		else {
			cutin "hu_laura01",2;
			mes "[ラウラ]";
			mes "……そうね、簡単に宝が";
			mes "手に入るようなもんじゃないわね……";
			mes "うーん……";
		}
		next;
		cutin "hu_laura04",2;
		mes "[ラウラ]";
		mes "……仕方ないわ。";
		mes "とりあえず今必要な物を";
		mes "手に入れてきてちょうだい。";
		mes "報酬は……そうね。";
		mes "以前の探索で集めた中から";
		mes "一つ特別にあげるわ。";
		next;
		switch(select("ところで、別の部屋の……","そうですね……","わかりました")) {
		case 1:
			mes "[ラウラ]";
			mes "……ルーンミッドガッツと";
			mes "シュバルツバルドによる";
			mes "オーディン神殿発掘団。";
			mes "そのシュバルツバルド代表よ。";
			next;
			cutin "hu_laura01",2;
			mes "[ラウラ]";
			mes "肩書きは代表だけど、";
			mes "どうせ親がどこかの大きい企業の";
			mes "幹部か何かで、裏金でも使って";
			mes "成り上がったんじゃない？";
			next;
			cutin "hu_laura03",2;
			mes "[ラウラ]";
			mes "見た目はお嬢様だけど";
			mes "あれは紛れも無く演技よ。";
			mes "私を見ると目を細くして";
			mes "「今日も白髪？　苦労してるのね。」";
			mes "ってにやにや笑うのよ！";
			mes "ったく、ふざけんじゃないよー！";
			next;
			emotion 19,"アッシュ#hu1";
			mes "[アッシュ]";
			mes "先生やめてー！";
			mes "暴れないでー！";
			next;
			mes "[ラウラ]";
			mes "あぁ、もう！";
			mes "むっかっつっくーッ！";
			mes "……あんた、悪いけど";
			mes "また後できてちょうだい。";
			mes "今なら八つ当たりをする";
			mes "自信があるわよ！";
			break;
		case 2:
			mes "[ラウラ]";
			mes "正直に言って、";
			mes "私もそんな仕事したくないわ。";
			mes "みんな考える事は同じじゃない？";
			mes "だから強要もしない。";
			mes "よく考えてみることね。";
			break;
		case 3:
			mes "[ラウラ]";
			mes "あらあらあらぁ。";
			mes "それじゃあさっそく";
			mes "^3355FF闇のルーン^0000005個を";
			mes "集めてきてちょうだい。";
			mes "よろしく！";
			set HU_8QUE,9;
			break;
		}
		break;
	case 9:
		cutin "hu_laura02",2;
		mes "[ラウラ]";
		mes "何してるの？";
		mes "ほら、早く行ってきてよ。";
		next;
		if(select("何でしたっけ？","行ってきます")==1) {
			mes "[ラウラ]";
			mes "^3355FF闇のルーン^0000005個よ。";
			mes "すぐに行って。";
			break;
		}
		mes "[ラウラ]";
		mes "さっさと行きなさいよ。";
		mes "鼻の高いお嬢様より早く";
		mes "結果を報告して……";
		mes "私は出世して……";
		mes "んっふっふっふっふっふ。";
		break;
	case 10:
		cutin "hu_laura04",2;
		mes "[ラウラ]";
		mes "行ってきた？";
		mes "それで、闇のルーンは？";
		next;
		if(select("まだ……","ここにあります")==1) {
			cutin "hu_laura03",2;
			mes "[ラウラ]";
			mes "焦らなくていいわ。";
			mes "のんびりやってていいのよ。";
			mes "私はこの田舎でのんびりと";
			mes "休養でも楽し……";
			mes "めるわけないわぁー！";
			next;
			mes "[ラウラ]";
			mes "ほら、さっさと行きなさい！";
			mes "行きなさいったら行きなさい！";
			break;
		}
		if(countitem(7511) < 1) {
			cutin "hu_laura02",2;
			mes "[ラウラ]";
			mes "何よ。";
			mes "一つも持ってないじゃない……";
			next;
			cutin "hu_laura03",2;
			mes "[ラウラ]";
			mes "……そんなに";
			mes "手伝いたくないなら";
			mes "最初っからくるなー！";
			mes "あんたは一体何様だぁ！";
			next;
			mes "[アッシュ]";
			mes "先生、やめてください！";
			mes "落ち着いてー！";
			next;
			mes "[ラウラ]";
			mes "ふざけんじゃないよー！";
			mes "うがー！";
			next;
			mes "[アッシュ]";
			mes "先生！";
			mes "先生がそんな風にしてたら";
			mes "ますます仕事がこなくなって、";
			mes "もっと貧乏になっちゃいます！";
			mes "だから落ち着いてくださいー！";
			next;
			cutin "hu_laura02",2;
			mes "[ラウラ]";
			mes "……ふぅふぅ……";
			mes "一発殴ってやりたいけど、";
			mes "もう一度チャンスをあげるわ。";
			mes "すぐに行きなさい。";
			mes "私を本気にしたら";
			mes "どうなるか知らないわよ……";
			break;
		}
		if(countitem(7511) == 1) {
			cutin "hu_laura03",2;
			mes "[ラウラ]";
			mes "……1個？";
			mes "いたずら？　いたずらなの？";
			mes "あなたは私たちの仕事が";
			mes "子供の遊びにでも見えるのか！";
			next;
			mes "[ラウラ]";
			mes "すぐにあと4個持ってこい！";
			mes "わかったわね！";
			break;
		}
		if(countitem(7511) == 2) {
			cutin "hu_laura03",2;
			mes "[ラウラ]";
			mes "どれどれ……";
			mes "一つ、二つ……二つ？";
			mes "これで終り？";
			next;
			mes "[ラウラ]";
			mes "いたずら？　いたずらなの？";
			mes "あなたは私たちの仕事が";
			mes "子供の遊びにでも見えるのか！";
			next;
			mes "[ラウラ]";
			mes "すぐにあと3個持ってこい！";
			mes "わかったわね！";
			break;
		}
		if(countitem(7511) < 5) {
			mes "[ラウラ]";
			mes "どれどれ……";
			mes "一つ、二つ、三つ……";
			mes "……";
			mes "…………";
			next;
			cutin "hu_laura03",2;
			mes "[ラウラ]";
			mes "足りないんじゃない。";
			mes "あなた、数字わかってる？";
			mes "ちゃんと理解してる？";
			next;
			mes "[ラウラ]";
			mes "ほら、すぐに行って";
			mes "5個手に入れてきて！";
			mes "じゃないと天罰が下るぞ！";
			break;
		}
		mes "[ラウラ]";
		mes "おぉー！";
		mes "よくやったわね。";
		mes "苦労したでしょう。";
		set HU_8QUE,11;
		delitem 7511,5;
		getitem 603,1;
		next;
		mes "[ラウラ]";
		mes "ほらほら、コレ見て。";
		mes "どんどん調査する物が増えて";
		mes "いくらやっても終わらないわ～";
		next;
		mes "[ラウラ]";
		mes "ねー？　アッシュ。";
		next;
		mes "[アッシュ]";
		mes "そうですねー";
		next;
		mes "[ラウラ]";
		mes "アッシュはいつも遺物を";
		mes "磨いてばかり。";
		mes "うんざりしない？";
		next;
		mes "[アッシュ]";
		mes "えへへ……";
		mes "そんなことないですよ。";
		next;
		cutin "hu_laura01",2;
		mes "[ラウラ]";
		mes "まったく、あっちのやつらは";
		mes "一体何をしてるの？";
		mes "まさか遊んでるんじゃ";
		mes "ないでしょうね……";
		next;
		mes "[ラウラ]";
		mes "あっはっは。";
		mes "もしかすると田舎での休養だと";
		mes "思ってるかもしれないわねー。";
		next;
		cutin "hu_laura02",2;
		mes "[ラウラ]";
		mes "まったく……";
		mes "金持ちってうらやましいわ。";
		mes "研究費で遊ぶ毎日。";
		mes "足りないなら今度は親の金。";
		next;
		mes "[ラウラ]";
		mes "それに、発掘なんて発掘団に";
		mes "任せておけばいいし……";
		next;
		mes "[ラウラ]";
		mes "それに引き換え、";
		mes "私たちは貧乏でね～";
		mes "研究費もまともに出ないのよ。";
		mes "今日の夜も肉無しの鍋……";
		next;
		cutin "hu_laura03",2;
		mes "[ラウラ]";
		mes "……うるぁぁぁぁぁぁ！";
		mes "肉！　肉！";
		mes "肉が食べたい！";
		mes "ミィィィィィィィィィツ！";
		next;
		mes "[アッシュ]";
		mes "ローレンス先生！";
		mes "あ、危ないですよ！";
		mes "そんなに暴れちゃ";
		mes "家が壊れちゃいますよー！";
		next;
		cutin "hu_laura02",2;
		mes "[ラウラ]";
		mes "……ッ！";
		mes "わかってるわよ！";
		mes "チィ……";
		next;
		cutin "hu_laura01",2;
		mes "[ラウラ]";
		mes "はぁ……もう何も言う気力がないわ。";
		mes "あなたも帰ってぐっすり休んで。";
		break;
	case 11:
		cutin "hu_laura02",2;
		mes "[ラウラ]";
		mes "はぁ……ホント……";
		mes "今頃、あっちのやつらは";
		mes "何してるのかしらね？";
		next;
		mes "[ラウラ]";
		mes "……まさかとは思うけど……";
		mes "あいつら、私が知らないものを";
		mes "自分たちだけで持ち帰る";
		mes "つもりじゃないでしょうね？";
		next;
		mes "[ラウラ]";
		mes "……";
		mes "……";
		mes "……";
		next;
		cutin "hu_laura01",2;
		mes "[ラウラ]";
		mes "……あ。";
		mes "ちょうどいい人材がいるじゃない。";
		next;
		if(select("……だれ？","……私？")==1) {
			mes "[ラウラ]";
			mes "や、ちょっと！";
			mes "あなたよあなた！";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "…………私ですか？";
			next;
		}
		mes "[ラウラ]";
		mes "そう、あなた。";
		mes "あいつらが何をしているのか";
		mes "聞いてきてちょうだい。";
		next;
		cutin "hu_laura04",2;
		mes "[ラウラ]";
		mes "ほらぁ、こっそりと";
		mes "盗み聞きしてくればいいのよ。";
		mes "簡単でしょ？";
		next;
		cutin "hu_laura03",2;
		mes "[ラウラ]";
		mes "わかった？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "…………";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……………………";
		next;
		mes "[ラウラ]";
		mes "…………";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "………………………………";
		next;
		mes "[ラウラ]";
		mes "わかったの！";
		next;
		menu "わかりました",-,"わかりました",-,"わかりました",-,"わかりました",-;
		cutin "hu_laura04",2;
		mes "[ラウラ]";
		mes "ふふ、いい子ね。";
		mes "それじゃ、よろしく。";
		set HU_8QUE,12;
		break;
	case 12:
		cutin "hu_laura02",2;
		mes "[ラウラ]";
		mes "何をしてるの？";
		mes "早く行ってきなさいよ。";
		mes "あの金持ちお嬢様が";
		mes "何をしてるのか";
		mes "探ってくるのよ。";
		break;
	case 13:
	case 14:
		cutin "hu_laura01",2;
		mes "[ラウラ]";
		mes "ん、どうだった？";
		mes "何か秘密でも掴んできた？";
		mes "それならほら、話しなさいよ。";
		next;
		mes "[ラウラ]";
		mes "言っておくけど";
		mes "お礼なんて期待しないでよね！";
		next;
		switch(select("彼らの目的はギガンテスだという","ユミルの心臓についていう","なにもいわない")) {

		case 1:
			cutin "hu_laura04",2;
			mes "[" +strcharinfo(0)+ "]";
			mes "ラウラさんも考古学者なら、";
			mes "ギガンテスが何か";
			mes "ご存じですよね？";
			next;
			mes "[ラウラ]";
			mes "当然知っているわ。";
			mes "古代人の。";
			mes "ガーディアンの原型。";
			next;
			cutin "hu_laura02",2;
			mes "[ラウラ]";
			mes "……まさか!?";
			mes "あいつら、ガーディアンを";
			mes "完成させようとして";
			mes "ここまで来たってこと？";
			mes "それ以外は？";
			mes "他の話はないの!?";
			next;
		case 2:
			mes "[" +strcharinfo(0)+ "]";
			mes "……ユミルの……";
			next;
			emotion 0,"アッシュ#hu1";
			mes "[アッシュ]";
			mes "心臓!?";
			next;
			mes "[ラウラ]";
			mes "ユミルの心臓？";
			mes "何よそれ？";
			next;
			switch(select("食べものです","おもちゃです","新たに出た健康製品ブランドです","世界を作った巨人の……")) {
			case 1:
				mes "[" +strcharinfo(0)+ "]";
				mes "食べ……";
				next;
				break;
			case 2:
				mes "[" +strcharinfo(0)+ "]";
				mes "いたずらに……";
				next;
				break;
			case 3:
				mes "[" +strcharinfo(0)+ "]";
				mes "新たに出た……";
				next;
				break;
			}
			emotion 33,"アッシュ#hu1";
			mes "[アッシュ]";
			mes "ジュリアンさんが着ている服の";
			mes "ブランドがユミルの心臓です。";
			mes "シュバルツバルドで最近";
			mes "流行ってるって聞きましたよ。";
			next;
			cutin "hu_laura01",2;
			mes "[ラウラ]";
			mes "何よ、服の話だったの？";
			mes "ブランドだなんて、";
			mes "流石はお嬢様ね、ふん。";
			next;
			cutin "hu_laura04",2;
			mes "[ラウラ]";
			mes "……仕方ないわね。";
			mes "私も色々と探ってみようかしら。";
			mes "うーん……";
			mes "もう一つお願いがあるんだけど";
			mes "いい？";
			next;
			mes "[ラウラ]";
			mes "神殿にもう一度";
			mes "行くことができる？";
			mes "神殿は二つの島でできているわ。";
			next;
			mes "[ラウラ]";
			mes "内側の島には一体何があるのか";
			mes "調べてきて欲しいのよ。";
			next;
			mes "[ラウラ]";
			mes "よろしくね。";
			set HU_8QUE,15;
			break;
		case 3:
			mes "[ラウラ]";
			mes "何もなかったってこと？";
			mes "本当に？";
			break;
		}
		break;
	case 15:
		cutin "hu_laura01",2;
		mes "[ラウラ]";
		mes "ほら。";
		mes "早く調べてきてちょうだい。";
		break;
	default:
		end;
	}
	close2;
	cutin "hu_laura01",255;
	end;
}

hu_in01.gat,18,167,4	script	ジュリアン#hu1	86,{
	switch(HU_8QUE) {
	case 0:
		mes "[ジュリアン]";
		mes "……ふぅ。";
		close;
	case 1:
		mes "[ジュリアン]";
		mes "仕事を探しにきたの？";
		mes "……簡単に説明してあげるよ。";
		next;
		mes "[ジュリアン]";
		mes "お金はあげれません。";
		mes "歴史的発掘に関わるって";
		mes "名誉だけで働くことになるんだ。";
		next;
		mes "[ジュリアン]";
		mes "それでもいいなら、";
		mes "ボクたちシュバルツバルドと";
		mes "ルーンミッドガッツ連合発掘団に";
		mes "協力してください。";
		mes "本当は一緒に調査をするんだけど……";
		next;
		mes "[ジュリアン]";
		mes "代表のおばさんたちが";
		mes "いがみあってるんだよ。";
		mes "初めて会った瞬間に";
		mes "けんかを始めちゃってね。";
		mes "調査は別々にしてるんだ。";
		next;
		mes "[ジュリアン]";
		mes "……ボクにとっては好都合だけど……";
		next;
		mes "[ジュリアン]";
		mes "それでも手伝ってくれる？";
		mes "遺物の状態は気にしないから、";
		mes "数だけあればいいんだ。";
		mes "それだけで調査は十分。";
		close;
	case 2:
		mes "[ジュリアン]";
		mes "君も人がいいね。";
		mes "あんなおばさんの言う事聞いて。";
		next;
		mes "[アレックス]";
		mes "ジュリアン！";
		next;
		mes "[ジュリアン]";
		mes "聞こえない。";
		mes "聞こえな～い。";
		close;
	case 3:
		mes "[ジュリアン]";
		mes "本当に行ってきたの？";
		mes "君もすごいねぇ。";
		mes "お金にならないのに";
		mes "こんなにがんばるなんて。";
		close;
	case 4:
		mes "[ジュリアン]";
		mes "熱心にやってるね。";
		mes "なんでこんなに親切なの？";
		close;
	case 5:
		mes "[ジュリアン]";
		mes "また来たんだ。";
		mes "親切にも程があるよ。";
		close;
	default:
		mes "[ジュリアン]";
		mes "二人のおばさん、";
		mes "うるさくて仕方ないよ。";
		close;
	}
}

hu_in01.gat,16,20,4	script	アッシュ#hu1	95,{
	switch(HU_8QUE) {
	case 0:
		mes "[アッシュ]";
		mes "どうしました？";
		next;
		mes "[アッシュ]";
		mes "お金をくれない人は";
		mes "立ち入り禁止ですよ。";
		close;
	case 1:
		mes "[アッシュ]";
		mes "公告を見たの？";
		mes "うーん……";
		mes "それじゃ仕事について";
		mes "説明するよ？";
		next;
		mes "[アッシュ]";
		mes "残念だけど、お給料はないよ。";
		mes "私たち貧乏だから。";
		mes "エヘヘ～";
		mes "その代わり、遺跡の発掘で";
		mes "歴史と関係ないような品物は";
		mes "持っていってもいいんだよ。";
		next;
		mes "[アッシュ]";
		mes "あと何を話せばいいのかな？";
		mes "えーっと……";
		next;
		mes "[アッシュ]";
		mes "あー……本当は一緒に調査を";
		mes "しなくちゃいけないんだけど、";
		mes "あっちのシュバルツバルドの人と";
		mes "私の先生は仲が悪いの。";
		next;
		mes "[アッシュ]";
		mes "どっちでもいいから";
		mes "仕事を手伝って欲しいの。";
		mes "発掘する人が増えれば";
		mes "この仕事が早く終わるから。";
		next;
		mes "[アッシュ]";
		mes "それじゃ、まずは先生と";
		mes "一度話してみてね。";
		close;
	case 2:
	case 7:
		mes "[アッシュ]";
		mes "神殿に行くの？";
		mes "危ないから気をつけてね。";
		close;
	case 3:
	case 8:
		mes "[アッシュ]";
		mes "もう行ってきたの!?";
		mes "すごい早いはやーい。";
		mes "あなたが手伝ってくれれば";
		mes "ホントに助かるよ！";
		close;
	case 4:
		mes "[アッシュ]";
		mes "あれれ？";
		mes "アレックスさんを手伝うの？";
		mes "……先生怒っちゃうよ？";
		mes "あ、でも大丈夫！";
		mes "探してくる物は同じはずだよ。";
		close;
	case 5:
	case 6:
		mes "[アッシュ]";
		mes "お仕事うまくいってる？";
		close;
	case 9:
		mes "[アッシュ]";
		mes "大変だけど";
		mes "がんばってね！";
		close;
	case 10:
		mes "[アッシュ]";
		mes "どうだった？";
		if(countitem(7511) < 5) {
			mes "……うーん、まだお仕事";
			mes "終わってないのかな？";
		}
		else
			mes "お仕事は終わったかな？";
		close;
	case 11:
		mes "[アッシュ]";
		mes "お疲れさまでした～";
		mes "先生があんなこと言ってたけど、";
		mes "あんまり悪く思わないでね。";
		close;
	case 12:
		mes "[アッシュ]";
		mes "こういうのは";
		mes "あまり好きじゃありません。";
		mes "でも……本当は私も……";
		mes "私も何をしてるのか知りたいの。";
		close;
	case 14:
		mes "[アッシュ]";
		mes "……何でもないです。";
		close;
	case 15:
		mes "[アッシュ]";
		mes "今は何も聞かないでください。";
		mes "あなたの害となる行動は";
		mes "しないとだけ約束します。";
		close;
	}
}

hugel.gat,209,109,2	script	船乗り	709,{
	mes "[船乗り]";
	mes "この海の先に見えるあの島に";
	mes "オーディン神殿があるんだ。";
	mes "そこまで送ってやろうか？";
	mes "お代はたったの800Zeny。";
	mes "行くかい？";
	next;
	if(select("いいえ","お願いします")==1) {
		mes "[船乗り]";
		mes "なんだい、行ってみたくないのかい。";
		close;
	}
	if(Zeny < 800) {
		mes "[船乗り]";
		mes "お金が足りないのか？";
		mes "そうは見えないが……";
		mes "また用意ができたら";
		mes "いつでもおいで。";
		close;
	}
	mes "[船乗り]";
	mes "よし、さっそく船を出すぞ。";
	close2;
	set Zeny,Zeny-800;
	if(HU_8QUE == 2 || HU_8QUE == 4 || HU_8QUE == 7 || HU_8QUE == 9)
		set HU_8QUE,HU_8QUE+1;
	warp "odin_tem01.gat",100,146;
	end;
}

odin_tem01.gat,93,146,4	script	船乗り	709,{
	mes "[船乗り]";
	mes "帰るつもりかい？";
	next;
	if(select("いえ、まだ残ります","はい、フィゲルへ")==1) {
		mes "[船乗り]";
		mes "おやおや、よくがんばるね。";
		mes "ワシにはここは";
		mes "恐ろしい化け物がいる";
		mes "危険な場所にしか見えんがな。";
		close;
	}
	mes "[船乗り]";
	mes "よし、さっそく船を出すぞ。";
	close2;
	warp "hugel.gat",206,109;
	end;
}

hu_in01.gat,16,21,0	script	アッシュ#hu2	139,2,2,{
	if(HU_8QUE != 13)
		end;
	mes "[アッシュ]";
	mes "………………";
	next;
	mes "[アッシュ]";
	mes "……";
	set HU_8QUE,14;
	close;
}

hu_in01.gat,15,108,0	script	hu_warp1	45,1,1,{
	if(HU_8QUE < 12 || HU_8QUE > 13) {
		warp "hu_in01.gat",15,155;
		end;
	}
	if(HU_8QUE == 13) {
		mes "……";
		close;
	}
	mes "[アレックス]";
	mes "まだ見つからないの？";
	mes "確かにここにあると";
	mes "言ったじゃない。";
	mes "妙に人が集まる所だから";
	mes "心臓の欠片があるだろうって。";
	next;
	mes "[ジュリアン]";
	mes "まだ出てこないだけだよ！";
	mes "絶対にここにあるんだから！";
	next;
	mes "[アレックス]";
	mes "お前がそこまで執着するなんて……";
	mes "あれが本当にここにあるかどうか";
	mes "わかる方法があるんじゃないの？";
	next;
	mes "[アレックス]";
	mes "……「シドクス」の時だって………";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "……シドクス？";
	next;
	mes "[アレックス]";
	mes "あの時は村の中で";
	mes "発見されたわけじゃないの。";
	mes "……はぁ……";
	mes "だからお前はいつまでたっても……";
	next;
	mes "[ジュリアン]";
	mes "……ッ！";
	mes "そうだよ！　いっつもそうだ！";
	mes "姉ちゃんが偉いとこれだ！";
	mes "ボクはいつまでも姉ちゃんの弟！";
	mes "父さんもいっつもボクを無視してる。";
	mes "ちくしょう！　畜生！";
	next;
	mes "[アレックス]";
	mes "事実だからよ。";
	next;
	mes "[ジュリアン]";
	mes "ッ!?";
	next;
	mes "[アレックス]";
	mes "だからお前はお子ちゃまなのよ。";
	mes "無鉄砲に手柄を立てようとしては";
	mes "仕事を台無しにする。";
	mes "だから……";
	mes "……何よ、その顔は？";
	mes "本当の事じゃない。";
	next;
	mes "[ジュリアン]";
	mes "姉ちゃんに何がわかるんだ！";
	next;
	mes "[アレックス]";
	mes "お前よりはわかってるわ。";
	mes "そう、お前よりは確実に仕事を";
	mes "やりこなすことができるわ。";
	mes "とにかく、ユミルの心臓は";
	mes "一旦諦めましょう。";
	mes "今はそれよりギガンテスよ。";
	next;
	mes "[ジュリアン]";
	mes "そんなの放っておけよ！";
	next;
	mes "[アレックス]";
	mes "……お前！";
	next;
	mes "[ジュリアン]";
	mes "姉ちゃんはいっつもボクに……";
	mes "……！……";
	mes "…………？";
	mes "何か音が聞こえなかった？";
	next;
	mes "[アレックス]";
	mes "……";
	mes "話は後にしましょう。";
	set HU_8QUE,13;
	close;
}

hugel.gat,52,90,0	script	hu_warp2	45,1,1,{
	if(HU_8QUE < 17) warp "hu_in01.gat",33,90;
	else if(HU_8QUE < 21) warp "hu_in01.gat",173,90;
	else warp "hu_in01.gat",102,90;
	end;
}

hu_in01.gat,155,70,0	script	hu_warp3	45,1,1,{
	mes "-ドアに鍵が掛かっている-";
	close;
}

hu_in01.gat,155,108,0	script	hu_warp4	45,1,1,{
	mes "-ドアに鍵が掛かっている-";
	close;
}

odin_tem03.gat,0,0,0	script	OdinTimer	-1,{
OnInit:
OnTimer300000:
	set '@num,rand(1,5);
	for(set '@i,1; '@i <= 5; set '@i,'@i+1) {
		if('@i != '@num)
			hideonnpc "odin_in#" +'@i;
	}
	hideoffnpc "odin_in#" +'@num;
	initnpctimer;
	end;
}

odin_tem03.gat,266,302,0	script	odin_in#1	139,3,3,{
	if(HU_8QUE < 15 || HU_8QUE > 17)
		end;
	donpcevent "OdinTimer";
	set HU_8QUE,16;
	warp "que_hugel.gat",36,179;
	end;
}
odin_tem03.gat,288,271,0	duplicate(odin_in#1)	odin_in#2	139,3,3
odin_tem03.gat,283,241,0	duplicate(odin_in#1)	odin_in#3	139,3,3
odin_tem03.gat,179,275,0	duplicate(odin_in#1)	odin_in#4	139,3,3
odin_tem03.gat,320,264,0	duplicate(odin_in#1)	odin_in#5	139,3,3

que_hugel.gat,35,29,0	script	odin1	139,2,2,{
	if(HU_8QUE == 17) {
		warp "que_hugel.gat",163,31;
		end;
	}
	if(HU_8QUE != 16)
		end;
	mes "-床にある残骸は";
	mes "神殿の一部が沈んだように";
	mes "無傷な状態を保ったまま";
	mes "埋まっている-";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "……";
	next;
	if(select("そのまま立ち去る","観察する")==1) {
		mes "-立ち止まるのを止めた-";
		close;
	}
	if(rand(3)) {
		mes "-何か違和感を感じる-";
		close;
	}
	mes "-明るく光る石が";
	mes "残骸の中で輝くのが見えた-";
	next;
	if(select("ほおっておく","石を慎重に取る")==1) {
		mes "-もっと色々探してみよう-";
		close;
	}
	mes "-輝く石を用心深く";
	mes "かばんにしまいこんだ-";
	next;
	mes "-^FF0000ゴゴゴゴゴ！^000000-";
	next;
	mes "-^FF0000ゴゴゴゴゴゴゴゴ！^000000-";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "……何か……音が？";
	next;
	misceffect 90;
	misceffect 90;
	misceffect 90;
	mes "[" +strcharinfo(0)+ "]";
	mes "う、うわぁぁぁぁ！";
	close2;
	set HU_8QUE,17;
	warp "que_hugel.gat",163,31;
	end;
}

que_hugel.gat,163,31,0	script	odin2	139,3,3,{
	mes "-注意深く回りを見てみたが、";
	mes "特に何もない……-";
	close;
}

que_hugel.gat,163,178,0	script	odin3	139,2,2,{
	if(HU_8QUE != 17)
		end;
	mes "[" +strcharinfo(0)+ "]";
	mes "ん？　ん？";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "うわぁぁぁぁぁ！！！";
	close2;
	set HU_8QUE,18;
	warp "odin_tem03.gat",264,260;
	end;
}

hu_in01.gat,159,84,3	script	ラウラ#hu	70,{
	if(HU_8QUE < 17 || HU_8QUE > 18) {
		cutin "hu_laura03",2;
		emotion 6;
		mes "[ラウラ]";
		mes "ったいわね！";
		mes "なにすんのよ！";
		next;
		cutin "hu_alex04",0;
		emotion 6,"アレックス#hu";
		mes "[アレックス]";
		mes "あんたこそなによ！";
		close2;
		cutin "hu_alex04",255;
		end;
	}
	cutin "hu_laura03",2;
	emotion 6;
	mes "[ラウラ]";
	mes "これは一体どういうことよ！";
	next;
	mes "-ラウラがぶ厚い書類を";
	mes "手に持って何か叫んでいる-";
	next;
	cutin "hu_alex04",0;
	emotion 6,"アレックス#hu";
	mes "[アレックス]";
	mes "何よ、うるさいわねぇ。";
	mes "調査ならすすんでるでしょ？";
	mes "あなたも島にちゃんと神殿が";
	mes "あるのをその目で見たでしょ？";
	next;
	cutin "hu_laura03",2;
	mes "[ラウラ]";
	mes "神殿なんてどうでもいいのよ！";
	mes "私が見たそこのやつ！";
	mes "そこにいるあんたの弟が";
	mes "真夜中に村のあちこちを";
	mes "掘りに行くのを見たのよ！";
	next;
	cutin "hu_alex04",0;
	mes "[アレックス]";
	mes "そんなこと";
	mes "するわけないじゃない。";
	mes "ここは遺跡じゃないのよ？";
	mes "夢でも見たんじゃない？";
	next;
	mes "[アレックス]";
	mes "それに、何で私の弟が";
	mes "そんなことをするのよ。";
	next;
	cutin "hu_laura03",2;
	mes "[ラウラ]";
	mes "私の弟、私の弟。";
	mes "ほんと、そればっかりね。";
	mes "いっつも言い争ってるくせに";
	mes "何かあるとすーぐ庇うのね。";
	next;
	cutin "hu_alex04",0;
	mes "[アレックス]";
	mes "……何が言いたいのよ？";
	next;
	cutin "hu_laura01",2;
	mes "[ラウラ]";
	mes "地面を一人で掘る？";
	mes "何日も続けて？";
	mes "そんなの何かを探してるとしか";
	mes "思えないでしょうが。";
	next;
	mes "-ラウラはぶ厚い書類を";
	mes "手に持って何か叫んでいる-";
	next;
	emotion 23,"ジュリアン#hu2";
	mes "[ジュリアン]";
	mes "……まさかそれって!?";
	next;
	emotion 7;
	mes "[ラウラ]";
	mes "そのまさかよ。";
	mes "「^FF0000ユミルの心臓^000000」";
	mes "何よこれ？";
	next;
	cutin "hu_alex02",0;
	mes "[アレックス]";
	mes "……";
	mes "ジュリアン……";
	next;
	emotion 19,"ジュリアン#hu2";
	mes "[ジュリアン]";
	mes "ボ、ボクのせいじゃない！";
	mes "あの女が勝手に部屋に……";
	next;
	cutin "hu_laura02",2;
	mes "[ラウラ]";
	mes "あら、それは違うわ。";
	mes "ここは「私たちの事務所」なのよ。";
	mes "私もあなたたちも同じ発掘団所属。";
	mes "違う？";
	next;
	mes "[ラウラ]";
	mes "それに、理由も言わずに";
	mes "そんな事されたら、誰が見ても";
	mes "怪しくてしょうがないわ。";
	mes "自国の領土にもかかわらず";
	mes "遺跡発掘なんて言い訳してるし。";
	next;
	mes "[ラウラ]";
	mes "その上、私たちが気づかないように";
	mes "夜中にこっそりと……";
	next;
	cutin "hu_laura03",2;
	mes "[ラウラ]";
	mes "これで、何でも無いなんて";
	mes "言い訳できると思ってるの？";
	mes "一体あなたたちは何なの？";
	mes "何をしにここに来たのよ！";
	next;
	cutin "hu_alex03",0;
	emotion 19,"アレックス#hu";
	mes "[アレックス]";
	mes "ッ……私は何も関係ないわ！";
	mes "それはジュリアン一人に与えられた";
	mes "^3355FF任務^000000なのよ！";
	mes "好き勝手言わないでよね！";
	mes "泥棒のくせに！";
	next;
	cutin "hu_laura03",2;
	mes "[ラウラ]";
	mes "なんですってぇー！";
	mes "もう我慢できない!!";
	next;
	mes "-ラウラは書類を床に叩きつけ、";
	mes "腕を捲り上げた-";
	next;
	emotion 28,"アッシュ#hu3";
	mes "[アッシュ]";
	mes "二人ともやめてください！";
	next;
	emotion 6;
	mes "[ラウラ]";
	mes "お前は黙ってなさい！";
	next;
	cutin "hu_alex04",0;
	emotion 6,"アレックス#hu";
	mes "[アレックス]";
	mes "邪魔しないでちょうだい！";
	mes "これは私たちの問題よ！";
	next;
	mes "[アレックス]";
	mes "……ッ。";
	set HU_8QUE,19;
	close2;
	cutin "hu_alex04",255;
	end;
}

hu_in01.gat,158,84,5	script	アレックス#hu	803,{
	if(HU_8QUE < 17 || HU_8QUE > 18) {
		cutin "hu_laura03",2;
		emotion 6,"ラウラ#hu";
		mes "[ラウラ]";
		mes "ったいわね！";
		mes "なにすんのよ！";
		next;
		cutin "hu_alex04",0;
		emotion 6;
		mes "[アレックス]";
		mes "あんたこそなによ！";
		close2;
		cutin "hu_alex04",255;
		end;
	}
	cutin "hu_laura03",2;
	emotion 6,"ラウラ#hu";
	mes "[ラウラ]";
	mes "神殿なんてどうでもいいのよ！";
	mes "これ以上ごまかせると思ってんの!?";
	next;
	mes "-ラウラはぶ厚い書類を";
	mes "手に持って何か叫んでいる-";
	next;
	mes "[ラウラ]";
	mes "私は見たのよ！";
	mes "そこにいるあんたの弟が";
	mes "真夜中に村のあちこちを";
	mes "掘りに行くのを！";
	next;
	cutin "hu_alex04",0;
	mes "[アレックス]";
	mes "そんなこと";
	mes "するわけないじゃない。";
	mes "ここは遺跡じゃないのよ？";
	mes "夢でも見たんじゃない？";
	next;
	mes "[アレックス]";
	mes "それに、何で私の弟が";
	mes "そんなことをするのよ。";
	next;
	cutin "hu_laura03",2;
	mes "[ラウラ]";
	mes "私の弟、私の弟。";
	mes "ほんと、そればっかりね。";
	mes "いっつも言い争ってるくせに";
	mes "何かあるとすーぐ庇うのね。";
	next;
	cutin "hu_alex04",0;
	mes "[アレックス]";
	mes "……何が言いたいのよ？";
	next;
	cutin "hu_laura01",2;
	mes "[ラウラ]";
	mes "地面を一人で掘る？";
	mes "何日も続けて？";
	mes "そんなの何かを探してるとしか";
	mes "思えないでしょうが。";
	next;
	mes "-ラウラは持っていた書類を";
	mes "見せつけるように軽く振った-";
	next;
	emotion 23,"ジュリアン#hu2";
	mes "[ジュリアン]";
	mes "……まさかそれって!?";
	next;
	emotion 7,"ラウラ#hu";
	mes "[ラウラ]";
	mes "そのまさかよ。";
	mes "「^FF0000ユミルの心臓^000000」";
	mes "何よこれ？";
	next;
	cutin "hu_alex02",0;
	mes "[アレックス]";
	mes "……";
	mes "ジュリアン……";
	next;
	emotion 19,"ジュリアン#hu2";
	mes "[ジュリアン]";
	mes "ボ、ボクのせいじゃない！";
	mes "あの女が勝手に部屋に……";
	next;
	cutin "hu_laura02",2;
	mes "[ラウラ]";
	mes "あら、それは違うわ。";
	mes "ここは「私たちの事務所」なのよ。";
	mes "私もあなたたちも同じ発掘団所属。";
	mes "違う？";
	next;
	mes "[ラウラ]";
	mes "それに、理由も言わずに";
	mes "そんな事されたら、誰が見ても";
	mes "怪しくてしょうがないわ。";
	mes "自国の領土にもかかわらず";
	mes "遺跡発掘なんて言い訳してるし。";
	next;
	mes "[ラウラ]";
	mes "その上、私たちが気づかないように";
	mes "夜中にこっそりと……";
	next;
	cutin "hu_laura03",2;
	mes "[ラウラ]";
	mes "これで、何でも無いなんて";
	mes "言い訳できると思ってるの？";
	mes "一体あなたたちは何なの？";
	mes "何をしにここに来たのよ！";
	next;
	cutin "hu_alex03",0;
	emotion 19;
	mes "[アレックス]";
	mes "ッ……私は何も関係ないわ！";
	mes "それはジュリアン一人に与えられた";
	mes "^3355FF任務^000000なのよ！";
	mes "好き勝手言わないでよね！";
	mes "泥棒のくせに！";
	next;
	cutin "hu_laura03",2;
	mes "[ラウラ]";
	mes "なんですってぇー！";
	mes "もう我慢できない!!";
	next;
	mes "-ラウラは書類を床に叩きつけ、";
	mes "腕を捲り上げた-";
	next;
	emotion 28,"アッシュ#hu3";
	mes "[アッシュ]";
	mes "二人ともやめてください！";
	next;
	emotion 6,"ラウラ#hu";
	mes "[ラウラ]";
	mes "お前は黙ってなさい！";
	next;
	cutin "hu_alex04",0;
	emotion 6;
	mes "[アレックス]";
	mes "邪魔しないでちょうだい！";
	mes "これは私たちの問題よ！";
	next;
	mes "[アレックス]";
	mes "……ッ。";
	set HU_8QUE,19;
	close2;
	cutin "hu_alex04",255;
	end;
}

hu_in01.gat,162,85,4	script	アッシュ#hu3	95,{
	switch(HU_8QUE) {
	case 17:
	case 18:
		mes "[アッシュ]";
		mes "……ど、どうしよう……";
		close;
	case 19:
		mes "-アッシュはラウラが投げ捨てた";
		mes "書類を拾い上げた-";
		next;
		mes "[アッシュ]";
		mes "……お願いします！";
		mes "急いでこの書類を持って";
		mes "モロクに行ってください。";
		next;
		mes "[アッシュ]";
		mes "モロクの南門を出たところで";
		mes "私の仲間が" +strcharinfo(0)+ "さんを";
		mes "待っています。";
		next;
		mes "[アッシュ]";
		mes "……多分私たちとは二度と";
		mes "会うことができなくなります。";
		mes "ここまでお疲れさまでした。";
		mes "詳しいことは仲間が全部";
		mes "説明してくれるはずです。";
		set HU_8QUE,20;
		close;
	case 20:
		mes "[アッシュ]";
		mes "モロクの南門を出れば";
		mes "私の仲間がいるはずです。";
		mes "早く行ってください！";
		close;
	}
}

hu_in01.gat,171,90,0	script	アッシュ#hu4	139,2,2,{
	if(HU_8QUE != 19)
		end;
	mes "-アッシュはラウラが投げ捨てた";
	mes "書類を拾い上げた-";
	next;
	mes "[アッシュ]";
	mes "……お願いします！";
	mes "急いでこの書類を持って";
	mes "モロクに行ってください。";
	next;
	mes "[アッシュ]";
	mes "モロクの南門を出たところで";
	mes "私の仲間が" +strcharinfo(0)+ "さんを";
	mes "待っています。";
	next;
	mes "[アッシュ]";
	mes "……多分私たちとは二度と";
	mes "会うことができなくなります。";
	mes "ここまでお疲れさまでした。";
	mes "詳しいことは仲間が全部";
	mes "説明してくれるはずです。";
	set HU_8QUE,20;
	close;
}

hu_in01.gat,155,82,4	script	ジュリアン#hu2	86,{
	if(HU_8QUE == 17 || HU_8QUE == 18) {
		mes "[ジュリアン]";
		mes "……なんなんだよ、一体？";
		close;
	}
	mes "[ジュリアン]";
	mes "ボ、ボクは知らない。";
	mes "何も知らないんだ！";
	close;
}

moc_fild12.gat,160,365,0	script	秘密の羽	139,4,4,{
	if(HU_8QUE != 20)
		end;
	mes "[????]";
	mes "スッ………";
	next;
	mes "[????]";
	mes "尾行されているぞ。";
	next;
	misceffect 122,"Hit#hu";
	mes "[????]";
	mes "トァッ！";
	next;
	mes "[????]";
	mes "……";
	mes "よし。";
	mes "その書類を地面に置け。";
	next;
	mes "-手に持っていた書類を";
	mes "地面に落とした-";
	mes "-すると、音もなく";
	mes "書類が消えてしまった-";
	next;
	mes "[????]";
	mes "よくやってくれた。";
	mes "これで君の任務は終わったが、";
	mes "最後に一つだけ。";
	mes "何か聞きたいことはあるか？";
	mes "君には多くの疑問があるだろ？";
	next;
	if(select("アッシュの正体は一体!?","ラウラはどうなった？")==1) {
		mes "[????]";
		mes "おそらく、君とアッシュは";
		mes "二度と会う事は無いだろう。";
		mes "既に他の任務を受けて";
		mes "この地を去っている。";
		next;
		mes "[????]";
	}
	else {
		mes "[????]";
		mes "……彼女は何も知らない。";
		mes "そう、我々とは何の関係もない。";
		mes "しかし、彼女の功績は我々の間で";
		mes "認められている。";
		next;
		mes "[????]";
		mes "彼女は自分が関わった事が";
		mes "どんなに重要な事なのかも知らず、";
		mes "次の仕事を探しているようだ。";
		mes "性格さえ直ればよい学者になる";
		mes "実力はある。";
		next;
		mes "[????]";
		mes "……";
	}
	mes "「秘密の羽」";
	mes "聞いたことがあるか？";
	mes "ほとんど解体されてしまったが、";
	mes "まだ活動を引き続く者がいる。";
	mes "アッシュはその一人だ。";
	next;
	mes "[????]";
	mes "巨大な野望を持った";
	mes "レッケンベル会長を始め、";
	mes "多くの実力者がオーディン神殿の";
	mes "ギガンテスを狙っている。";
	mes "そのため、彼女のような人材が";
	mes "潜入捜査を行っている。";
	next;
	mes "[????]";
	mes "我々と違い、何も知らない";
	mes "ルーンミッドガッツと";
	mes "シュバルツバルドの人間は、";
	mes "気づかぬうちに";
	mes "事件に巻き込まれるだろう。";
	next;
	mes "[????]";
	mes "……話はこれまでだ。";
	mes "君はよくやってくれた。";
	mes "礼を言おう。";
	set HU_8QUE,21;
	if(checkre())
		getexp 70000,0;
	else
		getexp 700000,0;
	close;
}
moc_fild12.gat,160,372,0	script	Hit#hu	139,{}

hu_in01.gat,99,90,0	script	Empty	139,3,3,{
	mes "-ここにはもう誰もいない-";
	close;
}

hu_in01.gat,18,94,0	script	アルバイト	49,{
	mes "[ルダ]";
	mes "こんにちわ。";
	mes "ここは神殿発掘団事務室です。";
	mes "私はアルバイトで、";
	mes "事務室の整理を任されています。";
	next;
	mes "[ルダ]";
	mes "村第一の整理師である私が";
	mes "特別に仕事を任されたんです。";
	mes "エッヘン。";
	next;
	mes "[ルダ]";
	mes "ですが、上にはシュバルツバルド、";
	mes "下にはルーンミッドガッツから来た";
	mes "発掘団の人がいて、";
	mes "妙に雰囲気が悪いです……";
	next;
	mes "[ルダ]";
	mes "そのせいか、見てのとおり";
	mes "こんなに散らかっているので";
	mes "どこから手をつければよいのやら……";
	mes "今回の仕事は普通より大変みたいです。";
	next;
	mes "[ルダ]";
	mes "あなたもここで仕事を";
	mes "探してみてはどうですか？";
	mes "報酬は少ないでしょうが";
	mes "やりがいのある仕事ばかりです。";
	close;
}

hu_in01.gat,26,77,4	script	アルバイト	50,{
	mes "本の整理に集中している-";
	close;
}

//============================================================
// 傭兵反乱クエスト
//- Registry -------------------------------------------------
// HU_9QUE -> 0～36
//------------------------------------------------------------
hugel.gat,70,137,5	script	シイデ	879,{
	cutin "siide1.bmp",2;
	switch(HU_9QUE) {
	case 0:
		emotion 0;
		mes "[シイデ]";
		mes "ぇ？　ぁ、私ですか？";
		mes "ごめんなさい、気づかなくて。";
		mes "こんにちは。";
		mes "街の外からいらした方ですね？";
		next;
		mes "[シイデ]";
		mes "空港ができて以来、";
		mes "フィゲルは急に賑やかになったわ。";
		mes "少し慌ただしいけど、";
		mes "そんなに嫌じゃないかも。";
		next;
		mes "[シイデ]";
		mes "でも、お客さんが急に増えたから";
		mes "食べ物は足りないし、";
		mes "人手は足りないし……";
		mes "やりたい事もできないの。";
		next;
		if(select("私がお手伝いしましょうか？","仕事を邪魔してはいけませんね")==2) {
			mes "[シイデ]";
			mes "邪魔というわけでは……";
			mes "いくら忙しくても";
			mes "休憩時間ぐらいあるわ。";
			break;
		}
		emotion 3;
		mes "[シイデ]";
		mes "え！　本当ですか？";
		mes "親切な方ですね。";
		mes "それじゃあちょっとだけ";
		mes "お願いしちゃおうかな。";
		next;
		switch(rand(3)) {
		case 0:
			mes "[シイデ]";
			mes "ホルアゾさんの誕生日祝いに";
			mes "^3131FFきのこクッキー^000000を";
			mes "焼こうと思ってたんだけど、";
			mes "そのきのこが";
			mes "切れているのよ。";
			next;
			cutin "siide2.bmp",2;
			mes "[シイデ]";
			mes "普通のきのこじゃダメなの。";
			mes "フィゲルの近くで育つ";
			mes "^3131FF「モクスきのこ」^000000なら";
			mes "きのこクッキーにピッタリ！";
			next;
			mes "[シイデ]";
			mes "フィゲル付近に生えている";
			mes "^3131FF「モクスきのこ」^000000から";
			mes "^3131FF「モクスきのこ水溶液」^000000を5個";
			mes "集めてきてもらえますか？";
			set HU_9QUE,1;
			break;
		case 1:
			mes "[シイデ]";
			mes "実は……アゼトと私は";
			mes "クッキーマスターの座を";
			mes "競い合ってるの。";
			next;
			mes "[シイデ]";
			mes "最高級クッキーの世界は別世界。";
			mes "最高の材料、最高の料理道具があれば";
			mes "誰が作っても最高になるというわけでは";
			mes "ないの。";
			next;
			mes "[シイデ]";
			mes "最高の腕前、そこに最高の感覚が";
			mes "ぴったりと調和した時、";
			mes "最高級クッキーが誕生するの。";
			next;
			cutin "siide2.bmp",2;
			mes "[シイデ]";
			mes "私のクッキーの味は最高だと";
			mes "自信をもって言えるわ！";
			mes "でも、彼女もプロ。";
			next;
			mes "[シイデ]";
			mes "最高のクッキーメーカーと自負する";
			mes "彼女の名前を聞くと、";
			mes "どうしても不安に……";
			next;
			mes "[シイデ]";
			mes "でも、私が作ったクッキーは";
			mes "彼女にだけは絶対に負けるなと";
			mes "叫んでいるわ！";
			mes "聞こえる？";
			mes "私の中から込み上げる";
			mes "クッキーファイターの雄叫びが！";
			next;
			mes "[シイデ]";
			mes "数日後、彼女と最高の場で";
			mes "対峙することになってるの！";
			mes "その日のため、絶え間ない";
			mes "研究と挑戦をすることが最善！";
			next;
			mes "[シイデ]";
			mes "多くの困難があるけど、";
			mes "私は挫折なんてしない！";
			mes "今回、私は^FF0000クッキー^000000";
			mes "で彼女に挑むつもり。";
			mes "ぴりっと刺す味と";
			mes "未体験な食感がポイント！";
			next;
			mes "[シイデ]";
			mes "村の海辺に行けば";
			mes "貝がすぐ見つかるはずよ。";
			mes "その貝から^3131FF貝肉^000000を";
			mes "取ってきてもらえますか？";
			mes "だいたい、5個位かしら。";
			set HU_9QUE,7;
			break;
		case 2:
			mes "[シイデ]";
			mes "実は……あの……";
			mes "私には気になる男性が……";
			mes "いつも親切で優しいあの人に……";
			mes "私の気持ちを受け取ってもらいたい！";
			next;
			cutin "siide2.bmp",2;
			mes "[シイデ]";
			mes "そう……あの方に、";
			mes "私の真心のこもった";
			mes "^3131FF魔性のクッキー^000000を!!";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "魔性のクッキー？";
			next;
			cutin "siide1.bmp",2;
			mes "[シイデ]";
			mes "そう。";
			mes "フィゲルの外にある茂みに、";
			mes "産卵期を控えた^3131FF「モクス虫」^000000";
			mes "が隠れているわ。";
			mes "今がぴったりの旬！";
			next;
			mes "[シイデ]";
			mes "そのモクス虫の皮を煮こんで、";
			mes "クッキー生地に混ぜれば、";
			mes "サクサククッキーの完成！";
			next;
			cutin "siide2.bmp",2;
			mes "[シイデ]";
			mes "食べた人はめまいに襲われる";
			mes "魔力の篭ったクッキー。";
			mes "それを彼に食べさせて……";
			next;
			cutin "siide1.bmp",2;
			mes "[シイデ]";
			mes "手伝ってくださるんですよね？";
			mes "モクス虫の皮を5個。";
			mes "よろしくお願いします。";
			next;
			emotion 9,"";
			mes "[" +strcharinfo(0)+ "]";
			mes "-………………-";
			set HU_9QUE,13;
			break;
		}
		break;
	case 1:
	case 2:
	case 3:
	case 4:
	case 5:
		mes "[シイデ]";
		mes "フィゲル付近で育っている";
		mes "^3131FF「モクスきのこ」^000000から";
		mes "^3131FF「モクスきのこ水溶液」^000000を";
		mes "5個集めてきてくださる？";
		break;
	case 6:
		emotion 18;
		mes "[シイデ]";
		mes "お疲れさまです。";
		mes "このモクスきのこで、";
		mes "おじさんに最高のクッキーを";
		mes "作ってあげれられるわ！";
		mes "本当にありがとう。";
		set HU_9QUE,19;
		break;
	case 7:
	case 8:
	case 9:
	case 10:
	case 11:
		mes "[シイデ]";
		mes "海辺にいる貝から";
		mes "^3131FF「貝肉」^000000を";
		mes "5個集めてきてくださる？";
		break;
	case 12:
		emotion 18;
		mes "[シイデ]";
		mes "お疲れさまです。";
		mes "この活きのいい貝で、";
		mes "彼女に負けない必殺クッキーを";
		mes "作る事ができるわ！";
		mes "本当にありがとう。";
		set HU_9QUE,19;
		break;
	case 13:
	case 14:
	case 15:
	case 16:
	case 17:
		mes "[シイデ]";
		mes "外にいるモクス虫から";
		mes "^3131FF「皮」^000000を5個集めてきてくださる？";
		break;
	case 18:
		emotion 18;
		mes "[シイデ]";
		mes "お疲れさまです。";
		mes "このモクス虫の皮を煮こんで";
		mes "作った最高級クッキーなら、";
		mes "あの方も私に……";
		mes "本当にありがとう。";
		next;
		emotion 9,"";
		mes "[" +strcharinfo(0)+ "]";
		mes "-材料が何かわかったら";
		mes "間違いなく顔は覚えるな……-";
		set HU_9QUE,19;
		break;
	case 19:
		if(LHZ_2QUE < 21 || LHZ_4QUE < 39) {
			mes "[シイデ]";
			mes "フィゲルはどうですか？";
			mes "気に入ってもらえましたか？";
			break;
		}
		mes "[シイデ]";
		mes "あの、";
		mes "ヘリコさんを知ってますか？";
		mes "フィゲル旅館に泊まっている";
		mes "ご年配の方です。";
		next;
		mes "[シイデ]";
		mes "見ていてなんだか寂しそうなので、";
		mes "時間があったら、";
		mes "話相手になってあげてください。";
		set HU_9QUE,20;
		break;
	case 20:
		mes "[シイデ]";
		mes "ヘリコさんは体の調子が悪くて";
		mes "あまり歩けないんです。";
		mes "見ていてなんだか寂しそうなので、";
		mes "時間があったら、";
		mes "話相手になってあげてください。";
		break;
	default:
		mes "[シイデ]";
		mes "フィゲルはどうですか？";
		mes "気に入ってもらえましたか？";
		break;
	}
	close2;
	cutin "siide1.bmp",255;
	end;
}

hu_fild06.gat,168,359,0	script	モクスきのこ#hu1	111,{
	if(HU_9QUE < 1 || HU_9QUE > 6)
		end;
	if(HU_9QUE == 6) {
		mes "[" +strcharinfo(0)+ "]";
		mes "-これだけあれば十分だ-";
		close;
	}
	mes "-大きいきのこを見つけた-";
	next;
	if(select("きのこを取る","そのままにしておく")==2) {
		mes "-あなたは何もしなかった-";
		close;
	}
	mes "-あなたはきのこを取り始めた-";
	next;
	misceffect 71,"";
	mes "-ぐいっぐいっぐいっぐい-";
	next;
	if(rand(5) == 0) {
		misceffect 194,"";
		mes "-きのこが折れてしまった-";
		mes "-これでは使えそうも無い-";
		close;
	}
	misceffect 364,"";
	set HU_9QUE,HU_9QUE+1;
	mes "-綺麗にきのこが取れた-";
	mes "-モクスきのこ水溶液の数：" +(HU_9QUE - 7)+ "個-";
	initnpctimer;
	hideonnpc;
	close;
OnTimer20000:
	hideoffnpc;
	stopnpctimer;
	end;
}
hu_fild06.gat,194,341,0	duplicate(モクスきのこ#hu1)	モクスきのこ#hu2	111
hu_fild06.gat,198,339,0	duplicate(モクスきのこ#hu1)	モクスきのこ#hu3	111

hugel.gat,209,163,0	script	貝#hu1	111,{
	if(HU_9QUE < 7 || HU_9QUE > 12)
		end;
	if(HU_9QUE == 12) {
		mes "[" +strcharinfo(0)+ "]";
		mes "-これだけあれば十分だ-";
		close;
	}
	mes "-日の光が反射して、";
	mes "綺麗に殻が輝いている-";
	mes "-貝の活きはよさそうだ-";
	next;
	if(select("貝を開ける","そのままにしておく")==2) {
		mes "-あなたは何もしなかった-";
		close;
	}
	mes "-あなたはむきみを取り出すため、";
	mes "貝を開け始めた-";
	next;
	misceffect 71,"";
	mes "-ぐっグッぐっグッ-";
	next;
	if(rand(5) == 0) {
		misceffect 194,"";
		mes "-どうやっても貝が開かない-";
		close;
	}
	misceffect 364,"";
	set HU_9QUE,HU_9QUE+1;
	mes "-貝のむきみを手に入れた-";
	mes "-むきみの数：" +(HU_9QUE - 1)+ "個-";
	initnpctimer;
	hideonnpc;
	close;
OnTimer20000:
	hideoffnpc;
	stopnpctimer;
	end;
}
hugel.gat,203,166,0	duplicate(貝#hu1)	貝#hu2	111
hugel.gat,217,158,0	duplicate(貝#hu1)	貝#hu3	111
hugel.gat,204,150,0	duplicate(貝#hu1)	貝#hu4	111

hu_fild06.gat,155,309,1	script	モクス虫#hu1	1053,2,2,{
OnTouch:
	if(HU_9QUE < 13 || HU_9QUE > 18)
		end;
	if(HU_9QUE == 18) {
		mes "[" +strcharinfo(0)+ "]";
		mes "-これ以上、虫なんか触りたくない！-";
		close;
	}
	mes "-茂みの中を調べると、";
	mes "淡くて茶色の体をした";
	mes "大きなモクス虫がいた-";
	next;
	if(select("皮を取る","そのままにしておく")==2) {
		mes "-あなたは何もしなかった-";
		close;
	}
	mes "-あなたはモクス虫に手を伸ばした-";
	next;
	mes "-………………-";
	next;
	mes "-………………………………-";
	next;
	misceffect 71,"";
	mes "-○×△□○×△□○×△□-";
	next;
	if(rand(5) == 0) {
		misceffect 194,"";
		mes "-虫に逃げられた-";
		close;
	}
	misceffect 364,"";
	set HU_9QUE,HU_9QUE+1;
	mes "-虫の皮を手に入れた-";
	mes "-モクス虫の皮の数：" +(HU_9QUE - 13)+ "個-";
	initnpctimer;
	hideonnpc;
	close;
OnTimer20000:
	hideoffnpc;
	stopnpctimer;
	end;
}
hu_fild06.gat,218,320,1	duplicate(モクス虫#hu1)	モクス虫#hu2	1053,2,2
hu_fild06.gat,249,329,1	duplicate(モクス虫#hu1)	モクス虫#hu3	1053,2,2
hu_fild06.gat,218,373,1	duplicate(モクス虫#hu1)	モクス虫#hu4	1053,2,2

hu_in01.gat,256,40,3	script	ヘリコ	897,{
	cutin "heri1",2;
	switch(HU_9QUE) {
	default:
		mes "[ヘリコ]";
		mes "天気が良いというのに、";
		mes "体が痛く、まともに動けん……";
		close;
	case 20:
		mes "[ヘリコ]";
		mes "天気が良いというのに、";
		mes "体が痛く、まともに動けん……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "こんにちは。";
		next;
		mes "[ヘリコ]";
		mes "む、シイデか？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "シイデさんの紹介で来ました。";
		mes "^3131FF" +strcharinfo(0)+ "^000000";
		mes "と言います。";
		next;
		mes "[ヘリコ]";
		mes "飛行船停泊場ができたと聞いたが、";
		mes "異邦人か？";
		mes "……ふむ、なかなか面白そうな奴だ。";
		next;
		mes "[ヘリコ]";
		mes "お主、";
		mes "フィゲルの事をどう思った？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "静かで平和です。";
		mes "今は少しは騒がしいですが、";
		mes "みんな幸せそうに見えます。";
		mes "シュバルツバルドの中でも";
		mes "他の街の人とは全然違う顔をしていて、";
		mes "まるで別の世界へ来たようです。";
		next;
		mes "[ヘリコ]";
		mes "人は誰もが懸念、不安、喜び、";
		mes "幸せと共に生きているものだ。";
		mes "恐らく、お主はこの国に隠された";
		mes "真の顔を見ていないと思うが……";
		mes "どうなのだ？";
		mes "本当の、自分自身の考えは？";
		next;
		switch(select("聞き返す","よくわからないです","違います")) {
		case 1:
			cutin "heri2",2;
			mes "[ヘリコ]";
			mes "ほぅ……";
			mes "このおいぼれの考えが聞きたいか。";
			mes "そうじゃな……";
			mes "人の目は多くのメッセージを";
			mes "語っておる。";
			next;
			cutin "heri1",2;
			mes "[ヘリコ]";
			mes "お主の目を見てもわかる。";
			mes "今まで見てきたものと";
			mes "あまりにも違うフィゲルの姿に";
			mes "感嘆と驚愕を抱いておるよ。";
			next;
			mes "[ヘリコ]";
			mes "フィゲルは誰も何も問わず。";
			mes "それはこの村の暗黙の了解じゃ。";
			mes "そのおかげで、ワシはこの村で";
			mes "この年まで静かに暮らす事ができた。";
			next;
			mes "[ヘリコ]";
			mes "しかし、お主を見ると、";
			mes "黙っていたワシの記憶が";
			mes "もう一度振り返れと言っておる。";
			mes "どうだ、ワシの過去を知る気はないか？";
			next;
			mes "[ヘリコ]";
			mes "恐らく、ワシらは";
			mes "互いの話を通じて";
			mes "自らの結論に";
			mes "終止符を打てるはずだ。";
			set HU_9QUE,21;
			break;
		case 2:
			mes "[ヘリコ]";
			mes "よくわからないという事は、";
			mes "まだこのフィゲルから";
			mes "何も得ていないということだ。";
			mes "ハッハッハ。";
			mes "もっと色々と見て回るがいい。";
			break;
		case 3:
			mes "[ヘリコ]";
			mes "そうか。";
			mes "どうやらこのおいぼれの感覚も";
			mes "すっかり錆び付いて";
			mes "しまったようだな。";
			mes "ハッハッハ。";
			break;
		}
		break;
	case 21:
		mes "[ヘリコ]";
		mes "その気があるようじゃな……";
		mes "ふむ。";
		mes "お主の名前は何といったかな？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "お忘れですか？";
		mes "^3131FF" +strcharinfo(0)+ "^000000";
		mes "と言います。";
		next;
		mes "[ヘリコ]";
		mes "おぉ、そうだったな。";
		mes "^3131FF" +strcharinfo(0)+ "^000000。";
		mes "ワシの話にはお主の興味を引くものが";
		mes "多いと思う。だが、その前に";
		mes "一つ頼みたいことがある。";
		mes "よいか？";
		next;
		mes "[ヘリコ]";
		mes "お前も知っての通り、";
		mes "フィゲルに空港ができた事で、";
		mes "多くの人が行き交っておる。";
		next;
		mes "[ヘリコ]";
		mes "だが、ワシの考えでは";
		mes "飛行船はシュバルツバルドの";
		mes "交通拡張のためだけではない。";
		next;
		mes "[ヘリコ]";
		mes "空港が出来て以来、";
		mes "島に行く人が増えたそうだ。";
		mes "何か臭わぬか？";
		next;
		mes "[ヘリコ]";
		mes "お主がワシのために";
		mes "働いてくれると信じておる。";
		mes "飛行船とあの島の関連を";
		mes "調べてくるのだ。";
		set HU_9QUE,22;
		break;
	case 22:
		if(HU_8QUE < 21) {
			mes "[ヘリコ]";
			mes "お主がワシのために";
			mes "働いてくれると信じておる。";
			mes "飛行船とあの島の関連を";
			mes "調べてくるのだ。";
			break;
		}
		mes "[ヘリコ]";
		mes "どうやら何か掴んだようだな。";
		mes "お主がワシにどんな話を聞かせるか";
		mes "期待しておる。";
		next;
		mes "-あなたはオーディン神殿で";
		mes "見て、聞いてきた事を";
		mes "ヘリコに話した-";
		mes "-ギガンテス、ユミルの心臓、";
		mes "レッケンベル……-";
		next;
		cutin "heri3",2;
		mes "[ヘリコ]";
		mes "レッケンベル……";
		mes "レッケンベルがついに";
		mes "このフィゲルに手を伸ばしおったか。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "何か知っているんですか？";
		next;
		mes "[ヘリコ]";
		mes "………………";
		next;
		cutin "heri1",2;
		mes "[ヘリコ]";
		mes "まずは礼をいおう。";
		mes "よく調べてくれた。";
		mes "だが、それ故に";
		mes "困難な道が開けたようだ……";
		next;
		mes "[ヘリコ]";
		mes "次はワシの番だな……";
		mes "心の準備はよいか？";
		set HU_9QUE,23;
		break;
	case 23:
		mes "[ヘリコ]";
		mes "さて……";
		mes "何から話せばよいか。";
		next;
		mes "[ヘリコ]";
		mes "お主も知っての通り、";
		mes "今の世界には^FF0000ガーディアン^000000という";
		mes "生体機械がある。";
		mes "ガーディアンで重要施設を保護し、";
		mes "無意味な殺生を避ける。";
		mes "これが一般常識だ。";
		next;
		mes "[ヘリコ]";
		mes "ならば、";
		mes "そのガーディアンが開発される前は";
		mes "どうやってその重要施設を";
		mes "守ってきた？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……人の手で守っていました。";
		next;
		mes "[ヘリコ]";
		mes "その通りだ。";
		mes "シュバルツバルドは長い間、";
		mes "^3131FF「傭兵」^000000を雇っていた。";
		mes "彼らは高い報酬と命を交換し、";
		mes "一般人では手に負えないような";
		mes "仕事を請け負っていた。";
		next;
		mes "[ヘリコ]";
		mes "しかし、レッケンベルが";
		mes "ガーディアンを開発した為、";
		mes "彼らは働く所を失ってしまった。";
		mes "人間のために作られた物が";
		mes "人間を苦しめてしまった。";
		next;
		mes "[ヘリコ]";
		mes "職を失った傭兵たちは、";
		mes "^FF0000「傭兵反乱」^000000と言う";
		mes "大規模な活動を行った。";
		next;
		mes "[ヘリコ]";
		mes "しかし、彼らは";
		mes "生存権を主張するだけではなく、";
		mes "^3131FF暴力的な方法^000000を使うという";
		mes "間違いを犯したのだ。";
		next;
		mes "[ヘリコ]";
		mes "それにより、残っていた傭兵さえもが";
		mes "シュバルツバルド国民の信頼を";
		mes "完全に失ってしまい、";
		mes "結果、傭兵はいなくなってしまった。";
		next;
		cutin "heri3",2;
		mes "[ヘリコ]";
		mes "その時！";
		mes "国家の宝とも言える";
		mes "^FF0000バルムント先生^000000が";
		mes "ガーディアンと傭兵の争いに";
		mes "巻き込まれ、どこかへ";
		mes "消えてしまったのだ！";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "！";
		mes "バルムント!?";
		next;
		cutin "heri1",2;
		mes "[ヘリコ]";
		mes "……すまんの。";
		mes "少し興奮したようだ。";
		next;
		mes "[ヘリコ]";
		mes "実は、";
		mes "バルムント先生とガーディアンは";
		mes "深い関係がある。";
		mes "ガーディアンの一番重要な動力部は";
		mes "バルムント先生が作り出した物。";
		next;
		mes "[ヘリコ]";
		mes "職を失った傭兵たちが腹いせに";
		mes "ガーディアンの親と言える";
		mes "バルムント先生を襲ったのも";
		mes "わかる話ではある……";
		mes "不条理な話だが、彼らにも";
		mes "生活がかかった問題じゃ……";
		next;
		mes "[ヘリコ]";
		mes "ワシは傭兵反乱の話を聞いた時、";
		mes "リヒタルゼンを離れていた……";
		mes "戻ったのは事件が終わった後。";
		mes "ワシは何もできんかった。";
		mes "先生もいなくなり……";
		mes "ワシは全てを捨ててフィゲルにきた。";
		next;
		mes "[ヘリコ]";
		mes "あの時、バルムント先生の";
		mes "研究所の資料を探してみたが、";
		mes "その一片たりとも見つからな……";
		next;
		mes "[ヘリコ]";
		mes "む？　ちょっと待て。";
		mes "そういえば、先生の研究資料は";
		mes "どこに行ったというのだ！";
		next;
		mes "[ヘリコ]";
		mes "まさか生き残った傭兵たちが";
		mes "隠し持っていたり、";
		mes "破棄したというのか？";
		mes "あの大量の研究資料を？";
		mes "そんなバカな！";
		next;
		mes "[ヘリコ]";
		mes "あの日から";
		mes "長い年月が経過しておるが、";
		mes "今になって疑問がでてきおったわ。";
		next;
		mes "[ヘリコ]";
		mes strcharinfo(0)+ "！";
		mes "お主にもわかるな？";
		mes "随分昔の事ではあるが、";
		mes "これはとても重要な事だ。";
		next;
		mes "[ヘリコ]";
		mes "昔、傭兵反乱について";
		mes "大きく取り上げた記事があった。";
		mes "つまり、その事件を担当した記者が";
		mes "一人はいるはず！";
		next;
		mes "[ヘリコ]";
		mes "リヒタルゼンで傭兵反乱を";
		mes "調べた記者を探し出し、";
		mes "まだ生きている傭兵の居所を";
		mes "聞きだすのだ！";
		mes "そして、バルムント先生と";
		mes "研究資料の行方を掴むのだ！";
		set HU_9QUE,24;
		break;
	case 24:
		mes "[ヘリコ]";
		mes "リヒタルゼンで傭兵反乱を";
		mes "調べた記者を探し出し、";
		mes "まだ生きている傭兵の居所を";
		mes "聞きだすのだ！";
		mes "そして、バルムント先生と";
		mes "研究資料の行方を掴むのだ！";
		break;
	case 25:
	case 26:
	case 27:
		mes "[ヘリコ]";
		mes "どうだ？";
		mes "何か掴めたか？";
		break;
	case 28:
		mes "[ヘリコ]";
		mes "バルムント先生の資料は";
		mes "どうなったかわかったか？";
		next;
		cutin "heri1",255;
		mes "[" +strcharinfo(0)+ "]";
		mes "資料は";
		if(select("私が食べてしまいました","レッケンベルが回収したという")==1) {
			mes "私が食べてしまいました";
			next;
			mes "[ヘリコ]";
			mes "ハハハ。";
			mes "冗談を言うでない。";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "冗談ではありません。";
			next;
			mes "[ヘリコ]";
			mes "………………………………";
			next;
			misceffect 3,"";
			percentheal -5,0;
			mes "[ヘリコ]";
			mes "吐け!!";
			next;
			misceffect 3,"";
			percentheal -5,0;
			mes "[ヘリコ]";
			mes "吐くのだ!!";
			next;
			misceffect 3,"";
			percentheal -5,0;
			mes "[ヘリコ]";
			mes "吐けーーーーー!!";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "ご、ごほ……";
			mes "じょ、冗談です……";
			next;
			cutin "heri2",2;
			emotion 9;
			emotion 28,"";
			mes "[ヘリコ]";
			mes "……ハハハ。";
			mes "年寄りを驚かせるでない。";
			next;
			mes "[ヘリコ]";
			mes "っで……";
			mes "資料はどこにあるのだ？";
			next;
			mes "[" +strcharinfo(0)+ "]";
		}
		mes "レッケンベルが全て";
		mes "回収したそうです。";
		next;
		cutin "heri3",2;
		mes "[ヘリコ]";
		mes "…………………………";
		next;
		cutin "heri1",2;
		mes "[ヘリコ]";
		mes "そうか……やはり……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……何か知っているんですね。";
		next;
		emotion 23,"";
		mes "[ヘリコ]";
		mes "……ワシはバルムント先生と同じ";
		mes "^3131FFレゲンシュルム";
		mes "擬似ユミルの心臓研究室所属^000000。";
		mes "……今はただ平凡な日々を過ごし、";
		mes "息絶える日を待つだけ。";
		next;
		cutin "heri2",2;
		mes "[ヘリコ]";
		mes "ふ。";
		mes "驚くのも無理はない。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "では、ヘリコさんが";
		mes "擬似ユミルの心臓を";
		mes "発明したんですか!?";
		next;
		cutin "heri1",2;
		mes "[ヘリコ]";
		mes "いや……ワシは";
		mes "バルムント先生の助手のようなもの。";
		mes "ワシが作ったとは言えん。";
		next;
		mes "[ヘリコ]";
		mes "レッケンベルは";
		mes "^FF0000ユミルの心臓の欠片^000000を";
		mes "秘密裏に入手しておる。";
		mes "奴らはそれに対し、";
		mes "すごい執着心を見せておったわ。";
		mes "恐らく、その力に魅かれたのじゃ。";
		next;
		mes "[ヘリコ]";
		mes "しかし、その力を人間の手で";
		mes "制御するのは極めて難しい。";
		mes "エネルギーとして利用するのは";
		mes "無理があったのだ。";
		mes "そこで開発されたのが";
		mes "^3131FF擬似ユミルの心臓の欠片^000000だ。";
		next;
		mes "[ヘリコ]";
		mes "バルムント先生とワシら研究員は、";
		mes "人間世界に革命を呼び込むため、";
		mes "長い年月をかけて";
		mes "研究を繰り返した。";
		next;
		mes "[ヘリコ]";
		mes "その結果、";
		mes "擬似ユミルの心臓は完成した。";
		mes "それによって、頭の中で想像していた";
		mes "夢が次々と実現されていった。";
		mes "その一つがガーディアンだ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "しかし、バルムントさんは";
		mes "ガーディアンの軍事理由に反対し、";
		mes "傭兵に味方したと聞きましたが。";
		next;
		mes "-あなたは、自分が知っている";
		mes "傭兵反乱の事について";
		mes "ヘリコに話した-";
		next;
		mes "[ヘリコ]";
		mes "ふむ……";
		mes "そうか……";
		next;
		mes "[ヘリコ]";
		mes "擬似ユミルの心臓が完成した後、";
		mes "バルムント先生はどこか";
		mes "悲しそうな顔をしておられた。";
		next;
		mes "[ヘリコ]";
		mes "結局、先生は";
		mes "^3131FF自分がこのレゲンシュルムで";
		mes "研究を続けていると、";
		mes "皆を不幸にさせる^000000という";
		mes "メッセージを残して研究所を去った。";
		next;
		mes "[ヘリコ]";
		mes "あの方は立派だった。";
		mes "技術、人間性……";
		mes "その全てにおいてな。";
		next;
		mes "[ヘリコ]";
		mes "案の定、バルムント先生が";
		mes "レゲンシュルムを去ると、";
		mes "すべての研究が";
		mes "進まなくなった。";
		next;
		mes "[ヘリコ]";
		mes "凍結されたプロジェクトも";
		mes "一つや二つではなかったはずだ。";
		next;
		cutin "heri3",2;
		mes "[ヘリコ]";
		mes "レゲンシュルムの上層部は";
		mes "次第に苛立ってきたのか、";
		mes "^FF0000どんな手を使ってでも成果をあげろ^000000";
		mes "と言ってきおったわ。";
		mes "実験体なら何をしても構わんと";
		mes "いうことだ。";
		next;
		cutin "heri1",2;
		mes "[ヘリコ]";
		mes "………………";
		mes "それが、ワシもレゲンシュルムを";
		mes "去った理由だ。";
		next;
		mes "[ヘリコ]";
		mes "レッケンベルは、";
		mes "自分たちの欲望のためなら";
		mes "何でもする集団だ。";
		mes "だが、それ故に";
		mes "巨大な力と権力を持った。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "それで、バルムント先生の";
		mes "穴を埋めるための";
		mes "「生体研究所」ですね。";
		next;
		cutin "heri3",2;
		mes "[ヘリコ]";
		mes "なに？　生体研究所だと!?";
		mes "そんなことまでしておったか！";
		mes "奴らは一体どこまで";
		mes "身勝手な行動をするつもりだ！";
		next;
		mes "[ヘリコ]";
		mes "科学は人間のためにあるのだ。";
		mes "人間を害するためではない！";
		mes "生体研究なぞ許されん行為！";
		mes "……このまま見逃すわけにはいかん。";
		mes "…………こうなったら……";
		set HU_9QUE,29;
		break;
	case 29:
		mes "[ヘリコ]";
		mes "……ワシが今、";
		mes "何を思いついたか知りたいようだな。";
		next;
		mes "[ヘリコ]";
		mes "もし、";
		mes "^3131FFレゲンシュルムが崩壊^000000";
		mes "したら、どうなると思う？";
		next;
		mes "[ヘリコ]";
		mes "認めたくはないが……";
		mes "レッケンベルは";
		mes "シュバルツバルドそのもの";
		mes "と言える程、巨大な企業。";
		mes "レッケンベルが壊滅したら、";
		mes "それは国家の崩壊に繋がる。";
		next;
		mes "[ヘリコ]";
		mes "だが、しかし！";
		mes "「レゲンシュルム」は";
		mes "奴らの秘密研究所として";
		mes "機能しておる。";
		mes "ワシは、奴らの非人間的な";
		mes "研究を阻止したいのだ。";
		next;
		mes "[ヘリコ]";
		mes "……だがな。";
		mes "ワシにはそんな力、";
		mes "とうに残っておらぬ。";
		next;
		mes "[ヘリコ]";
		mes "お主、お主だけが頼りだ。";
		mes "頼む！";
		mes "ワシを手伝ってくれ！";
		next;
		if(select("手伝わない","手伝う")==1) {
			mes "[ヘリコ]";
			mes "確かに、これからは";
			mes "危険と隣り合わせとなるだろう。";
			mes "今までの事、感謝しておる。";
			mes "だが、もし心変わりしたなら";
			mes "また来るがよい。";
			break;
		}
		cutin "heri2",2;
		mes "[ヘリコ]";
		mes "お主の正義への意思、";
		mes "確かに聞いた。";
		mes "お主の目も同じ事を言っておる。";
		next;
		mes "[ヘリコ]";
		mes "これからワシらがする事、";
		mes "とても容易な事ではない。";
		mes "まず、心の準備をしておくがよい。";
		set HU_9QUE,30;
		break;
	case 30:
		mes "[ヘリコ]";
		mes "よいか。";
		mes "ワシらはまず、奴らの";
		mes "手足を効果的に";
		mes "縛りつけなければならない。";
		next;
		mes "[ヘリコ]";
		mes "レゲンシュルムは古い研究所だ。";
		mes "つまり、蓄積された情報と知識も";
		mes "生半可な量ではない。";
		mes "もし、奴らが保管している";
		mes "資料が消えてしまえば、";
		mes "奴らの研究は止まるはずだ。";
		next;
		mes "[ヘリコ]";
		mes "リヒタルゼン本社の地下に";
		mes "レゲンシュルムがある。";
		mes "奴らの腐った心そのもの。";
		mes "そこに忍び込み、";
		mes "^FF0000奴らの研究資料を盗む^000000のだ。";
		set HU_9QUE,31;
		break;
	case 31:
		mes "[ヘリコ]";
		mes "リヒタルゼン本社の地下に";
		mes "レゲンシュルムがある。";
		mes "そこに忍び込み、";
		mes "奴らの研究資料を盗むのだ。";
		break;
	case 32:
		mes "[ヘリコ]";
		mes "どうだ、うまくいったか？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "警備に見つかってしまいましたが、";
		mes "なんとかなりました。";
		next;
		mes "[ヘリコ]";
		mes "それはご苦労であった。";
		mes "研究資料が無ければ";
		mes "奴らも研究を続けてはいられぬ。";
		next;
		mes "[ヘリコ]";
		mes "よし、次の行動だが……";
		mes "今度は今まで以上に";
		mes "難しい事やもしれぬ。";
		next;
		mes "[ヘリコ]";
		mes "ワシはレゲンシュルムで";
		mes "一番危険なのは生体研究所";
		mes "だと思っておる。";
		next;
		mes "[ヘリコ]";
		mes "あのような非人道的で悪魔の所業、";
		mes "見逃すわけにはいかん！";
		mes "奴らが科学発展という名目で、";
		mes "今までしてきたことを考えると……";
		next;
		mes "[ヘリコ]";
		mes "お主が持って来た研究資料によると、";
		mes "生体研究所は3層構成になっておる。";
		mes "その2層目が中心部のようだ。";
		mes "直接、実験を行っていた場所らしい。";
		next;
		mes "[ヘリコ]";
		mes "採鉱の村、^3131FFアインベフ^000000には";
		mes "マインボトルを作ることができる";
		mes "鉱夫がおる。";
		mes "発掘作業にはどうしても";
		mes "必要な物じゃ。";
		next;
		mes "[ヘリコ]";
		mes "ふふ……";
		mes "お主、ワシの言葉を待っておるな？";
		next;
		mes "[ヘリコ]";
		mes "アインベフにいる";
		mes "^3131FFマインボトル業者^000000に会い、";
		mes "マインボトルを得る。";
		mes "その後、生体研究所2層にある";
		mes "^3131FF生体実験器機を爆破^000000するのだ！";
		next;
		mes "[ヘリコ]";
		mes "これはとても危険な事だ。";
		mes "だが、それ以上に重要な事だ。";
		mes "お主の手に全てがかかっておる。";
		mes "これ以上の生体研究を阻止するのだ！";
		set HU_9QUE,33;
		delitem 7342,1;
		break;
	case 33:
		mes "[ヘリコ]";
		mes "アインベフにいる";
		mes "^3131FFマインボトル業者^000000に会い、";
		mes "マインボトルを得る。";
		mes "その後、生体研究所2層にある";
		mes "^3131FF生体実験器機を爆破^000000するのだ！";
		mes "お主にしかできん仕事だ。";
		next;
		mes "[ヘリコ]";
		mes "もし他のマインボトルの製造が";
		mes "可能な者がいるなら、";
		mes "そやつの物を使っても構わぬぞ。";
		break;
	case 34:
		mes "[" +strcharinfo(0)+ "]";
		mes "機械の爆破に成功しました！";
		next;
		cutin "heri2",2;
		mes "[ヘリコ]";
		mes "よし！　よくやった！";
		next;
		mes "[ヘリコ]";
		mes "今まで奴らは数え切れぬ程の";
		mes "悪事を働いてきおったが、";
		mes "これで奴らの活動を";
		mes "止める事ができる。";
		mes "誇るがよい。";
		mes "全てお主の手柄だ。";
		next;
		cutin "heri1",2;
		mes "[ヘリコ]";
		mes "しかし、まだ生体研究所には";
		mes "ガーディアンが残っておる。";
		mes "研究資料によると";
		mes "ガーディアンは^3131FF囚人の腕輪^000000";
		mes "を着けているようだ。";
		mes "これについて調べねばなるまい。";
		next;
		mes "[ヘリコ]";
		mes "この囚人の腕輪を持ってきたら";
		mes "何かと交換しようではないか。";
		next;
		mes "[ヘリコ]";
		mes "それにしても……";
		mes "ワシらがいくら奴らの行動を";
		mes "縛りつけたとしても、";
		mes "いつまでも状況は変わるまい。";
		mes "もっと大きな力、協力者が";
		mes "ワシらには必要だ。";
		next;
		mes "[ヘリコ]";
		mes "お主、何か心当たりは無いか？";
		next;
		input '@str$;
		if('@str$ != "大統領" && '@str$ != "ワイエルストラウス") {
			mes "[" +strcharinfo(0)+ "]";
			mes "……うーん…………";
			next;
			mes "[ヘリコ]";
			mes "心当たりは無いか？";
			mes "よく考えて見て欲しい。";
			break;
		}
		mes "[" +strcharinfo(0)+ "]";
		mes "ワイエルストラウス大統領……";
		mes "大統領なら私たちを";
		mes "助けてくれるでしょう。";
		next;
		mes "[ヘリコ]";
		mes "大統領か……";
		mes "今の共和国はレッケンベル自体と";
		mes "言ってもよい。";
		mes "すでに大統領には";
		mes "奴らの手が伸びているはずだ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "私が会った大統領は、";
		mes "レッケンベルと対抗しようと";
		mes "している方です。";
		mes "一度はレッケンベルに";
		mes "負けましたが、あの人はまだ";
		mes "諦めていません！";
		next;
		mes "[ヘリコ]";
		mes "そうか……";
		mes "よかろう、お主を信じよう。";
		mes "お主が持って来たこの書類を";
		mes "大統領に渡すのだ。";
		mes "後はその方に任せよう。";
		next;
		mes "[ヘリコ]";
		mes "今までよくがんばったな。";
		mes "心から礼を言おう。";
		set HU_9QUE,35;
		getitem 7342,1;
		break;
	case 35:
		mes "[ヘリコ]";
		mes "まだグズグズしておるのか？";
		mes "早くその書類を";
		mes "大統領に渡さぬか。";
		break;
	case 36:
		mes "[ヘリコ]";
		mes "お主か。";
		mes "元気でやっておるか？";
		next;
		if(select("囚人の腕輪を持って来ました","バルムントの資料に対して")==2) {
			mes "[ヘリコ]";
			mes "お主が持ってきた資料によると、";
			mes "バルムント先生の資料は";
			mes "暗号に変換されていたようだ。";
			mes "結局解読できない為、";
			mes "生体研究に手を出したようだ。";
			break;
		}
		mes "[ヘリコ]";
		mes "囚人の腕輪100個で";
		mes "レベル4の料理1個と";
		mes "交換しよう。";
		next;
		if(select("交換する","交換しない")==2)
			break;
		if(countitem(7345) < 100) {
			mes "[ヘリコ]";
			mes "数が足りないではないか。";
			break;
		}
		mes "[ヘリコ]";
		mes "よくこれだけの数を";
		mes "集めおったな。";
		delitem 7345,100;
		getitem 12044+(rand(6)*5),1;
		break;
	}
	close2;
	cutin "heri1",255;
	end;
}

lhz_in03.gat,39,44,3	script	エンキュロ・カスン	97,{
	if(HU_9QUE < 24) {
		mes "[エンキュロ・カスン]";
		mes "こんにちは！";
		mes "いつも素早いニュースを伝える、";
		mes "リヒトニュースの記者、";
		mes "エンキュロ・カスンです！";
		next;
		mes "[エンキュロ・カスン]";
		mes "人々は迅速で正確なニュースを";
		mes "願っています。";
		mes "そんな人々に感歎と驚愕を";
		mes "与えた瞬間が記者として";
		mes "とても嬉しい瞬間です。";
		close;
	}
	switch(HU_9QUE) {
	case 24:
		mes "[エンキュロ・カスン]";
		mes "こんにちは！";
		mes "いつも素早いニュースを伝える、";
		mes "リヒトニュースの記者、";
		mes "エンキュロ・カスンです！";
		next;
		mes "[エンキュロ・カスン]";
		mes "人々は迅速で正確なニュースを";
		mes "願っています。";
		mes "そんな人々に感歎と驚愕を";
		mes "与えた瞬間が記者として";
		mes "とても嬉しい瞬間です。";
		next;
		if(select("傭兵反乱について聞く","記者という職業について聞く")==2) {
			mes "[エンキュロ・カスン]";
			mes "…………";
			next;
			mes "-エンキュロ・カスンは";
			mes "あなたの全身をじっくりと見て、";
			mes "眉間をしかめた-";
			next;
			mes "[エンキュロ・カスン]";
			mes "まさか……その服で";
			mes "記者になりたいとでも";
			mes "言うのですか？";
			close;
		}
		mes "[エンキュロ・カスン]";
		mes "傭兵反乱ですか……";
		mes "ずいぶん前の事件ですね。";
		mes "ガーディアンの生産によって";
		mes "職を失った人たちが、";
		mes "暴力的手段で生存権を訴えた事件。";
		mes "結局、傭兵は制圧されました。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "傭兵反乱の後、生存している";
		mes "傭兵はいますか？";
		next;
		mes "[エンキュロ・カスン]";
		mes "そうですね……";
		mes "私が担当した事件ではないので……";
		mes "当時事件を担当した記者も";
		mes "ずいぶん前に引退をしてますし……";
		next;
		mes "[エンキュロ・カスン]";
		mes "ちょっと待っていてください。";
		mes "その人が残した資料を探してみます。";
		next;
		mes "-ガサゴソガサゴソ-";
		mes "-ゴソガサゴソガサ-";
		mes "-ガサガサゴソゴソ-";
		next;
		mes "[エンキュロ・カスン]";
		mes "あ！";
		mes "ありました！";
		next;
		mes "[エンキュロ・カスン]";
		mes "えーっと…………";
		mes "当時の事件を担当した";
		mes "バルパルン先輩の資料を見る限り、";
		mes "どうやら事件後も傭兵たちと";
		mes "接触をしていたようです。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "彼らの居場所はわかりますか？";
		next;
		mes "[エンキュロ・カスン]";
		mes "はい、それも資料に載っています。";
		mes "本人の承諾も得てあるそうなので、";
		mes "あなたに住所を教えても";
		mes "構いませんが……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……？";
		mes "何かあるんですか？";
		next;
		mes "[エンキュロ・カスン]";
		mes "…………んっふっふっふ。";
		mes "こういう言葉を知っていますか？";
		mes "と　う　か　こ　う　か　ん。";
		mes "「等価交換」";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "傭兵反乱の後、生存している";
		mes "傭兵はいますか？";
		next;
		mes "[エンキュロ・カスン]";
		mes "ルーンミッドガッツ王国のモロクに";
		mes "秘密の酒場があると聞きます。";
		mes "そこで売っているという飲み物を";
		mes "買ってきてください。";
		mes "……一度飲んでみたいんです。";
		mes "フフフ……";
		set HU_9QUE,25;
		close;
	case 25:
		if(countitem(12112) < 1 && countitem(12113) < 1) {
			mes "[エンキュロ・カスン]";
			mes "ルーンミッドガッツ王国のモロクに";
			mes "秘密の酒屋があると聞きました。";
			mes "そこで売っているという飲み物を";
			mes "買ってきてください。";
			mes "……一度飲んでみたいんです。";
			mes "フフフ……";
			close;
		}
		mes "[エンキュロ・カスン]";
		mes "これ、これね！";
		mes "これがあの噂の！";
		mes "……よし………………";
		mes "-ゴクン-";
		next;
		emotion 21;
		mes "[エンキュロ・カスン]";
		mes "ッッッッッッ!!!!";
		mes "キックゥゥゥゥ！";
		mes "噂に違わぬ素晴らしい味だわ！";
		mes "私の舌が、脳が、体が溶けそう！";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "………………";
		next;
		mes "[エンキュロ・カスン]";
		mes "……ぁ、ごめんなさい。";
		mes "そうそう、等価交換でしたね。";
		next;
		mes "[エンキュロ・カスン]";
		mes "えっと…………";
		mes "先輩が残した資料によると……";
		mes "この人が最後の傭兵みたい。";
		mes "^3131FFウィンチル・トゥロニ^000000さん。";
		next;
		mes "[エンキュロ・カスン]";
		mes "この人と最後に接触したのは";
		mes "シュバルツバルドの果て、";
		mes "^FF0000フィゲル^000000。";
		mes "なにこれ、すごい田舎じゃない。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "え!?";
		mes "フィゲル!?";
		next;
		mes "[エンキュロ・カスン]";
		mes "昔はフィゲルに行くには";
		mes "歩いて行くしかなかったけど、";
		mes "今ではシュバルツバルド国内を";
		mes "行き来する飛行船が開通しています。";
		next;
		mes "[エンキュロ・カスン]";
		mes "あなたは運がいいですね。";
		mes "先輩もフィゲルに行くのは辛く、";
		mes "そう何度も訪ねる事は";
		mes "できなかったようですが、";
		mes "あなたは飛行船に乗るだけで";
		mes "いいんですから。";
		next;
		emotion 29;
		mes "[エンキュロ・カスン]";
		mes "もし彼が死んでいたとしても、";
		mes "結婚しているので、";
		mes "子孫がいると思います。";
		mes "ですが……";
		mes "フィゲルにまだ住んでいるかは";
		mes "知りませんよ……フフフ。";
		set HU_9QUE,26;
		delitem 12112,1;
		delitem 12113,1;
		close;
	case 26:
		mes "[エンキュロ・カスン]";
		mes "飛行船でフィゲルに行って、";
		mes "^3131FFウィンチル・トゥロニ^000000を探すんですね？";
		mes "多分、彼の子孫がいると思います。";
		mes "フィゲルにまだ住んでいるかまでは";
		mes "知りませんが……";
		close;
	default:
		mes "[エンキュロ・カスン]";
		mes "実は……";
		mes "記者として恥ずかしい事ですが、";
		mes "私はすぐに地がでちゃいます。";
		mes "なんとかしないと……";
		close;
	}
}

hu_in01.gat,310,380,5	script	少女	891,{
	if(HU_9QUE < 26) {
		mes "[少女]";
		mes "退屈……";
		close;
	}
	switch(HU_9QUE) {
	case 26:
		mes "[少女]";
		mes "…………ぁ、お客さん……";
		mes "エヘヘ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "こんにちは可愛いお嬢ちゃん。";
		mes "「ウィンチル・トゥロニ」という";
		mes "大人の人は知らないかな？";
		next;
		mes "[少女]";
		mes "ウィンチル・トゥロニ";
		mes "っていう大人はいないよ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "へ？";
		next;
		mes "[少女]";
		mes "ウィンチル・トゥロニは私。";
		mes "私はまだ……大人じゃない。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……………………";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "^3131FF（神よ！）";
		mes "（今更私の記憶力でも試すのですか!?）";
		mes "（こんな小さな子が最後の傭兵？）";
		mes "（話にならない！）^000000";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "あの……お嬢ちゃん。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "お嬢ちゃんが最後の傭……";
		mes "あ、いや……";
		mes "もしかしてご両親に同じような";
		mes "名前の人はいないかな？";
		mes "お父さんとか。";
		next;
		mes "[ウィンチル・トゥロニ]";
		mes "この家に";
		mes "ウィンチル・トゥロニは私だけ。";
		mes "パパは……ずっといないの。";
		mes "ママはフィゲルの特産物を売りに";
		mes "フィゲルの外に行ってる。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "お父さんは……死んじゃったの？";
		next;
		mes "[ウィンチル・トゥロニ]";
		mes "……しょうがないよ。";
		mes "パパは年がすっごく多かった。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……お父さんが昔、";
		mes "何をしていたのかわかる？";
		next;
		mes "[ウィンチル・トゥロニ]";
		mes "パパは種を蒔いてたよ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "^3131FF（……傭兵じゃないし。）^000000";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "ところでお嬢ちゃん。";
		mes "普通は「種を蒔く」と言わないで、";
		mes "「畑を掘り起こす」って";
		mes "言わないかな？";
		next;
		mes "[ウィンチル・トゥロニ]";
		mes "^3131FF私のパパは腕が一つだけだから";
		mes "そんな大変な事はできなかったの。^000000";
		mes "だから、私がママと一緒に";
		mes "畑を掘り起こしていたの。";
		mes "よいしょ、えっころしょいって。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "（腕が一つ……）";
		mes "（負傷して傭兵を引退したのか!?）";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "うーん……お嬢ちゃん。";
		mes "もしよかったら、お父さんの";
		mes "写真や何か残した物を見れないかな？";
		next;
		mes "[ウィンチル・トゥロニ]";
		mes "ぶー、昔来たおじさんと同じ。";
		mes "そのおじさんも色々聞くだけ。";
		mes "つまんない。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "（リヒトニュースの記者か……）";
		next;
		mes "[ウィンチル・トゥロニ]";
		mes "私のパパはただのパパ。";
		mes "その辺にいる人と一緒。";
		mes "パパが残してくれたのは本棚だけ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……その本棚。";
		mes "ちょっと見てもいいかな？";
		next;
		mes "[ウィンチル・トゥロニ]";
		mes "別にいいけど……";
		mes "勝手に本を持っていかないでよ。";
		mes "約束だよ。";
		set HU_9QUE,27;
		close;
	case 27:
		mes "[ウィンチル・トゥロニ]";
		mes "漫画を持ってかないって約束するなら、";
		mes "本はいくらでも見ていっていいよ。";
		close;
	default:
		mes "[ウィンチル・トゥロニ]";
		mes "退屈、退屈～";
		mes "ママはいつ帰ってくるのかな～";
		close;
	}
}

hu_in01.gat,317,312,0	script	本棚	111,{
	if(HU_9QUE < 27)
		end;
	cutin "hg_book",2;
	mes "-本が一冊、妙に分厚い-";
	mes "-本を開くと、中には";
	mes "もう一つ小さな本が隠されていた-";
	next;
	if(select("小さな本を読んで見る","そのままにしておく")==2) {
		mes "-あなたは本を元の場所に戻した-";
		close2;
		cutin "hg_book",255;
		end;
	}
	mes "-あなたは隠されていた本を";
	mes "取り出し、ページをめくった-";
	while(1) {
		next;
		switch(select("1ページ目","2ページ目","3ページ目","4ページ目","5ページ目","6ページ目","7ページ目","8ページ目","9ページ目","元に戻す")) {
		case 1:
			mes "-あなたは端に大きく「1」";
			mes "と書かれたページを";
			mes "読み始めた-";
			next;
			mes "X月　X日";
			mes "レッケンベルで^FF0000「ガーディアン」^000000";
			mes "という機械が開発された話を聞いた。";
			mes "どうしても嫌な予感がする。";
			mes "今日から状況を記録する事にする。";
			next;
			mes "^FF0000「ガーディアン」^000000とは";
			mes "はるか遠い過去に存在した巨人族である";
			mes "^3131FFギガンテス^000000を土台に作られた";
			mes "機械人間らしい。";
			mes "さまざまな動作が入力されていて、";
			mes "人間ができるほぼ全ての行動を";
			mes "できるらしい。";
			next;
			mes "しかし、それは私たち傭兵が";
			mes "引き受けていた仕事も含まれている。";
			mes "既に各地の傭兵部隊がざわめいている。";
			mes "果たして、私たち傭兵の未来は";
			mes "どうなるのだろうか……";
			next;
			mes "………………………………";
			mes "………………………………";
			mes "………………………………";
			break;
		case 2:
			mes "-あなたは端に大きく「2」";
			mes "と書かれたページを";
			mes "読み始めた-";
			next;
			mes "X月　X日";
			mes "私の気持ちも、";
			mes "ここの雰囲気も落ち着かない。";
			mes "ぼーっとしていて、";
			mes "階段を踏み外す事もあった。";
			mes "いかんいかん。しっかりしなくては。";
			next;
			mes "………………………………";
			mes "………………………………";
			mes "………………………………";
			break;
		case 3:
			mes "-あなたは端に大きく「3」";
			mes "と書かれたページを";
			mes "読み始めた-";
			next;
			mes "X月　X日";
			mes "現在、私を含む傭兵隊が所属している";
			mes "「共和国守備隊」に";
			mes "^3131FFガーディアン2個中隊の編成・";
			mes "試験導入^000000が行われた。";
			mes "巨大、無機的、重装な見た目に";
			mes "皆の気が引けたようだ。";
			next;
			mes "やはり、人の代行者であるこの機械は、";
			mes "感情無しに武器を振るうだけの";
			mes "^FF0000「殺戮兵器」^000000へと";
			mes "転落してしまったようだ。";
			mes "いや、始めからそれが";
			mes "目的だったのかも知れない。";
			next;
			mes "あの殺戮機械の試験導入が終わると、";
			mes "私たち傭兵たちはどうなるのだろうか。";
			mes "お金に狂ったやつらという";
			mes "扱いを受けているが、";
			mes "私たちはそれなりの意志をもって";
			mes "依頼を遂行する。";
			mes "でなければ、失うのは自分の命だけだ。";
			next;
			mes "しかし、「命」を持たぬ物によって";
			mes "私たちは居場所を失っていく。";
			mes "傭兵を辞める奴も出てきている。";
			mes "私にも、そういう気持ちが";
			mes "無いとは言えない……";
			mes "……くそ、レッケンベルめ……";
			next;
			mes "………………………………";
			mes "………………………………";
			mes "………………………………";
			break;
		case 4:
			mes "-あなたは端に大きく「4」";
			mes "と書かれたページを";
			mes "読み始めた-";
			next;
			mes "X月　X日";
			mes "冗談も言えない機械と";
			mes "どうやって一緒にいろというのだ……";
			next;
			mes "………………………………";
			mes "………………………………";
			mes "………………………………";
			break;
		case 5:
			mes "-あなたは端に大きく「5」";
			mes "と書かれたページを";
			mes "読み始めた-";
			next;
			mes "X月　X日";
			mes "なんてことだ！";
			mes "ついに事件が起きてしまった！";
			mes "今日の部隊はまさに阿鼻叫喚だった。";
			next;
			mes "誤作動したガーディアンが、";
			mes "近くにいた「刀駕傭兵団」";
			mes "の少将を殺してしまった。";
			next;
			mes "暴れ狂うガーディアンを";
			mes "なんとか止めることができたが、";
			mes "今日で終わってしまった";
			mes "一人の男の人生はどうなる。";
			next;
			mes "レッケンベルの奴らが来たが、";
			mes "少将には目もくれない。";
			mes "仲間を失った私たち傭兵団は";
			mes "沸き立つ怒りを止められない……";
			next;
			mes "………………………………";
			mes "………………………………";
			mes "………………………………";
			break;
		case 6:
			mes "-あなたは端に大きく「6」";
			mes "と書かれたページを";
			mes "読み始めた-";
			next;
			mes "X月　X日";
			mes "上層部から通達があった。";
			mes "「^3131FF話が広がらないように";
			mes "口止めをすること。^000000」";
			mes "これだけだ。";
			next;
			mes "レッケンベルのやつらが守備軍の";
			mes "上層部に大金をばら撒いたのか、";
			mes "昨日の衝撃的な事件について";
			mes "何も追求されていないのだ。";
			next;
			mes "この通達が広まると同時に、";
			mes "傭兵たちが抱いていた";
			mes "ガーディアンへの敵対心が爆発した。";
			next;
			mes "私たちは各地の傭兵団と共に、";
			mes "格納庫のガーディアンを破壊した。";
			mes "堅い金属を打ち下ろす音が";
			mes "あちこちで響くが、";
			mes "さらに大きなサイレンの音が響いた。";
			next;
			mes "その後、私たち傭兵団は部隊を出て、";
			mes "安全な場所に身を隠した。";
			mes "私たちは私たちの生存権と、";
			mes "レッケンベル、及び政府の行いを";
			mes "人々に主張する。";
			next;
			mes "大将は各地の傭兵団に";
			mes "賛同してくれという手紙を送った。";
			mes "どんどん、戻る事ができない道に";
			mes "進んでいる……";
			mes "これからどうなるのだ……";
			next;
			mes "-綺麗に折り畳まれた";
			mes "メッセージが挟まれている-";
			next;
			if(select("読んでみる","他のページをみる")==2)
				break;
			mes "^3131FF………………………………^000000";
			next;
			mes "^3131FF……話は聞きました。";
			mes "傷心、とても大きいと思われます。";
			mes "我が傭兵団内でも、";
			mes "該当の事件の顛末に関し、";
			mes "すでに話が広がっており、";
			mes "皆が憤慨している状況です。^000000";
			next;
			mes "^3131FF政府は、レッケンベルの";
			mes "汚れた金で腐った、";
			mes "ただの置物となっています。^000000";
			next;
			mes "^3131FF私たちの未来は私たちの力で";
			mes "掴まなければなりません。";
			mes "もはや信じられるのは自分の仲間だけ。";
			mes "私たち傭兵は皆、";
			mes "「刀駕傭兵団」と共にあります。^000000";
			next;
			mes "^3131FF………………………………^000000";
			break;
		case 7:
			mes "-あなたは端に大きく「7」";
			mes "と書かれたページを";
			mes "読み始めた-";
			next;
			mes "X月　X日";
			mes "意志だけではダメなのか！";
			mes "泣き叫ぶこともできないのか！";
			mes "各地から集まった傭兵たちと合流し、";
			mes "レッケンベル本社に進撃したが、";
			mes "奴らのガーディアンに無残に敗退した。";
			next;
			mes "想像以上だった奴らの行動と資金。";
			mes "おびただしい数のガーディアンを相手に";
			mes "私たちはどうすることもできなかった。";
			mes "まさに惨敗だ。";
			next;
			mes "皆、大きな敗北感を抱いているが、";
			mes "私たちはこのまま挫折してはいけない。";
			mes "夜明けには「バルムント」という";
			mes "学者の邸宅に移動する。";
			next;
			mes "理由はわからないが、";
			mes "彼はガーディアンの運用に";
			mes "反対しているようだ。";
			next;
			mes "それにしても、彼の邸宅は";
			mes "すでに邸宅では無いと思う。";
			mes "個人の邸宅がなぜあそこまで";
			mes "殺伐とし、堅固なのか";
			mes "私にはわからない……";
			mes "だが、あれほど心強い人が";
			mes "支援してくれるのはとても助かる。";
			next;
			mes "思い返せば、とても疲れる一日だった。";
			mes "そして、混乱する一日でもあった。";
			mes "未来はまっ暗だ。";
			mes "このままあっけなく";
			mes "一生を終えるかもしれない。";
			next;
			mes "……何故だ……";
			mes "私たちが一体";
			mes "何を間違ったというのだ……";
			next;
			mes "………………………………";
			mes "………………………………";
			mes "………………………………";
			break;
		case 8:
			mes "-あなたは端に大きく「8」";
			mes "と書かれたページを";
			mes "読み始めた-";
			next;
			mes "X月　X日";
			mes "絶望した大将が、密かに共和国側に";
			mes "^3131FF休戦協定^000000を願う手紙を送っていた。";
			mes "バルムント邸宅を取り囲んだ";
			mes "ガーディアンに怯えているようだ……";
			next;
			mes "しかし、返事は悲惨なものだった。";
			mes "奴らは協定をきっぱりと断り、";
			mes "^FF0000どんな投降及び降参も認めない^000000";
			mes "と告げてきた。";
			next;
			mes "政府は私たちのデモを";
			mes "暴動、及びテロとして";
			mes "「傭兵」の存在を";
			mes "抹殺しようというのだ。";
			next;
			mes "一般市民たちの間でも、";
			mes "国を乱している傭兵団を見下し、";
			mes "後ろ指を差し始めている。";
			mes "事実が歪曲されたとしか思えない。";
			next;
			mes "私たちは傭兵として生きたいだけだ。";
			mes "……降参さえ断られた以上、";
			mes "私たちは明日、";
			mes "最後の戦いをすることになる……";
			next;
			mes "………………………………";
			mes "………………………………";
			mes "………………………………";
			break;
		case 9:
			mes "-あなたは端に大きく「9」";
			mes "と書かれたページを";
			mes "読み始めた-";
			next;
			mes "X月　X日";
			mes "久しぶりに書く日記のようだ。";
			mes "ここはシュバルツバルドの一番端にある";
			mes "「フィゲル」という村だ。";
			next;
			mes "当時は書き留めなかったが、";
			mes "やはり、バルムント邸宅での";
			mes "最後の戦闘は惨敗だった。";
			mes "バルムント先生もどこか消えてしまい、";
			mes "彼の研究資料はレッケンベルの奴らに";
			mes "回収されてしまった。";
			next;
			mes "これで、さらに大量の";
			mes "ガーディアンが製造されるだろう……";
			mes "私は最後の戦闘で片腕を失った。";
			mes "このフィゲルまで逃げてきた時の私は、";
			mes "十分怪しい人物だったはずだ。";
			next;
			mes "だが、ここの人は誰も聞かず、";
			mes "笑いながら暖かく迎え入れてくれた。";
			mes "どうせこれ以上逃げる所も、";
			mes "行く場所も無い。";
			mes "なら、ここに住むのもいいだろう。";
			next;
			mes "片腕が泣いている……";
			mes "しかし、傭兵の歴史は終わったのだ。";
			mes "私ももう休むとしよう。";
			mes "この悲劇が別の形で";
			mes "再現されない事を祈る……";
			next;
			mes "-日記はここで終わっている-";
			if(HU_9QUE == 27)
				set HU_9QUE,28;
			break;
		case 10:
			cutin "hg_book",255;
			close;
		}
	}
}

lhz_in01.gat,214,129,0	script	研究記録#hu	111,{
	if(HU_9QUE != 31)
		end;
	mes "-厚く積み重なった紙が紐で";
	mes "強く結ばれている-";
	mes "-表紙の紙にはどの期間、";
	mes "どの日とともに、";
	mes "「XX研究結果」";
	mes "という文字が書かれている-";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "よし、これだ。";
	set HU_9QUE,32;
	getitem 7342,1;
	announce (rand(2)? "侵入者だ！　研究資料を守るんだ！": "誰か！　侵入者を捕まえろ！"),9,0xFF0000;
	monster "lhz_in01.gat",208,133,"警備兵",1682,1,"研究記録#hu::OnKilled";
	monster "lhz_in01.gat",217,135,"警備兵",1682,1,"研究記録#hu::OnKilled";
	initnpctimer;
	close;
OnTimer60000:
	killmonster "lhz_in01.gat","研究記録#hu::OnKilled";
	stopnpctimer;
	end;
OnKilled:
	end;
}

einbech.gat,208,124,3	script	マインボトル業者	851,{
	if((MaxWeight - Weight) < 2000) {
		mes "-所持アイテムの重量が多いため";
		mes "アイテムを受けとることができません-";
		mes "-所持アイテムを減らしてから、再度";
		mes "話しかけてください-";
		close;
	}
	if(HU_9QUE != 33) {
		mes "[ブモ]";
		mes "ふふ、こんにちは。";
		mes "何でもボン！";
		mes "全てを吹き飛ばす";
		mes "マインボトル専門業者のブモです。";
		close;
	}
	mes "[ブモ]";
	mes "ふ、ふふ、ふふふ。";
	mes "何でもボン！　かんでもボン！";
	mes "マインボトルの専門業者、";
	mes "ブモです。";
	mes "何かご用かな？";
	next;
	if(select("マインボトルを買う","会話をやめる")==2) {
		mes "[ブモ]";
		mes "ボン！";
		mes "何しにきたんですか？";
		mes "ボン！　ボン！";
		close;
	}
	mes "[ブモ]";
	mes "マインボトルが必要ですか？";
	mes "私が作ったマインボトルは";
	mes "何でもかんでも吹き飛ばす";
	mes "完全、素敵なマインボトル。";
	mes "ボン、ボン！　ボン!!";
	next;
	mes "[ブモ]";
	mes "マインボトルは1つ3000z。";
	mes "価格以上に性能がいい優秀な品。";
	mes "買わないと色々と後悔しますよ。";
	mes "ボン！　ボン！";
	mes "ふっふっふ。";
	next;
	if(select("買う","買わない")==2) {
		mes "[ブモ]";
		mes "ふふ、また来てください。";
		mes "でないと…………";
		mes "ボン！　ってなりますよ。";
		mes "ふふふふふ。";
		close;
	}
	if(Zeny < 3000) {
		mes "[ブモ]";
		mes "おやおや、財布の中身が";
		mes "無いですよ。";
		close;
	}
	mes "[ブモ]";
	mes "爆発に巻き込まれないように";
	mes "気をつけてください。";
	mes "急に……ボン！";
	mes "ふふふ。";
	set Zeny,Zeny-3000;
	getitem 7138,1;
	close;
}

lhz_dun02.gat,244,226,0	script	原子変換器機	111,{
	if(HU_9QUE != 33)
		end;
	if(countitem(7138) < 1) {
		mes "-私は何も持っていない両手を";
		mes "呆然と眺めるしかなかった-";
		close;
	}
	mes "[" +strcharinfo(0)+ "]";
	mes "これだな……";
	mes "罪もない多くの人たちが、";
	mes "無理やり背負わされた運命。";
	mes "それも今日で終りだ!!";
	next;
	mes "-機械にマインボトルを投げつけた-";
	next;
	mes "「ボン！」";
	misceffect 183;
	hideoffnpc "爆発#hu";
	announce "ビ------------------",9,0x99CCFF;
	delitem 7138,1;
	set HU_9QUE,34;
	close;
}

lhz_dun02.gat,244,227,0	script	爆発#hu	139,5,5,{
	percentheal -10,0;
	misceffect 4,"";
	hideonnpc;
	end;
OnInit:
	hideonnpc;
	end;
}
