//= Athena Script ==============================================================
// Ragnarok Online Einbroch Town Script	by Blaze
//= Registry ===================================================================
// $EinFactory -> 環境汚染レベル
//==============================================================================

//============================================================
// Shop
//------------------------------------------------------------
ein_in01.gat,106,27,4	shop	片手武器商人	850,1101,1104,1107,1110,1113,1119,1122,1123,1126,1129,1201,1204,1207,1210,1213,1216,1219,1222,1301,1401,1404,1407,1501,1504,1507,1510,1513,1516,1519,1522,1801,1803,1805,1807,1809,1811
ein_in01.gat,109,27,4	shop	両手武器商人	850,1116,1151,1154,1157,1160,1351,1354,1357,1360,1410,1451,1454,1457,1460,1463,1250,1252,1254
ein_in01.gat,189,15,0	shop	道具商人	850,1750,1752,1751,611,501,502,503,504,506,645,656,601,602,1065
einbroch.gat,82,199,4	shop	雑貨商人#einbroch	855,512,645,1750,501
einbroch.gat,138,66,4	shop	マスク商人#einbroch	850,2218
ein_in01.gat,119,26,4	shop	武器商人	855,1247,1248,1249,13000

//============================================================
// アインブロック⇔アインベフ転送NPC
//------------------------------------------------------------
einbroch.gat,232,272,3	script	駅員#einbroch1	852,{
	mes "[駅員]";
	mes "こんにちは。こちらは";
	mes "アインブロックとアインベフを";
	mes "往復する汽車です。";
	mes "アインベフまでの料金は";
	mes "200zenyです。乗りますか？";
	next;
	switch(select("乗る","乗らない","空気がよくないですね")) {
	case 1:
		if(Zeny < 200) {
			mes "[駅員]";
			mes "お客様、お金が足りないようです。";
			close;
		}
		mes "[駅員]";
		mes "ご利用ありがとうございます。";
		mes "よい旅を～。";
		close2;
		set Zeny,Zeny-200;
		warp "einbech.gat",43,215;
		end;
	case 2:
		mes "[駅員]";
		mes "それではごきげんよう。";
		close;
	case 3:
		mes "[駅員]";
		mes "アインブロックは工場を中心とする";
		mes "街ですので、煤煙が酷いことで";
		mes "有名です。呼吸困難を起こしかねない程";
		mes "汚染状況が酷くなった際は";
		mes "警告放送がありますので、";
		mes "お客様もお気をつけ下さい。";
		close;
	}
}

einbroch.gat,252,301,4	duplicate(駅員#einbroch1)	駅員#einbroch2	852

einbech.gat,39,215,5	script	駅員#einbech	852,{
	mes "[駅員]";
	mes "こんにちは。こちらが";
	mes "アインベフとアインブロックを";
	mes "往復する汽車です。";
	mes "アインブロックまでの料金は";
	mes "200zenyです。乗りますか？";
	next;
	if(select("乗る","乗らない")==2) {
		mes "[駅員]";
		mes "それではごきげんよう。";
		close;
	}
	if(Zeny < 200) {
		mes "[駅員]";
		mes "お客様、お金が足りないようです。";
		close;
	}
	mes "[駅員]";
	mes "ご利用ありがとうございます。";
	mes "よい旅を～。";
	close2;
	set Zeny,Zeny-200;
	warp "einbroch.gat",226,276;
	end;
}

//============================================================
// アインブロックNPC
//------------------------------------------------------------
einbroch.gat,151,46,5	script	表示板	858,{
	mes "西－研究所、飛行船修理所";
	mes "南－アインブロック正門";
	mes "北－空港";
	mes "北東－駅、ホテル、武器屋";
	close;
}

einbroch.gat,183,174,5	script	表示板	858,{
	mes "東－武器屋、ホテル";
	mes "南－工場";
	mes "南西－飛行船修理所、研究所";
	mes "北西－空港";
	close;
}

einbroch.gat,104,202,5	script	表示板	858,{
	mes "北東－駅";
	mes "東－武器屋、ホテル";
	mes "南－飛行船修理所、研究所";
	close;
}

einbroch.gat,162,256,5	script	表示板	858,{
	mes "東－駅";
	mes "南東－ホテル";
	mes "南－武器屋、工場";
	mes "南西－空港、飛行船修理所、研究所";
	close;
}

einbroch.gat,235,141,5	script	表示板	858,{
	mes "南西－飛行船修理所、研究所";
	mes "北西－空港";
	mes "北－武器屋、ホテル、駅";
	close;
}

einbroch.gat,132,76,5	script	表示板	858,{
	mes "－－－－－－－－－";
	mes "　　　　工場";
	mes "－－－－－－－－－";
	close;
}

einbroch.gat,90,84,5	script	表示板	858,{
	mes "－－－－－－－－－";
	mes "　　　　研究所";
	mes "－－－－－－－－－";
	close;
}

einbroch.gat,68,206,5	script	表示板	858,{
	mes "－－－－－－－－－";
	mes "　　　　空港";
	mes "－－－－－－－－－";
	close;
}

einbroch.gat,253,203,5	script	表示板	858,{
	mes "－－－－－－－－－";
	mes "　　　　ホテル";
	mes "－－－－－－－－－";
	close;
}

einbroch.gat,220,208,5	script	表示板	858,{
	mes "－－－－－－－－－";
	mes "　　　　武器屋";
	mes "－－－－－－－－－";
	close;
}

einbroch.gat,101,106,5	script	表示板	858,{
	mes "－－－－－－－－－";
	mes "　　　　飛行船修理所";
	mes "－－－－－－－－－";
	close;
}

einbroch.gat,244,255,5	script	表示板	858,{
	mes "－－－－－－－－－";
	mes "　　　　駅";
	mes "－－－－－－－－－";
	close;
}

einbroch.gat,143,109,5	script	ケティン#einbroch	855,{
	mes "[ケティン]";
	mes "街の南に、使われていない";
	mes "建物がありますが、";
	mes "今度、何か特別な施設が";
	mes "入って来るようです。それが";
	mes "何なのかまでは知りませんが……";
	next;
	mes "[ケティン]";
	mes "少なくとも、私とは";
	mes "何も関係がなさそうです。";
	next;
	mes "[ケティン]";
	mes "だから気にしない方がいいですね。";
	mes "どの道、ここが発展することは";
	mes "変わりないので、私みたいな人が";
	mes "気にしてもしょうがないですよね。";
	close;
}

einbroch.gat,188,72,4	script	ケネッシオ#einbroch	855,{
	mes "[ケネッシオ]";
	mes "空までそびえる工場の煙突！";
	mes "昼夜問わず響き渡る機械音！";
	mes "空気は汚れていても、その分";
	mes "お金が増えてると思えばいいさ！";
	next;
	mes "[ケネッシオ]";
	mes "やはり世の中、お金が全て。";
	mes "食べ物さえ買えない奴らを見ると、";
	mes "つくづくお金は大事だって思うね。";
	close;
}

einbroch.gat,229,149,4	script	スリーキ#einbroch	854,{
	mes "[スリーキ]";
	mes "ここには、汽車があるんですよ！";
	mes "ビックリしたでしょう！";
	mes "これぞ、まさに科学の勝利！";
	next;
	mes "[スリーキ]";
	mes "え、汽車はどこに行くのかですか？";
	mes "乗ってみればわかりますよ。";
	next;
	mes "[スリーキ]";
	mes "汽車が走る街の住民ということは";
	mes "私の誇りです。";
	close;
}

einbroch.gat,236,191,4	script	街の青年#einbroch1	855,{
	mes "[青年]";
	mes "ここは、工場が多いから";
	mes "空気は、かなり悪いです。";
	next;
	mes "[青年]";
	mes "僕は飛行船の修理技師なんですが";
	mes "一日中、油だらけで仕事して、";
	mes "仕事が終わったと思ったら、";
	mes "今度は煤煙に苦しむわけですよ。";
	mes "おかげでいつも頭がズキズキ痛みます。";
	next;
	mes "[青年]";
	mes "今日も空がどんよりしてますね。";
	mes "こんな時は、僕の様にマスクを";
	mes "着用するのがオススメ！";
	next;
	mes "[青年]";
	mes "あなたも健康のため、マスクくらいは";
	mes "持った方がいいですよ。";
	close;
}

einbroch.gat,228,121,5	script	街の青年#einbroch2	855,{
	mes "[青年]";
	mes "あれ、ここはどこだろう？";
	mes "ここが空港かな？";
	mes "ああ、親が待ってるのに遅れちゃうよ！";
	next;
	mes "[青年]";
	mes "まだ引っ越してきたばかりで、どこに";
	mes "何があるか、さっぱり分からなくて……";
	mes "うわぁ、大きな建物が多すぎるよう！";
	next;
	mes "[青年]";
	mes "ああ、困ったよー!!";
	close;
}

einbroch.gat,294,312,4	script	センツ#einbroch	854,{
	mes "[センツ]";
	mes "ここは、何て発展が早いんだ。";
	mes "ここで暮らしていると、毎日何かが";
	mes "変わっていることを実感できるよ。";
	next;
	mes "[センツ]";
	mes "でも、どうしてこんなに早く";
	mes "発展しているのだろう？";
	next;
	mes "[センツ]";
	mes "何が、どんな理由で、どんな手段で";
	mes "発展させているのか……";
	mes "まぁ、それが分かっても、";
	mes "何か変わるわけじゃないが。";
	next;
	mes "[センツ]";
	mes "ま、いいや。";
	mes "僕は、この街が変わっていくのを";
	mes "見るのが楽しいんだから。";
	close;
}

einbroch.gat,232,255,5	script	カロパー#einbroch	847,{
	mes "[カロパー]";
	mes "ごほ、ごほ……";
	mes "発展するのはいいが、この空気だけは";
	mes "何とかならんものか！";
	next;
	mes "[カロパー]";
	mes "空気がきれいで静かな場所で";
	mes "余生を送りたいのう……";
	next;
	mes "[カロパー]";
	mes "だが、それでもここが故郷だと思うと";
	mes "引っ越しに踏み切れん。";
	mes "死ぬまで、ここで呼吸困難に";
	mes "苦しみながら、生きていくことに";
	mes "なりそうじゃ……";
	next;
	mes "[カロパー]";
	mes "ごほん、ごほんっ！";
	close;
}

einbroch.gat,208,208,4	script	センボ#einbroch	850,{
	mes "[センボ]";
	mes "カーラさんは、アインブロックの";
	mes "女神のような方よ。気立てが良く、";
	mes "透き通った声に天使のような微笑み！";
	mes "それに、とても綺麗なのよ。";
	next;
	mes "[センボ]";
	mes "家も裕福で、完璧というべきかしら？";
	mes "カーラさんと結婚できる殿方は、";
	mes "何て幸せなのかしら。";
	next;
	mes "[センボ]";
	mes "カーラさんの家ですか？";
	mes "ここから北へ進んで、西に曲がり、";
	mes "途中で南へ行ったところにある家よ。";
	close;
}

einbroch.gat,259,326,4	script	乗客#einbroch	846,{
	mes "[乗客]";
	mes "ごほ、ごほごほっ！";
	mes "こんなに空気が悪いと、私のような";
	mes "年寄りには辛くて辛くて。";
	mes "こんな所で何十年も";
	mes "暮らしてる人がいるなんて……";
	mes "ごほっごほっ！";
	next;
	mes "[乗客]";
	mes "私はアインベフに住んでいます。";
	mes "アインベフもあまり空気が";
	mes "よくありませんが、ここは酷すぎる！";
	mes "ごほん、ごほん!!";
	next;
	mes "[乗客]";
	mes "こちらに買い物に来るだけで";
	mes "一苦労ですよ。";
	mes "ごほっ、ごほっ、ごほっ！";
	close;
}

einbroch.gat,40,116,1	script	飛行船の技師#einbroch	855,{
	mes "[飛行船の技師]";
	mes "オイオイ、俺の大事な「ブリュエ」に";
	mes "気安く触るな！";
	mes "彼女は、修理が終わったばかりで";
	mes "ゆっくりしてるトコロなんだから";
	mes "邪魔するんじゃない!!";
	next;
	if(select("彼女？","ごめんなさい")==2) {
		mes "[飛行船の技師]";
		mes "おお、分かったならいい。";
		close;
	}
	mes "[飛行船の技師]";
	mes "そう！　ブリュエは10年前に作られた";
	mes "一番キレイな飛行船さ！";
	mes "10年経っても、俺が修理してやると";
	mes "元気にピチピチと空を飛び回れるんだ。";
	next;
	mes "["+strcharinfo(0)+"]";
	mes "一番きれいって……";
	mes "あの、飛行船は全部同じデザインに";
	mes "見えるんですが。";
	next;
	emotion 6;
	mes "[飛行船の技師]";
	mes "何だと?!";
	close;
}

einbroch.gat,51,46,5	script	研究所の警備員#einbroch1	852,{
	mes "[警備員]";
	mes "こちらは関係者以外";
	mes "立ち入り禁止です。";
	close;
}

einbroch.gat,51,56,5	script	研究所の警備員#einbroch2	852,{
	mes "[警備員]";
	mes "口の中が埃っぽいよ。";
	mes "早く帰りたいな～。";
	close;
}

//============================================================
// アインブロック室内NPC
//------------------------------------------------------------
ein_in01.gat,43,252,3	script	カンポティ	852,{
	mes "[カンポティ]";
	mes "ぐずぐずしてないで、";
	mes "さっさと仕事をせんか！";
	next;
	mes "[カンポティ]";
	mes "分かったらお前も持ち場に戻れ……";
	mes "ん？　お前、この工場の";
	mes "人間じゃないな。";
	mes "許可も必要もなしに、";
	mes "工場内を歩き回らないで欲しいな。";
	next;
	mes "[カンポティ]";
	mes "一般人がここまで入りこむとは、";
	mes "警備の人間は何をしている。";
	close;
}

ein_in01.gat,68,209,5	script	カシュランチェ	852,{
	mes "[カシュランチェ]";
	mes "ここは、あなたみたいな一般人が";
	mes "出歩いていい場所ではありません。";
	mes "出ていってください。";
	close2;
	warp "einbroch.gat",179,63;
	end;
}

ein_in01.gat,31,217,3	script	センダト	851,{
	mes "[センダト]";
	mes "この工場は物資が、";
	mes "とてつもなく不足してます。";
	mes "それでも動いてるのが";
	mes "不思議なくらいです。";
	next;
	mes "[センダト]";
	mes "しかもこの間、モンスターを退けた";
	mes "戦利品で、工場物資を補う始末……";
	next;
	mes "[センダト]";
	mes "もし、また同じようなことが";
	mes "起こったら……次はどうなることか。";
	mes "現在、モンスターと戦えるほど";
	mes "強い人は、我が工場にいません。";
	close;
}

ein_in01.gat,48,220,5	script	ロー	851,{
	mes "[ロー]";
	mes "……………………";
	mes "……………………";
	mes "……………………";
	next;
	mes "[ロー]";
	mes "……………………";
	mes "……………………";
	mes "……………………";
	next;
	mes "[ロー]";
	mes "業務時間中は無駄話禁止。";
	mes "主任に酷い目に遭わされる。";
	next;
	mes "[ロー]";
	mes "おっと、無駄話をしてしまった。";
	mes "失礼。";
	close;
}

ein_in01.gat,36,204,3	script	ロベル	851,{
	mes "[ロベル]";
	mes "工場がフル稼働しているのは";
	mes "いいのですが……";
	mes "実はかなり心配です。";
	next;
	mes "[ロベル]";
	mes "何が心配か、ですか？";
	mes "あぁ、大気汚染です。";
	mes "こんなに汚い煙を噴き出す機械が、";
	mes "一日中動いているのですから、";
	mes "そりゃあ、空気も悪くなりますよ。";
	next;
	mes "[ロベル]";
	mes "そうでなくても";
	mes "この街は空気が悪いのに、";
	mes "更に悪くなるかもしれないと思うと";
	mes "本当に心配です。";
	next;
	mes "[ロベル]";
	mes "何か、方法がないのでしょうか……";
	close;
}

ein_in01.gat,49,202,3	script	ドープ	851,{
	mes "[ドープ]";
	mes "やっぱり、機械って便利だね。";
	mes "人が手でやったら大変な事も、";
	mes "機械だと簡単にやってくれるし。";
	mes "これこそ、まさに文明の利器じゃない？";
	next;
	mes "[ドープ]";
	mes "確かに、機械一つ作るのに";
	mes "相当な資金と労力が必要だけど、";
	mes "僕がお金を出したわけじゃないし。。";
	next;
	mes "[ドープ]";
	mes "僕は、機械がちゃんと働きさえすれば";
	mes "それでＯＫさ！";
	close;
}

ein_in01.gat,113,211,3	script	タインス	851,{
	mes "[タインス]";
	mes "お金！　お金！";
	mes "お金をくれるなら、何でもするよ！";
	mes "脱げと言われれば脱ぎます！";
	mes "お金のためなら、何だってします！";
	next;
	mes "[タインス]";
	mes "だから、ここで働いて、";
	mes "お金をたくさん貯めてるんです。";
	mes "仕事は辛いけど、お金のためなら";
	mes "何だってできますとも！";
	mes "ええ!!";
	close;
}

ein_in01.gat,84,218,3	script	ツェン	851,{
	mes "[ツェン]";
	mes "冒険者になるのが、私の夢でした。";
	mes "しかし、今はしがない工場の労働者……";
	next;
	mes "[ツェン]";
	mes "今の生活も、それなりにいいです。";
	mes "単純作業ですが、";
	mes "私が仕事で作った物が";
	mes "誰かの役に立つと思うと、";
	mes "嬉しいんですよ。";
	next;
	mes "[ツェン]";
	mes "それでも、夢を";
	mes "忘れたことはありません。";
	mes "いつか、冒険に旅立てたら！";
	next;
	mes "[ツェン]";
	mes "冒険は楽しいですか？";
	mes "いつか、私が冒険者になって、";
	mes "君とどこかで会えたらいいですね。";
	close;
}

ein_in01.gat,87,237,5	script	ディンゼ	850,{
	mes "[ディンゼ]";
	mes "男でも辛い仕事を、どうして";
	mes "私がしなければいけないの?!";
	mes "亭主がまともに稼いでこないからって";
	mes "どうして、まったくもう！";
	next;
	mes "[ディンゼ]";
	mes "え、主人が誰かって？";
	mes "あそこに倒れている、情けない男よ！";
	mes "あ～、まったく、情けないったら";
	mes "ありゃしない！";
	next;
	mes "[ディンゼ]";
	mes "もう少し楽な生活をするために、";
	mes "働いて、お金を貯めなくっちゃ";
	mes "ならないのに！";
	next;
	mes "[ディンゼ]";
	mes "あんな情けない亭主のせいで……";
	mes "ぶつぶつ……";
	mes "どうして妻の私が、";
	mes "働かなければいけないの……";
	mes "ぶつぶつぶつ……";
	next;
	mes "[ディンゼ]";
	mes "あなた、ちょっとあの男のケツを";
	mes "蹴っ飛ばしてきてくれる？";
	mes "どうせ、起きやしないけどね。";
	close;
}

ein_in01.gat,103,239,1	script	ゲシン	849,{
	mes "[ゲシン]";
	mes "ウウウウウ～、";
	mes "適当に働いて、それなりの";
	mes "暮らしができりゃあ、いいだろう。";
	mes "何が富だ、名誉だ……";
	next;
	mes "[ゲシン]";
	mes "今の暮らしだって悪くないのに、";
	mes "妻は寝る時間を削ってでも";
	mes "働けと言う……";
	mes "どうして、あんなに富と名誉に";
	mes "こだわるんだ。";
	next;
	mes "[ゲシン]";
	mes "それは、まぁとりあえず置いといて、";
	mes "……今、問題なのは";
	mes "起き上がる力さえないってことだ。";
	next;
	mes "[ゲシン]";
	mes "ウウウ、助けてくれ～。";
	mes "お金もいいけど、";
	mes "ちょっとは休ませてくれ～……";
	close;
}

ein_in01.gat,85,261,3	script	ゼリン	851,{
	mes "[ゼリン]";
	mes "私は、あの溶鉱炉内の液体の";
	mes "状態を管理しています。";
	mes "忙しい仕事ではありませんが、";
	mes "かなり神経を使いますので、";
	mes "けっこう疲れますね。";
	next;
	mes "[ゼリン]";
	mes "でも、この仕事はやりがいがあります。";
	mes "私のおかげで、この工場の労働者達が";
	mes "安全に仕事ができると思うと、";
	mes "胸が一杯になります。";
	next;
	mes "[ゼリン]";
	mes "あ、離れて離れて！";
	mes "それ以上近付いてはいけません！";
	close;
}

ein_in01.gat,64,271,3	script	ポンス	855,{
	mes "[ポンス]";
	mes "熱く盛り上がる鉄の液体を見ていると";
	mes "何となく気持ちがいいよな？";
	mes "世の中の全てを溶かせる力が";
	mes "あるような気になる。";
	next;
	mes "[ポンス]";
	mes "いつか、マグマがこの通りを";
	mes "おおい被せるようになったら、フフフ。";
	mes "うあ、いつからそこに?!";
	mes "冗談だよ、冗談。";
	close;
}

ein_in01.gat,33,275,1	script	ペプティン	848,{
	mes "[ペプティン]";
	mes "ここの仕事は楽しくもないし、";
	mes "上司は金、金とうるさいし！";
	mes "私はこんなことをするために";
	mes "この街に来たんじゃないぞ！";
	next;
	mes "[ペプティン]";
	mes "でも、お金がないから、";
	mes "どこにも行けないし……";
	close;
}

//============================================================
// 見晴台NPC
//------------------------------------------------------------
// callfunc "見晴台#einbroch",X,Y;
function	script	見晴台#einbroch	{
	mes "["+strnpcinfo(1)+"]";
	mes "こんにちは。";
	mes "アインブロック見晴台案内員の";
	mes strnpcinfo(1)+ "と言います。";
	mes "この見晴台からは";
	mes "アインブロックを一目で";
	mes "見渡せるんですよ。";
	next;
	mes "["+strnpcinfo(1)+"]";
	mes "下に広がる景色は";
	mes "とても涼しげですよ。";
	mes "友達や恋人との待ち合わせに";
	mes "ピッタリの場所です。";
	next;
	mes "["+strnpcinfo(1)+"]";
	mes "見晴台の利用料は、10zenyです。";
	mes "只今、一般のご利用に新鮮なリンゴを";
	mes "付けた、お得なリンゴセット";
	mes "キャンペーンも実施中です。";
	next;
	mes "["+strnpcinfo(1)+"]";
	mes "リンゴセットは20zenyです。";
	mes "見晴台をご利用しますか？";
	next;
	switch(select("一般でお願い","リンゴセットでお願い","やめる")) {
	case 1:
		if(Zeny < 10) {
			mes "["+strnpcinfo(1)+"]";
			mes "見晴台の利用料は、10zenyです。";
			close;
		}
		set Zeny,Zeny-10;
		mes "["+strnpcinfo(1)+"]";
		mes "ご利用、ありがとうございます。";
		mes "すぐにご案内しましょう。";
		break;
	case 2:
		if(Zeny < 20) {
			mes "["+strnpcinfo(1)+"]";
			mes "リンゴセットは、20zenyです。";
			close;
		}
		mes "["+strnpcinfo(1)+"]";
		mes "ご利用、ありがとうございます。";
		mes "では安全のため、重量チェックを";
		mes "行わせていただきます。";
		next;
		if(checkweight(512,1)==0) {
			mes "["+strnpcinfo(1)+"]";
			mes "お客様、申し訳ございません。";
			mes "お荷物が重すぎるため、見晴台へ";
			mes "行くには少々危険が伴います。";
			mes "お荷物を減らすなどしてから";
			mes "再度お越しいただけないでしょうか。";
			close;
		}
		set Zeny,Zeny-20;
		getitem 512,1;
		mes "["+strnpcinfo(1)+"]";
		mes "はい、合格です。";
		mes "それでは、すぐにご案内しましょう。";
		break;
	case 3:
		mes "["+strnpcinfo(1)+"]";
		mes "次は、是非ご利用ください。";
		mes "お待ちしています。";
		close;
	}
	close2;
	warp "einbroch.gat",getarg(0),getarg(1);
	return;
}

einbroch.gat,176,171,5	script	カム#einbroch	855,{
	callfunc "見晴台#einbroch",181,196;
	end;
}

einbroch.gat,173,229,5	script	オベ#einbroch	855,{
	callfunc "見晴台#einbroch",179,204;
	end;
}

einbroch.gat,218,198,5	script	マーク#einbroch	855,{
	callfunc "見晴台#einbroch",174,204;
	end;
}

einbroch.gat,175,196,5	script	シン#einbroch	854,{
	mes "[シン]";
	mes "こんにちは。";
	mes "見晴台管理人のシンです。";
	mes "下にお戻りの際は、";
	mes "私にご連絡ください。";
	next;
	mes "[シン]";
	mes "下に戻りますか？";
	next;
	if(select("はい、戻ります","いいえ、もうちょっとここにいます")==2) {
		mes "[シン]";
		mes "はい、わかりました。";
		mes "ごゆっくりどうぞ。";
		close;
	}
	mes "[シン]";
	mes "ご利用、ありがとうございました。";
	mes "またのお越しをお待ちしております。";
	close2;
	switch(rand(3)) {
	case 0:	warp "einbroch.gat",178,167; break;
	case 1:	warp "einbroch.gat",216,188; break;
	case 2:	warp "einbroch.gat",170,229; break;
	}
	end;
}

//============================================================
// アインベフNPC
//------------------------------------------------------------
einbech.gat,77,105,5	script	表示板	858,{
	mes "採鉱の村アインベフへようこそ";
	next;
	mes "東－酒場、道具屋";
	mes "北－駅、鉱山";
	close;
}

einbech.gat,181,127,5	script	表示板	858,{
	mes "北西－駅";
	mes "南－酒場";
	mes "北－道具屋、鉱山";
	close;
}

einbech.gat,133,114,5	script	表示板	858,{
	mes "－－－－－－－－－";
	mes "　　　　酒場";
	mes "－－－－－－－－－";
	close;
}

einbech.gat,180,136,5	script	表示板	858,{
	mes "－－－－－－－－－";
	mes "　　　　道具屋";
	mes "－－－－－－－－－";
	close;
}

einbech.gat,90,214,5	script	表示板	858,{
	mes "－－－－－－－－－";
	mes "　　　　駅";
	mes "－－－－－－－－－";
	close;
}

einbech.gat,158,189,4	script	表示板	858,{
	mes "－－－－－－－－－";
	mes "　　　　賃物列車駅";
	mes "－－－－－－－－－";
	close;
}

einbech.gat,135,250,5	script	表示板	858,{
	mes "－－－－－－－－－";
	mes "鉱山ダンジョン入口";
	mes "－－－－－－－－－";
	close;
}

einbech.gat,93,139,5	script	レスト	847,{
	mes "[レスト]";
	mes "一体！　どうして！";
	mes "あっちの街だけ栄えて、こっちだけ";
	mes "こんな目に遭わないといけないんだ！";
	next;
	mes "[レスト]";
	mes "こっちの方が、空気は悪いよ！";
	mes "仕事は辛いし！";
	mes "狭いし！";
	next;
	mes "[レスト]";
	mes "空気が悪いから、";
	mes "食べ物もおいしくないし！";
	next;
	mes "[レスト]";
	mes "空が灰色なのも、";
	mes "私が老けたのも、";
	mes "寒いのも!!!!";
	mes "みんなアインブロックのせいだ!!!!";
	next;
	mes "[レスト]";
	mes "ぶつぶつぶつぶつぶつぶつぶつぶつ";
	mes "ぶつぶつぶつぶつぶつぶつぶつぶつ";
	mes "ぶつぶつぶつぶつぶつぶつぶつぶつ";
	mes "ぶつぶつぶつぶつ……";
	mes "^FF0000ごほっ！^000000";
	close;
}

einbech.gat,57,210,4	script	青年	855,{
	mes "[青年]";
	mes "酒場の裏で、怖い顔をして、";
	mes "ブツブツ言っているお爺さんがいます。";
	next;
	mes "[青年]";
	mes "とても怖いことでも";
	mes "あったのでしょうか。";
	mes "気の毒になるくらい、";
	mes "変な声をたくさん出しています。";
	next;
	mes "[青年]";
	mes "かなりのお年なのに、よっぽど腹に";
	mes "据えかねたことでもあるんでしょうね。";
	close;
}

einbech.gat,105,218,6	script	グセン	848,{
	mes "[グセン]";
	mes "私は、色々な場所に住んでいたけど、";
	mes "こんなにも住みにくい場所は、";
	mes "生まれて初めてだよ。";
	mes "仕事は過酷で、人手は足りないし、";
	mes "その上ますます仕事が";
	mes "危険になっていくし。";
	next;
	mes "[グセン]";
	mes "それに、あっちで工場を動かすと";
	mes "そこから出る煙のせいで、";
	mes "こっちまで昼も夜も真っ暗だ。";
	next;
	mes "[グセン]";
	mes "あと、何故か分からないんだけど、";
	mes "真っ暗な時に限って、";
	mes "人が怪我をする事件が起こる。";
	mes "だから、私も最近は、習慣だった";
	mes "朝の運動ができないでいるんだ。";
	next;
	mes "[グセン]";
	mes "あっちの街が大きくなってから、";
	mes "今まで見ることがなかった";
	mes "化け物が増えたって噂もあるし……";
	next;
	mes "[グセン]";
	mes "はぁ、最近は大変すぎるよ……";
	close;
}

einbech.gat,129,234,5	script	ハンダ	848,{
	mes "[ハンダ]";
	mes "アインブロックの奴らめ！";
	mes "あいつらが裕福に暮らせるのも、";
	mes "この村から安くエネルギー源を";
	mes "補給できるおかげなのに！";
	mes "あいつらは、俺達のありがたみが";
	mes "全然分かってない!!!!";
	next;
	mes "[ハンダ]";
	mes "俺達は毎日、危険を覚悟で";
	mes "家族のために、死ぬまで機械の様に";
	mes "働いてるのに！";
	next;
	mes "[ハンダ]";
	mes "村の長老達は、そんな苦労を";
	mes "誰よりも解っているはずなのに、";
	mes "俺達が掘り出した珍しい鉱物を、";
	mes "あいつらに捨て値同然の値段で";
	mes "売り払ってしまっている！";
	next;
	mes "[ハンダ]";
	mes "申し立てだ！申し立て！";
	mes "申し立てをしなくちゃいけないんだ！";
	mes "無茶な日程で仕事を";
	mes "させられているんだから！";
	next;
	mes "[ハンダ]";
	mes "サビタさんの奥さんは";
	mes "鉱山の化け物に襲われて、";
	mes "起き上がることもできないのに！";
	mes "死にそうなのに！";
	next;
	mes "[ハンダ]";
	mes "それなのに、病院に行くどころか、";
	mes "食事すらまともにできない";
	mes "状態なのに……";
	close;
}

einbech.gat,128,238,5	script	モーガン	848,{
	mes "[モーガン]";
	mes "最近頻発している陥没事故で、";
	mes "たくさんの人が怪我をしています。";
	mes "街の方でも、無理に鉱山の奥へ";
	mes "入らないようにと、注意報が出ました。";
	next;
	mes "[モーガン]";
	mes "ウンゴリアント……";
	mes "遥か昔から、鉱山の奥に";
	mes "眠っていたという鉱山の主……";
	mes "あいつが目覚めた以上、鉱山でこれから";
	mes "どれだけの犠牲者が出るのか……";
	mes "とても心配です。";
	next;
	mes "[モーガン]";
	mes "あなたも鉱山に入るなら、";
	mes "気をつけなさい。";
	mes "あいつは、足音を聞きつけて、";
	mes "獲物を追ってきますからね……";
	close;
}

einbech.gat,130,253,1	script	イクリ	848,{
	mes "[イクリ]";
	mes "エイホっ、エイホっ！";
	mes "鉱山の中は恐ろしいけど、";
	mes "仕事をしないと飢えちゃうからな！";
	mes "仕方ないから、こんな入口で";
	mes "わずかな鉱石を掘る毎日さ。";
	next;
	mes "[イクリ]";
	mes "これっぽっちの鉱石でも、";
	mes "中に入って、事故で怪我するより";
	mes "よっぽどいいさ。";
	next;
	mes "[イクリ]";
	mes "はい、お喋りはここまで！";
	mes "エイサっ、ホイサっ！";
	mes "エイホっ、エイホっ！";
	close;
}

einbech.gat,157,215,3	script	駅の関係者	852,{
	mes "[駅の関係者]";
	mes "こちらは鉱物等を運ぶ";
	mes "貨物用専用車両です。";
	next;
	mes "[駅の関係者]";
	mes "関係者以外は立ち入り禁止です。";
	mes "アインブロックへ行くなら、ここから";
	mes "11時方向の一般列車をご利用ください。";
	close;
}

einbech.gat,172,113,4	script	ネムク	855,{
	mes "[ネムク]";
	mes "見慣れない人だな。";
	mes "観光かい？";
	mes "いきなり聞くのもなんだが……";
	mes "ここ、どう思う？";
	next;
	if(select("いいんじゃないですか","正直に言いますと、大変そうです")==1) {
		mes "[ネムク]";
		mes "うーん、どこを見たら";
		mes "そう見えるんだろう。";
		mes "不思議だ。";
		next;
		mes "[ネムク]";
		mes "そろそろ、ここからおさらばするかと";
		mes "心に決めて、早10年……";
		next;
		mes "[ネムク]";
		mes "ん？";
		mes "お金だよ。";
		mes "お金さえあれば、";
		mes "こんな場所にいないさ。";
		close;
	}
	mes "[ネムク]";
	mes "うん、やっぱりそう見えるか。";
	next;
	mes "[ネムク]";
	mes "ここじゃ、仕事仕事の毎日だ。";
	mes "どれだけ働いても変わらない。";
	mes "いくらあがいても無理だ。";
	next;
	mes "[ネムク]";
	mes "去りたいと思っても、それは心だけ……";
	mes "実際、身は動くことができない……";
	mes "心だけ、遠い空の向こうを";
	mes "夢見るばかり……";
	next;
	mes "[ネムク]";
	mes "はぁ、お金があればな……";
	close;
}

einbech.gat,197,139,4	script	青年	855,{
	mes "[ハインズ]";
	mes "見るからに優雅な旅人さん。";
	mes "どんな用事でここに？";
	next;
	mes "[ハインズ]";
	mes "見るものなんて一つもない";
	mes "こんな村に、何をしに来たんですか？";
	mes "鉱山で一攫千金でも狙って？";
	next;
	mes "[ハインズ]";
	mes "ああ、そうだ。";
	mes "今、鉱山にモンスターが";
	mes "うようよいるんですよ。";
	mes "もう大変です。";
	next;
	mes "[ハインズ]";
	mes "でも最近、退治しに来る旅人が";
	mes "多いので、モンスターが、";
	mes "どんなに増えても大丈夫です。";
	mes "旅人のおかげで、私達は採掘できて";
	mes "旅人も金儲けができる！";
	mes "いや～、実にいいことです。";
	next;
	mes "[ハインズ]";
	mes "ああ、聞こえないふりしないで下さい。";
	mes "お願いしますよ～。";
	next;
	mes "[ハインズ]";
	mes "鉱山に出るモンスターを旅人さんが、";
	mes "ちょっと退治するだけでいいんです。";
	mes "どうか、お願いしますよ～。";
	close;
}

einbech.gat,216,118,4	script	カツランプ	854,{
	mes "[カツランプ]";
	mes "私は普通に生きたいだけなのに、";
	mes "どうして周りはこうも欲張りだらけ";
	mes "なんだろう。";
	next;
	mes "[カツランプ]";
	mes "便利じゃなくてもいい。";
	mes "お金もいっぱいなくていい。";
	mes "素朴で安らかな生活がいいのに。";
	next;
	mes "[カツランプ]";
	mes "お金をどんなに稼いでも、命は";
	mes "買えない。でも隣町の連中は";
	mes "お金が大好きで、稼ぐのに忙しいから、";
	mes "そのことに一生気がつかないだろうね。";
	close;
}

einbech.gat,151,168,3	script	トラブ	855,{
	mes "[トラブ]";
	mes "ああ……死んでしまう……";
	mes "いつまでお金もないまま";
	mes "こんな場所で働いて";
	mes "暮らさなければならないんだ……";
	mes "ここは本当に、隣とは";
	mes "比べ物にもならないほど貧しい。";
	next;
	mes "[トラブ]";
	mes "空気も悪いし……";
	mes "きっとアインベフが、";
	mes "シュバルツバルドで一番";
	mes "暮らしにくい村だ。";
	close;
}

einbech.gat,176,125,3	script	エルーゼ	850,{
	mes "[エルーゼ]";
	mes "この村で一番真面目で";
	mes "素直な青年を知ってる？";
	mes "それは、クルトよ。";
	mes "馬鹿がついてもいいほど、";
	mes "善良な青年なの。";
	next;
	mes "[エルーゼ]";
	mes "ただ、彼の家はとっても貧しいの。";
	mes "それさえなければ、本当に";
	mes "何も言うことないのだけれど。";
	next;
	mes "[エルーゼ]";
	mes "そんなクルトが最近、酷く悩んでるの。";
	mes "まぁ、年頃だし、";
	mes "女のことじゃないかしら？";
	next;
	mes "[エルーゼ]";
	mes "彼は、アインベフで貴重な存在。";
	mes "しかも彼を見てると、何となく";
	mes "希望が沸いてくるの。";
	mes "早く、元気になって欲しいわ。";
	close;
}

einbech.gat,149,154,3	script	ミュニア	850,{
	mes "[ミュニア]";
	mes "女が住むには、";
	mes "この村はとても過酷です。";
	mes "肌は荒れるし、筋肉はつくし……";
	next;
	mes "[ミュニア]";
	mes "アインブロックの方を見つけて、";
	mes "結婚し、早くこの村を出よう。";
	mes "結婚もしないで、ここでずっと";
	mes "暮らすなんて耐えられないわ！";
	next;
	mes "[ミュニア]";
	mes "見てください、この筋肉！";
	next;
	mes "[ミュニア]";
	mes "女でも、生活が苦しいから";
	mes "こんなになるまで仕事をしないと";
	mes "いけないなんて、酷いと思いません？";
	close;
}

//============================================================
// アインベフ室内NPC
//------------------------------------------------------------
ein_in01.gat,277,95,6	script	青年	855,{
	mes "[青年]";
	mes "お嬢ちゃん、可愛いね。";
	mes "仕事終わったらさ、";
	mes "俺と楽しい一時でもどう？";
	next;
	mes "[青年]";
	mes "そんな汚い服着てないでさ、";
	mes "お兄さんがもっと可愛いの";
	mes "買ってあげるよ！";
	next;
	mes "[青年]";
	mes "うん、何？　いや？";
	mes "ふふふ……";
	mes "気が変わったら、";
	mes "いつでも連絡ちょうだい。";
	close;
}

ein_in01.gat,279,92,3	script	酒場のお嬢さん	854,{
	mes "[酒場のお嬢さん]";
	mes "ここの男性は性格がとても荒いです。";
	mes "大胆で乱暴で、単純で無神経で!!";
	mes "力で全て思い通りになると";
	mes "思ってるのでしょうか？";
	next;
	mes "[酒場のお嬢さん]";
	mes "最近の女性は、ちょっとした";
	mes "優しさとか思いやりを望んでるんです。";
	mes "そういうトコを、男性はちゃんと";
	mes "分かってあげないといけません。";
	mes "ずっとこのままだと、一生";
	mes "結婚できないんじゃないかしら。";
	close;
}

ein_in01.gat,281,85,3	script	酔っている男	849,{
	mes "[酔っている男]";
	mes "……ヒック、ヒック";
	mes "グォォォォォォォ……";
	mes "……………………";
	close;
}

ein_in01.gat,208,86,3	script	トシ	855,{
	mes "[トシ]";
	mes "ああ、息苦しいな！";
	mes "早くお金を儲けて、";
	mes "隣の街に引っ越して";
	mes "こんな共同生活とは";
	mes "おさらばしたいよ！";
	close;
}

ein_in01.gat,192,90,3	script	スピナー	849,{
	mes "[スピナー]";
	mes "ぁぁぁ……腹減った……";
	mes "今、このご飯食べたら";
	mes "明日のご飯がない……";
	mes "ぁぁぁ……";
	close;
}

//============================================================
// モンスター情報NPC
//------------------------------------------------------------
einbech.gat,46,106,6	script	サナ#einbech	846,{
	mes "[サナ]";
	mes "昔は当たり前だった話なのに";
	mes "どうしてみんな、分からないと";
	mes "大騒ぎしているのかね？";
	next;
	mes "[ルイーダ]";
	mes "年寄りは知っている話でも、";
	mes "若い人たちは忙しいから";
	mes "そのような話を聞く暇も";
	mes "なかったのでしょう。";
	next;
	if(select("何の話ですか？","通り過ぎる")==2) {
		mes "[サナ]";
		mes "今日は、どんな話を";
		mes "しようかな……";
		close;
	}
	mes "[サナ]";
	mes "うん？";
	mes "見かけない娘さんだね。";
	next;
	if(Sex==0) {
		mes "[サナ]";
		mes "娘さんは旅人みたいだが、";
		mes "ここら辺に出るモンスターについて";
		mes "知っているかね？";
	}
	else {
		menu "男ですが……",-;
		mes "[サナ]";
		mes "そうかい？";
		mes "最近、目が弱ってしまってね。";
		mes "ホッホッホ。";
		next;
		mes "[サナ]";
		mes "娘さんは旅人みたいだが、";
		mes "ここら辺に出るモンスターについて";
		mes "知っているかね？";
		next;
		menu "だから、男だってば……",-;
		mes "[サナ]";
		mes "最近の若い者は、目上に対する";
		mes "礼儀を知らん！";
		next;
		mes "[サナ]";
		mes "せっかく、モンスターの情報を";
		mes "教えてあげようと言うのに、";
		mes "話をさえぎるとは何事か。";
		next;
		mes "[サナ]";
		mes "さあ、反省したら、ちゃんと";
		mes "おとなしく聞きなさい。";
	}
	next;
	while(1) {	//「やめる」を選択するまでループ
		switch(select("メタリンについて","ミネラルについて","ピットマンについて","ジャンクポットについて","やめる")) {
		case 1:
			mes "[サナ]";
			mes "人間が生まれるはるか昔に";
			mes "オーディンが巨人と戦った。";
			next;
			mes "[サナ]";
			mes "ポリンやドロップスのような形態の";
			mes "モンスターは、オーディンの唾から";
			mes "生まれたと聞いたことがあるが……";
			next;
			mes "[サナ]";
			mes "メタリンは、オーディンと戦った";
			mes "巨人の死骸から生まれたのじゃ。";
			next;
			mes "[サナ]";
			mes "人間が流した血は、";
			mes "固まり硬くなる。";
			mes "巨人が流した血は、人間のより";
			mes "硬くなり、金属となり、";
			mes "メタリンとなったのじゃ！";
			next;
			mes "[サナ]";
			mes "よく見ると、メタリンの上の方に";
			mes "血管みたいなものが、";
			mes "動いているのが見えるだろう。";
			next;
			mes "[サナ]";
			mes "地に落ちたものを拾って食べる習性は";
			mes "ポリンと一緒だが、";
			mes "姿形が本当に気色悪い……";
			next;
			mes "[サナ]";
			mes "そうそう、メタリンは大きなゼロピー、";
			mes "鉄鉱石や鉄を落としたりするな。";
			break;
		case 2:
			mes "[サナ]";
			mes "鍾乳石や鉱石は、何百年何千年かけて";
			mes "洞窟の中で育つ話を知っているかな？";
			next;
			mes "[サナ]";
			mes "鍾乳石は、石灰石で出来た洞窟が水に";
			mes "溶かされ、その液体が流れ落ちて";
			mes "つららのように固まったものじゃ。";
			next;
			mes "[サナ]";
			mes "しかし、鍾乳石が洞窟で育つ一方、";
			mes "鉱石は石の中で育つ。";
			next;
			mes "[サナ]";
			mes "そして、邪悪な気が充満する洞窟で";
			mes "長い年月を過ごした鉱石には、";
			mes "邪悪な意志が宿ってしまうのじゃ。";
			next;
			mes "[サナ]";
			mes "以前、鉱山で発見されたアレが";
			mes "影響を与えたのかもしれん……";
			next;
			mes "[サナ]";
			mes "長い年月、鉱山に出入りする人を";
			mes "観察してきたせいか、どのように";
			mes "攻撃すれば一番効率的か";
			mes "分かっているらしい。";
			mes "戦うなら、気をつけなされ。";
			next;
			mes "[サナ]";
			mes "それからミネラルは、";
			mes "^3333FF星のかけら^000000や^3333FFトパーズ^000000、";
			mes "^3333FFエンベルタコン^000000を落とす。";
			mes "運が良ければ、珍しい宝石も";
			mes "落とすらしいが、わしは";
			mes "見たことないな。";
			break;
		case 3:
			mes "[サナ]";
			mes "ピットマンは、使えなくなった";
			mes "トロッコを勝手に引いて遊ぶ";
			mes "幽霊じゃ。";
			next;
			mes "[サナ]";
			mes "長い間使われて修理もできなくなった";
			mes "トロッコは、魂が宿るようになる。";
			mes "まぁ、トロッコに限らず、";
			mes "物は長く使えば、そうなるがな。";
			next;
			mes "[サナ]";
			mes "そして事故などで死んだ坑夫の魂が、";
			mes "そんなトロッコと";
			mes "融合してしまうのじゃ。";
			mes "そんなところに縛られずに、";
			mes "神の下に召されればいいのになぁ。";
			next;
			mes "[サナ]";
			mes "ピットマンを成仏させることが出来れば";
			mes "^3333FF古いつるはし^000000、^3333FFランタン^000000、^3333FF鉄^000000、";
			mes "^3333FF鋼鉄^000000、^3333FF石炭^000000、^3333FF古い鉄板^000000、^3333FF懐中電灯^000000を";
			mes "もらえるらしい。";
			break;
		case 4:
			mes "[サナ]";
			mes "見れば分かる。";
			mes "ボロボロの暖炉じゃ。";
			next;
			if(select("……それだけ？","ほほー！")==1) {
				mes "[サナ]";
				mes "それだけだ。他に何か？";
				mes "新しい、最新機能の暖炉が出たら";
				mes "古い暖炉が捨てられるのは";
				mes "よくあることじゃ。";
				next;
				mes "[サナ]";
				mes "鉄はリサイクルすべきもの。";
				mes "なのにここの人は鉱石に関して、";
				mes "節約感覚が全然ない！";
				next;
				mes "[サナ]";
				mes "いつかは資源もなくなるというのに。";
				mes "その時期を延ばそうと思うなら、";
				mes "リサイクルが必要なのは、誰だって";
				mes "分かるはずなのにな。";
				next;
				mes "[サナ]";
				mes "ジャンクポットも、魔物に転じて";
				mes "しまったとはいえ、元は鉄くず。";
				mes "倒して落とした破片はリサイクル";
				mes "できるかもしれん。";
				next;
				mes "[サナ]";
				mes "それからジャンクポットは、";
			}
			else {
				mes "[サナ]";
				mes "うむ！";
				mes "わしは、最近のデザインより、";
				mes "昔のものの方が味があって好きじゃ！";
				next;
				mes "[サナ]";
				mes "捨てられた暖炉が、モンスターに";
				mes "なってしまうとは、悲しいのう～。";
				next;
				mes "[サナ]";
				mes "ジャンクポットは、";
			}
			mes "^3333FFへこんだやかん^000000や^3333FF燃えた木^000000、^3333FF鉄^000000、";
			mes "^3333FF鉄鉱石^000000、^3333FF古い鉄板^000000だけでなく、";
			mes "時には^3333FF甘い牛乳^000000や^3333FFアロエベラ^000000を";
			mes "落とすそうじゃ。";
			break;
		case 5:
			mes "[サナ]";
			mes "そうか、そうか。";
			mes "気をつけてな、娘さん。";
			next;
			mes "[サナ]";
			mes "母は話好きなの。";
			mes "だからもし退屈になったら、また";
			mes "母の話でも聞きに来てくださいな。";
			close;	//ここで終了
		}
		next;
		mes "[サナ]";
		mes "他にも何か聞くかな？";
		next;
	}
}

einbech.gat,48,106,3	duplicate(サナ#einbech)	ルイーダ	850

einbech.gat,148,242,5	script	ユング	855,{
	mes "[ユング]";
	mes "私はアインブロックとアインベフを";
	mes "長い間、研究してきた。";
	mes "鉱山へ行くなら、私の情報を";
	mes "聞いてからの方がいいよ。";
	next;
	if(select("はい、お願いします","このまま行きます")==2) {
		mes "[ユング]";
		mes "そうか。";
		mes "聞いた方がいいのに。";
		mes "まぁ、がんばりなよ。";
		close;
	}
	mes "[ユング]";
	mes "じゃあ鉱山にいるモンスターについて";
	mes "説明してあげよう。";
	mes "どれについて聞きたい？";
	next;
	switch(select("ノクシャス、ベノマス","ポルセリオ","オブシディアン")) {
	case 1:
		mes "[ユング]";
		mes "ノクシャスとベノマスか……";
		mes "実は、詳しいことは";
		mes "よく分かってないんだ。";
		next;
		mes "[ユング]";
		mes "あいつは、アインブロックの";
		mes "発展が活発になってから";
		mes "現われ始めた。昔からここに";
		mes "住んでいる人達も、昔は";
		mes "見かけなかったと言っている。";
		next;
		mes "[ユング]";
		mes "正体は詳しく分かっていないけど";
		mes "危険な存在だ。";
		mes "何というか……自然発生ではなく";
		mes "人工的に生まれたと言えるかも";
		mes "しれない……";
		next;
		mes "[ユング]";
		mes "しかもあいつらの目は、";
		mes "自分を倒して欲しいというような";
		mes "悲しい目をしているそうな。";
		next;
		mes "[ユング]";
		mes "ノクシャスとベノマスを倒すと、";
		mes "^FF0000リンゴ^000000、^FF0000粉じん^000000、^FF0000菌糸^000000、^FF0000毒の粉^000000、";
		mes "^FF0000有毒ガス^000000、^FF0000カビの粉^000000、";
		mes "^FF0000アンティペインメント^000000を得られるよ。";
		next;
		mes "[ユング]";
		mes "ノクシャスとベノマスは無形で、";
		mes "念と毒属性のモンスターだから";
		mes "気をつけた方がいいよ。";
		mes "彼らは、空気の中に潜んで、";
		mes "危険をばらまくからね。";
		break;
	case 2:
		mes "[ユング]";
		mes "ポルセリオか……";
		mes "ポルセリオは洞窟の鍾乳石から落ちる";
		mes "水を飲んで暮らしている虫さ。";
		next;
		mes "[ユング]";
		mes "ウンゴリアントとは異なり、";
		mes "石炭みたいな鉱物の周辺に";
		mes "棲息するモンスターだ。";
		next;
		mes "[ユング]";
		mes "坑夫達曰く、ポルセリオが住む";
		mes "洞窟は、スプーンで掘っても";
		mes "良い鉱物が出るらしいよ。";
		next;
		mes "[ユング]";
		mes "ポルセリオは小型の昆虫、";
		mes "地属性モンスターで、倒すと";
		mes "^FF0000ジュビリー^000000、^FF0000虫の觸覚^000000、";
		mes "^FF0000単細胞^000000、^FF0000朝の露が宿っている苔^000000、";
		mes "^FF0000蛍光色の液体^000000なんかを得られるよ。";
		break;
	case 3:
		mes "[ユング]";
		mes "オブシディアンは見た目通り、";
		mes "生きている鉱物さ。";
		next;
		mes "[ユング]";
		mes "地から生まれる石炭や宝石は";
		mes "神秘的な力を持っていて、それらには";
		mes "魂に匹敵するエネルギーがあると";
		mes "昔の人は信じていたんだ。";
		next;
		mes "[ユング]";
		mes "オブシディアンには、月明かりがない";
		mes "真っ暗な闇さえ、何十里先まで照らせる";
		mes "力があると言われている。";
		next;
		mes "[ユング]";
		mes "それだけの力を持っているんだ。";
		mes "戦うつもりなら、相当の";
		mes "実力者じゃないと、危険だね。";
		next;
		mes "[ユング]";
		mes "オブシディアンは小型の";
		mes "無形モンスターで、倒すと";
		mes "^FF0000ダイヤモンド１カラット^000000、";
		mes "^FF0000黒水晶のかけら^000000、^FF0000石炭^000000、^FF0000エルニウム^000000、";
		mes "^FF0000鋼鉄^000000、^FF0000鉄^000000を得られるらしいよ。";
		next;
		mes "[ユング]";
		mes "昔の文献に、エネルギーとしての";
		mes "オブシディアンの記述がないことが";
		mes "惜しいね……";
		break;
	}
	next;
	mes "[ユング]";
	mes "他のモンスターについても知りたいなら";
	mes "またおいで。";
	close;
}

einbech.gat,148,246,5	script	テス	851,{
	mes "[テス]";
	mes "あ～、退屈だ～。";
	mes "おや、そこを行くのは冒険者かい。";
	mes "鉱山に行くなら、ちょっと";
	mes "耳寄りな情報があるよ。";
	mes "聞いてくかい？";
	next;
	if(select("はい","いいえ")==2) {
		mes "[テス]";
		mes "ふーん。あ、そう。";
		mes "僕の話を聞かないで、後で";
		mes "何があっても知らないからね～。";
		close;
	}
	mes "[テス]";
	mes "よ～し、よしよし。";
	mes "鉱山で暮らす化け物か";
	mes "ここら近辺の化け物、";
	mes "どっちの話を聞きたい？";
	next;
	if(select("鉱山の化け物の話","近辺の化け物の話")==1) {
		mes "[テス]";
		mes "鉱山にはね……";
		mes "鉱山の主と呼ばれる";
		mes "ウンゴリアントがいるんだ。";
		next;
		mes "[テス]";
		mes "元は、地中奥深くに眠る";
		mes "力を持つ石の近くに、自分の巣を";
		mes "作って暮らしていたんだ。";
		mes "アインベフでも、ウンゴリアントが";
		mes "現われたっていう話は、昔からある。";
		next;
		mes "[テス]";
		mes "でも、その話を頻繁に";
		mes "聞くようになったのは、";
		mes "そんなに昔のことじゃない。";
		mes "何年か前に起きた坑道の";
		mes "陥没事故以来だ。";
		next;
		mes "[テス]";
		mes "その事故以来、ウンゴリアントが";
		mes "出没する頻度が高くなり、";
		mes "陥没事故もそれと比例して増えた。";
		next;
		mes "[テス]";
		mes "昔話にもあるけど、巨人族が人間の";
		mes "鉱山に盗みに入ってくると、";
		mes "ウンゴリアントはその大きな足音を";
		mes "聞きつけて、巨人をみんな";
		mes "倒してしまったんだって。";
		next;
		mes "[テス]";
		mes "朝、坑夫達が仕事に来ると、";
		mes "巨人の死骸が散らばっていて、";
		mes "ビックリしたそうだ。";
		mes "その後、ウンゴリアントは鉱山の主と";
		mes "呼ばれるようになり、坑夫の間で";
		mes "崇められるようになりましたとさ。";
		next;
		mes "[テス]";
		mes "ウンゴリアントは大型の昆虫形";
		mes "モンスターで、倒せたっていう";
		mes "冒険者の話によると……";
		next;
		mes "[テス]";
		mes "^FF0000蟻の顎^000000と^FF0000華麗な蟲の皮^000000、";
		mes "^FF0000けっこうかたい皮^000000、^FF0000虫の足^000000、";
		mes "^FF0000蛍光色の液体^000000、^FF0000ジルコン^000000なんかを";
		mes "得たって言ってたよ。";
		next;
		mes "[テス]";
		mes "かなり強いモンスターらしいから";
		mes "鉱山では、ことさら気をつけた方が";
		mes "いいよ。";
		close;
	}
	mes "[テス]";
	mes "ベアドールなんだけどね……";
	mes "最近、そのモンスターが";
	mes "大問題になっているんだ。";
	mes "どこから話したらいいかな……";
	next;
	mes "[テス]";
	mes "以前、アインブロック郊外の空き地に";
	mes "大量の熊の人形、ベアドールが";
	mes "廃棄処分されていたことがあったんだ。";
	next;
	mes "[テス]";
	mes "その人形、元々は子供用の";
	mes "動くおもちゃだったんだ。";
	mes "ちょっと重いんだけど、安いし";
	mes "手頃な値段だったから、";
	mes "けっこう売れたんだって。";
	next;
	mes "[テス]";
	mes "ところが、その人形を買った";
	mes "家族が殺される事件が";
	mes "発生するようになったんだ。";
	mes "そのうち、その人形が";
	mes "自力で動いてるって話が";
	mes "出回り始めてさ。";
	next;
	mes "[テス]";
	mes "人気商品だったから、";
	mes "その噂が世間に広まるのに、";
	mes "そう時間はかからなかったさ。";
	mes "そんな事があって";
	mes "調査が始まったんだけど、";
	mes "奇妙なことが判ってね。";
	next;
	mes "[テス]";
	mes "このベアドールの仕入先なんだけど、";
	mes "これを仕入れてきた商人達の話だと、";
	mes "どうやら誰もが同じ人間から";
	mes "仕入れていたらしい。";
	mes "そして、その人物は、どうやら";
	mes "アインブロックの人間じゃないらしい。";
	next;
	mes "[テス]";
	mes "他にも何かあったのかもしれないけど、";
	mes "そのベアドール回収に、とうとう";
	mes "軍隊が派遣されることになった。";
	next;
	mes "[テス]";
	mes "回収は問題なく進んだ。";
	mes "簡単すぎたくらいさ。";
	mes "そして、最後の最後で";
	mes "トラブルが発生した！";
	next;
	mes "[テス]";
	mes "軍が、街外れの空き地で";
	mes "廃棄処理をしようとした途端！";
	mes "回収したベアドール全部が動きだして";
	mes "混乱に乗じて逃げてしまったんだ！";
	next;
	mes "[テス]";
	mes "ベアドール達は、本当は";
	mes "何か目的があって作られ、";
	mes "誰かに操作されていた、";
	mes "そう思わないかい？";
	next;
	mes "[テス]";
	mes "ベアドールを倒した奴の話によると、";
	mes "こいつらは無形の小型モンスターで";
	mes "倒すと、^FF0000ハチ蜜^000000、";
	mes "^FF0000錆びたネジ^000000、^FF0000オリデオコンの金槌^000000を";
	mes "得られるんだってさ。";
	next;
	mes "[テス]";
	mes "僕が知ってるのはこれくらいかな。";
	mes "それじゃあ、気をつけてね。";
	close;
}

//============================================================
// 恋人クエストNPC
//- Registry -------------------------------------------------
// EIN_1QUE -> 0～15
//------------------------------------------------------------
ein_in01.gat,31,137,3	script	カーラ	90,{
	switch(EIN_1QUE) {
	case 2:
		mes "[カーラ]";
		mes "またお会いしましたね、冒険者さん。";
		mes "こちらには、お仕事で";
		mes "いらしているのですか？";
		next;
		mes "[カーラ]";
		mes "え、クルトさんですか？";
		mes "……えぇ、知っています。";
		mes "アインベフのクルトさんでしょう？";
		mes "一つも悪い所がない、";
		mes "とても素敵な方です。";
		next;
		mes "[カーラ]";
		mes "私に会いたいと言っていたのですか？";
		mes "……私も会いたいです。";
		mes "でも、無理です。私の両親は";
		mes "クルトを嫌っています。";
		mes "いえ、正確に言えば、";
		mes "貧乏なクルトを嫌っています。";
		next;
		mes "[カーラ]";
		mes "金のない奴と遊ばせるわけには";
		mes "いかない。当然、結婚も";
		mes "認めることはできない。";
		mes "いつも、両親が言う言葉です。";
		mes "だから私は今、彼と";
		mes "会うことができません……";
		next;
		mes "[カーラ]";
		mes "……そうだわ。";
		mes "これを彼に持っていってください。";
		mes "私の大事な楽器です。これで";
		mes "少しでも彼の心の支えになれたら……";
		next;
		mes "[カーラ]";
		mes "初対面の方に、このような";
		mes "お願いをしてしまい、";
		mes "申し訳ないと思っています。";
		mes "でも、他に頼れる方がいないのです。";
		mes "どうかお願いします。";
		getitem 1901,1;
		set EIN_1QUE,3;
		close;
	case 3:
		mes "[カーラ]";
		mes "早く……お願いします。";
		mes "アインベフの彼に、";
		mes "忘れずに伝えてください。";
		mes "この楽器が、私の代わりに、";
		mes "少しでも彼の支えになれたら……";
		mes "お願いします。";
		close;
	case 4:
		mes "[カーラ]";
		mes "この家を出る時は、";
		mes "父に気をつけてください。";
		mes "父は厳格で……私だけでなく、";
		mes "私の所持品も家の外に出るのを";
		mes "嫌がるのです。";
		next;
		mes "[カーラ]";
		mes "バイオリンは、取り戻しておきました。";
		mes "どうか、お気をつけください。";
		getitem 1901,1;
		set EIN_1QUE,3;	//フラグが戻される
		close;
	case 5:
		if(countitem(712)) {
			mes "[カーラ]";
			mes "クルトにバイオリンを";
			mes "届けてもらえましたか？";
			next;
			mes "[カーラ]";
			mes "え、この花を私に……？";
			mes "クルト……";
			mes "ありがとうございます、冒険者さん。";
			next;
			mes "[カーラ]";
			mes "そういえば、こんなに助けて";
			mes "もらっているのに、冒険者さんの";
			mes "お名前を聞いていませんでしたね。";
			mes "お名前を教えてもらっていいですか？";
			next;
			input '@name$;
			if('@name$ != strcharinfo(0)) {
				mes "[カーラ]";
				mes "お名前を教えてください。";
				mes "ここまで助けてくださった方の";
				mes "お名前を、ちゃんと知りたいのです。";
			}
			else {
				mes "[カーラ]";
				mes strcharinfo(0)+ "さんですか。";
				mes "このご恩は忘れません……";
				mes "本当にありがとうございます。";
				mes "もし、またアインベフに";
				mes "足を運ぶことがありましたら、";
				next;
				mes "[カーラ]";
				mes "ありがとうって言ってたって";
				mes "クルトに伝えてくれますか？";
				mes "そして……会いたいと……";
				mes "いつでも待っていると……";
				delitem 712,1;
				set EIN_1QUE,6;
			}
			close;
		}
		//countitem(712)==0のときはfall through
	default:
		mes "[カーラ]";
		mes "あの広く青い空の下、";
		mes "大地に流れる川を見ながら、";
		mes "風のように自由になれたら";
		mes "どんなに素敵でしょう。";
		next;
		mes "[カーラ]";
		mes "……私には、そんな生活、";
		mes "きっとできない。";
		mes "私には、力も勇気もないから、";
		mes "きっと無理……";
		next;
		mes "[カーラ]";
		mes "あなたがうらやましいわ。";
		mes "私にも、全てを捨ててでも";
		mes "大事なただ一つのものを選ぶ";
		mes "勇気があればいいのに。";
		if(BaseLevel >= 60 && EIN_1QUE==0)
			set EIN_1QUE,1;
		close;
	case 14:
		mes "[カーラ]";
		mes "母を説得した後、クルトを";
		mes "元気づけてくれたそうですね。";
		mes "このご恩、どのように返せば";
		mes "いいのでしょう……";
		mes "心から感謝いたします。";
		next;
		mes "[カーラ]";
		mes "私も、何か出来ることからしたいと";
		mes "思うようになりました。まだ何が";
		mes "出来るかは分かりませんが……";
		mes "でもいつかきっと、両親の考えを";
		mes "変えてみせます。";
		next;
		mes "[カーラ]";
		mes "そうだ。私の家に代々伝わる";
		mes "健康の秘法を施しましょう。";
		mes "10秒ほどで、どんな人でも";
		mes "元気になれるんですよ。";
		next;
		unequip;
		mes "[カーラ]";
		mes "そこで横になってくださいね。";
		mes "分厚い装備は脱いでください。";
		mes "少し痛くても我慢してくださいね。";
		mes "いいですか、始めますよ。";
		next;
		mes "-トントントン、タントントン-";
		mes "-もみもみ、たんとんとん-";
		mes "-トントントン、タントントン-";
		mes "-もみもみ、たんとんとん-";
		next;
		percentheal 100,100;
		set EIN_1QUE,15;
		if(checkre()) {
			if(BaseLevel > 80)	getexp 20000,0;
			else if(BaseLevel > 60)	getexp 3000,0;
			else			getexp 600,0;
		}
		else {
			if(BaseLevel > 80)	getexp 200000,0;
			else if(BaseLevel > 60)	getexp 30000,0;
			else			getexp 6000,0;
		}
		mes "-元気になった！";
		mes "……気がする-";
		next;
		mes "[カーラ]";
		mes "どうですか？";
		mes "もっと何かできたらよいのでしょうが、";
		mes "これが、今の私にできる";
		mes "精一杯なんです。";
		next;
		mes "[カーラ]";
		mes "本当に、ここまで色々してくださり";
		mes "ありがとうございます。";
		mes "冒険者さん、良い旅を。";
		close;
	 case 15:
		mes "[カーラ]";
		mes "ありがとうございます。";
		mes "必ず両親に彼との仲を";
		mes "認めてもらえるよう、";
		mes "頑張ります。";
		next;
		mes "[カーラ]";
		mes "それが私達の、いいえ、";
		mes "アインブロックとアインベフの";
		mes "仲を少しでも良くするきっかけに";
		mes "なるかもしれないから。";
		close;
	}
}

ein_in01.gat,200,101,5	script	クルト	854,{
	switch(EIN_1QUE) {
	case 0:
		mes "[クルト]";
		mes "あなたは、本当に自由で幸せですか？";
		mes "本当に、あらゆる束縛から";
		mes "脱出することができると思いますか？";
		mes "何よりも愛しい人と会えない痛みは";
		mes "僕を無気力にします……";
		close;
	case 1:
		mes "[クルト]";
		mes "ん？　この香り……そうか。";
		mes "あなた、アインブロックにいる";
		mes "カーラに会いましたね。";
		mes "やっぱりお金持ちの家は違いますね。";
		mes "家のあちこちから綺麗な";
		mes "香りがしたでしょう。";
		next;
		mes "[クルト]";
		mes "カーラ……彼女はどうでした？";
		mes "一輪の勿忘草みたいに、美しい彼女……";
		mes "太陽のように明るい微笑み、";
		mes "白くて、清らかな……ああ！";
		next;
		mes "[クルト]";
		mes "あ、初対面なのに、ごめんなさい。";
		mes "……僕を愚かと笑いますか。";
		mes "どうぞ。僕は愚かですから。";
		mes "自分でも、こんなに勇気のない";
		mes "意気地なしだって、気がつかなかった";
		mes "愚か者なんですから。";
		next;
		mes "[クルト]";
		mes "さすがにこれ以上は、";
		mes "初対面の方に話せません。";
		mes "まぁ～、アインベフに";
		mes "クルトというバカな青年がいた、";
		mes "ただそれだけのことですよ……";
		set EIN_1QUE,2;
		close;
	//先に3,4から処理
	case 3:
	case 4:
		if(countitem(1901)) {
			mes "[クルト]";
			mes "また来たんですか……";
			mes "僕のことは忘れた方がいいですよ。";
			mes "ん……それは？";
			next;
			mes "[クルト]";
			mes "そのバイオリン！";
			mes "カーラのバイオリンでは!?";
			mes "その音色で、僕を幸せにしてくれた";
			mes "バイオリンが……何故？";
			next;
			mes "[クルト]";
			mes "……そうですか。";
			mes "カーラがそんなことを。";
			mes "このバイオリンを自分の代わりと";
			mes "思って欲しいということだろうか……";
			next;
			mes "[クルト]";
			mes "冒険者さん、僕の頼みを一つ";
			mes "聞いてくれませんか。";
			mes "僕も、彼女に贈り物をしたいのです。";
			next;
			mes "[クルト]";
			mes "^FF0000花^000000を一輪、";
			mes "彼女に買ってあげてくれませんか？";
			mes "僕が買ってあげられたらいいんですが、";
			mes "花一輪買うお金すらないんです。";
			next;
			mes "[クルト]";
			mes "花代の代わりに、少し";
			mes "マッサージしてあげます。";
			mes "あの、そんな大層なものではないので、";
			mes "あんまり効果はないかもしれませんが。";
			next;
			mes "-トントントン、タントントン-";
			mes "-もみもみ、たんとんとん-";
			mes "-トントントン、タントントン-";
			mes "-もみもみ、たんとんとん-";
			next;
			delitem 1901,1;
			percentheal 100,100;
			set EIN_1QUE,5;
			if(checkre()) {
				if(BaseLevel > 80)	getexp 20000,0;
				else if(BaseLevel > 60)	getexp 3000,0;
				else			getexp 600,0;
			}
			else {
				if(BaseLevel > 80)	getexp 200000,0;
				else if(BaseLevel > 60)	getexp 30000,0;
				else			getexp 6000,0;
			}
			mes "-元気になった！";
			mes "……気がする-";
			next;
			mes "[クルト]";
			mes "それでは、お願いします。";
			mes "どうか、カーラに花を。";
			close;
		}
		//countitem(1901)==0のときはfall through
	case 2:
		mes "[クルト]";
		mes "同情はいらないですよ。";
		mes "勇気のない馬鹿なだけです。";
		mes "このまま忘れてください。";
		close;
	case 5:
		mes "[クルト]";
		mes "どうか、カーラに花を一輪、";
		mes "買ってあげてくれませんか？";
		mes "商店で売っている、ごく普通の";
		mes "^FF0000花^000000でいいですから。";
		close;
	case 6:
		mes "[クルト]";
		mes "そうですか……";
		mes "カーラがそんなことを……";
		mes "そう言えば、まだお名前を";
		mes "聞いていなかったですね。";
		next;
		mes "[クルト]";
		mes "よかったら、お名前を";
		mes "聞いていいですか？";
		next;
		input '@name$;
		if ('@name$ != strcharinfo(0)) {
			mes "[クルト]";
			mes "あ、そんなに緊張しないで。";
			mes "お名前、教えてもらえませんか？";
			close;
		}
		mes "[クルト]";
		mes strcharinfo(0)+ "さんですか。";
		mes "良いお名前ですね。";
		mes "ありがとうございました。";
		mes "このご恩は一生忘れません。";
		next;
		mes "[クルト]";
		mes "もうカーラと会うことは";
		mes "ないでしょうが、";
		mes strcharinfo(0)+ "さんの";
		mes "おかげで少し気が楽になりました。";
		next;
		mes "[クルト]";
		mes "ありがとうございました。";
		mes "そうだ、母が話をしたいと";
		mes "言っていました。帰りにでも";
		mes "会ってもらえますか。";
		set EIN_1QUE,7;
		close;
	default:	//7～11のとき
		mes "[クルト]";
		mes "……どうすれば、私達の仲を";
		mes "認めてもらえるのだろう……";
		close;
	case 12:
		mes "[クルト]";
		mes "ええ、何だって?!";
		mes "カーラのお母さんが、";
		mes "きちんとした格好をしてくれば、";
		mes "カーラと会っていいって";
		mes "言ったって？";
		next;
		mes "[クルト]";
		mes "あの、本当ですか？";
		mes "でも、話が急すぎて……";
		mes "信じられません。";
		mes "どんな魔法を使ったんですか？";
		next;
		mes "[クルト]";
		mes "ああ、こうしている場合じゃない。";
		mes "格好……服だよね、服。";
		mes "ああ、どうしよう?!";
		set EIN_1QUE,13;
		close;
	case 13:
		if (countitem(7170)==0) {
			mes "[クルト]";
			mes "ああ、こうしている場合じゃない。";
			mes "格好……服だよね、服。";
			mes "ああ、どうしよう?!?!";
			close;
		}
		mes "[クルト]";
		mes "服……服……服！";
		mes "ああっ……!!";
		mes "ううむ、ええと、ふむむ～";
		mes "こうでもないし、ああでもないし……";
		next;
		mes "[クルト]";
		mes "え？";
		mes "その綺麗で素敵な服を";
		mes "僕にくれるのですか？";
		next;
		if(select("あげる","あげない")==2) {
			mes "[クルト]";
			mes "そうですよね……";
			mes "そこまで頼るなんて";
			mes "いけないですよね。";
			mes "ごめんなさい。";
			mes "ここまで手伝ってくれただけでも";
			mes "感謝しきれないほどなのに……";
			close;
		}
		mes "[クルト]";
		mes "ありがとうございます！";
		mes "これで、これでカーラに";
		mes "会いに行けます！";
		next;
		mes "[クルト]";
		mes "あの、ごめんなさい。";
		mes "ずっと助けてもらっているのに、";
		mes "僕はお礼も忘れてうろたえてばかりで。";
		mes "それなのに、こんな服までもらって";
		mes "しまって……本当に、ごめんなさい。";
		next;
		mes "[クルト]";
		mes "そして、本当にありがとうございます。";
		mes "こんな、見ず知らずの僕に、";
		mes "ここまでしてくれるなんて。";
		next;
		mes "[クルト]";
		mes "そうだ！";
		mes "お礼に、これを差し上げます。";
		mes "鉱山で見つけたものですが、";
		mes "よければどうぞ。";
		next;
		delitem 7170,1;
		getitem 7289+rand(9),1;		//ちょうどアイテムIDが1ずつ増加
		set EIN_1QUE,14;
		mes "[クルト]";
		mes "どれくらい価値があるか、僕には";
		mes "判りませんが、これくらいしか";
		mes "あげられるものがないんです。";
		mes "どうぞ、受け取ってください。";
		next;
		mes "[クルト]";
		mes strcharinfo(0)+ "さんの";
		mes "おかげで、何だか、";
		mes "頑張れる気がしてきました。";
		mes "あなたが手伝ってくれたことを";
		mes "忘れずに、勇気を出してみようと";
		mes "思います。";
		next;
		mes "[クルト]";
		mes "カーラとのこと、きっと";
		mes "何とかしてみせます！";
		mes "カーラとの結婚式には、";
		mes "是非招待させてくださいね。";
		mes "本当に、ありがとうございます。";
		close;
	case 14:
	case 15:
		mes "[クルト]";
		mes "僕、頑張ってみます。";
		mes "今までの自分に囚われず";
		mes "努力を怠らなければ、いつか";
		mes "認めてもらえると思います。";
		close;
	}
}

ein_in01.gat,21,147,3	script	メガス	853,3,3,{
	end;
OnTouch:
	switch(EIN_1QUE) {
	case 3:
		if(countitem(1901)) {
			mes "[メガス]";
			mes "む！";
			mes "そのバイオリンは私が";
			mes "娘に買い与えたもの！";
			mes "この泥棒が！　それを返せ!!";
			next;
			mes "[メガス]";
			mes "警備員！";
			mes "こいつをぶん殴って、";
			mes "道端に捨ててしまえ！";
			close2;
			delitem 1901,1;
			set EIN_1QUE,4;
			percentheal -90,0;
			break;
		}
		//countitem(1901)==0ならfall through
	default:
		mes "[メガス]";
		mes "由緒あるカペルタの家に、";
		mes "お前のような得体の知れない者を";
		mes "入れるわけにはいかん！";
		mes "とっとと出て行け！";
		mes "出て行け、出て行け!!";
		close2;
		break;
	case 4:
		mes "[メガス]";
		mes "また来たのか！";
		mes "強盗の現行犯で逮捕してやる！";
		mes "今度は何を盗みに来た!?";
		next;
		mes "[メガス]";
		mes "警備員！";
		mes "こいつをぶん殴って、";
		mes "道端に捨ててしまえ！";
		close2;
		percentheal -90,0;
		break;
	}
	warp "einbroch.gat",112,245;
	end;
}

ein_in01.gat,191,102,5	script	カイザ	846,{
	switch(EIN_1QUE) {
	default:	//0～6,9～12のとき
		mes "[カイザ]";
		mes "このような場所に、何かご用ですか？";
		mes "ここには、本当に何もありませんよ。";
		next;
		mes "[カイザ]";
		mes "ここでの生活は、あまりにも";
		mes "余裕がありません。";
		mes "個人で家を持つなんて、夢のまた夢。";
		mes "資金もなければ、土地もない……";
		mes "それでも、ここで生活しなければ";
		mes "ならないのです。";
		close;
	case 7:
		mes "[カイザ]";
		mes "息子の頼みを聞いて";
		mes "くださったそうですね。";
		mes "確かに貧乏かもしれませんが、";
		mes "根は真面目で良い子なんです。";
		mes "それが、どういう経緯でお金持ちの";
		mes "お嬢さんと知り合ったのか……";
		next;
		mes "[カイザ]";
		mes "あちらは、アインブロックの";
		mes "町内で大事に育てられたお嬢さん。";
		mes "こちらは、アインベフの";
		mes "厳しい環境の下で育った息子……";
		next;
		mes "[カイザ]";
		mes "お互いに惹かれあったのは";
		mes "必然かもしれません。";
		mes "男と女というのは、お互いに";
		mes "無いものを求めるものですから。";
		next;
		mes "[カイザ]";
		mes "でも現在、元は一つの村とも";
		mes "言えた村が二つに分かれ、";
		mes "お互いを憎んでいる……";
		mes "神はどうして、二つの村の男女に、";
		mes "このような苦痛を与えるのか……";
		next;
		mes "[カイザ]";
		mes "息子とカーラさんのためにも、何かを";
		mes "変えなければならないのでしょう。";
		mes "けれどもカーラさんは女性ですし、";
		mes "育ちもよいので、新しく何かをやる";
		mes "度胸はなさそうですが……";
		next;
		mes "[カイザ]";
		mes "どうすればいいでしょう。";
		mes "このまま、二つの村がいがみ合い、";
		mes "愛しあう者同士が結ばれないなど、";
		mes "悲しいことです。";
		set EIN_1QUE,8;
		close;
	case 8:
		mes "[カイザ]";
		mes "このまま、二つの村がいがみ合い、";
		mes "愛しあう者同士が結ばれないなど、";
		mes "悲しいことです。";
		close;
	case 13:
		mes "[カイザ]";
		mes "息子のために、色々と手伝ってくださり";
		mes "本当にありがとうございます。";
		mes "それなのに、息子は礼も言えずに";
		mes "右往左往するばかり……";
		next;
		mes "[カイザ]";
		mes "たかが服で、あんなに慌てるなんて。";
		mes "未熟で、お恥ずかしい。";
		next;
		mes "[カイザ]";
		mes "タキシードを着こなせとまでは";
		mes "言いませんが、せめてもう少し、";
		mes "落ち着いて欲しいものです。";
		close;
	case 14:
	case 15:
		mes "[カイザ]";
		mes "息子を手伝ってくださって、";
		mes "本当に感謝いたします。";
		mes "ああ、あんなに前向きな息子が";
		mes "見られるなんて……！";
		close;
	}
}

ein_in01.gat,31,151,3	script	サトラ	850,{
	switch(EIN_1QUE) {
	default:	//0～8のとき
		mes "[サトラ]";
		mes "ああ、旅人かい？";
		mes "主人は、すぐに追い出そうとするけど";
		mes "この私は、寛大だからね。";
		mes "ゆっくりしていきな。ワハハ！";
		if(EIN_1QUE != 8)
			close;
		next;
		if(countitem(1003) < 10) {
			mes "[サトラ]";
			mes "アインブロック、いや、";
			mes "カペルタ家にとってアインベフは、";
			mes "私達のために鉱山から石炭を";
			mes "掘り出すだけの存在さ。";
			mes "そんな奴らが、私達に";
			mes "近づこうなんて笑っちゃうね。";
			next;
			mes "[サトラ]";
			mes "まぁ、私達と同等にはなれないけど";
			mes "^FF0000私達のために、石炭をたくさん";
			mes "集めてさえくれば、階級は上がるさ。^000000";
			mes "ワハハハ！";
			next;
			mes "[サトラ]";
			mes "ん、そろそろ帰るのかい？";
			mes "カペルタ家で話をたくさん聞けたんだ。";
			mes "自慢していいさ。ワハハ！";
			close;
		}
		mes "[サトラ]";
		mes "おお、石炭か。当然、";
		mes "カペルタへの献上品ね。";
		mes "ありがたく受け取ってあげましょう。";
		mes "ワハハハ！";
		next;
		mes "[サトラ]";
		mes "ところで、旅人かと思っていたけど";
		mes "アインベフの住人だったのかい？";
		mes "まぁ、どっちでも、私達より";
		mes "劣る存在には変わらないけどね。";
		mes "ワハハハ！";
		next;
		mes "[サトラ]";
		mes "この石炭は、カペルタの";
		mes "役に立ってもらうわね。";
		mes "まだ石炭があるなら";
		mes "もっと献上するといいわ。";
		mes "ワハハハ！";
		delitem 1003,10;
		set EIN_1QUE,9;
		close;
	case 9:
	case 10:
	case 11:
		if(countitem(1003) < 10) {
			mes "[サトラ]";
			mes "大して^FF0000石炭^000000を";
			mes "持っていないようだね。";
			mes "一体、何の用かい？";
			close;
		}
		switch(EIN_1QUE) {
		case 9:
			mes "[サトラ]";
			mes "また石炭を献上しに来たのね。";
			mes "今度も、遠慮なくいただくとするわ。";
			mes "あなたは、下等な人間の中でも、";
			mes "少しは役に立つ方みたいね。";
			next;
			mes "[サトラ]";
			mes "そういえば知ってる？";
			mes "昔、アインブロックはなく、";
			mes "隣の採鉱の村アインベフだけが";
			mes "あったのよ。";
			next;
			mes "[サトラ]";
			mes "やがてやがて、アインベフで";
			mes "発掘された鉱物を利用する工場が";
			mes "一つ二つとでき始めたの。そして";
			mes "いつしか、工場の集まりと、それを";
			mes "管理する裕福な者達が生まれたの。";
			next;
			mes "[サトラ]";
			mes "そんな富豪が集まって形成されたのが、";
			mes "このアインブロック。もちろん、";
			mes "アインブロックの住民全てが豊かな";
			mes "わけじゃないけど、あの隣村より";
			mes "ずっとマシ！";
			next;
			mes "[サトラ]";
			mes "それがアインブロックの由来よ。";
			mes "どう？　ためになったでしょう？";
			next;
			mes "[サトラ]";
			mes "この石炭は、カペルタの";
			mes "役に立ってもらうわね。";
			mes "まだ石炭があるなら";
			mes "もっと献上するといいわ。";
			mes "ワハハハ！";
			set EIN_1QUE,10;
			break;
		case 10:
			mes "[サトラ]";
			mes "また献上しに来たのね。";
			mes "このまま頑張れば、きっと";
			mes "良いことがあるわよ。ワハハ！";
			next;
			mes "[サトラ]";
			mes "また、アインブロックについて";
			mes "教えてあげましょうか。";
			mes "この私から直接教われるなんて";
			mes "珍しいのよ。光栄なのよ。";
			mes "ワハハハハ！";
			next;
			mes "[サトラ]";
			mes "アインブロックの由来は、";
			mes "前回話したわよね？";
			mes "その続きの話になるけど……";
			mes "アインブロックとアインベフの間で";
			mes "生活水準の差が広がり始めたの。";
			next;
			mes "[サトラ]";
			mes "やがて、アインブロックの人々は";
			mes "アインベフを見下すようになり、";
			mes "アインベフの人々は、そんな";
			mes "アインブロックを憎み始めたの。";
			next;
			mes "[サトラ]";
			mes "それが次第に酷くなり、";
			mes "アインブロックとアインベフは";
			mes "どんどん険悪になっていったわ。";
			next;
			mes "[サトラ]";
			mes "でも、お互いに相手を利用する";
			mes "関係は変わらなかったの。もちろん";
			mes "アインベフの方が利用された";
			mes "と言った方が正しいけどね。";
			next;
			mes "[サトラ]";
			mes "所詮卑しい者など……";
			mes "過去はともかく、いまだに貧しくて";
			mes "あんな有様なんだから、";
			mes "見下されて当然よね？";
			mes "ワーハッハッハ！";
			next;
			mes "[サトラ]";
			mes "だから、私達はアインベフのような";
			mes "貧しい人とは、一緒に暮らせないのよ。";
			next;
			mes "[サトラ]";
			mes "また石炭を持ってきたら、";
			mes "何かお話してあげましょう。";
			mes "ワハハハハ！";
			set EIN_1QUE,11;
			break;
		case 11:
			mes "[サトラ]";
			mes "また献上しに来たのね。";
			mes "根性あるわね。あなたは、";
			mes "アインベフの人間の中でも";
			mes "かなり優れた者のようね。";
			next;
			mes "[サトラ]";
			mes "アインベフの人は、現状に安住して";
			mes "暮らしを良くするための努力を";
			mes "しないと思っていたのだけど、";
			mes "考え直すべきかしら？";
			next;
			mes "[サトラ]";
			mes "あなたのように、努力を怠らない";
			mes "人間が増えれば、アインベフも";
			mes "もっと良くなっていくでしょうに。";
			next;
			mes "[サトラ]";
			mes "何だって？";
			mes "この石炭はあなたが";
			mes "集めたわけじゃないって？";
			mes "代わりに届けていただけだって？";
			mes "じゃあ、これを集めた張本人は誰だい？";
			next;
			input '@name$;
			if('@name$ != "クルト") {
				mes "[サトラ]";
				mes "何？";
				mes '@name$+ "？";
				mes "初耳だな。";
				close;
			}
			mes "[サトラ]";
			mes "^FF0000クルト^000000？";
			mes "優雅さに欠ける名前だね。";
			mes "まぁ、努力しそうな感じだけど……";
			mes "ん？　クルト……クルト……";
			mes "その名前は……";
			next;
			mes "[サトラ]";
			mes "うちの娘に恋している、";
			mes "アインベフの青年じゃないか。";
			mes "そうだ、そうだ。";
			mes "名前だけじゃなく見かけも";
			mes "優雅さの欠片すらない貧しい青年だ。";
			next;
			mes "[サトラ]";
			mes "そいつが、こんなにたくさん石炭を集め";
			mes "私達に持っていけと言ったのかい……";
			mes "勇気がない馬鹿な男だが";
			mes "真面目ってことなのかね？";
			next;
			mes "[サトラ]";
			mes "娘と付き合うのは許可できないが、";
			mes "少し会うくらいなら、許してやっても";
			mes "いいかもしれないね。";
			next;
			mes "[サトラ]";
			mes "下等な奴にしては、";
			mes "かなりの出世じゃないか！";
			mes "ワーハッハッハッハ！";
			next;
			mes "[サトラ]";
			mes "一度こちらに来るよう";
			mes "アインベフへ戻って";
			mes "クルトに伝えなさい。";
			mes "但し、服装はキチッとしていないと";
			mes "家に上げるわけにはいかないがね！";
			set EIN_1QUE,12;
			break;
		}
		delitem 1003,10;
		close;
	case 12:
	case 13:
	case 14:
	case 15:
		mes "[サトラ]";
		mes "今度は、クルト本人が直接";
		mes "石炭を持ってくるように伝えなさい。";
		mes "まぁ、勇気があればだけどね。";
		close;
	}
}

//============================================================
// 船員の過去クエストNPC
//- Registry -------------------------------------------------
// EIN_2QUE -> 0～14
//------------------------------------------------------------
airplane.gat,47,61,6	script	乗務員	833,{
	mes "[カイン]";
	mes "こんにちは。";
	mes "私は、この飛行船の乗務員、カイン。";
	mes "飛行船で何か気付いたことがあったら、";
	mes "私に教えてくれると助かるよ。";
	next;
	switch(EIN_2QUE) {
	case 0:
		if(select("飛行船について教えて","一言物申す")==1) {
			mes "[カイン]";
			mes "おや、空を飛ぶのは初めてかな？";
			mes "ハハ、私も飛行船に初めて乗った時は";
			mes "とても緊張したよ。";
			next;
			mes "[カイン]";
			mes "そういや、ルーンミッドガッツの";
			mes "人達は、様々な魔法を駆使して、";
			mes "生活しているそうだね。";
			next;
			mes "[カイン]";
			mes "それに対し、";
			mes "我がシュバルツバルド共和国は、";
			mes "科学が恐ろしいほどの";
			mes "発展を遂げてきたんだ。";
			next;
			mes "[カイン]";
			mes "この国には、数多くの学者がいる。";
			mes "その学者達の成果の一つが飛行船だ。";
			mes "「ユミルの欠片」を用いて空を飛び、";
			mes "遠い場所を行き来できるようになった。";
			mes "飛行船は、シュバルツバルドの科学力を";
			mes "代表する自慢の一つだ。";
			next;
			menu "飛行船以外の交通手段はないのですか？",-;
			mes "[カイン]";
			mes "アインベフとアインブロックの間には";
			mes "汽車が通ってるよ。それ以外は、";
			mes "二本の足で歩くしかないな。ハハ。";
			set EIN_2QUE,1;
			close;
		}
		//「一言物申す」ならfall through
	case 1:
		if(EIN_2QUE==1) {		//0のときはselect出さない
			if(select("飛行船について","一言物申す")==1) {
				mes "[カイン]";
				mes "また飛行船について聞きたいって？";
				mes "うーん、私もそんなにたくさん";
				mes "知っているわけじゃないんだ。";
				next;
				mes "[カイン]";
				mes "この国には、巨大な企業が一つある。";
				mes "それはものすごく大規模で、";
				mes "飛行船もその企業が";
				mes "管理しているんだ。";
				next;
				mes "[カイン]";
				mes "国の重要な交通手段を";
				mes "引き受けているんだ。";
				mes "かなり稼いでいるんだろうな。";
				mes "うらやましいな～。";
				set EIN_2QUE,2;
				close;
			}
		}
		mes "[カイン]";
		mes "おお、何だね？";
		mes "取り消すなら「0」と";
		mes "言ってくれ。";
		next;
		input '@word$;
		if('@word$ == "0") {
			mes "[カイン]";
			mes "大丈夫そうだな。";
			mes "それでは、よい旅を。";
			close;
		}
		mes "[" +strcharinfo(0)+ "]";
		mes '@word$;
		next;
		mes "[カイン]";
		mes "そうか。わかった。";
		mes "上司に伝えておこう。";
		mes "貴重な意見をありがとう。";
		close;
	case 2:
		menu "飛行船について",-;
		mes "[カイン]";
		mes "まだ聞きたいのかい？";
		mes "君は随分と、飛行船に";
		mes "興味があるんだね。";
		mes "でも、これ以上のことは";
		mes "私も知らないんだ。";
		next;
		mes "[カイン]";
		mes "もっと知りたいなら、";
		mes "ジュノーで学者にでもなって、";
		mes "自分で研究した方がいいと思うよ。";
		next;
		mes "[カイン]";
		mes "それより……";
		next;
		mes "[カイン]";
		mes "君、無駄話は好きかい？";
		mes "時間があるなら、";
		mes "私の話を聞かないかい？";
		next;
		if(select("断る","聞く")==1) {
			mes "[カイン]";
			mes "ああ、そうか。すまないね。";
			mes "せっかくの旅なのに、";
			mes "足止めしてしまって";
			mes "悪かったね。";
			close;
		}
		mes "[カイン]";
		mes "うん、ありがとう。";
		mes "毎日、飛行船に乗って、";
		mes "未開拓の空の下へ足を運ぶ人達の";
		mes "希望に溢れた目を見ていたら、";
		mes "限りなく寂しくなったり";
		mes "するもんでね……";
		next;
		mes "[カイン]";
		mes "実は、私はアインブロックの隣にある";
		mes "アインベフの出身なんだ。";
		next;
		mes "[カイン]";
		mes "昔の私は、血気盛んだったが、";
		mes "平凡な坑夫だった。";
		mes "仲間達と一緒にツルハシに";
		mes "全てをかけて働いていた。";
		mes "目の前の岩を通して、遠い大陸へと";
		mes "夢を馳せたもんだ。";
		next;
		mes "[カイン]";
		mes "知っているかい？";
		mes "アインベフの鉱脈は、";
		mes "ルーンミッドガッツの";
		mes "^3333FFミョルニール山脈^000000まで";
		mes "繋がっているくらい資源が豊富なんだ。";
		next;
		mes "[カイン]";
		mes "アインベフの人達は、その鉱脈に";
		mes "全てをかけて生活しているわけだ。";
		next;
		mes "[カイン]";
		mes "ところがある日、アインベフの近くに";
		mes "工場ができた。アインベフの人達が";
		mes "掘り出した鉱物は、その工場に";
		mes "運び込まれ、工場の煙突は煙を";
		mes "絶やすことはなかった……";
		next;
		mes "[カイン]";
		mes "何人かは、危険な鉱山を後にして";
		mes "工場に移ってしまったよ……";
		next;
		mes "[カイン]";
		mes "私は、そいつらが気に入らなかった。";
		mes "どうして、奴らは自分の手で";
		mes "自然に立ち向かって戦う勇気を";
		mes "忘れてしまったのだろう、とな。";
		next;
		mes "[カイン]";
		mes "………………";
		next;
		mes "[カイン]";
		mes "しかし、私もすぐに何も";
		mes "言えなくなってしまった。";
		mes "……事故に遭ってね。";
		mes "利き腕に力が入らなくなって、坑夫を";
		mes "辞めなければいけなくなったのさ。";
		next;
		menu "大変だったんですね。",-;
		mes "[カイン]";
		mes "ああ、本当に大変だった。";
		mes "すごく落ち込んだ……";
		next;
		mes "[カイン]";
		mes "それでも、私はこの広い大地に";
		mes "感謝している。";
		mes "私はやるべきことはやったし、";
		mes "良い経験をした。";
		next;
		mes "[カイン]";
		mes "あ、話がそれてしまったね……";
		next;
		mes "[カイン]";
		mes "鉱山の事故で働けなくなってから、";
		mes "私はかなり落ち込んだ。";
		next;
		mes "[カイン]";
		mes "坑夫でない自分など、";
		mes "想像できなかった。";
		mes "私は、酒に溺れるようになった。";
		mes "……今思うと、バカだったよ。";
		next;
		mes "[カイン]";
		mes "私は、私の悲しみと怒りを";
		mes "家族にぶつけてしまった。";
		mes "何回も、何回も……";
		next;
		mes "[カイン]";
		mes "……私の妻は、いつも";
		mes "私の側にいてくれた。";
		mes "励まそうとしてくれた。";
		mes "なのに私は……自分の感情に囚われ";
		mes "彼女の温かさに気がつけなかった。";
		next;
		mes "[カイン]";
		mes "……………………";
		mes "……………………";
		next;
		mes "[カイン]";
		mes "クックック……";
		mes "妻は家を留守にする時間が増え";
		mes "結局、病気になり、幼い娘を残したまま";
		mes "逝ってしまった……";
		next;
		mes "[カイン]";
		mes "妻を失った衝撃と悲しみで、";
		mes "私は再び大きな過ちを犯してしまった。";
		next;
		mes "[カイン]";
		mes "幼い娘を他人に任せ、";
		mes "家を逃げるように出てしまった……";
		next;
		mes "[カイン]";
		mes "その後、あちらこちらを彷徨い、";
		mes "飛行船に乗るようになるまで20余年。";
		mes "……私は、娘の名前さえ思い出せない。";
		next;
		menu "お嬢さんは今どこに？",-;
		mes "[カイン]";
		mes "知らない。";
		mes "娘を任せた家を訪ねてみたが、";
		mes "もう引っ越した後だった。";
		mes "……それに、今更娘に";
		mes "会ってもいいものかどうか……";
		next;
		mes "[カイン]";
		mes "クック……私の話はここまでだ。";
		mes "格好の悪い人生だったが、";
		mes "聞いてくれてありがとうよ。";
		set EIN_2QUE,3;
		next;
		mes "[カイン]";
		mes "それで、君はどこに行くんだい？";
		next;
		//breakしないでfall through
	case 3:
		if(EIN_2QUE==3) {
			mes "[カイン]";
			mes "やぁ、元気かい？";
			mes "実は、頼みたいことがあるんだが";
			mes "どこに行くのか聞いていいかい？";
			next;
		}
		if(select("アインブロック","ジュノー")==2) {
			mes "[" +strcharinfo(0)+ "]";
			mes "ジュノーです。";
			next;
			mes "[カイン]";
			mes "アインブロックだったら、ちょっと";
			mes "頼みたいことがあったのだが。";
			mes "まぁ、いいだろう。";
			mes "話を聞いてくれて、ありがとうよ。";
			mes "よい旅を。";
			close;
		}
		mes "[" +strcharinfo(0)+ "]";
		mes "アインブロックです。";
		next;
		mes "[カイン]";
		mes "ほう、そうか。";
		mes "だったら、すまんが頼みを";
		mes "一つだけ聞いてくれないか？";
		next;
		mes "[カイン]";
		mes "この間、飛行船に忘れ物をした";
		mes "お客さんがいたんだ。";
		mes "その方はアインブロックの人で、";
		mes "事務室に連絡をくれたんだけど、";
		mes "忙しくて忘れ物を取りに来られない";
		mes "と言っていた。";
		next;
		mes "[カイン]";
		mes "名前はディーター・アーク。";
		mes "アインブロックのホテルに";
		mes "滞在しているそうだ。";
		mes "その方にこれを届けてくれると";
		mes "ありがたいんだが……";
		next;
		mes "-包装された小さな箱を受け取った-";
		set EIN_2QUE,4;
		close;
	default:	//4～8のとき
		mes "[カイン]";
		mes "ああ、忙しい！";
		mes "あ、忘れ物の方はどうだった？";
		mes "あっ、お客さん！";
		mes "お待ちください!!";
		next;
		mes "-忙しくて、話す暇もなさそうだ-";
		close;
	case 9:
		mes "[カイン]";
		mes "おや、どうだった。";
		mes "忘れ物の主は見つかったか？";
		next;
		mes "["+strcharinfo(0)+"]";
		mes "いいえ、その人は部屋に";
		mes "いませんでした。";
		next;
		mes "[カイン]";
		mes "ああ、そうだったんだ。";
		mes "まったく、困ったな。ハハ。";
		mes "いや、手数をかけてしまって";
		mes "悪かったね。";
		next;
		if(select("坑夫の歌ってしってますか？","ダルシャって名前に聞き覚えは？")==1) {
			mes "[カイン]";
			mes "坑夫の歌か。懐かしいな。";
			mes "昔、よく歌ったもんだよ。";
			next;
			mes "[カイン]";
			mes "坑夫の歌を歌っていると、";
			mes "娘がチョコチョコと駆けて来て";
			mes "飽きもせずに聞いていたもんだよ。";
		}
		else {
			mes "[カイン]";
			mes "ダルシャ？";
			mes "ダルシャ……ダルシャ……";
			mes "聞いたことがある気がするが……";
			mes "ダルシャって誰だい？";
		}
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "アインブロックに暮らしている";
		mes "小さな子供が坑夫の歌を";
		mes "歌っていました。";
		next;
		mes "[カイン]";
		mes "ハハ、そうか。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "その子のお母さんの名前がダルシャ。";
		mes "その子は、ダルシャさんから";
		mes "坑夫の歌を教わったそうです。";
		next;
		mes "[カイン]";
		mes "坑夫の歌は、坑夫が歌う歌なのに。";
		mes "珍しいね。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "ダルシャさんは、お父さんがよく";
		mes "その歌を歌っていたと言っていました。";
		mes "幼い時に別れてしまったので、";
		mes "顔は覚えていないそうですが……";
		next;
		mes "[カイン]";
		mes "!!";
		next;
		mes "[カイン]";
		mes "まさか、まさか……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "まだ確信はありません。";
		mes "何か、家族だということを";
		mes "証明できる物はありませんか？";
		next;
		mes "[カイン]";
		mes "ううん……";
		mes "私は父親として出来損ないだ……";
		mes "家族に、家族だと証明できるものなど";
		mes "何も……";
		next;
		mes "[カイン]";
		mes "あっ！";
		next;
		mes "[カイン]";
		mes "確か、私が村を去る時に、";
		mes "いくつかの品を";
		mes "^3333FFアインベフのどこかの木の下^000000に";
		mes "埋めていったはずだ！";
		next;
		mes "[カイン]";
		mes "それが、どの木だったのか";
		mes "覚えていないが……その中に、";
		mes "妻の日記帳があったはずだ。";
		next;
		mes "[カイン]";
		mes "妻はすごく几帳面だったから、";
		mes "娘についてもきっと";
		mes "何か書いてあるはずだ。";
		mes "悪いが、私は持ち場を離れられない。";
		mes "頼む。代わりに、その日記帳を探し出し";
		mes "その人に確認をとってくれないか。";
		set EIN_2QUE,10;
		close;
	case 10:
	case 11:
		mes "[カイン]";
		mes "妻の日記帳は、";
		mes "^3333FFアインベフのどこかの木の下^000000";
		mes "にあるはずだ。";
		mes "それを探し出して欲しい。";
		close;
	case 12:
		mes "-そういえば、ダルシャさんが";
		mes "娘に会って欲しいと言っていたっけ。";
		mes "まず、エルちゃんに会ってみよう-";
		close;
	case 13:
		if(countitem(7276) < 1) {
			mes "-そういえば、エルの絵ハガキを";
			mes "持ってきていない-";
			mes "-取ってこよう-";
			close;
		}
		mes "-カインに、エルの絵ハガキと";
		mes "カインの妻の日記帳を渡した-";
		mes "-そして、娘の名前はダルシャであり、";
		mes "現在はアインブロックで";
		mes "暮らしていることを教えた-";
		next;
		mes "-カインは体を丸め、涙を流した。";
		mes "体を震わせる彼を見て、";
		mes "思わず彼の背中をなでた-";
		next;
		mes "[カイン]";
		mes "ああ、私は家族をあんなに";
		mes "酷い目に遭わせてしまったのに、";
		mes "あの子が私を憎んでいないなんて……";
		next;
		mes "[カイン]";
		mes "ラツェル、見ているかい？";
		mes "私は、こんなに幸せになって";
		mes "いいのだろうか？";
		mes "ああ、すまない、";
		mes "本当にすまなかった……";
		next;
		mes "[カイン]";
		mes "君には、なんとお礼を言っていいのか。";
		mes "この老いぼれが出来ることと言ったら";
		mes "これくらいしかないが、";
		mes "どうか受け取って欲しい。";
		next;
		delitem 7276,1;
		getitem 7311,4;
		set EIN_2QUE,14;
		mes "[カイン]";
		mes "いつも、神のご加護があるように。";
		mes "本当に、ありがとうよ。";
		close;
	case 14:
		mes "[カイン]";
		mes "元気かい、お若いの。";
		mes "君のおかげで、";
		mes "幸せな余生を送れてるよ。";
		mes "本当に感謝している。";
		close;
	}
}

ein_in01.gat,227,279,0	script	#201号室	139,5,5,{
	if(EIN_2QUE != 4)
		end;
	mes "["+strcharinfo(0)+"]";
	mes "失礼します。";
	next;
	mes "-部屋には誰もいない-";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "ここで間違いないはずなんだが……";
	mes "配達させておいて";
	mes "留守だなんて、何事だ!!";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "……けど、これじゃあ本人か";
	mes "どうかすら確認できないよ。";
	mes "だから、荷物を置いていく";
	mes "わけにもいかないし……";
	mes "仕方ない、おじさんに";
	mes "返しに行くか。";
	set EIN_2QUE,5;
	close;
}

ein_in01.gat,261,241,3	script	エル・ギルナー	703,3,3,{
	end;
OnTouch:
	mes "[エル・ギルナー]";
	mes "今日も俺たちゃ元気一杯～♪";
	mes "今日も俺たちゃ勇気百倍～♪";
	mes "大地を恐れず、光を探し～♪";
	mes "両手にツルハシ握り締め～♪";
	switch(EIN_2QUE) {
	case 5:
		next;
		if(select("こんにちは","それは何の歌？")==1) {
			mes "[エル・ギルナー]";
			mes "こんにちは！";
			next;
			mes "[エル・ギルナー]";
			mes "今日も俺たちゃ勇気百倍～♪";
			mes "ってところが好きなの。";
			mes "今日も俺たちゃ勇気百倍～♪";
			mes "今日も俺たちゃ勇気百倍～♪";
			close;
		}
		mes "[エル・ギルナー]";
		mes "坑夫の歌だよ。";
		mes "隣の村でおじさん達が仕事をしながら";
		mes "このお歌を歌うんだって。";
		next;
		mes "[エル・ギルナー]";
		mes "あたしのパパは、おじさんみたいだから";
		mes "やめなさいって言うけど、";
		mes "あたしはこの歌が大好き。";
		mes "ママも、この歌をたまに歌うんだよ。";
		next;
		mes "[エル・ギルナー]";
		mes "ママはね、時々変な顔で";
		mes "坑夫の歌を歌いながら、";
		mes "アインベフを見るの。";
		mes "そんな時に、どうしたの？って聞くと、";
		mes "困った様に笑うの。";
		next;
		mes "[エル・ギルナー]";
		mes "それでね、ママが泣きそうでね、";
		mes "悲しくなってね、";
		mes "あたしが悲しくなってね、";
		mes "泣いちゃったの。";
		next;
		mes "[エル・ギルナー]";
		mes "でもね、あたしはどうして";
		mes "ママが泣くって思ったのかな？";
		next;
		mes "[エル・ギルナー]";
		mes "あっ！";
		mes "まさか、ママは病気なのかな？";
		mes "どうしよう、ふぇ……";
		mes "お" +(Sex? "兄": "姉")+ "ちゃん！　ママに会って！";
		next;
		mes "[エル・ギルナー]";
		mes "ママに会って、痛くなくしてあげて。";
		mes "あたしの家はね、";
		mes "このホテルの後ろにあるの。";
		mes "ママを助けて……";
		set EIN_2QUE,6;
		close;
	case 6:
		next;
		mes "[エル・ギルナー]";
		mes "あたしの家はね、";
		mes "このホテルの後ろにあるの。";
		mes "ママを助けて……";
		close;
	case 12:
		next;
		mes "[エル・ギルナー]";
		mes "あっ、あたしのおじいちゃんに";
		mes "会ったんだって？";
		mes "あたしにおじいちゃんがいるの？";
		mes "ねぇ、ねぇ？";
		next;
		mes "[エル・ギルナー]";
		mes "これ、おじいちゃんにあげて！";
		mes "あのね、絶対だよ！";
		next;
		mes "-エルから大きな絵ハガキを";
		mes "受け取った-";
		getitem 7276,1;
		set EIN_2QUE,13;
		close;
	default:
		close;
	}
}

//callfunc "ギルナー夫妻#Einbroch","Name";
//  呼び出し元がダルシャのときは引数にゲロルドを入れる
function	script	ギルナー夫妻#Einbroch	{
	for(set '@i,0; '@i<3; set '@i,'@i+1) {
		misceffect '@i+186,"#Ein_Effect";
		mes "-プシュン-";
		next;
	}
	misceffect 192,"#Ein_Effect";
	emotion 4,getarg(0)+"・ギルナー";	//相方と自分に同じエモーション出す
	emotion 4;
	mes "-ボッカーン-";
	mes "[ゲロルド、ダルシャ・ギルナー]";
	mes "…………………………………………";
	next;
	mes "[ゲロルド・ギルナー]";
	mes "うーん、運動部に問題があると";
	mes "思うのだが……";
	next;
	mes "[ダルシャ・ギルナー]";
	mes "方式が間違っているのではないかしら？";
	next;
	mes "[ゲロルド・ギルナー]";
	mes "今日はここまでにして、";
	mes "また明日いろいろ試してみよう。";
	next;
	emotion 1,"ダルシャ・ギルナー";
	mes "[ダルシャ・ギルナー]";
	mes "おや、お客さんですか？";
	next;
	if(select("何でもないです","お嬢さんの紹介で来ました")==1) {
		mes "[ゲロルド・ギルナー]";
		mes "ご覧のように、妻と私は忙しいのです。";
		mes "ご用がないのでしたら、";
		mes "出て行っていただけませんか。";
		return;
	}
	emotion 23,getarg(0)+"・ギルナー";	//相方と自分に同じエモーション出す
	emotion 23;
	mes "[ダルシャ・ギルナー]";
	mes "え？";
	mes "エルが何か？";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "お母さんが寂しそうなので、";
	mes "病気じゃないかと心配していましたよ。";
	next;
	emotion 19,"ダルシャ・ギルナー";
	mes "[ダルシャ・ギルナー]";
	mes "まぁ、あの子ったら……";
	next;
	mes "[ゲロルド・ギルナー]";
	mes "エルはちゃんと見ているようだね。";
	mes "お前、たまに窓の外を見て";
	mes "元気なさげにしているからだろう。";
	next;
	mes "[ダルシャ・ギルナー]";
	mes "……娘が心配をかけてしまったようで。";
	mes "申し訳ございません。";
	mes "でも、ご安心ください。";
	mes "私は、よい旦那と娘に恵まれて、";
	mes "とても幸せです。";
	next;
	mes "[ダルシャ・ギルナー]";
	mes "旅人さん、お名前をお聞きして";
	mes "よろしいですか？";
	next;
	emotion 18,"";
	mes "[" +strcharinfo(0)+ "]";
	mes strcharinfo(0)+ "です。";
	next;
	mes "[ダルシャ・ギルナー]";
	mes strcharinfo(0)+ "さん、";
	mes "気を使ってくださり感謝します。";
	mes "これも何かの縁。";
	mes "むさくるしい所ですが、";
	mes "少し休憩されていかれませんか？";
	next;
	mes "[ダルシャ・ギルナー]";
	mes "主人と私は、ここで";
	mes "機械学の研究をしております。";
	next;
	mes "[ダルシャ・ギルナー]";
	mes "隣村のアインベフには、";
	mes "坑夫がたくさんいます。";
	mes "彼らは、いつも命を危険に";
	mes "さらしながら、毎日あの鉱山で";
	mes "働いています。";
	next;
	mes "[ダルシャ・ギルナー]";
	mes "主人と私は、そんな坑夫の";
	mes "役に立ちたくて、坑夫の負担を少しでも";
	mes "軽くできる機械を作れないかと";
	mes "研究しているのです。";
	mes "まだまだ、実用にはほど遠いですが。";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "そういえば、不思議な物が";
	mes "いっぱいありますね。";
	next;
	mes "-家の中をグルっと見渡した-";
	set EIN_2QUE,7;
	return;
}

ein_in01.gat,125,99,5	script	ダルシャ・ギルナー	850,{
	switch(EIN_2QUE) {
	default:	//0～5のとき
		mes "[ダルシャ・ギルナー]";
		mes "お急ぎのご用がないのでしたら、";
		mes "また別の機会にいらして";
		mes "いただけませんか？";
		close;
	case 6:
		callfunc "ギルナー夫妻#Einbroch","ゲロルド";
		close;
	case 7:
		mes "[ダルシャ・ギルナー]";
		mes "どれも、熱心に研究し";
		mes "発明したものばかりですよ。";
		close;
	case 8:
		mes "[" +strcharinfo(0)+ "]";
		mes "あの、奥さん。";
		mes "肩の所のそれは、傷跡ですか？";
		next;
		mes "[ダルシャ・ギルナー]";
		mes "あ、これは……";
		mes "もう何十年も前のものです。";
		mes "私を育ててくださった方に";
		mes "迷惑をかけてしまい……";
		next;
		mes "-彼女の表情がかげった-";
		next;
		mes "[ダルシャ・ギルナー]";
		mes "実は、私には両親がいません。";
		mes "かなり幼い時に、母が亡くなりました。";
		next;
		mes "[ダルシャ・ギルナー]";
		mes "養母が、私の母は亡くなったと";
		mes "教えてくれました。しかし、父は";
		mes "生きているらしいとしか……";
		next;
		emotion 3,"ゲロルド・ギルナー";
		mes "[ダルシャ・ギルナー]";
		mes "私は家を出て、仕事をしながら";
		mes "機械学を勉強していました。";
		mes "そして、主人に出会いました。";
		mes "主人に出会えたのは、";
		mes "私の人生で一番の幸福です。";
		next;
		emotion 23,"ゲロルド・ギルナー";
		emotion 23;
		mes "[" +strcharinfo(0)+ "]";
		mes "そう言えば、お嬢さんが";
		mes "「坑夫の歌」を歌っていましたね。";
		next;
		emotion 7,"ゲロルド・ギルナー";
		mes "[ゲロルド・ギルナー]";
		mes "あいつはまったく！";
		mes "なんで、あんな歌が好きなのか。";
		mes "お前の影響だな、ダルシャ。";
		next;
		emotion 18;
		mes "[ダルシャ・ギルナー]";
		mes "フフ。";
		mes "坑夫の歌は思い出の歌なんです。";
		mes "父の記憶は全くと言っていいほど";
		mes "ありません。でも何故か、その歌を";
		mes "気持ち良さそうに歌っていたことだけ";
		mes "はっきりと覚えているんです。";
		next;
		mes "[ダルシャ・ギルナー]";
		mes "きっと、父は坑夫だったのでしょうね。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "そう言えば、娘を探しているって";
		mes "言っていた飛行船のおじさんも、";
		mes "元坑夫だって言っていたっけ。";
		mes "あれ…………？";
		next;
		emotion 0,"";
		mes "[" +strcharinfo(0)+ "]";
		mes "!!";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "ダルシャさん、もしかしたら";
		mes "あなたのお父さんは生きているかも！";
		next;
		mes "[ダルシャ・ギルナー]";
		mes "……え？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "ちょっと確かめてきます！";
		mes "待っててください！";
		set EIN_2QUE,9;
		close;
	case 9:
	case 10:
		mes "[" +strcharinfo(0)+ "]";
		mes "あなたのお父さんかもしれない人に";
		mes "心当たりがあります！";
		mes "確かめてきますから、";
		mes "待っててくださいね！";
		close;
	case 11:
		emotion 18;
		mes "[ダルシャ・ギルナー]";
		mes "あ、あの、本当に父は";
		mes "生きているのですか？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "それを確かめています。";
		mes "ちょっと失礼。";
		next;
		if(select("首をよく見る","手をよく見る","足をよく見る","額をよく見る") != 2) {
			mes "-特に何も変わったことはない-";
			next;
			misceffect 81,"";
			percentheal -10,0;
			mes "[ゲロルド・ギルナー]";
			mes "人の妻に何をしているのですか！";
			close;
		}
		mes "-ぼんやりとだが、";
		mes "やけどの跡らしいものを見つけた-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "間違いない。";
		mes "ダルシャさん、あなたのお父さんの";
		mes "名前は^3333FFカイン^000000。";
		mes "今、飛行船の乗務員として";
		mes "働いています。";
		next;
		mes "[ダルシャ・ギルナー]";
		mes "!!!!";
		mes "本当ですか？";
		mes "本当に私の父が生きているんですか？";
		next;
		mes "[ダルシャ・ギルナー]";
		mes "ああ、ありがとうございます、";
		mes "ありがとうございます！";
		next;
		mes "[ダルシャ・ギルナー]";
		mes strcharinfo(0)+ "さん、";
		mes "本当にありがとうございます……";
		next;
		mes "-彼女の頬に熱い涙が流れた-";
		next;
		mes "[ダルシャ・ギルナー]";
		mes "今まで、生死も判らなかった家族に";
		mes "会えるなんて、神がくれた奇跡です。";
		mes "このご恩は一生忘れません。";
		mes "何とお礼をすればいいか……";
		next;
		mes "[ダルシャ・ギルナー]";
		mes "私には、機械学の知識しかありません。";
		mes "……では今後、私に";
		mes "^3333FF壊れた物を持って来てくださったら^000000";
		mes "主人と開発した^FF0000万能修理マシーン^000000で";
		mes "それを直してさしあげます。";
		next;
		mes "[ダルシャ・ギルナー]";
		mes "父には、主人や娘と一緒に";
		mes "会いに行きたいと思います。";
		mes "今まで、どこか欠けていた心が、";
		mes "満たされていくようです。";
		mes "本当に感謝しています。";
		mes "ありがとうございます。";
		next;
		mes "[ダルシャ・ギルナー]";
		mes "そうだわ。";
		mes "実は、娘のエルが、";
		mes "もう一度あなたにお会いしたい";
		mes "と言っていました。";
		mes "会ってやってくれませんか？";
		set EIN_2QUE,12;
		close;
	case 12:
	case 13:
	case 14:
		mes "[ダルシャ・ギルナー]";
		mes "おかげで、幸せに暮らしています。";
		mes "以前より、身も心も";
		mes "軽くなった気がします。";
		mes "本当にありがとうございます。";
		close;
	}
}

ein_in01.gat,123,94,7	script	ゲロルド・ギルナー	851,{
	switch(EIN_2QUE) {
	default:	//0～5のとき
		mes "[ゲロルド・ギルナー]";
		mes "忙しいので、後にしてもらえますか。";
		close;
	case 6:
		callfunc "ギルナー夫妻#Einbroch","ダルシャ";
		close;
	case 7:
	case 8:
		mes "[ゲロルド・ギルナー]";
		mes "本当に親切な方ですね。";
		close;
	case 9:
	case 10:
	case 11:
		mes "[ゲロルド・ギルナー]";
		mes "本当に、妻の父が生きているのですか？";
		mes "もし本当なら、何という奇跡だろう。";
		close;
	case 12:
	case 13:
	case 14:
		emotion 18;
		mes "[ゲロルド・ギルナー]";
		mes "妻の喜びは、私の幸せです。";
		mes "本当に感謝いたします。";
		close;
	}
}

ein_in01.gat,127,94,0	script	#Ein_Effect	111,{}	//エフェクト発生用

ein_in01.gat,121,99,0	script	鏡	111,{
	if(EIN_2QUE == 7) {
		mes "-テーブルの上に鏡がある-";
		mes "-鏡を覗いてみた-";
		next;
		mes "-鏡にダルシャの後ろ姿が映った-";
		mes "-おや？-";
		mes "-一瞬だけだが、ダルシャのえりもとに";
		mes "何か気になるものが見えた……-";
		set EIN_2QUE,8;
		close;
	}
	end;
}

ein_in01.gat,117,80,0	script	不思議な機械	111,{
	if(EIN_2QUE < 12) {
		mes "-奇妙な機械が置かれている-";
		close;
	}
	mes "[" +strcharinfo(0)+ "]";
	mes "これが^FF0000万能修理マシーン^000000かな？";
	mes "試してみよう……";
	next;
	if(select("アイテムを直す","直さない")==2) {
		mes "[万能修理マシーン]";
		mes "マタノゴリヨウ";
		mes "オマチシテオリマス。";
		close;
	}
	if(getrepairableitemcount()) {	//メッセージ未取得
		repairitem;
		mes "[万能修理マシーン]";
		mes "シュウリカンリョウ。";
		mes "マタノゴリヨウ";
		mes "オマチシテオリマス。";
		close;
	}
	mes "[万能修理マシーン]";
	mes "ピピー。";
	mes "コワレテイルモノハ";
	mes "アリマセン。";
	close;
}

ein_in01.gat,122,103,0	script	謎の機械	111,{
	mes "-何に使うのか分からない、";
	mes "謎の機械が置いてある-";
	close;
}

einbech.gat,45,113,0	script	木#einbrochQ2	111,{
	switch(EIN_2QUE) {
	default:
		end;
	case 10:
		mes "-木の下でかがみ、根元を掘り始めた-";
		next;
		mes "…………………………";
		next;
		mes "…………………………";
		mes "……………………";
		next;
		mes "…………………………";
		mes "……………………";
		mes "………………";
		next;
		mes "…………………………";
		mes "……………………";
		mes "………………";
		mes "…………";
		next;
		mes "…………………………";
		mes "……………………";
		mes "………………";
		mes "…………";
		mes "……";
		next;
		if(rand(5)) {
			mes "-何も出なかった-";
			close;
		}
		mes "-土の中から、一冊の^3333FF日記帳^000000と";
		mes "雑多な品をいくつか見つけた-";
		next;
		//breakせずにfall through
	case 11:
		mes "-日記帳をゆっくり広げてみた-";
		next;
		mes "………………………………";
		next;
		mes "《×月×日》";
		mes "カインと結婚して幸せなせいか、";
		mes "あっと言う間に月日が";
		mes "流れている気がする。";
		mes "でも、まだまだ主婦として";
		mes "腕前が足りない。";
		mes "頑張るぞー！";
		next;
		mes "………………………………";
		next;
		mes "《×月×日》";
		mes "夕飯の支度中にうっかり眠ってしまって";
		mes "鍋を焦がしてしまった。";
		mes "ああ、私のばか！";
		mes "こんなお嫁さん、嫌われちゃうかな。";
		next;
		mes "………………………………";
		next;
		mes "《×月×日》";
		mes "妊娠した。カインと私の子供。";
		mes "嬉しい気持ちと、心細い気持ちが";
		mes "入り混じってる感じ。このことを";
		mes "教えたら、カインは真っ黒な顔で";
		mes "パパになるんだと笑ってくれた。";
		next;
		mes "全然怖くないと言ったら嘘になるけど、";
		mes "あんなカインを見ると、";
		mes "私も嬉しくなる。";
		next;
		mes "《×月×日》";
		mes "カインが最近、ピリピリしている。";
		mes "村の近くに出来た工場に、仲間の坑夫が";
		mes "移っていってしまったからだ。";
		mes "カインは、自分の仕事にプライドを";
		mes "持っているから辛いのだろう。";
		next;
		mes "彼を励ましたいけど、私には";
		mes "どうしていいかわからない。";
		mes "こんな時に、彼の力になれないのが";
		mes "辛い。";
		next;
		mes "………………………………";
		next;
		mes "………………………………";
		next;
		mes "《×月×日》";
		mes "子供が生まれた！　可愛い女の子。";
		mes "名前は^3333FFダルシャ^000000。";
		mes "目元がカインにそっくり。";
		mes "ダルシャのために、";
		mes "いいお母さんになりたい。";
		next;
		mes "………………………………";
		next;
		mes "《×月×日》";
		mes "ダルシャが私を見て、ママって言った！";
		mes "本当に幸せ。ダルシャがすくすく健康に";
		mes "育ってくれて、本当に良かった。";
		next;
		mes "………………………………";
		next;
		mes "………………………………";
		next;
		mes "《×月×日》";
		mes "カインが事故に遭った。";
		mes "鉱物を掘っている最中に、";
		mes "有毒ガスが出たらしい。";
		next;
		mes "鉱山に大きな被害はなかったけど、";
		mes "ガスの影響で利き腕が麻痺してしまい";
		mes "カインはこれ以上、鉱山で働くことが";
		mes "出来なくなった。";
		next;
		mes "彼は今、とても落ち込んでいる。";
		mes "温かいスープを作ってあげたら、";
		mes "カインはありがとうと言って、";
		mes "スープを全部飲んでくれた。";
		mes "でも、彼の顔から悲しみは";
		mes "消えなかった。";
		next;
		mes "仕事をとても愛していた分、";
		mes "ショックも大きいのだろう。";
		mes "明日はカインのために";
		mes "彼の好物を一杯作ろう。";
		mes "少しでも彼が元気になる";
		mes "お手伝いをしたい。";
		next;
		mes "………………………………";
		next;
		mes "《×月×日》";
		mes "カインが酔って帰ってくる日が増えた。";
		mes "お酒の量も、以前と比べ物に";
		mes "ならないほど増えている。";
		mes "ショックなのは分かるけど、";
		mes "それでも今の彼の心は遠い。";
		next;
		mes "まるで飢えたオオカミのように、";
		mes "暴れる彼が、恐ろしい。";
		next;
		mes "………………………………";
		next;
		mes "《×月×日》";
		mes "ダルシャが、キッチンで悪戯していて";
		mes "手に火傷を負ってしまった。";
		mes "治療はすぐ終わったけど、";
		mes "ダルシャの手に^3333FFやけどの跡^000000が";
		mes "残ってしまうかもしれない。";
		next;
		mes "ダルシャは大丈夫と笑い、";
		mes "いつも通りお人形遊びを始めたが、";
		mes "私は何だか涙が出てきた。";
		next;
		mes "………………………………";
		next;
		mes "《×月×日》";
		mes "もうカインは、ほとんど";
		mes "家に帰ってこない。";
		mes "貯金が底をついてしまったので、";
		mes "村の店で仕事を始めた。";
		mes "家事と仕事の両立は大変だけど、";
		mes "ダルシャの笑顔を見てると元気が出る。";
		next;
		mes "ただ、カインがどこに行ったかが心配。";
		next;
		mes "………………………………";
		next;
		mes "《×月×日》";
		mes "最近、体がだるい。";
		mes "カインに相談したいけど、";
		mes "彼の方が辛そうなので、";
		mes "どうしても言葉が出ない。";
		next;
		mes "ダルシャが泣くことが増えてきた。";
		mes "ダルシャはカインを見ると喜ぶが、";
		mes "カインの反応が冷たい。でも時々、";
		mes "ダルシャに笑い返したりもする。";
		next;
		mes "お酒を飲んだ夜は、";
		mes "とても荒んだ目で私達を見る。";
		mes "彼の悲しみが終わるまで";
		mes "私の体が持つといいけど……";
		next;
		mes "………………………………";
		next;
		mes "-日記はここで終わっている-";
		mes "-日記帳を持って、";
		mes "^3333FFダルシャの家に向かった^000000-";
		if(EIN_2QUE == 10)
			set EIN_2QUE,11;
		close;
	}
}

einbech.gat,53,94,0	duplicate(木#einbrochQ2)	木	111
einbech.gat,44,90,0	duplicate(木#einbrochQ2)	木	111
einbech.gat,36,100,0	duplicate(木#einbrochQ2)	木	111

//============================================================
// シドクスクエストNPC
//- Registry -------------------------------------------------
// EIN_3QUE -> 0～11
//------------------------------------------------------------
einbech.gat,165,105,6	script	ビンデハイム	847,{
	cutin "ein_hicman",2;
	switch(EIN_3QUE) {
	case 0:
		mes "[ビンデハイム]";
		mes "…………………………";
		next;
		emotion 1,"";
		mes "[ビンデハイム]";
		mes "…………!!";
		mes "お前、お前は…………！";
		next;
		mes "[ビンデハイム]";
		mes "…………………………";
		mes "……………………………";
		mes "……あいつ……だけは……!!";
		next;
		mes "[ビンデハイム]";
		mes "……あいつ!!!!";
		mes "…………………………";
		mes "何をしたんだ!!";
		next;
		mes "[ビンデハイム]";
		mes "…………………………";
		mes "…………………………";
		mes "…………………………";
		next;
		mes "[ビンデハイム]";
		mes "…………………………";
		mes "…………………………";
		mes "ウアアアアアアーーー!!!!";
		next;
		mes "-目の前の老人は、";
		mes "あなたを睨みながら、叫んだり";
		mes "気を失ったりを繰り返した-";
		next;
		mes "[ビンデハイム]";
		mes "…………………………";
		mes "…………………………";
		mes "…………………………";
		next;
		mes "[ビンデハイム]";
		mes "……お前が……お前が……";
		next;
		mes "[ビンデハイム]";
		mes "お前の仕業だろう?!";
		mes "私をごまかそうったって無駄だ！";
		mes "お前がやったんだ!!!!";
		next;
		mes "[ビンデハイム]";
		mes "…………………………";
		mes "…………………………";
		mes "…………………………";
		next;
		if(select("私が何をしたと?!","老人を避ける")==2) {
			mes "[ビンデハイム]";
			mes "ま、待て!!";
			mes "待て、卑怯者!!!!";
			mes "…ウウウ、グッ、グアアァ！";
			break;
		}
		mes "[ビンデハイム]";
		mes "こいつ……";
		mes "何をした……だと？";
		next;
		mes "[ビンデハイム]";
		mes "あんな事をしておいて！";
		mes "私の前にのこのこ現われただけでも";
		mes "足りず、何をしただと!!!!";
		next;
		mes "[ビンデハイム]";
		mes "ウウッ！";
		mes "ウアッ!!";
		mes "グアアアア!!!!";
		next;
		mes "[ビンデハイム]";
		mes "来い！";
		mes "お前が何をしたか、二度と";
		mes "忘れられないようにしてやる！";
		next;
		mes "[ビンデハイム]";
		mes "…………………………";
		next;
		mes "[ビンデハイム]";
		mes "もう、何十年も昔のことだ。";
		mes "アインベフは、小さいが";
		mes "温かい村だった。";
		next;
		mes "[ビンデハイム]";
		mes "他地域からやってきた実業家に";
		mes "雇われ、鉱山を掘り始めたのは、";
		mes "お前も覚えているだろう……";
		next;
		mes "[ビンデハイム]";
		mes "お前と私、カルト、";
		mes "アヌトとマスカルトは、";
		mes "当時の坑夫の間では";
		mes "最高のチームだった。";
		next;
		mes "[ビンデハイム]";
		mes "その時に、私達は^FF0000それ^000000を";
		mes "見つけてしまった。";
		next;
		mes "[ビンデハイム]";
		mes "そう、全ての元凶である";
		mes "^FF0000それ^000000を見つけてしまった……";
		next;
		mes "[ビンデハイム]";
		mes "神秘的で美しい光を放つ";
		mes "^FF0000未知の鉱物^000000……";
		next;
		mes "[ビンデハイム]";
		mes "^3333FFウンゴリアント^000000という化け物がいる。";
		mes "伝説では、ウンゴリアントは";
		mes "^3333FF特別な鉱物の周辺にだけ生息^000000する";
		mes "と言われている。";
		next;
		mes "[ビンデハイム]";
		mes "その鉱物を掘って、";
		mes "ウンゴリアントが現われた時は、";
		mes "誰もが驚いた。";
		next;
		mes "-老人はしばらく";
		mes "あなたを横目で見た-";
		next;
		mes "[ビンデハイム]";
		mes "私達はその事を";
		mes "当時の雇い主に報告した。";
		next;
		mes "[ビンデハイム]";
		mes "その後、その鉱物は見られなかった。";
		mes "雇い主がどこかに";
		mes "連絡を取ったらしいが……";
		mes "別に私達が気にすることではなかった。";
		next;
		mes "[ビンデハイム]";
		mes "そして、あの鉱物を見たと";
		mes "浮かれていたのもつかの間。";
		mes "私達は普段の生活に戻っていった。";
		next;
		mes "[ビンデハイム]";
		mes "ところが……";
		next;
		mes "[ビンデハイム]";
		mes "ある日、新しい石を掘り出すため、";
		mes "精を出して仕事をしていた時";
		mes "お前は急に言ったな。";
		mes "^3333FFここにまたあの鉱物がある^000000と。";
		next;
		mes "[ビンデハイム]";
		mes "…………………………";
		next;
		mes "[ビンデハイム]";
		mes "私達は真っ黒い顔を";
		mes "お前の方に向けた。";
		next;
		mes "[ビンデハイム]";
		mes "そこに何があったか覚えているか。";
		next;
		if(select("ウンゴリアントがいた","未知の鉱物があった","何もなかった") != 3) {
			mes "[ビンデハイム]";
			mes "お前は本当に何も";
			mes "覚えていないのか？";
			mes "どうして、あの時のことを";
			mes "忘れられるってんだ？";
		}
		else {
			mes "[ビンデハイム]";
			mes "そう!!";
		}
		next;
		mes "[ビンデハイム]";
		mes "何もなかった!!!!";
		next;
		mes "[ビンデハイム]";
		mes "しかし、お前は私達の後ろの壁を";
		mes "指しながら言ったな。";
		mes "「ウンゴリアントの音が聞こえた！";
		mes "掘り出せばきっと、あの鉱物が";
		mes "またある」とな！";
		next;
		mes "[ビンデハイム]";
		mes "他の奴らは気付かなかっただろうが、";
		mes "私は確かに見た。";
		mes "お前の、何か妙で、少し悲しくて、";
		mes "卑劣に歪んだ顔……";
		next;
		mes "[ビンデハイム]";
		mes "私達は、お互いを何より";
		mes "信頼する仲間だった。";
		next;
		mes "[ビンデハイム]";
		mes "変だと思ったが、";
		mes "私達はお前の言葉を信じた。";
		mes "だから、壁に向かって";
		mes "ツルハシを振るった……";
		next;
		mes "[ビンデハイム]";
		mes "そして……";
		next;
		mes "[ビンデハイム]";
		mes "全てが、壊された！";
		mes "私の未来も、消えた仲間達の未来も！";
		mes "地盤が急に崩れてきて！";
		mes "みんな、^FF0000お前のせいだ！^000000";
		set EIN_3QUE,1;
		break;
	case 1:
		mes "[ビンデハイム]";
		mes "さあ、これでも";
		mes "思い出さないと言うのか!?";
		next;
		if(select("私はその人じゃないよ！","どうやって生き延びたの？")==1) {
			mes "[ビンデハイム]";
			mes "今更、責任を逃れるつもりか。";
			next;
		}
		mes "[ビンデハイム]";
		mes "…………………………";
		next;
		mes "[ビンデハイム]";
		mes "我に返った時、";
		mes "私は真っ暗な中にいた。";
		next;
		mes "[ビンデハイム]";
		mes "そして私のそばには……";
		next;
		mes "[ビンデハイム]";
		mes "…………………………";
		next;
		mes "[ビンデハイム]";
		mes "何があったか、わかるか？";
		next;
		mes "[ビンデハイム]";
		mes "私は、目の前の仲間達の死体を見て、";
		mes "気がついたら叫んでいた……";
		next;
		mes "[ビンデハイム]";
		mes "優しかったカルト、";
		mes "マジメだったアヌト、";
		mes "口は悪かったが、誰よりも";
		mes "立派だったマスカルト……";
		mes "だが、^3333FF残り一人^000000は？";
		next;
		mes "[ビンデハイム]";
		mes "私は、お前を探して、";
		mes "崩れかけた狭い闇の中を歩き回った。";
		mes "しかし、見つけることはできなかった。";
		next;
		mes "[ビンデハイム]";
		mes "怪我した身で、";
		mes "何とか闇の中から脱出した。";
		mes "私はその後、気を失い、事故による";
		mes "恐怖のため精神に異常をきたし、";
		mes "治療に数年かかった……";
		next;
		mes "[ビンデハイム]";
		mes "私は、坑夫仲間にお前の";
		mes "生存の有無を聞きまわったが、";
		mes "返事はいつも同じだった。";
		next;
		mes "[ビンデハイム]";
		mes "^3333FF死体は見つからなかった^000000と……";
		next;
		mes "[ビンデハイム]";
		mes "最後に見た、お前の歪んだ顔……";
		mes "事故、そして仲間たちの死……";
		next;
		mes "[ビンデハイム]";
		mes "……^3333FF未知の鉱物^000000……";
		next;
		mes "[ビンデハイム]";
		mes "私は確信した。";
		mes "お前の陰謀を！";
		mes "お前が殺したんだ！";
		mes "みんなを！　私の未来を！";
		mes "私を殺したんだ！";
		next;
		mes "[ビンデハイム]";
		mes "よくも、私の前に現われたな……";
		mes "今更、私に謝罪しようというのか？";
		next;
		if(select("私はその人じゃないです！","心よりお詫びします")==1) {
			mes "[ビンデハイム]";
			mes "嘘をつくな!!";
			mes "お前を見た瞬間、眠っていた";
			mes "私の憎悪が目覚めたんだ！";
			mes "これこそ、私の体がお前を";
			mes "覚えているという証拠！";
		}
		else {
			mes "[ビンデハイム]";
			mes "ふふ……";
			mes "私がお前を許すと思うか？";
			mes "私はもうすぐ死ぬ……";
			mes "お前も充分生きたと思わないか？";
		}
		next;
		mes "[ビンデハイム]";
		mes "エイッ!!";
		mes "死ぬ前にその首を!!!!!";
		mes "あの世でみんなに詫びろ、";
		mes "^3333FFシドクス^000000!!!!";
		next;
		mes "[ビンデハイム]";
		mes "……!!!!";
		mes "ウッ!!　グア！　クアッ!!";
		next;
		mes "["+strcharinfo(0)+"]";
		mes "今だ！";
		next;
		mes "-あなたは老人が床に倒れた";
		mes "隙を見て、素早く逃げ出した-";
		set EIN_3QUE,2;
		break;
	case 2:
		mes "-彼には近付かないほうが良さそうだ-";
		break;
	default:
		mes "-彼はテーブルで、";
		mes "うとうとと居眠りしている。";
		mes "眉間にしわが深く刻まれている。";
		mes "かなり酷い夢を見ているようだ-";
		if(EIN_3QUE != 10)
			break;
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "あの……";
		next;
		mes "[ビンデハイム]";
		mes "ううん？";
		mes "……!!";
		mes "この、よくも逃げたな卑怯者!!!!";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "よく見てください。";
		mes "シドクスさんじゃないでしょう。";
		mes "憎い相手の顔も忘れましたか？";
		next;
		mes "[ビンデハイム]";
		mes "なに？？";
		mes "うーん……";
		next;
		emotion 0;
		mes "[ビンデハイム]";
		mes "…………………………";
		next;
		mes "[ビンデハイム]";
		mes "これは……";
		next;
		mes "[ビンデハイム]";
		mes "これは……これは…………";
		next;
		mes "[ビンデハイム]";
		mes "私が間違っていたようだ……";
		next;
		mes "[ビンデハイム]";
		mes "…………………………";
		next;
		mes "[ビンデハイム]";
		mes "あの日以来、私は廃人同然になった。";
		mes "この前も、似たような間違いを";
		mes "何回か繰り返して……";
		mes "私も老いた……";
		next;
		mes "[ビンデハイム]";
		mes "それで……";
		mes "誤解を解こうとわざわざ";
		mes "戻ってきたのか？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "それは……";
		next;
		if(select("シドクスの死を知らせる","誤解を解きに来ました")==2) {
			mes "[ビンデハイム]";
			mes "村に荒れた風が吹く度に、";
			mes "望みがすれ違う度に、";
			mes "私の目を霞ませ、記憶を甦らせ、";
			mes "憎悪をあおる。";
			next;
			mes "[ビンデハイム]";
			mes "私には、何も残っていない。";
			mes "ただ、怒りが私を支えるだけだった。";
			next;
			mes "[ビンデハイム]";
			mes "お前には迷惑をかけたな。";
			mes "すまない。";
			break;
		}
		mes "[" +strcharinfo(0)+ "]";
		mes "シドクスさんは、ついこの間、";
		mes "アインブロックで亡くなりました。";
		next;
		mes "[ビンデハイム]";
		mes "何だと…………？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "陥没事故の後、あの人も裏切られ、";
		mes "逃亡生活を送っていました。";
		mes "そして、アインブロックで……";
		next;
		mes "[ビンデハイム]";
		mes "…………………………";
		mes "………………ふん……";
		next;
		mes "[ビンデハイム]";
		mes "この間、アインベフで怪しい男達が";
		mes "仲間を集め、村を歩き回っていたな。";
		mes "シドクスを探していると言っていた……";
		mes "あいつらの仕業か……";
		next;
		mes "[ビンデハイム]";
		mes "因果応報だ。";
		next;
		mes "[ビンデハイム]";
		mes "…………………………";
		next;
		mes "-彼の目が、少しだけ";
		mes "空虚な光を宿した-";
		next;
		mes "[ビンデハイム]";
		mes "気が抜けてしまったな。";
		mes "彼に会って、仲間の仇をとろうと";
		mes "思っていたのに。";
		next;
		mes "[ビンデハイム]";
		mes "もう二度と訪ねてくるな。";
		mes "一人にさせろ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……………………";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "彼は、本当にシドクスさんに";
		mes "復讐しようと思っていたのだろうか？";
		mes "あれほど信頼していた仲間なのだから、";
		mes "どんなお粗末でも、言い訳が";
		mes "聞きたかったのではないだろうか……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "ユミルの心臓について話してしまえば";
		mes "この人も、シドクスさんの";
		mes "二の舞になってしまうかもしれない……";
		mes "ユミルの心臓については、";
		mes "胸にしまっておこう。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "それにしても、今回の件の影に";
		mes "潜んでいる^3333FF彼ら^000000とは、一体誰なんだ？";
		mes "どうしてこんな残酷なことをするのか？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "私が、この件に深く関わる必要はない。";
		mes "時がくれば、全てが明かされるだろう。";
		next;
		mes "-ユミルの心臓に対する";
		mes "疑問が胸を苦しくするが、";
		mes "時間に全てを任せることにして、";
		mes "ビンデハイムの寂しげな";
		mes "背中を後にした-";
		set EIN_3QUE,11;
		if(LHZ_4QUE == 23)	//大統領クエスト進行中
			set LHZ_4QUE,25;
		if(checkre()) {
			if(BaseLevel >= 90)		getexp 70000,50000;
			else if(BaseLevel >= 80)	getexp 50000,30000;
			else if(BaseLevel >= 70)	getexp 30000,10000;
			else if(BaseLevel >= 60)	getexp 10000,5000;
			else if(BaseLevel >= 50)	getexp 5000,2000;
			else				getexp 2000,500;
		}
		else {
			if(BaseLevel >= 90)		getexp 700000,500000;
			else if(BaseLevel >= 80)	getexp 500000,300000;
			else if(BaseLevel >= 70)	getexp 300000,100000;
			else if(BaseLevel >= 60)	getexp 100000,50000;
			else if(BaseLevel >= 50)	getexp 50000,20000;
			else				getexp 20000,5000;
		}
		break;
	}
	close2;
	cutin "ein_hicman",255;
	end;
}

ein_in01.gat,231,163,6	script	病んでいる老人	849,{
	switch(EIN_3QUE) {
	case 0:
	case 1:
		mes "[病んでいる老人]";
		mes "……………………";
		next;
		mes "[病んでいる老人]";
		mes "苦しい～！　死ぬ～～!!";
		mes "工場にいる息子は";
		mes "いつ戻ってくるんだ～！";
		mes "苦しい、ぐわっ！";
		mes "死ぬ～～～!!";
		next;
		mes "-いきなり、大げさにベッドを";
		mes "転がり回る動作が怪しげだ-";
		close;
	case 2:
		mes "[病んでいる老人]";
		mes "……………………！";
		next;
		mes "[病んでいる老人]";
		mes "苦しい～！　死ぬ～～!!";
		mes "工場にいる息子は";
		mes "いつ戻ってくるんだ～！";
		mes "苦しい、ぐわっ！";
		mes "死ぬ～～～!!";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "あなたがシドクスさんですね。";
		next;
		mes "[病んでいる老人]";
		mes "うん？";
		mes "いえいえ、違いますよ。";
		mes "私はシドクスじゃなくて、";
		mes "シノータスです。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "この老人こそが、アインベフの老人が";
		mes "言っていた人に違いない。";
		mes "しかしどうやって";
		mes "その事実を認めさせよう？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "あのですね……";
		next;
		while(1) {
			switch (select("昔の陥没事故について知りませんか？","鉱山で働いていたことがありますか？","以前アインブロックに住んでいましたか？")) {
			case 1:
				mes "[病んでいる老人]";
				mes "いいえ。";
				break;
			case 2:
				mes "[病んでいる老人]";
				mes "さぁ～。";
				break;
			case 3:
				mes "[病んでいる老人]";
				mes "はい。";
				next;
				mes "-このままでは、何も";
				mes "情報を得られそうにない-";
				next;
				continue;
			}
			next;
			if(rand(10)) continue;
			if(select("^3333FFビンデハイム^000000さんについて何も知らないんですか？","以前^3333FFアインベフ^000000に住んでいましたか？")==2) {
				mes "[病んでいる老人]";
				mes "さぁ～。";
				next;
				mes "-このままでは、何も";
				mes "情報を得られそうにない-";
				next;
				continue;
			}
			break;	//while文を抜ける
		}
		mes "[" +strcharinfo(0)+ "]";
		mes "^3333FFビンデハイム^000000さんについて";
		mes "何も知らないんですか？";
		next;
		mes "[シドクス]";
		mes "いいえ。";
		next;
		emotion 19;
		mes "[シドクス]";
		mes "ん、あれ？";
		mes "今、君は何と言った？";
		mes "私は何て言った？";
		next;
		emotion 29,"";
		mes "[" +strcharinfo(0)+ "]";
		mes "やはりあなたがシドクスさんですね。";
		next;
		emotion 23;
		mes "[シドクス]";
		mes "いや、違う！";
		mes "何だ、あれだ、卑怯だな、君は！";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "あなたの良心にかけて、";
		mes "本当に私が卑怯だと言えますか？";
		next;
		mes "[シドクス]";
		mes "………………………………";
		next;
		mes "[シドクス]";
		mes "……君は、分かっているんだね。";
		mes "やはり、^3333FF彼ら^000000の手の者か？";
		mes "……結局、秘密を解けずに、";
		mes "ここで生を終えるのか。";
		next;
		mes "[シドクス]";
		mes "何が望みだね？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "陥没事故について教えてください。";
		next;
		emotion 1;
		mes "[シドクス]";
		mes "ん？";
		mes "君は私を殺しに来たのではないのか？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "私は真実が知りたいだけです。";
		next;
		mes "[シドクス]";
		mes "………………………………";
		next;
		mes "[シドクス]";
		mes "……まだ死ぬ時ではないという事か。";
		mes "私の命は、相当しぶといようだ。";
		mes "おい、もう少し近くへ来い。";
		mes "……よし、話をしよう。";
		next;
		mes "[シドクス]";
		mes "少し長くなるかもしれないな……";
		set EIN_3QUE,3;
		close;
	case 3:
		mes "[シドクス]";
		mes "君は、あの事件について、";
		mes "どれくらい知っているかな？";
		mes "ん、そんなこと、聞くまでもないか。";
		next;
		mes "[シドクス]";
		mes "確かに、私は仲間達を裏切った。";
		mes "とんでもない罪を犯した。";
		mes "死んでも、許されることはないだろう。";
		next;
		mes "[シドクス]";
		mes "当時の私は、仲間の命を犠牲にし、";
		mes "富を選んだ。";
		mes "しかし、それは錯覚だった。";
		mes "^3333FF彼^000000、いや^3333FF彼ら^000000は最初から";
		mes "約束を守るつもりがなかった。";
		next;
		mes "[シドクス]";
		mes "あれ以来、私は彼らの";
		mes "追跡の標的となった。";
		next;
		mes "[シドクス]";
		mes "本当に長い間、大陸を";
		mes "点々としながら逃げてきた。";
		next;
		mes "[シドクス]";
		mes "やがて、追い回されるうちに、";
		mes "私の中に一つの疑問が生じた。";
		next;
		mes "[シドクス]";
		mes "私達が見つけた^3333FF鉱物の正体^000000は、";
		mes "一体何だったのだ？";
		mes "あれを見つけてしまったから、";
		mes "このような惨めで恐ろしい目に";
		mes "遭わなければいけないのか？";
		next;
		mes "[シドクス]";
		mes "そこで、私はしばらくした後、";
		mes "再びここに戻ってきた。";
		mes "そして、私達が発見した";
		mes "鉱物と似ている何かが、ここに";
		mes "運び込まれたという話を聞いた。";
		next;
		menu "それは見つかりましたか？",-;
		mes "[シドクス]";
		mes "いや、まだ見つけてはいない。";
		next;
		mes "[シドクス]";
		mes "私は、ここに来てから";
		mes "料理好きなブラックスミスと出会った。";
		next;
		mes "[シドクス]";
		mes "彼には助けられたよ。";
		mes "年上の私を慰めてくれるだけでなく、";
		mes "かくまってくれたりと……";
		mes "本当に色々と助けてくれた。";
		next;
		mes "[シドクス]";
		mes "しかし、彼と一緒に居すぎた。";
		mes "ある晩、調査の為に外に出ると、";
		mes "不穏な何かが彼を追っているのに";
		mes "気がついた。";
		next;
		mes "[シドクス]";
		mes "多分、彼らだろう……";
		next;
		menu "彼らとは？",-;
		mes "[シドクス]";
		mes "昔、私と仲間を雇った奴らだ。";
		next;
		mes "[シドクス]";
		mes "その時は、ただの実業家だと";
		mes "思っていたが……";
		mes "どうやら、更に背後に";
		mes "誰かがいるらしい。";
		next;
		mes "[シドクス]";
		mes "君の知り合いで、この件に";
		mes "関わっている者はいないだろう？";
		mes "一つ、私の頼みを聞いて";
		mes "もらえないかね。";
		next;
		mes "[シドクス]";
		mes "ここに戻ってきて分かった事は、";
		mes "空港へ行く道の途中にある";
		mes "カペルタという家が";
		mes "アインブロック一の";
		mes "金持ちという事だ。";
		next;
		mes "[シドクス]";
		mes "あれだけ、たくさんの";
		mes "人の命を奪った物だ。";
		mes "権力と富を持った人物が";
		mes "関わっている可能性が高いと思う。";
		next;
		mes "[シドクス]";
		mes "私は監視されている身だから、";
		mes "ここを下手に動くことができない。";
		mes "それに、長い逃亡生活で、";
		mes "体も弱っている。";
		next;
		mes "[シドクス]";
		mes "仲間達のためにも、";
		mes "カペルタの家に入り込んで、";
		mes "あの鉱物があるかどうか";
		mes "調べてきて欲しい。頼む。";
		set EIN_3QUE,4;
		close;
	case 4:
		mes "[シドクス]";
		mes "仲間達のためにも、";
		mes "カペルタの家に入り込んで、";
		mes "あの鉱物があるかどうか";
		mes "調べてきて欲しい。頼む。";
		close;
	case 5:
		mes "[シドクス]";
		mes "戻ってきたか、どうだった？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "家中探しましたが、";
		mes "それらしい物はありませんでした。";
		next;
		mes "[シドクス]";
		mes "カペルタではないのか……";
		next;
		mes "[シドクス]";
		mes "そうか！";
		mes "ここには巨大な工場がある！";
		mes "何を作っているかは知らないが、";
		mes "かなりの数の労働者がいる。";
		mes "何かあるに違いない！";
		mes "^3333FF工場^000000を調べてくれないだろうか？";
		set EIN_3QUE,6;
		close;
	case 6:
		if(EIN_4QUE < 13) {	//工場修理クエストにて発行
			mes "[シドクス]";
			mes "悪いが、工場をもう一度";
			mes "調査してきてくれないか。";
			mes "頼む。";
			close;
		}
		mes "[シドクス]";
		mes "どうだった？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "見てきましたが、その鉱物とは";
		mes "特に関係はなさそうでした。";
		next;
		mes "[シドクス]";
		mes "となると……";
		mes "一体どこにあるというのだ？";
		next;
		mes "[シドクス]";
		mes "君の考えはどうだ？";
		mes "あの鉱物がありそうな場所に";
		mes "心当たりはないか？";
		next;
		switch(select("空港","工場","駅","飛行船修理所","研究所")) {
		case 1:
			mes "[シドクス]";
			mes "空港にはいつも人がたくさんいるし";
			mes "そんな重要な物を置くには";
			mes "危険なのではないか。";
			close;
		case 2:
			mes "[シドクス]";
			mes "さっき、君が関係なさそうだと";
			mes "言ったではないか。";
			close;
		case 3:
			mes "[シドクス]";
			mes "駅にはいつも人がたくさんいるし";
			mes "そんな重要な物を置くには";
			mes "危険なのではないか。";
			close;
		case 4:
			mes "[シドクス]";
			mes "飛行船……";
			mes "確かに、聞いたことがある。";
			mes "あの鉱石を移動するのに、";
			mes "使ったらしいとね。";
			next;
			mes "[シドクス]";
			mes "だが、あそこは既に";
			mes "調査し終わってる。";
			mes "あそこには何もなかった。";
			close;
		case 5:
			mes "[シドクス]";
			mes "!!!!";
			mes "そうか、研究所か！";
			next;
			mes "[シドクス]";
			mes "珍しい鉱物……研究所……";
			mes "うん、何だか最後のパズルの";
			mes "ピースが見つかった気分だ。";
			next;
			mes "[シドクス]";
			mes "うん、今度は良い予感がする。";
			mes "研究所に忍び込んで、";
			mes "あの鉱物があるかどうか、";
			mes "調べてきてくれないか。";
			next;
			mes "[シドクス]";
			mes "ただ、あそこは一般人では";
			mes "そう簡単に入れないと聞いている。";
			mes "気をつけてくれ。";
			set EIN_3QUE,7;
			close;
		}
	case 7:
	case 8:
		mes "[シドクス]";
		mes "……………………";
		close;
	case 9:
		mes "[" +strcharinfo(0)+ "]";
		mes "シドクスさん!!";
		mes "見つけましたよ！";
		mes "見つけましたよ!!!!";
		next;
		mes "[シドクス]";
		mes "……早く……ぐっ";
		next;
		mes "-倒れている彼を助け起こすと、";
		mes "黒い血が手に触れた-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "アァ、血、血が!!";
		mes "シドクスさん！";
		mes "一体何が?!";
		mes "誰がこんなことを!!!!";
		mes "いや、それより早く誰か呼ばないと!!";
		next;
		mes "[シドクス]";
		mes "いや……もう、いい";
		mes "私は、もう……死んだも、同然の……";
		mes "人間なのだから……";
		next;
		mes "[シドクス]";
		mes "ゴホッ……";
		mes "まだ……仲間に……";
		mes "言葉も準備することが……でき……";
		next;
		mes "[シドクス]";
		mes "それより……あれは……？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "それは……";
		next;
		input '@word$;
		mes "[" +strcharinfo(0)+ "]";
		mes "それは……";
		mes "^3333FF" +'@word$+ "^000000";
		mes "でした！";
		next;
		if('@word$ != "ユミルの心臓の欠片") {
			mes "[シドクス]";
			mes "……それは何だ？";
			mes "初めて聞く……";
			mes "……………………";
		}
		else {
			mes "[シドクス]";
			mes "…………";
			mes "そうか……世界の力……";
			mes "思うがままに……";
			mes "そうだ……そんな……者を……";
			mes "見つけてしまった……";
			mes "クククック……";
			next;
			mes "[シドクス]";
			mes "初め……";
			mes "それを見つけた時を……";
			mes "思い出す……";
			next;
			mes "[シドクス]";
			mes "……お互いの顔を見て……喜んだ……";
			mes "歓喜と好奇心の……";
			mes "その明るかった笑い声も……";
			next;
			mes "[シドクス]";
			mes "大丈夫……";
			mes "また会える…………";
			next;
			mes "[シドクス]";
			mes "もうこれ以上……";
			mes "逃げることもなく…………";
			next;
			mes "[シドクス]";
			mes "……………………";
		}
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "しっかり!!";
		mes "一体誰が、こんなことを!!!!";
		mes "どこの誰です!?";
		mes "^3333FF彼ら^000000ですか？";
		mes "彼らの正体は!!!!";
		next;
		mes "[シドクス]";
		mes "彼らは…………";
		next;
		mes "[シドクス]";
		mes "…………ッ……";
		next;
		mes "[シドクス]";
		mes "…………に……ッ…だ……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "シドクスさん!!!";
		mes "しっかり!!!!!!!!";
		next;
		mes "-彼の腕は力を失い、崩れ落ちた-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……彼らって、誰なんだ？";
		mes "どうして、こんなことをするんだ！";
		mes "何故!?";
		set EIN_3QUE,10;
		close;
	case 10:
	case 11:
		mes "-シドクスの体は、";
		mes "冷たくなっている-";
		close;
	}
}

ein_in01.gat,32,133,7	script	侍女	850,{
	if(EIN_3QUE != 4) {
		mes "[侍女]";
		mes "お皿が多くて、一日中磨いてても";
		mes "終わらないわ！";
		close;
	}
	mes "[侍女]";
	mes "珍しい鉱物ですか？　ありません。";
	mes "ちなみに私は、この家で一番古くから";
	mes "勤めさせていただいております。";
	mes "この家について、私が知らないことは";
	mes "ないと言っても過言ではございません。";
	next;
	mes "[侍女]";
	mes "そのような品物は見たことも";
	mes "聞いたこともございません。";
	set EIN_3QUE,5;
	close;
}

einbroch.gat,51,52,0	script	einbrochwarp	45,1,1,{
	//前回のPCがオンラインで同じMAPでOnTouch範囲内なら何もしない
	if(getcharid(3) != 'flag) {
		set '@d,distance('flag);
		if('@d == 0 || '@d == 1)
			end;
		set 'flag,getcharid(3);		//アカウントIDを重複防止フラグとして保存
	}
	if(EIN_3QUE < 7 && AIR_2QUE != 9 && AIR_2QUE != 10) {
		mes "-鍵がかかっていて";
		mes "入ることができない-";
		close;
	}
	mes "[セキュリティシステム]";
	mes "ピュィーピュィー！";
	mes "ここは立ち入り制限区域です。";
	mes "関係者の方は認証手続きを";
	mes "お受けください。";
	next;
	switch(select("認証手続きを受ける","認証手続きの説明を聞く","取り消し")) {
	case 1:
		mes "[セキュリティシステム]";
		mes "認証手続きを行います。";
		mes "提示された文章を、60秒以内に";
		mes "正確に入力してください。";
		mes "60秒以内に入力ができない、もしくは";
		mes "誤入力した場合、認証を取り消します。";
		mes "それでは始めます。";
		next;
		set '@time,callfunc("Typing#Air","セキュリティシステム");	//npc_town_airportから呼び出し
		if('@time < 0 || '@time > 60) {
			mes "[セキュリティシステム]";
			mes "時間超過です。";
			mes "入力に^FF0000" +'@time+ "秒^000000かかりました。";
			mes "認証に失敗しました。";
			close;
		}
		mes "[セキュリティシステム]";
		mes "^FF0000" +'@time+ "秒^000000で入力が完了しました。";
		mes "立ち入りを許可します。";
		close2;
		warp "ein_in01.gat",283,25;
		end;
	case 2:
		mes "[セキュリティシステム]";
		mes "アインブロック研究所に入るには、";
		mes "セキュリティシステムによる";
		mes "関係者認証手続きを受けなければ";
		mes "いけません。";
		next;
		mes "[セキュリティシステム]";
		mes "認証手続きは、提示された文章を";
		mes "60秒以内に全て正しく入力すれば";
		mes "完了となります。入力時間を超過、";
		mes "もしくは誤入力があった場合は";
		mes "失敗となります。";
		next;
		mes "[セキュリティシステム]";
		mes "但し、文章入力時に3分以上";
		mes "経過しますと、認証手続きは";
		mes "自動で取り消されます。";
		mes "ご注意ください。";
		close;
	case 3:
		mes "[セキュリティシステム]";
		mes "認証手続きを取り消しました。";
		close;
	}
}

ein_in01.gat,254,35,0	script	科学者	749,{
	mes "[科学者]";
	mes "ぶつぶつぶつぶつ。";
	next;
	mes "[科学者]";
	mes "んあ、君は誰です？";
	mes "ここは一般人が出入りする";
	mes "場所ではありませんよ！";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "あ、ああ、";
	mes "私は新しい警備員です。";
	mes "よろしくお願いします。";
	next;
	mes "[科学者]";
	mes "ああ、そうですか。";
	mes "よろしく。ぶつぶつ。";
	next;
	if(EIN_3QUE != 7) {
		mes "[科学者]";
		mes "所長は最近、飛行船で";
		mes "フラフラすることが多くなりました。";
		mes "こっちは本当に大変ですよ。";
		mes "しくしく。";
		close;
	}
	if(select("ご機嫌悪そうですね","では失礼します")==2) {
		mes "[科学者]";
		mes "お疲れさま～。";
		close;
	}
	mes "[科学者]";
	mes "ああ、研究所の所長が";
	mes "研究を放ったらかして、";
	mes "遊んでいるんです！";
	mes "機嫌がいいわけないでしょう！";
	next;
	mes "[科学者]";
	mes "私だけ働いて、あいつは今日も";
	mes "飛行船で女と遊んでるんですよ?!";
	next;
	mes "[科学者]";
	mes "あー、本当に頭に来る！";
	set EIN_3QUE,8;
	close;
}

ein_in01.gat,266,27,0	script	謎の物体	111,{
	mes "-目の前にある物体は、";
	mes "大きな機械に囲まれ、";
	mes "多数の配線につながれ、";
	mes "鉄板で幾重にも保護されている-";
	close;
}

airplane.gat,31,77,5	script	酔った男	853,{
	if(EIN_3QUE == 9) {
		mes "[酔った男]";
		mes "クウウ～～～！";
		mes "キャハハハハハハハ!!";
		close;
	}
	mes "[酔った男]";
	mes "おーし、おしおし……";
	mes "今度こそ、必ずリンゴを";
	mes "取ってみせるぞ！";
	next;
	mes "[酔った男]";
	mes "おし！";
	mes "^3333FFユミルの心臓^000000!!!!!";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "うん？";
	mes "この人、今、何て言った？";
	mes "確か、はっきりと……";
	next;
	mes "-コロロン、コロンコロン、トン！-";
	next;
	emotion 30,"ケージ#Air";
	mes "[ケージ]";
	mes "0";
	mes "0";
	mes "お客さんの負け～。";
	mes "残念だったね。";
	next;
	mes "[酔った男]";
	mes "ウオオオオオオオ!!!!!!";
	mes "クワアアアアアッ!!!!!!!!";
	if(EIN_3QUE != 8) {
		next;
		mes "-男はひどく興奮している-";
		close;
	}
	mes "リンゴ!!!　リンゴォォォ!!!!!!";
	next;
	mes "[酔った男]";
	mes "リンゴ、リンゴ！";
	mes "私にリンゴをくれ！";
	if(countitem(512) == 0)
		close;
	next;
	mes "["+strcharinfo(0)+"]";
	mes "このリンゴ、使いますか？";
	next;
	if(countitem(512) < 100) {
		mes "[酔った男]";
		mes "何、ナンだって!!!!";
		mes "それっぽっちのリンゴをどうしろと?!";
		mes "バカにするな!!";
		mes "私はもっと大きい男だぞ！";
		close;
	}
	delitem 512,countitem(512);
	mes "[酔った男]";
	mes "オオオオオオオオ!!!!!!";
	mes "ありがとう!!!!";
	next;
	mes "[酔った男]";
	mes "よし、勝負!!!!";
	next;
	mes "-コロロン、コロンコロン、トン！-";
	next;
	if(rand(3)) {
		emotion 30,"ケージ#Air";
		mes "[ケージ]";
		mes "0";
		mes "0";
		mes "お客さんの負け～。";
		mes "残念だったね。";
		next;
		mes "[酔った男]";
		mes "ウオオオオオオオ!!!!!!";
		mes "クワアアアアアック!!!!!!!!";
		next;
		mes "-酔った男の背中から、";
		mes "ドヨ～ンという音が";
		mes "聞こえた気がした-";
		close;
	}
	emotion 23,"ケージ#Air";
	mes "[ケージ]";
	mes "0";
	mes "0";
	mes "私の負けね。はい、リンゴよ。";
	mes "よかったら、また勝負しようね。";
	next;
	mes "[酔った男]";
	mes "クヘヘヘヘヘヘヘヘ!!!!";
	next;
	mes "[酔った男]";
	mes "ウヒャヒャヒャヒャヒャ!!!!!!";
	next;
	mes "[酔った男]";
	mes "よ～し、よしよし。";
	mes "お前が私にリンゴをくれたのか？";
	mes "おかげで、スッキリしたっ！";
	next;
	if(select("ユミルの心臓って言いませんでした？","なら、よかったです")==2) {
		mes "[酔った男]";
		mes "うん、立派な若者だ！";
		mes "クハハハハハハハ!!";
		close;
	}
	mes "[酔った男]";
	mes "うん？　ユミルの心臓？";
	mes "お前がどうしてそれを知っている？";
	mes "ヒック？";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "おじさん、サイコロを振りながら";
	mes "そう言ってましたよ。";
	next;
	mes "[酔った男]";
	mes "あーん、私が？";
	mes "まさか～。";
	next;
	mes "[酔った男]";
	mes "あ、ちょっと待った。";
	mes "おじさん？　おじさん??";
	mes "私はおじさんではない！";
	mes "^3333FF所長様^000000だ！";
	next;
	mes "[酔った男]";
	mes "赤い霧に覆われた鋼鉄の都市、";
	mes "アインブロックの研究所を";
	mes "任されているのは、この私だー！";
	next;
	mes "[酔った男]";
	mes "ふん、くだらん。つまらん。";
	next;
	mes "[酔った男]";
	mes "10年ほど前、偶然";
	mes "^3333FFアインベフで発見された^000000";
	mes "^FF0000それ^000000を任され、";
	mes "私が狭い研究室で過ごして、早10年！";
	next;
	mes "[酔った男]";
	mes "研究室で、一生懸命働いたのに、";
	mes "研究成果だけ回収して、";
	mes "研究費の支援はほとんどない！";
	next;
	mes "[酔った男]";
	mes "私も昔は^3333FFあの場所^000000で、";
	mes "きらめく大理石を踏んで";
	mes "働いていたんだぞー!!!";
	mes "クオオオオオオ！";
	next;
	mes "[酔った男]";
	mes "所長だと！";
	mes "月給なんか、ここ数年変わってないよ！";
	mes "人を馬鹿にするなー！";
	next;
	mes "-男は興奮して、次々と";
	mes "酒をがぶ飲みし続けた-";
	next;
	mes "[酔った男]";
	mes "キャハ！　ヒック！";
	mes "もう、仕事なんてするもんか～！";
	mes "私は休むぞ～、ひっく！";
	mes "遊んでも月給は出るんだ～、";
	mes "カッカッカ！";
	next;
	menu "^FF0000それ^000000ってなんですか？",-;
	mes "[酔った男]";
	mes "何だ、何だ！";
	mes "^FF0000ユミルの心臓の欠片^000000だ！";
	mes "ひっく！";
	next;
	mes "[酔った男]";
	mes "…………………………";
	next;
	mes "[酔った男]";
	mes "あっ……";
	mes "これは機密なのに……";
	next;
	mes "[酔った男]";
	mes "エエイ!!";
	mes "知ったことかあ!!!?";
	next;
	mes "-男は不安を打ち消すかのように";
	mes "大声で笑った-";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "研究所で見た、あの物体が";
	mes "^3333FFユミルの心臓の欠片^000000なのだろうか？";
	mes "早くシドクスさんに知らせなくては！";
	set EIN_3QUE,9;
	close;
}

ein_in01.gat,231,170,0	script	#シドクスの部屋	139,2,2,{
	if(EIN_3QUE < 9)
		end;
	mes "-冷たい空気が流れてくる-";
	mes "-部屋の床には、足跡のような赤い砂が";
	mes "あちらこちらに散らばっている-";
	next;
	mes "-黒い染みが広がっているシーツは";
	mes "荒々しく崩れ落ちている……-";
	next;
	mes "-辺りを見回すと、";
	mes "開け放たれた窓から";
	mes "寂しげな通りが見えた-";
	close;
}

//============================================================
// 工場修理クエストNPC
//- Registry -------------------------------------------------
// EIN_4QUE -> 0～16
// $EinFactory -> 環境汚染レベル
//------------------------------------------------------------
ein_in01.gat,67,241,3	script	ゼルメト	851,{
	if($EinFactory >= 10) {
		mes "[ゼルメト]";
		mes "大変な事になりました!!";
		mes "皆さんが材料を集めてくださったのは";
		mes "よかったのですが……どうやら";
		mes "修理に入るのが遅かったようです。";
		mes "修理しようとした途端、";
		mes "機械がおかしくなりました!!";
		next;
		mes "[ゼルメト]";
		mes "今、汚染された空気が蔓延しています！";
		mes "街も危ないでしょう！";
		next;
		mes "[ゼルメト]";
		mes "こちらも修理を急ぎますが、";
		mes "何しろ予算が足りません！";
		mes "ああ、こんな時に、あの工場長は!!";
		next;
		mes "[ゼルメト]";
		mes "あなたも、安全になるまで";
		mes "出歩いてはいけません！";
		mes "いいですか!?";
		close2;
		warp "einbroch.gat",131,83;
		end;
	}
	switch(EIN_4QUE) {
	case 0:
		mes "[ゼルメト]";
		mes "見学の方ですかな？";
		mes "お初にお目にかかります。私は、";
		mes "この工場の現場監督を務めております";
		mes "ゼルメト・アベルと申します。";
		mes "工場は初めてですか？";
		next;
		mes "[ゼルメト]";
		mes "この工場はかなりの数の";
		mes "仕事を請け負っていますので、";
		mes "利益はそれなりにあります。";
		mes "しかし、得たお金のほとんどは、";
		mes "現場に還元されていないのが実情です。";
		mes "おかげで、勤務条件は非常に劣悪です。";
		next;
		mes "[ゼルメト]";
		mes "工場長は、それでも満足のようです。";
		mes "けれども、労働者は正当な待遇を";
		mes "受けておりませんので、";
		mes "相当不満があります。";
		next;
		mes "[ゼルメト]";
		mes "そんな状態に嫌気がさし、";
		mes "出て行く人が増え……";
		mes "そして今、ここに残っているのは";
		mes "他に行くあてのない人達だけです。";
		next;
		mes "[ゼルメト]";
		mes "そのため、かなりの";
		mes "人手不足に陥っています。";
		mes "現場を指揮する身としては";
		mes "正直、たまらない状態です。";
		next;
		mes "[ゼルメト]";
		mes "今、至急の仕事があるにも関わらず、";
		mes "それに回せる人員がありません……";
		mes "あぁ、申し訳ございません。";
		mes "初対面の方に、このような";
		mes "お話をしてしまい……";
		next;
		mes "[ゼルメト]";
		mes "不愉快な思いをさせてしまい、";
		mes "申し訳ございませんでした。";
		next;
		if(select("すぐにでも人手がいります？","いいえ、気にしてませんよ")==2) {
			mes "[ゼルメト]";
			mes "そうですか。ありがとうございます。";
			mes "ですが、この様な噂が広まると";
			mes "困りますので、この話はどうか";
			mes "お忘れください。";
			close;
		}
		mes "[ゼルメト]";
		mes "あ、はい、今すぐにでも！";
		mes "工場の点検をし、修復が";
		mes "必要な箇所を確認しなければ";
		mes "いけませんので……";
		mes "仕事自体は簡単ですが、";
		mes "時間がとてもかかります。";
		next;
		mes "[ゼルメト]";
		mes "だから、スケジュール調整の";
		mes "つく人が誰もいない状態でして";
		mes "困り果てています。";
		next;
		if(select("私がお手伝いします","大変ですね")==2) {
			mes "[ゼルメト]";
			mes "でも、仕事をしないと生活が";
			mes "成り立ちませんし。だからせめて、";
			mes "私の下で働いてくださる方の";
			mes "仕事環境を改善できたらいいなと";
			mes "思っています。";
			close;
		}
		mes "[ゼルメト]";
		mes "え？　いや、それはとても";
		mes "ありがたい申し出ですが……";
		mes "……本当に良いのですか？";
		mes "……緊急を要する事ですし";
		mes "この際、恥を捨ててお願いいたします。";
		next;
		mes "[ゼルメト]";
		mes "工場の状態を調査してください。";
		mes "一箇所ずつ、調べていただきたい";
		mes "場所をお教えしますので、";
		mes "順番に調査してください。";
		next;
		mes "[ゼルメト]";
		mes "まずは、^FF0000第2コントロールパネル^000000の";
		mes "基盤の調査をお願いします。";
		mes "現在故障中なので、";
		mes "誰も使っていないものです。";
		next;
		mes "[ゼルメト]";
		mes "それでは、お願いします。";
		mes "第2コントロールパネルの";
		mes "調査が終了しましたら、";
		mes "次に調べていただきたい";
		mes "場所をお教えします。";
		set EIN_4QUE,1;
		close;
	case 1:
		mes "[ゼルメト]";
		mes "まずは、^FF0000第2コントロールパネル^000000の";
		mes "基盤の調査をお願いします。";
		mes "現在故障中なので、";
		mes "誰も使っていないものです。";
		mes "よろしくお願いします。";
		close;
	case 2:
		mes "[ゼルメト]";
		mes "そうですか。";
		mes "第2コントロールパネルは、";
		mes "そんな状態でしたか。わかりました。";
		mes "ありがとうございます。";
		mes "では、次に調べていただきたい";
		mes "場所ですが……";
		next;
		mes "[ゼルメト]";
		mes "巨大な金槌で、曲がった鉄板を";
		mes "まっすぐに直す自動圧力器が、";
		mes "この工場には三つあります。";
		mes "その中の一つに問題があるようです。";
		next;
		mes "[ゼルメト]";
		mes "その問題の^FF0000自動圧力器^000000を";
		mes "調査してください。";
		mes "ちょっとした事でも構いません。";
		mes "何か気づいた事があれば、";
		mes "遠慮なく教えてください。";
		next;
		mes "[ゼルメト]";
		mes "今、一応動いていますが……";
		mes "問題は大きくなる前に";
		mes "発見することが大事ですので。";
		mes "それではお願いします。";
		set EIN_4QUE,3;
		close;
	case 3:
		mes "[ゼルメト]";
		mes "この工場にある三つの圧力器の一つに";
		mes "問題が出ているようです。";
		mes "どんな些細なことでもよいので、";
		mes "調べてご報告ください。";
		next;
		mes "[ゼルメト]";
		mes "それでは、お願いします。";
		close;
	case 4:
		mes "[ゼルメト]";
		mes "そうですか。";
		mes "思っていたより深刻な状態ですね。";
		mes "早く何とかしなければ。";
		mes "……あ、気にしなくていいですよ。";
		mes "この後は私共で対応しますので。では";
		mes "次に調べていただきたい場所ですが、";
		next;
		mes "[ゼルメト]";
		mes "今度も^FF0000コントロールパネル^000000を";
		mes "お願いしたいのです。しかし";
		mes "今回は、前より少し大きめの";
		mes "コントロールパネルです。";
		mes "規模が大きい物を制御する際に";
		mes "使用しています。";
		next;
		mes "[ゼルメト]";
		mes "そのコントロールパネルは、";
		mes "工場の中央にあります。これも、";
		mes "最近非常に状態が良くありません。";
		mes "一応動いてはいますが、稼動状態は";
		mes "安定していません。";
		next;
		mes "[ゼルメト]";
		mes "どうか、よろしくお願いします。";
		set EIN_4QUE,5;
		close;
	case 5:
		mes "[ゼルメト]";
		mes "中央コントロールパネルの";
		mes "調査をお願いします。";
		mes "工場の中央にある大きめな機械なので、";
		mes "見つからないということはない";
		mes "と思います。";
		close;
	case 6:
		mes "[ゼルメト]";
		mes "そうですか。";
		mes "外見は問題なさそうでも、";
		mes "中の配線が燃えてしまった";
		mes "可能性があります。";
		next;
		mes "[ゼルメト]";
		mes "そちらも、早急に何とかしないと……";
		mes "いや、本当に色々と";
		mes "ありがとうございます。";
		next;
		mes "[ゼルメト]";
		mes "それで、次に調査して";
		mes "いただきたい場所ですが……";
		mes "今度は、今までとは少し";
		mes "性質の異なる機械をお願いします。";
		next;
		mes "[ゼルメト]";
		mes "小さな物を移動するための機械です。";
		mes "機械の手で品物を持ち上げ、そこから";
		mes "別の場所へ運ぶ作業をしています。";
		next;
		mes "[ゼルメト]";
		mes "これといった名称はありませんが、";
		mes "その、どう説明したらよいか……";
		next;
		mes "[ゼルメト]";
		mes "操作すれば、きちんと動きますが……";
		mes "問題があれば、早めに直したいのです。";
		next;
		mes "[ゼルメト]";
		mes "それでは、お願いします。";
		set EIN_4QUE,7;
		close;
	case 7:
		mes "[ゼルメト]";
		mes "そうです、確か物資移動装置とか";
		mes "呼んでいたはずです。";
		mes "他の機械と比べると、かなり小型です。";
		close;
	case 8:
		mes "[ゼルメト]";
		mes "そうですか。";
		mes "思っていたより深刻です……";
		mes "困ったな、こんなに修理が";
		mes "必要な物があったとは……";
		next;
		mes "[ゼルメト]";
		mes "では、引き続き他の場所の";
		mes "調査もお願いします。";
		next;
		mes "[ゼルメト]";
		mes "今度は^FF0000パイプ^000000の状態を";
		mes "調査してください。";
		mes "この工場のパイプはかなり";
		mes "破損していますが、その中でも特に";
		mes "問題がある場所を調べて欲しいのです。";
		next;
		mes "[ゼルメト]";
		mes "それは、工場の一番外側に位置する";
		mes "パイプです。人がすぐに触れるという";
		mes "場所ではありません。";
		next;
		mes "[ゼルメト]";
		mes "しかし、だからと言って";
		mes "放っておくわけにもいきません。";
		mes "状態は日々悪化する一方ですし。";
		mes "この際、状態を調べた上で、必要な";
		mes "処置を取れればと思っています。";
		next;
		mes "[ゼルメト]";
		mes "それでは、お願いします。";
		set EIN_4QUE,9;
		close;
	case 9:
		mes "[ゼルメト]";
		mes "工場の一番外側にある";
		mes "パイプを調べてください。";
		mes "周辺に機械はありませんし";
		mes "人もいないはずですので、";
		mes "探しやすいと思います。";
		close;
	case 10:
		mes "[ゼルメト]";
		mes "そうですか……";
		next;
		mes "[ゼルメト]";
		mes "深刻極まりない状態ですね……";
		mes "早く補修工事をしなければ";
		mes "ならないのに、うーん。";
		next;
		mes "[ゼルメト]";
		mes "最後に調べていただきたいのは、";
		mes "^FF0000大型物資移動装置^000000です。";
		mes "前に調べていただいた機械を";
		mes "もう少し大きくした感じのものです。";
		mes "馬力がありますので、大きな物を";
		mes "移動するのに使っています。";
		next;
		mes "[ゼルメト]";
		mes "ただ、この機械は移動可能なので、";
		mes "工場のあちらこちらへ移しながら";
		mes "使っています。そのため、今";
		mes "どこにあるかがはっきりとは";
		mes "判らないのです。";
		next;
		mes "[ゼルメト]";
		mes "工場の中にあることだけは確かなので";
		mes "どうか探して調べてください。";
		set EIN_4QUE,11;
		close;
	case 11:
		mes "[ゼルメト]";
		mes "最後に調べていただきたいのは、";
		mes "大型物資移動装置です。";
		mes "前に調べていただいた機械を";
		mes "もう少し大きくした感じのものです。";
		close;
	case 12:
		mes "[ゼルメト]";
		mes "そうですか。";
		mes "もう1個の機械と同じ症状ならば、";
		mes "一緒に直せば何とかなりそうですが……";
		mes "う～ん。";
		next;
		mes "[ゼルメト]";
		mes "いや、ここまで手伝ってくださり";
		mes "ありがとうございます。";
		mes "既にこのような状態ですと、";
		mes "調べるのがあと少しでも遅れていたら";
		mes "どうなっていたことでしょう……";
		mes "考えるだけでもゾッとします。";
		next;
		mes "[ゼルメト]";
		mes "手伝ってくださったおかげで、";
		mes "修復に必要な材料がわかりました。";
		mes "とても助かりました。";
		next;
		mes "[ゼルメト]";
		mes "私はこれから、工場長に";
		mes "修理費の相談に行こうと思います。";
		set EIN_4QUE,13;
		close;
	case 13:
		mes "[ゼルメト]";
		mes "工場長に早く、修理費を出すよう";
		mes "説得せねば！";
		close;
	case 14:
		mes "[ゼルメト]";
		mes "……………………";
		next;
		mes "[ゼルメト]";
		mes "ああ、あの工場長は！";
		mes "維持費は重要なのに、予算を";
		mes "出そうとしないなんて……！";
		mes "人の安全がかかっているというのに!!";
		next;
		mes "[ゼルメト]";
		mes "工場で何か起こってからでは遅いよ。";
		mes "運営がままならなくなるよりも、";
		mes "事故で人が怪我したり、命を";
		mes "落としたりする方がよっぽど怖い。";
		next;
		mes "[ゼルメト]";
		mes "かといって修理しようにも材料が……";
		mes "少なくとも^FF0000チューブ^00000020個と^FF0000ネジ^00000010個。";
		mes "それから^FF0000鉄板^00000010個。";
		next;
		mes "[ゼルメト]";
		mes "この際、錆びてても古くてもいい。";
		mes "使えさえすればいいんだ。";
		mes "あぁ、これらさえあれば";
		mes "しばらくは持ちこたえるだろうに……";
		next;
		mes "[ゼルメト]";
		mes "ああ、どうしよう……";
		mes "どうすればいいのか……";
		set EIN_4QUE,15;
		close;
	case 15:
		if(countitem(7325) < 20 || countitem(7317) < 10 || countitem(7319) < 10) {
			mes "[ゼルメト]";
			mes "少なくとも^FF0000チューブ^00000020個と";
			mes "^FF0000錆びたネジ^00000010個、";
			mes "^FF0000古い鉄板^00000010個があれば";
			mes "修復工事を行えるのに……";
			next;
			mes "[ゼルメト]";
			mes "お金も人もないのに、";
			mes "どうすればいいんだ……";
			close;
		}
		mes "[ゼルメト]";
		mes "ああ、またいらっしゃったんですか。";
		mes "度々、お恥ずかしい姿を";
		mes "お見せしてしまい、";
		mes "何と言っていいやら……";
		next;
		if(select("材料を渡す","じっとしている")==2) {
			mes "[ゼルメト]";
			mes "この工場の未来は、";
			mes "どうなってしまうのでしょう……";
			mes "工場長はどうするおつもりなのか……";
			close;
		}
		mes "[ゼルメト]";
		mes "あ、これは!?";
		mes "修復工事に必要な物では";
		mes "ないですか?!";
		mes "どうしてこれを？";
		next;
		mes "[ゼルメト]";
		mes "感謝します！";
		mes "何から何までお世話になってしまい";
		mes "本当に、感謝しきれません。";
		next;
		mes "[ゼルメト]";
		mes "そうだ、お礼と言ってはなんですが……";
		mes "現場監督をしながら学んだ";
		mes "他人の意欲を高める方法を用いて、";
		mes "あなたの意欲を高めてあげましょう。";
		next;
		mes "[ゼルメト]";
		mes "いいですか、よく聞いてくださいね。";
		next;
		mes "-ゼルメトの激励を";
		mes "5分ほど聞いていた-";
		mes "-すると！-";
		delitem 7325,20;
		delitem 7317,10;
		delitem 7319,10;
		set EIN_4QUE,16;
		set $EinFactory,$EinFactory+1;
		if(checkre()) {
			if(BaseLevel > 90) 				getexp 29067,0;
			else if(BaseLevel > 80 && BaseLevel <= 90) 	getexp 7602,0;
			else if(BaseLevel > 70 && BaseLevel <= 80) 	getexp 3206,0;
			else if(BaseLevel > 60 && BaseLevel <= 70) 	getexp 1850,0;
			else if(BaseLevel > 50 && BaseLevel <= 60) 	getexp 660,0;
			else if(BaseLevel > 40 && BaseLevel <= 50) 	getexp 307,0;
			else						getexp 61,0;
		}
		else {
			if(BaseLevel > 90) 				getexp 290675,0;
			else if(BaseLevel > 80 && BaseLevel <= 90) 	getexp 76026,0;
			else if(BaseLevel > 70 && BaseLevel <= 80) 	getexp 32062,0;
			else if(BaseLevel > 60 && BaseLevel <= 70) 	getexp 18508,0;
			else if(BaseLevel > 50 && BaseLevel <= 60) 	getexp 6604,0;
			else if(BaseLevel > 40 && BaseLevel <= 50) 	getexp 3075,0;
			else						getexp 615,0;
		}
		next;
		mes "[ゼルメト]";
		mes "ありがとうございます。";
		mes "私は早速、修復工事に";
		mes "入ろうと思います。本当に";
		mes "ありがとうございました！";
		close;
	case 16:
		mes "[ゼルメト]";
		mes "頂いた材料はありがたく";
		mes "使わせていただきました。";
		mes "これで、工場の方もしばらくは";
		mes "安全でしょう。";
		close;
	}
}

ein_in01.gat,49,232,0	script	第2コントロールパネル	111,{
	if(EIN_4QUE == 1 || EIN_4QUE == 2) {
		mes "-第2コントロールパネルを見つけた-";
		mes "-明らかにネジが足りない上、";
		mes "鉄板の損傷も激しい。";
		mes "そして配線もボロボロだ-";
		set EIN_4QUE,2;
		close;
	}
	end;
}

ein_in01.gat,108,217,0	script	第3圧力器	111,{
	if(EIN_4QUE == 3 || EIN_4QUE == 4) {
		mes "-見た目では、特に";
		mes "問題はなさそうだが……";
		mes "よく調べてみると、音がおかしい上";
		mes "ネジがいくつか取れているようだ-";
		set EIN_4QUE,4;
		close;
	}
	end;
}

ein_in01.gat,62,258,0	script	中央コントロールパネル	111,{
	if(EIN_4QUE == 5 || EIN_4QUE == 6) {
		mes "-見た目では、何ら";
		mes "問題はなさそうだが……";
		mes "ちょっと試しに叩いてみると、";
		mes "中からヴーンと変な音がする-";
		mes "-どうやら内部に問題があるようだ-";
		set EIN_4QUE,6;
		close;
	}
	end;
}

ein_in01.gat,46,197,0	script	物資移動装置	111,{
	if(EIN_4QUE == 7 || EIN_4QUE == 8) {
		mes "-機械の手の動きが、";
		mes "ものすごくぎこちない-";
		mes "-パーツを握る力も、かなり弱そうだ-";
		mes "-錆びたネジもいくつか見える-";
		set EIN_4QUE,8;
		close;
	}
	end;
}

ein_in01.gat,100,266,0	script	パイプ	111,{
	if(EIN_4QUE == 9 || EIN_4QUE == 10) {
		mes "-パイプから危険そうな";
		mes "煙が吹き出している-";
		mes "-詳しく調べる必要もないほど";
		mes "危険な状態だ-";
		set EIN_4QUE,10;
		close;
	}
	end;
}

ein_in01.gat,95,239,0	script	物資移動装置	111,{
	if(EIN_4QUE == 11 || EIN_4QUE == 12) {
		mes "-小型の装置と似たような症状らしい-";
		mes "-機械の手の動きはぎこちなく、";
		mes "握力も弱そうだ-";
		mes "-錆びたネジもあちらこちらに見える-";
		set EIN_4QUE,12;
		close;
	}
	end;
}

einbroch.gat,132,84,4	script	リュッツ#einbroch	853,2,2,{
	if(EIN_4QUE == 13 || EIN_4QUE == 14) {
		mes "[リュッツ]";
		mes "修理費？　そんなもん出せるか！";
		mes "金が惜しいわい！";
		mes "機械はまだ動いているのに、";
		mes "何故わざわざ金を出さねば";
		mes "ならんのだ！　あぁん？";
		next;
		mes "[リュッツ]";
		mes "ゼルメトが予算を割いて欲しいと";
		mes "言ってきたが、そんなことに";
		mes "いちいち金を使っていたら、";
		mes "儲けにならんだろうが！";
		set EIN_4QUE,14;
		close;
	}
	mes "[リュッツ]";
	mes "わしがこの工場の工場長だ！";
	mes "ワッハッハ！";
	next;
	mes "[リュッツ]";
	mes "この工場のおかげで、わしだけでなく";
	mes "工場の労働者達も生活できているんだ！";
	mes "しかも、わしが直接現場にいなくても、";
	mes "現場監督のゼルメトがきちんと";
	mes "やってくれているから、";
	mes "工場自体も安泰だしな！";
	next;
	mes "[リュッツ]";
	mes "今後も発展し続ける";
	mes "我が工場を見ているがいい！";
	mes "ガーハッハッハ!!";
	close;
OnTouch:
	if($EinFactory < 10)
		end;
	mes "[リュッツ]";
	mes "何事だ!?";
	mes "わしの工場で何かあったのか？";
	mes "一体、誰の仕業だ?!";
	next;
	mes "[リュッツ]";
	mes "わしは避難するから、そこのお前!!";
	mes "ボケっとつっ立ってないで、";
	mes "さっさと事態を収めてみろ！";
	close2;
	donpcevent "環境管理員#einbroch::OnStart";
	end;
}

einbroch.gat,0,0,0	script	環境管理員#einbroch	-1,{
OnStart:
	announce "環境管理員: 非常事態発生!!　工場の煤煙が街に広がっています。アインブロック住民の皆さん、速やかに避難してください！",9;
	hideonnpc "カプラ職員#einbroch1";
	hideonnpc "カプラ職員#einbroch2";
	hideonnpc "案内要員#einbroch";
	hideonnpc "案内要員#einbrochdummy1";
	hideonnpc "案内要員#einbrochdummy2";
	hideonnpc "雑貨商人#einbroch";
	hideonnpc "マスク商人#einbroch";
	hideonnpc "駅員#einbroch1";
	hideonnpc "駅員#einbroch2";
	hideonnpc "カム#einbroch";
	hideonnpc "オベ#einbroch";
	hideonnpc "マーク#einbroch";
	hideonnpc "ケティン#einbroch";
	hideonnpc "ケネッシオ#einbroch";
	hideonnpc "スリーキ#einbroch";
	hideonnpc "街の青年#einbroch1";
	hideonnpc "街の青年#einbroch2";
	hideonnpc "センツ#einbroch";
	hideonnpc "カロパー#einbroch";
	hideonnpc "センボ#einbroch";
	hideonnpc "乗客#einbroch";
	hideonnpc "飛行船の技師#einbroch";
	hideonnpc "リュッツ#einbroch";
	hideonnpc "アーク・クライン#einbroch";
	hideonnpc "研究所の警備員#einbroch1";
	hideonnpc "研究所の警備員#einbroch2";
	monster "einbroch.gat",82,332,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",99,328,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",122,317,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",138,319,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",147,312,"酸の煙",1620,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",159,316,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",173,315,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",161,311,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",147,296,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",168,282,"酸の煙",1620,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",175,271,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",146,274,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",160,272,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",155,256,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",179,262,"酸の煙",1620,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",192,248,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",212,255,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",230,250,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",246,251,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",262,254,"酸の煙",1620,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",253,240,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",202,245,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",181,251,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",172,238,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",146,242,"酸の煙",1620,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",186,226,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",173,239,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",124,248,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",120,234,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",98,234,"酸の煙",1620,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",101,219,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",89,208,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",96,191,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",76,194,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",60,196,"酸の煙",1620,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",45,194,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",34,201,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",40,184,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",64,173,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",96,173,"酸の煙",1620,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",41,155,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",46,131,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",46,108,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",38,93,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",55,86,"酸の煙",1620,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",81,81,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",107,82,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",107,104,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",123,73,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",132,87,"酸の煙",1620,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",125,63,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",142,64,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",150,52,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",157,37,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",179,39,"酸の煙",1620,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",197,46,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",217,67,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",246,54,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",228,110,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",250,118,"酸の煙",1620,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",273,127,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",288,138,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",281,160,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",281,192,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",291,201,"酸の煙",1620,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",283,218,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",268,216,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",273,196,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",262,164,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",241,180,"酸の煙",1620,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",216,205,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",209,198,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",224,177,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",227,163,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",208,166,"酸の煙",1620,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",132,87,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",149,119,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",119,136,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",84,155,"毒の煙",1621,1,"環境管理員#einbroch::OnKilled";
	monster "einbroch.gat",82,107,"酸の煙",1620,1,"環境管理員#einbroch::OnKilled";
	initnpctimer;
	end;
OnTimer600000:
	set $EinFactory,0;
	killmonster "einbroch.gat","環境管理員#einbroch::OnKilled";
	announce "環境管理員: 避難警報解除!!　大気汚染度が安全値に戻りました。アインブロック住民の皆さん、ご安心ください。",9;
	hideoffnpc "カプラ職員#einbroch1";
	hideoffnpc "カプラ職員#einbroch2";
	hideoffnpc "案内要員#einbroch";
	hideoffnpc "案内要員#einbrochdummy1";
	hideoffnpc "案内要員#einbrochdummy2";
	hideoffnpc "雑貨商人#einbroch";
	hideoffnpc "マスク商人#einbroch";
	hideoffnpc "駅員#einbroch1";
	hideoffnpc "駅員#einbroch2";
	hideoffnpc "カム#einbroch";
	hideoffnpc "オベ#einbroch";
	hideoffnpc "マーク#einbroch";
	hideoffnpc "ケティン#einbroch";
	hideoffnpc "ケネッシオ#einbroch";
	hideoffnpc "スリーキ#einbroch";
	hideoffnpc "街の青年#einbroch1";
	hideoffnpc "街の青年#einbroch2";
	hideoffnpc "センツ#einbroch";
	hideoffnpc "カロパー#einbroch";
	hideoffnpc "センボ#einbroch";
	hideoffnpc "乗客#einbroch";
	hideoffnpc "飛行船の技師#einbroch";
	hideoffnpc "リュッツ#einbroch";
	hideoffnpc "アーク・クライン#einbroch";
	hideoffnpc "研究所の警備員#einbroch1";
	hideoffnpc "研究所の警備員#einbroch2";
	stopnpctimer;
	end;
OnKilled:
	end;	//ダミーイベント
}

//============================================================
// 病院クエストNPC（未完成）
//- Registry -------------------------------------------------
// EIN_5QUE -> 0～1
//------------------------------------------------------------
einbech.gat,97,167,5	script	サビタ	847,{
	if(EIN_5QUE) {
		mes "[サビタ]";
		mes "よく来たな。この間、";
		mes "約束したもんは揃ったか？";
		next;
		switch(select("はい","いいえ")) {
		case 1:
			if(countitem(7126)<40 || countitem(1011)<10 || countitem(1003)<3 || countitem(912)<10) {
				mes "[サビタ]";
				mes "もう一度教えるぜ。";
				break;
			}
			mes "[サビタ]";
			mes "おし、見せてくれ。";
			next;
			mes "[サビタ]";
			mes "うん、数も全部揃ってるな。";
			mes "ほら、約束のオリデオコンだ。";
			next;
			delitem 7124,40;
			delitem 1011,10;
			delitem 1003,3;
			delitem 912,10;
			getitem 984,1;
			set EIN_5QUE,0;
			mes "[サビタ]";
			mes "それじゃあ、元気でな。";
			close;
		case 2:
			mes "[サビタ]";
			break;
		}
		mes "大きなゼロピー40個";
		mes "エンベルタコン10個";
		mes "石炭3個、ジャルゴン10個を";
		mes "オリデオコン1個と交換だ。";
		mes "忘れるなよ。";
		close;
	}
	if(BaseLevel >= 40) {
		if(Zeny < 1000) {
			mes "[サビタ]";
			mes "あんた、随分景気悪そうだな。";
			mes "こんな貧しい俺でも同情しちゃうよ……";
			close;
		}
		mes "[サビタ]";
		mes "何だ？";
		mes "悪いが、俺は今、あまり";
		mes "喋りたい気分じゃないんだ。";
		mes "妻が坑道の陥没で大怪我をして、";
		mes "大変なんだ。";
		next;
		mes "[サビタ]";
		mes "以前の^FF0000陥没事故^000000に比べれば";
		mes "死者数は少ないが、妻が……";
		mes "手伝うつもりがないなら、";
		mes "あっちに行ってくれ。";
		switch(select("手伝いましょうか？","そうですか、さようなら","前の陥没事故？")) {
		case 1:
			mes "[サビタ]";
			mes "ああ、本当か？";
			mes "ありがとう、ありがとう、ありがとう！";
			mes "本当は、一刻も早く妻を病院に連れて";
			mes "いきたいところだが、1日の稼ぎで、";
			mes "1日の食い分を稼ぐ身にとっては";
			mes "それすらままならないんだ。";
			next;
			menu "どんなお手伝いをすればいいですか？",-;
			mes "[サビタ]";
			mes "妻の病院の費用と、1日分の食費を";
			mes "俺に恵んでくれないか。";
			mes "1000zenyなんだが。";
			next;
			if(select("あげる","やめる")==2) {
				mes "[サビタ]";
				mes "そっちにも、そっちの事情が";
				mes "あるもんな。";
				mes "無理言って悪かったよ。";
				close;
			}
			mes "[サビタ]";
			mes "ありがとう!!";
			next;
			mes "[サビタ]";
			mes "それと、もし手持ちがあるなら";
			mes "大きなゼロピー40個と石炭3個、";
			mes "ジャルゴン10個に、";
			mes "エンベルタコン10個を";
			mes "オリデオコン1個と";
			mes "交換してくれないか。";
			next;
			if(select("いいですよ","いやです")==2) {
				mes "[サビタ]";
				mes "うん、まぁ、ありがとよ。";
				mes "少ないが、これやるよ。";
				set Zeny,Zeny-1000;
				getitem 1010,1;
				close;
			}
			mes "[サビタ]";
			mes "よし、これで妻を医者に見せに行ける！";
			mes "じゃあ、約束したもの、";
			mes "忘れないでくれよ。";
			set Zeny,Zeny-1000;
			set EIN_5QUE,1;
			next;
			mes "[サビタ]";
			mes "またな。";
			close;
		case 2:
			mes "[サビタ]";
			mes "そ、それだけかい？";
			mes "お前には血も涙もないのかい……";
			close;
		case 3:
			break;
		}
	}
	//Lv40未満のとき
	mes "[サビタ]";
	mes "最近、ここでは坑道の";
	mes "陥没事故が頻発してるんだ。";
	mes "被害者もたくさんいて、";
	mes "今、村は色々と困ってる。";
	next;
	mes "[サビタ]";
	mes "どうやら、鉱山で何かが坑道を";
	mes "崩して回っているらしい……";
	mes "^FF0000鉱山の主^000000の怒りを買ったみたいだ……";
	next;
	mes "[サビタ]";
	mes "昔の^FF0000あの事故^000000以来、^FF0000鉱山の主^000000が";
	mes "頻繁に現われるようになりやがった。";
	mes "だから、仕事がより一層";
	mes "危険になってな。";
	next;
	mes "[サビタ]";
	mes "俺は^FF0000事故^000000の日、非番だったから";
	mes "命を落とさずにすんださ。";
	mes "ただ、その事故の唯一の生存者が";
	mes "俺の友人なんだが……";
	mes "精神に異常をきたしちまった。";
	mes "今でも、そいつを見ると胸が痛むよ……";
	close;
}

//============================================================
// 料理人クエストNPC（未完成）
//- Registry -------------------------------------------------
// EIN_6QUE -> 0～
//------------------------------------------------------------
einbroch.gat,215,180,5	script	アーク・クライン#einbroch	85,{
	switch(EIN_6QUE) {
	case 0:
		mes "[アーク]";
		mes "ル～ルル、ラリラリ～";
		mes "世界で一番美しいこと～";
		mes "それは、おいしい料理を";
		mes "食べて喜ぶあなたのお顔～♪";
		next;
		if(select("ここは鍛冶屋ではないのですか？","無視")==2) {
			mes "[アーク]";
			mes "料理とは～";
			mes "火に始まり、火に終わるもの～";
			mes "文明を悟った者だけが";
			mes "進むことができる道～♪";
			close;
		}
		mes "[アーク]";
		mes "もちろん！　ここは鍛冶屋よ。";
		mes "そして、私は世界で一番優雅な";
		mes "ブラックスミスであり、";
		mes "シュバルツバルド一の料理人、";
		mes "アーク・クラインよ！";
		mes "今後もよろしく。ウフッ♪";
		next;
		mes "[アーク]";
		mes "私に何か用かしら？";
		set EIN_6QUE,1;
		set '@word$,"先生、料理がしたいです！";
		break;
	case 1:
		mes "[アーク]";
		mes "あら、何かご用？";
		set '@word$,"先生、料理がしたいです！";
		break;
	case 2:
		mes "[アーク]";
		mes "あら、頼んでいた材料でも忘れたの？";
		set '@word$,"材料を渡す";
		break;
	case 3:
		mes "[アーク]";
		mes "あら、何か用かしら？";
		set '@word$,"料理について聞く";
		break;
	}
	next;
	switch(select("アインブロックについて聞く","武器を作って欲しい",'@word$,"やめる")) {
	case 1:
		mes "[アーク]";
		mes "……アインブロックの発展は、";
		mes "アインベフの鉱山から始まったのよ。";
		next;
		mes "[アーク]";
		mes "でもアインベフは、蒸気機関を";
		mes "中心とする工場をたくさん";
		mes "作るには狭すぎた。";
		next;
		mes "[アーク]";
		mes "そこで、空き地だったこちらに";
		mes "工場が立てられたそうよ。";
		mes "けれど私も、おじいちゃんに";
		mes "聞いた話だから、詳しくは知らないわ。";
		next;
		mes "[アーク]";
		mes "そうしてできたアインブロックは、";
		mes "あっと言う間に規模も人口も";
		mes "アインベフを飛び越えてしまった。";
		next;
		mes "[アーク]";
		mes "でも……アインベフは伸びていない。";
		mes "アインベフの開発を";
		mes "見直さなければいけないのよ。";
		next;
		mes "[アーク]";
		mes "以前、鉱山で働いていた人達の";
		mes "ほとんどが、今は工場に勤めているの。";
		mes "そして、アインベフは活気を";
		mes "失ってしまったわ。";
		next;
		mes "[アーク]";
		mes "アインブロックは、";
		mes "一見、派手かもしれない。";
		mes "でも、この荒んだ空気がわからない？";
		mes "もし、住む場所を探しているなら、";
		mes "ここは止めた方がいいわよ。";
		next;
		if(select("あなたはどうしてここにいるんですか？","分かりました")==1) {
			mes "[アーク]";
			mes "……思い出があるの。";
			mes "詳しくは教えられないけど、";
			mes "私にとって、お父さんみたいな人が";
			mes "いたの。";
			next;
			mes "[アーク]";
			mes "このお話は、";
			mes "これで終わりにしましょう。";
			mes "また遊びに来てね。";
			close;
		}
		mes "[アーク]";
		mes "……素直なのね、フフフ。";
		mes "そういうの、嫌いじゃないわ。";
		next;
		mes "[アーク]";
		mes "長話もここまで。";
		mes "また遊びに来てね。";
		close;
	case 2:
		mes "[アーク]";
		mes "人は、自分の身を守るためと言って";
		mes "戦い、戦って、戦い続ける。";
		mes "そんなことに武器が使われるのを、";
		mes "ブラックスミスが望むと思う？";
		next;
		mes "[アーク]";
		mes "平和主義者というわけじゃないけど";
		mes "今の私は料理人として、自分用の";
		mes "調理道具しか作るつもりがないわ。";
		next;
		mes "[アーク]";
		mes "私は、武器を作りたくないの。";
		mes "どうか、他の人に頼んでちょうだい。";
		mes "さようなら。";
		close;
	case 3:
		switch(EIN_6QUE) {
		case 1:
			mes "[アーク]";
			mes "あら、お料理に興味があるの？";
			mes "悪いけど、私は弟子を";
			mes "とらない主義なの。";
			mes "でも、料理人の心得なら";
			mes "教えてあげられるわ。";
			next;
			mes "[アーク]";
			mes "授業料は……";
			mes "そうね、どうしましょう？";
			mes "最近、欲しいものがいっぱい";
			mes "あるのよね、ウフッ。";
			next;
			mes "[アーク]";
			mes "冗談よ。";
			mes "でも、授業料はいただくわ。";
			mes "安心して。お金じゃないから。";
			mes "私の調理道具に必要な材料を";
			mes "集めてきてくれるかしら。";
			next;
			mes "[アーク]";
			mes "必要なのは、";
			mes "^3131FF大きなゼロピー^0000006個。";
			next;
			mes "[アーク]";
			mes "集めてきてくれたら、";
			mes "石炭1個と交換してあげるわ。";
			mes "そして、料理の先輩として";
			mes "料理の心構えを教えてあげる。";
			mes "実は、同業者には無料で";
			mes "教えてるんだけど……";
			next;
			mes "[アーク]";
			mes "ねぇ、あなた。";
			mes "ブラックスミスになってみない？";
			mes "ウフフ。";
			next;
			mes "[アーク]";
			mes "それでは待ってるわ。";
			mes "ウフフ。";
			set EIN_6QUE,2;
			close;
		case 2:
			if(countitem(7126) < 6) {
				mes "[アーク]";
				mes "あら？";
				if(countitem(7126) == 0)
					mes "一つも持ってないみたいだけど。";
				else
					mes "足りないみたいよ。";
				mes "ちゃんと頼んだ数分";
				mes "持って来てもらえるかしら。";
				close;
			}
			set EIN_6QUE,3;
			delitem 7126,6;
			getitem 1003,1;
			mes "[アーク]";
			mes "あら、ありがとう。";
			mes "とても助かるわ。";
			mes "はい、約束の石炭よ。";
			next;
			mes "[アーク]";
			mes "料理なんて、";
			mes "関係ない話かもしれないけど、";
			mes "よかったら聞いていかない？";
			next;
			mes "[アーク]";
			mes "何が聞きたいのかしら？";
			break;
		case 3:
			mes "[アーク]";
			mes "何が聞きたいの？";
			break;
		}
		next;
		switch(select("心","材料","実力","道具","やめる")) {
		case 1:
			mes "[アーク]";
			mes "料理は精錬と全く同じよ。";
			mes "心だけでお料理できたら、";
			mes "誰だって名シェフになれちゃうわ。";
			next;
			mes "[アーク]";
			mes "精錬する時、武器を作る時、";
			mes "必要な心は、始めたことを";
			mes "完成させるという固い意志だけ。";
			next;
			mes "[アーク]";
			mes "心とは、そういうもの。";
			mes "そして強い意志は、";
			mes "自分をも変えることが出来るの。";
			next;
			mes "[アーク]";
			mes "料理のお話からズレちゃったわね。";
			mes "大丈夫、覚えていて";
			mes "損はないお話だもの。";
			mes "また遊びに来てね。";
			mes "ウフフ。";
			close;
		case 2:
			mes "[アーク]";
			mes "材料ね……";
			mes "材料は、確かに大事よ。";
			mes "特に最初は、かなり重要ね。";
			next;
			mes "[アーク]";
			mes "鍛冶屋も同じ。";
			mes "鉄ではなく、鋼鉄や";
			mes "オリデオコンならって感じで、";
			mes "材料が変われば、";
			mes "作れるものも変わるわ。";
			next;
			mes "[アーク]";
			mes "でもね、材料集めが大変だから";
			mes "諦める……それで、果たして、";
			mes "おいしい料理が作れるかしら？";
			next;
			mes "[アーク]";
			mes "作ることだけに夢中になって、";
			mes "あれもダメ、これもダメなんて";
			mes "言ってたら、何ができるかしら？";
			next;
			mes "[アーク]";
			mes "また遊びに来てね。";
			mes "ウフッ。";
			close;
		case 3:
			mes "[アーク]";
			mes "実力が足りないから、";
			mes "出来ないことがある。";
			mes "何て愚かな言葉でしょう。";
			mes "料理は練習、練習、また練習。";
			mes "努力が大切よ。";
			next;
			mes "[アーク]";
			mes "努力してないのに、失敗の原因を";
			mes "自分の実力のせいにするのは";
			mes "言い訳よね。";
			next;
			mes "[アーク]";
			mes "鍛冶屋だって同じでしょ？";
			mes "スキルを上げる努力をしなければ";
			mes "いくら格好よくハンマーを握れたって";
			mes "まともな武器が出来るわけないわね。";
			next;
			mes "[アーク]";
			mes "でも、努力しつつ、実力を磨いている";
			mes "途中、自分より優れた人に会って";
			mes "挫折し、心を戒める。";
			mes "そういう人が実力のせいにするのは";
			mes "言い訳じゃないわよね。";
			next;
			mes "[アーク]";
			mes "努力を忘れず、実力を見直し、";
			mes "より一層の高みを目指しているなら、";
			mes "みんなが、あなたを尊敬の眼差しで";
			mes "見ること間違いないわ。";
			next;
			mes "[アーク]";
			mes "また遊びに来てね。";
			mes "ウフッ。";
			close;
		case 4:
			mes "[アーク]";
			mes "良い道具があれば、料理もしやすいわ。";
			mes "でもね、それだけ。";
			next;
			mes "[アーク]";
			mes "道具はあくまで、道具。";
			mes "良い道具だけでは、";
			mes "素敵な料理はできないの。";
			next;
			mes "[アーク]";
			mes "使いやすい道具が一番よ。";
			mes "私のオーブンはシュバルツバルドで";
			mes "最高のオーブンだけど、鍛冶の道具は";
			mes "昔仕事を始めた時から変わってないわ。";
			next;
			mes "[アーク]";
			mes "また遊びに来てね。";
			mes "フフフ。";
			close;
		case 5:
			mes "[アーク]";
			mes "お話したくなったら、";
			mes "いつでも遊びに来てね。";
			close;
		}
	case 4:
		mes "[アーク]";
		mes "また遊びに来てね。";
		mes "ウフフ。";
		close;
	}
}
