//= Auriga Script ==============================================================
// Ragnarok Online Moscovia Town Script	by Blaze
//==============================================================================

//============================================================
// Shop
//------------------------------------------------------------
mosk_in.gat,21,254,5	shop	道具商人	968,611,501,502,503,504,506,645,656,601,602,1065,1750
mosk_in.gat,31,180,3	shop	武器商人	968,1207,1216,1107,1122,1116,1154,1407,1457,1354,1519
mosk_in.gat,79,177,1	shop	防具商人	961,2211,2401,2403,2501,2503,2101,2103,2305,2321,2332,2328,2627
moscovia.gat,152,71,4	shop	果物商人	968,512,513,515,516
moscovia.gat,199,110,3	shop	牛乳商人	959,519

//============================================================
// アルベルタ⇔モスコビア転送NPC
//------------------------------------------------------------
//alberta.gat,245,66,3	script	モスコビア広報大使	960,{
alberta.gat,246,51,3	script	モスコビア広報大使	960,{
	mes "[モスコビア広報大使]";
	mes "モスコビアを知っていますか？";
	mes "果てしない海に浮いている楽園!!";
	mes "冒険と神秘に満ちている";
	mes "モスコビアがあなたを待っています！";
	next;
	switch(select("モスコビアとは？","モスコビアへ行く","話をやめる")) {
	case 1:
		mes "[モスコビア広報大使]";
		mes "自然の神秘に満ちた絶景！";
		mes "美しい礼拝堂と王宮を見れば、";
		mes "あなたもモスコビアに";
		mes "心を奪われるでしょう。";
		next;
		mes "[モスコビア広報大使]";
		mes "長い長い冬が終わり、";
		mes "こうして我がモスコビアを";
		mes "皆さんに紹介出来るようになり、";
		mes "本当に嬉しいです。";
		mes "モスコビアの冬は……";
		mes "想像を絶する程、厳しいのです。";
		next;
		mes "[モスコビア広報大使]";
		mes "さぁ、美しいモスコビアに行くには";
		mes "今がチャンスです！";
		mes "きっと素敵な思い出を残せるでしょう！";
		close;
	case 2:
		mes "[モスコビア広報大使]";
		mes "モスコビアまでの移動料金は";
		mes "10,000 zenyです。";
		mes "お帰りはもちろん無料です！";
		next;
		mes "[モスコビア広報大使]";
		mes "さて、出発しましょうか？";
		next;
		if(select("出発！","やめる")==2) {
			mes "[モスコビア広報大使]";
			mes "私はここにいますので、";
			mes "行きたくなりましたら";
			mes "いつでも話しかけてください！";
			close;
		}
		if(Zeny < 10000) {
			mes "[モスコビア広報大使]";
			mes "申し訳ありませんが、";
			mes "移動料金の10,000 zeny";
			mes "を頂かないと船は出せません。";
			mes "もう一度、所持金を確かめてください。";
			close;
		}
		mes "[モスコビア広報大使]";
		mes "では、出発します！";
		close2;
		set Zeny,Zeny-10000;
		warp "moscovia.gat",163,55;
		end;
	case 3:
		mes "[モスコビア広報大使]";
		mes "私はここにいますので、";
		mes "行きたくなりましたら";
		mes "いつでも話しかけてください！";
		close;
	}
OnInit:
	waitingroom "モスコビア行き",0;
	end;
}

moscovia.gat,166,53,3	script	モスコビア広報大使	960,{
	mes "[モスコビア広報大使]";
	mes "アルベルタに戻る船は";
	mes "いつでも出発できます。";
	mes "すぐに乗られますか？";
	next;
	if(select("アルベルタに帰る","やめる")==2) {
		mes "[モスコビア広報大使]";
		mes "モスコビアを隅々まで、";
		mes "ゆっくりと楽しんで";
		mes "いってください。";
		close;
	}
	mes "[モスコビア広報大使]";
	mes "またのお越しを";
	mes "お待ちしています！";
	close2;
	//warp "alberta.gat",243,67;
	warp "alberta.gat",241,87;
	end;
}

//============================================================
// モスコビアNPC
//------------------------------------------------------------
moscovia.gat,253,166,3	script	兵士	966,{
	mes "[兵士]";
	mes "王宮には、このモスコビアを";
	mes "支配する「チャール様」が";
	mes "いらっしゃる。くれぐれも失礼が";
	mes "ない様、気をつけたまえ。";
	close;
}

//============================================================
// モスコビア室内NPC
//------------------------------------------------------------
mosk_in.gat,118,66,5	script	兵士#mosk	966,{
	mes "[兵士]";
	mes "王宮では静かにしてください。";
	mes "チャール様がいらっしゃいます！";
	close;
}
mosk_in.gat,118,66,5	duplicate(兵士#mosk)	兵士	966
mosk_in.gat,113,124,5	duplicate(兵士#mosk)	兵士	966
mosk_in.gat,133,110,3	duplicate(兵士#mosk)	兵士	966
mosk_in.gat,133,73,3	duplicate(兵士#mosk)	兵士	966

//============================================================
// モスコビアダンジョンNPC
//------------------------------------------------------------
mosk_dun01.gat,194,43,0	script	石碑#mosk1	111,{
	mes "-四角い形の岩の表面に";
	mes "　文字が刻まれている-";
	next;
	mes "^3131FF-死にたくなければ";
	mes "　戻るが良い-^000000";
	close;
}

mosk_dun01.gat,170,164,0	script	石碑#mosk2	111,{
	mes "-四角い形の岩の表面に";
	mes "　文字が刻まれている-";
	next;
	mes "^3131FF-太陽に仕える者、死に";
	mes "　至る覚悟があるのなら、";
	mes "　北へ進むが良い-^000000";
	close;
}

mosk_dun01.gat,207,276,0	script	石碑#mosk3	111,{
	mes "-四角い形の岩の表面に";
	mes "　文字が刻まれている-";
	next;
	mes "^3131FF-進む者、傷ついた代わりに";
	mes "　勇気を貰う、戻る者は何時までも";
	mes "　安全であろう。";
	mes "　無謀な勇気を持つ者は進み、";
	mes "　そうでない者は戻るが良い-^000000";
	next;
	if(select("進む","戻る") == 2) {
		mes "-戻ることを選んだ-";
		close;
	}
	mes "-進むことを選んだ-";
	close2;
	warp "mosk_dun02.gat",165,30;
	end;
}

mosk_dun02.gat,168,28,0	script	石碑#mosk4	111,{
	mes "-四角い形の岩の表面に";
	mes "　文字が刻まれている-";
	next;
	mes "^3131FF-進む者、傷つく代わりに";
	mes "　勇気を貰う。";
	mes "　戻る者は何時までも";
	mes "　安全であろう。";
	mes "　勇気ある者は進み、";
	mes "　そうでない者は戻るが良い-^000000";
	next;
	if(select("進む","戻る") == 2) {
		mes "-戻ることを選んだ-";
		close;
	}
	mes "-進むことを選んだ-";
	close2;
	warp "mosk_dun01.gat",201,269;
	end;
}

mosk_dun02.gat,268,117,0	script	石碑#mosk5	111,{
	mes "-四角い形の岩の表面に";
	mes "　文字が刻まれている-";
	next;
	mes "^3131FF-進む者、死ぬ代わりに";
	mes "　名誉を貰う。";
	mes "　戻る者は勇気を得るが";
	mes "　傷を負うだろう。";
	mes "　無謀な勇気のある者は進み、";
	mes "　そうでない者は戻るが良い-^000000";
	next;
	if(select("進む","戻る") == 2) {
		mes "-戻ることを選んだ-";
		close;
	}
	mes "-進むことを選んだ-";
	close2;
	warp "mosk_dun03.gat",32,135;
	end;
}

mosk_dun03.gat,27,131,0	script	石碑#mosk6	111,{
	mes "-四角い形の岩の表面に";
	mes "　文字が刻まれている-";
	next;
	mes "^3131FF-留まる者、傷つく代わりに";
	mes "　名誉を貰う。";
	mes "　戻る者は大きい傷を負い、";
	mes "　勇気を学ぶだろう。";
	mes "　勇気ある者は戻り、";
	mes "　そうでない者は進むが良い-^000000";
	next;
	if(select("戻る","進む") == 2) {
		mes "-進むことを選んだ-";
		close;
	}
	mes "-危険を感じ、戻ることを選んだ-";
	close2;
	warp "mosk_dun02.gat",262,118;
	end;
}

mosk_dun01.gat,264,191,0	script	石碑#mosk7	111,{
	mes "-四角い形の岩の表面に";
	mes "　文字が刻まれている-";
	next;
	mes "^3131FF-進む者、死ぬ代わりに";
	mes "　名誉を貰う。";
	mes "　戻る者は何時までも";
	mes "　安全であろう。";
	mes "　死を恐れない者は進み、";
	mes "　そうでない者は戻るが良い-^000000";
	next;
	if(select("進む","戻る") == 2) {
		mes "-戻ることを選んだ-";
		close;
	}
	mes "-進むことを選んだ-";
	close2;
	warp "mosk_dun03.gat",117,36;
	end;
}

mosk_dun03.gat,119,46,0	script	石碑#mosk8	111,{
	mes "-四角い形の岩の表面に";
	mes "　文字が刻まれている-";
	next;
	mes "^3131FF-留まる者、死ぬ代わりに";
	mes "　名誉を貰う。";
	mes "　戻る者は何時までも";
	mes "　安全だろう。";
	mes "　死を恐れぬ者は戻り、";
	mes "　そうでない者は進むが良い-^000000";
	next;
	if(select("戻る","進む") == 2) {
		mes "-進むことを選んだ-";
		close;
	}
	mes "-危険を感じ、戻ることを選んだ-";
	close2;
	warp "mosk_dun01.gat",257,190;
	end;
}

//============================================================
// クジラ島をたずねてクエストNPC
//- Registry -------------------------------------------------
// MOSK_1QUE -> 0～41
//------------------------------------------------------------
moscovia.gat,171,71,3	script	ベルバイェフ	968,{
	switch(MOSK_1QUE) {
	case 0:
		mes "[ベルバイェフ]";
		mes "……";
		next;
		emotion 6;
		mes "[ベルバイェフ]";
		mes "何で……";
		mes "何でみんな俺の言う事を";
		mes "信じてくれないんだ……";
		mes "本当なのに……";
		next;
		menu "どうかしましたか？",-;
		mes "[ベルバイェフ]";
		mes "えっと、君は……";
		mes "この街の人ではないね。";
		mes "その格好だと、冒険者かな。";
		next;
		mes "-" +strcharinfo(0)+ "は";
		mes "　うなずいた-";
		next;
		mes "[ベルバイェフ]";
		mes "世界を旅している冒険者の君なら、";
		mes "俺の話を信じてくれるかも……";
		mes "みんな、誰も信じてくれないんだ。";
		mes "俺の話を聞いてくれないかな？";
		next;
		if(select("興味ありません","話してください") == 1) {
			mes "[ベルバイェフ]";
			mes "そう……興味ないか……";
			mes "まぁ、仕方ないな。";
			next;
			mes "[ベルバイェフ]";
			mes "もし、気が変わったら";
			mes "また話しかけて欲しいな。";
			close;
		}
		emotion 21;
		mes "[ベルバイェフ]";
		mes "おお！ありがとう！";
		mes "俺の話を聞いてくれるんだね！";
		next;
		mes "[ベルバイェフ]";
		mes "君は、^FF0000動く島^000000の話を";
		mes "聞いたことあるかい？";
		next;
		mes "[ベルバイェフ]";
		mes "昔からこの地に伝わる";
		mes "伝説なんだけど、";
		mes "この近海のどこかに、";
		mes "動く島があるというんだ。";
		next;
		mes "[ベルバイェフ]";
		mes "でも、今までその島を";
		mes "見た人はいない。";
		mes "ついこの間までは";
		mes "この伝説を信じる人なんて";
		mes "この街には誰もいなかった。";
		next;
		mes "[ベルバイェフ]";
		mes "この俺も、ついこの間までは";
		mes "そんな伝説なんて";
		mes "全く信じていなかったよ。";
		next;
		mes "[ベルバイェフ]";
		mes "でも、俺は見てしまったんだ。";
		mes "船に乗っている時、";
		mes "この目でハッキリと";
		mes "その動く島をさ！";
		next;
		mes "[ベルバイェフ]";
		mes "本当に興奮したよ！";
		mes "伝説とばっかり思っていた";
		mes "動く島が突如、";
		mes "俺の前に現れたんだからね！";
		next;
		mes "[ベルバイェフ]";
		mes "俺は必死にその島に近づこうと";
		mes "船の速度を上げたんだ！";
		next;
		mes "[ベルバイェフ]";
		mes "でも島は近づくどころか、";
		mes "どんどん離れていってしまうんだ。";
		next;
		mes "[ベルバイェフ]";
		mes "俺は必死に島を追ったけど、";
		mes "……結局は";
		mes "海の向こう側に消えてしまったんだ。";
		next;
		mes "[ベルバイェフ]";
		mes "でも誰もこの話を";
		mes "信じてくれないんだ！";
		next;
		mes "[ベルバイェフ]";
		mes "まぁ、君だって俺の言う事を";
		mes "そのまま信じるのは無理だろうな……";
		next;
		mes "[ベルバイェフ]";
		mes "俺がその島を目撃したのは、ここから";
		mes "南の海岸のど真ん中の辺りだったよ。";
		mes "最初は俺だって、自分の目を";
		mes "疑ったけどね。";
		next;
		menu "その後、島を見た事は？",-;
		mes "[ベルバイェフ]";
		mes "いいや、それが";
		mes "あれから一度も見ていないよ。";
		next;
		mes "[ベルバイェフ]";
		mes "でも本当なんだ！";
		mes "俺は見たんだ！";
		mes "^FF0000動く島^000000は実在するんだ！";
		next;
		mes "[ベルバイェフ]";
		mes "あれから俺の心は";
		mes "動く島のことでいっぱいだよ。";
		mes "俺はあの島の謎を解明したい！";
		next;
		mes "[ベルバイェフ]";
		mes "本当は今すぐにでも";
		mes "動く島を探しに行きたいんだけど";
		mes "俺の船が故障してしまってね。";
		mes "俺は本当についてないよ……";
		next;
		mes "[ベルバイェフ]";
		mes "それで仕方なく";
		mes "船を持っている";
		mes "^FF0000イワノフ爺さん^000000に";
		mes "船を貸してくれ、と頼んだんだ。";
		next;
		mes "[ベルバイェフ]";
		mes "でも、";
		mes "断られてしまったんだよ……";
		next;
		mes "[ベルバイェフ]";
		mes "おまえはわしの話を聞かんから";
		mes "駄目だ！と訳のわからないことを";
		mes "言われてね。";
		next;
		mes "[ベルバイェフ]";
		mes "イワノフ爺さんとはどうも";
		mes "いつもかみ合わないというか……";
		next;
		mes "[ベルバイェフ]";
		mes "イワノフ爺さんから";
		mes "船を借りられればなあ。";
		mes "借りられない以上は";
		mes "俺の船の修理が";
		mes "終わるまで待つしかないか……";
		mes "早く動く島を探したいよ。";
		next;
		mes "[ベルバイェフ]";
		mes "そう言えば、イワノフ爺さんも";
		mes "若い頃、君のように";
		mes "冒険をしていたらしいぞ。";
		mes "もしかして、君なら気が合って、";
		mes "船を貸してくれたりしてね。";
		mes "まあ、多分無理だろうけど。";
		next;
		mes "[ベルバイェフ]";
		mes "ちなみに";
		mes "イワノフ爺さんは";
		mes "ここからすぐ南西の方にいるよ。";
		set MOSK_1QUE,1;
		close;
	case 1:
		mes "[ベルバイェフ]";
		mes "イワノフ爺さんから";
		mes "船を借りられればなあ。";
		mes "借りられない以上は";
		mes "俺の船の修理が";
		mes "終わるまで待つしかないか……";
		mes "早く動く島を探したいよ。";
		next;
		mes "[ベルバイェフ]";
		mes "そう言えば、イワノフ爺さんも";
		mes "若い頃、君のように";
		mes "冒険をしていたらしいぞ。";
		mes "もしかして、君なら気が合って、";
		mes "船を貸してくれたりしてね。";
		mes "まあ、多分無理だろうけど。";
		next;
		mes "[ベルバイェフ]";
		mes "ちなみに";
		mes "イワノフ爺さんは";
		mes "ここからすぐ南西の方にいるよ。";
		close;
	default:
		if(MOSK_1QUE > 12 && MOSK_1QUE < 42) {
			emotion 23;
			mes "[ベルバイェフ]";
			mes "本当!?動く島を";
			mes "見つけたのかい？";
			mes "しかも島に上陸したって言うの!?";
			next;
			emotion 21;
			mes "[ベルバイェフ]";
			mes "やはり動く島は実在した！";
			mes "君が証明してくれたんだよ！";
			mes "ありがとう！";
			mes "船がなおったら";
			mes "俺もすぐにでも動く島を";
			mes "探しに行くよ！";
			close;
		}
		mes "[ベルバイェフ]";
		mes "モスコビアにようこそ！";
		mes "モスコビアは";
		mes "綺麗な所でしょう？";
		mes "楽しんでいってくださいね。";
		close;
	}
}

moscovia.gat,135,49,5	script	イワノフ	964,{
	switch(MOSK_1QUE) {
	case 1:
	case 2:
		mes "[イワノフ]";
		mes "外国の冒険者さんよ。";
		next;
		mes "[イワノフ]";
		mes "俺も昔、冒険者をしていたんだ。";
		mes "体に限界がきちまったから";
		mes "今じゃあ、冒険を";
		mes "やめちまっているがね。";
		next;
		mes "[イワノフ]";
		mes "もし俺が20年若ければ、";
		mes "間違いなく、あんたのように";
		mes "冒険をしているぜ……";
		mes "時が過ぎるのは早すぎる。";
		next;
		if(select("冒険話を聞かせてください","船を貸してください") == 1) {
			emotion 2;
			mes "[イワノフ]";
			mes "俺の冒険話を聞きたいって？";
			mes "ふふふ……";
			mes "まぁ、ゆっくりしていきな。";
			next;
			mes "[イワノフ]";
			mes "さぁて、何から話そうかな。";
			mes "そうだな……";
			mes "俺がルーンミッドガッツを";
			mes "転々としていた時の話をしようかな。";
			next;
			mes "[イワノフ]";
			mes "そういえば、あの時はあんたと";
			mes "同じくらいの年だったな……";
			next;
			mes "[イワノフ]";
			mes "ふふふ、";
			mes "あれだけ屈強だった俺が";
			mes "今では";
			mes "こうして海を眺めながら";
			mes "昔を思い出したりするだけ……";
			next;
			mes "[イワノフ]";
			mes "若い頃の俺が";
			mes "今の俺を見て";
			mes "どう思うのだろうか……";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "（ものすごく話が長い";
			mes "　予感がする……）";
			next;
			mes "[イワノフ]";
			mes "おお、すまない。";
			mes "前置きが長くなってしまったな。";
			next;
			mes "[イワノフ]";
			mes "それにしても、あんた";
			mes "俺の話を相当楽しみにしているな！";
			next;
			mes "[イワノフ]";
			mes "早く冒険話をたっぷりと";
			mes "聞かせてくれよ、";
			mes "そんな顔をしているぞ！";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "……";
			next;
			mes "[イワノフ]";
			mes "そこまで、楽しみにされては";
			mes "俺も最高の冒険話を";
			mes "しなくてはなるまい。";
			next;
			mes "[イワノフ]";
			mes "ううむ、";
			mes "今日中に話が終わるだろうか……";
			next;
			mes "[イワノフ]";
			mes "まぁ、今日中に終わらなかったら";
			mes "明日に続きを話せばいいな。";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "……";
			next;
			mes "[イワノフ]";
			mes "まず、巨大ポリンの群れとの";
			mes "闘いの話をするか！";
			next;
			mes "[イワノフ]";
			mes "俺が24歳になった時、";
			mes "俺と仲間達はフェイヨンの森で";
			mes "迷っていたんだ。";
			next;
			mes "……";
			next;
			mes "…………";
			next;
			mes "………………";
			next;
			mes "……………………";
			next;
			mes "[イワノフ]";
			mes "そして、命を懸けた";
			mes "俺の活躍により";
			mes "みんな無事に帰ったわけだ！";
			mes "どうだ、凄いだろう？";
			next;
			mes "[イワノフ]";
			mes "次は、そうだな！";
			mes "ゴブリン達との";
			mes "闘いの話をしようかな！";
			next;
			mes "[イワノフ]";
			mes "このゴブリンの話はすごいぞ!!";
			mes "特に後半の俺の活躍を";
			mes "中心に聞いて欲しい。";
			next;
			mes "[イワノフ]";
			mes "この話の俺から、";
			mes "多くのことを学んで欲しい。";
			mes "どうだ、聞きたいだろ？";
			next;
			if(select("え、えと、また今度に……","はい、聞きます！") == 1) {
				mes "[イワノフ]";
				mes "そうか、残念だ。";
				mes "やっと話が乗りに乗って";
				mes "きたのだが……";
				next;
				mes "[イワノフ]";
				mes "もう少し、あんたとは";
				mes "話がしたかったな。";
				next;
				mes "[イワノフ]";
				mes "それでは、また話が";
				mes "聞きたくなったら来てくれ。";
				close;
			}
			emotion 2;
			mes "[イワノフ]";
			mes "ふふふ、";
			mes "あんたは最高だ！";
			mes "俺とは気が合いそうだぞ！";
			next;
			mes "[イワノフ]";
			mes "じゃ、ゴブリン達との";
			mes "闘いを話すぞ！";
			next;
			mes "……";
			next;
			mes "…………";
			next;
			mes "………………";
			next;
			mes "……………………";
			next;
			mes "[イワノフ]";
			mes "そして、激しかった戦闘が";
			mes "無事に終わったんだ……";
			mes "ふぅ。";
			next;
			mes "[イワノフ]";
			mes "……";
			next;
			mes "[イワノフ]";
			mes "ふふふ。";
			next;
			mes "[イワノフ]";
			mes "それにしても、こうして";
			mes "俺の話を聞いてくれる人は、";
			mes "本当に久しぶりだな……";
			next;
			mes "[イワノフ]";
			mes "ありがとう。";
			mes "礼を言うぞ。";
			next;
			mes "[イワノフ]";
			mes "あんたとは";
			mes "良い友達になりそうだな。";
			next;
			mes "[イワノフ]";
			mes "あんたの名前を教えてくれ。";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes strcharinfo(0)+ "です。";
			next;
			mes "[イワノフ]";
			mes strcharinfo(0)+ "か。";
			mes "力強い、いい名前だ。";
			next;
			mes "[イワノフ]";
			mes "次は、君の冒険話を聞かせてくれ！";
			mes "それに……";
			mes "^FF0000もし俺に手伝える事が";
			mes "あれば、何でも言ってくれ！";
			set MOSK_1QUE,2;
			close;
		}
		if(MOSK_1QUE != 2) {
			emotion 7;
			mes "[イワノフ]";
			mes "俺から船を借りたいのか？";
			mes "すまないが、それは無理だ。";
			mes "俺は、友と呼べるものにしか";
			mes "協力はしたくはないな。";
			next;
			mes "[イワノフ]";
			mes "俺とあんたは";
			mes "まだ友と呼べる仲ではないよな。";
			close;
		}
		mes "[イワノフ]";
		mes "俺から船を借りたいのか。";
		mes "あんたのためなら";
		mes "喜んでこの船を貸すぞ!!";
		next;
		mes "[イワノフ]";
		mes "ところで";
		mes "船で何をするつもりなんだ、";
		mes "教えてくれないか？";
		next;
		mes "-" +strcharinfo(0)+ "は";
		mes "　伝説の動く島の話をした-";
		next;
		mes "[イワノフ]";
		mes "あんた、ベルバイェフが見たという";
		mes "あの伝説の島を";
		mes "探すと言うのか。";
		next;
		mes "[イワノフ]";
		mes "ふふふ、";
		mes "あんたは根っからの";
		mes "冒険者だな！";
		mes "最高だぜ！";
		next;
		mes "[イワノフ]";
		mes "困難に挑戦するその意志！";
		mes "ますます気に入った！";
		mes "では早速行くか！";
		next;
		mes "[イワノフ]";
		mes "……";
		next;
		mes "[イワノフ]";
		mes "……ちょっと待ってくれ。";
		mes "船の調子がおかしい。";
		mes "……なるほど。";
		mes "そういうことか。";
		next;
		mes "[イワノフ]";
		mes "すまない。";
		mes "最近、船を出してなかったから、";
		mes "この船は少し手入れの必要が";
		mes "あるようだ。";
		next;
		mes "[イワノフ]";
		mes "う～む、やはりそうか。";
		mes "船の動力部分の整備が必要だ。。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "手伝いましょうか？";
		next;
		mes "[イワノフ]";
		mes "あんた、手伝ってくれるのか！";
		mes "最近の若者にしては珍しい。";
		mes "あんたはやはり最高だよ！";
		mes "最高の冒険者だよ！";
		next;
		mes "[イワノフ]";
		mes "それではすまないが、";
		mes "整備に必要な材料を";
		mes "集めてきてくれないか？";
		next;
		mes "[イワノフ]";
		mes "必要な材料は、";
		mes "^3131FF謎のチャック 10個、";
		mes "錆びたネジ 10個、";
		mes "チューブ 5個、";
		mes "ジュビリー 10個^000000だ。";
		next;
		mes "[イワノフ]";
		mes "材料が揃ったら、";
		mes "持って来てくれ。";
		mes "すまないがよろしく頼むぞ。";
		set MOSK_1QUE,3;
		close;
	case 3:
		mes "[イワノフ]";
		mes "材料は全部揃ったか？";
		mes "材料さえあれば、";
		mes "船を出す事ができるぞ。";
		next;
		if(countitem(7167) < 10 || countitem(7317) < 10 || countitem(7325) < 5 || countitem(7312) < 10) {
			mes "[イワノフ]";
			mes "材料が足りないぞ。";
			mes "材料をもう一度言うからな。";
			next;
			mes "[イワノフ]";
			mes "必要な材料は、";
			mes "^3131FF謎のチャック 10個、";
			mes "錆びたネジ 10個、";
			mes "チューブ 5個、";
			mes "ジュビリー 10個^000000だ。";
			close;
		}
		delitem 7167,10;
		delitem 7317,10;
		delitem 7325,5;
		delitem 7312,10;
		set MOSK_1QUE,4;
		mes "[イワノフ]";
		mes "おー!!全部揃えたな！";
		mes "これでばっちりだ!!";
		next;
		mes "[イワノフ]";
		mes "少し待っててくれ。";
		mes "すぐに整備するからな。";
		next;
		mes "[イワノフ]";
		mes "……";
		next;
		mes "[イワノフ]";
		mes "整備はできたぞ！";
		mes "さぁ、これで船の準備は";
		mes "大丈夫だ。";
		next;
		mes "[イワノフ]";
		mes "あんたの準備が出来たら";
		mes "言ってくれ！";
		close;
	case 4:
		mes "[イワノフ]";
		mes "お！準備ができたのか？";
		next;
		mes "[イワノフ]";
		mes "では行こう！";
		mes "クジラ島、待っていやがれってんだ！";
		close2;
		warp "mosk_ship.gat",94,110;
		end;
	case 5:
	case 6:
	case 7:
	case 8:
	case 9:
	case 10:
	case 11:
	case 12:
	case 13:
	case 14:
		mes "[イワノフ]";
		mes "この前の航海は大変だったな……";
		mes "しかしっ！";
		mes "最高に胸が熱くなったよ。";
		next;
		mes "[イワノフ]";
		mes "また船を出す気なら、";
		mes "言ってくれ。";
		mes "俺はいつでも大丈夫だぜ！";
		mes "むしろ早く行きたいぜっ！";
		next;
		mes "[イワノフ]";
		mes "クジラ島に行くか？";
		next;
		if(select("準備がまだ……","出発してください") == 1) {
			mes "[イワノフ]";
			mes "そうかっ、残念だ!!";
			mes "準備が出来たら";
			mes "いつでも話しかけてくれ。";
			mes "あんまり準備が遅いようだと";
			mes "あんたを捕まえて";
			mes "無理やりでも連れて行くからな！";
			close;
		}
		mes "[イワノフ]";
		mes "よし、行こう！";
		set MOSK_1QUE,4;
		close2;
		warp "mosk_ship.gat",94,110;
		end;
	case 15:
		mes "[イワノフ]";
		mes "あんた……";
		mes "生きていたのか!!";
		mes "俺は、あんたが波に飲まれて";
		mes "もう帰って来れないかと……";
		next;
		mes "[イワノフ]";
		mes "ううっ、";
		mes "生きていてよかった……";
		mes "本当によかった！";
		next;
		mes "[イワノフ]";
		mes "それで、今までどこにいたんだ？";
		mes "海に落ちた後、どうやって";
		mes "帰ってきたんだ？";
		next;
		menu "今までの話をする",-;
		mes "[イワノフ]";
		mes "何！";
		mes "今まで動く島にいたって!?";
		next;
		mes "[イワノフ]";
		mes "しかも動く島の正体は";
		mes "クジラだって言うのか！";
		next;
		mes "[イワノフ]";
		mes "そのクジラの上には水が流れ、";
		mes "木が生えていて、家屋もあり";
		mes "老人が住んでいる……";
		next;
		mes "[イワノフ]";
		mes "すごいな……";
		mes "今まで俺が聞いた話のうち、";
		mes "一番不思議な話だ。";
		next;
		mes "[イワノフ]";
		mes "特に老人が住んでいるっていうのが";
		mes "すごいな。";
		mes "それにしてもクジラが沈んだら";
		mes "どうするつもりなんだろうな。";
		next;
		mes "[イワノフ]";
		mes "とにかくすごい話なのは";
		mes "間違いないぜ！";
		mes "これは王宮にいるチャール様に";
		mes "報告した方がいいぞ。";
		next;
		mes "[イワノフ]";
		mes "チャール様はこういう不思議な";
		mes "話が好きなんだよ。";
		mes "この話を聞いたら、";
		mes "莫大な褒賞を";
		mes "もらえるかもしれないぜ。";
		next;
		mes "[イワノフ]";
		mes "王宮の場所は、すぐ北東にいる";
		mes "モスコビアガイドに聞くといい。";
		next;
		mes "[イワノフ]";
		mes "友よ！";
		mes "やはり、あんたは";
		mes "すごい冒険者だぜっ！";
		set MOSK_1QUE,16;
		close;
	case 16:
	case 17:
		mes "[イワノフ]";
		mes "クジラ島の話を王宮にいる";
		mes "チャール様に報告した方がいいぞ。";
		next;
		mes "[イワノフ]";
		mes "チャール様はこういう不思議な";
		mes "話が好きなんだよ。";
		mes "この話を聞いたら、";
		mes "莫大な褒賞を";
		mes "もらえるかもしれないぜ。";
		next;
		mes "[イワノフ]";
		mes "王宮の場所は、すぐ北東にいる";
		mes "モスコビアガイドに聞くといい。";
		close;
	case 18:
		mes "[イワノフ]";
		mes "どうした？";
		next;
		mes "-" +strcharinfo(0)+ "は";
		mes "　事情を話した-";
		next;
		mes "[イワノフ]";
		mes "チャール様はクジラ島の証拠を";
		mes "要求されたのか……";
		mes "話だけでは信じてくれなかったか。";
		next;
		mes "[イワノフ]";
		mes "しかし友よ！";
		next;
		mes "[イワノフ]";
		mes "俺は絶対にあんたの話を";
		mes "信じるぜ。";
		mes "例えどんなことがあってもな。";
		next;
		mes "[イワノフ]";
		mes "……";
		mes "これからどうする？";
		mes "証拠と言っても、困難な話だろ。";
		mes "クジラ島に再び行けるか";
		mes "わからないし……";
		next;
		mes "[イワノフ]";
		mes "しかし、あんたのことだ。";
		mes "きっと諦めないだろう？";
		next;
		mes "[イワノフ]";
		mes "友よ！";
		mes "あんたが望むなら";
		mes "俺は何度でも手伝うぞ。";
		next;
		if(select("もう一度クジラ島を探す","諦める") == 2) {
			mes "[イワノフ]";
			mes "そうか……";
			mes "確かに";
			mes "もう一度たどり着けるか";
			mes "わからないクジラ島を";
			mes "探すのは無茶かも知れない。";
			next;
			mes "[イワノフ]";
			mes "しかし、それゆえに";
			mes "挑戦する価値があると俺は思う。";
			mes "クジラ島を探す気になったら";
			mes "また話しかけてくれ。";
			close;
		}
		mes "[イワノフ]";
		mes "さすがだ……";
		mes "どんな困難にも立ち向かう。";
		mes "やはり、俺が認めた";
		mes "冒険者だけあるな!!";
		next;
		mes "[イワノフ]";
		mes "準備ができたら";
		mes "話しかけてくれ！";
		set MOSK_1QUE,19;
		close;
	case 19:
		mes "[イワノフ]";
		mes "お！準備ができたのか？";
		mes "ちょっと待ってくれ……";
		next;
		mes "[イワノフ]";
		mes "では行くぞ！";
		close2;
		warp "mosk_ship.gat",94,110;
		end;
	case 20:
	case 21:
	case 22:
	case 23:
	case 24:
	case 25:
	case 26:
	case 27:
	case 28:
	case 29:
	case 30:
	case 31:
		mes "[イワノフ]";
		mes "この前の航海は大変だったな……";
		mes "しかしっ！";
		mes "最高に胸が熱くなったよ。";
		next;
		mes "[イワノフ]";
		mes "また船を出す気なら、";
		mes "言ってくれ。";
		mes "俺はいつでも大丈夫だぜ！";
		mes "むしろ早く行きたいぜっ！";
		next;
		mes "[イワノフ]";
		mes "クジラ島に行くか？";
		next;
		if(select("準備がまだ……","出発してください") == 1) {
			mes "[イワノフ]";
			mes "そうかっ、残念だ!!";
			mes "準備が出来たら";
			mes "いつでも話しかけてくれ。";
			mes "あんまり準備が遅いようだと";
			mes "あんたを捕まえて";
			mes "無理やりでも連れて行くからな！";
			close;
		}
		mes "[イワノフ]";
		mes "よし、行こう！";
		set MOSK_1QUE,19;
		close2;
		warp "mosk_ship.gat",94,110;
		end;
	case 32:
		mes "[イワノフ]";
		mes "クジラ島をこの目で";
		mes "見たけど、いまだ信じられないぜ。";
		mes "本当に驚いた……";
		next;
		mes "-" +strcharinfo(0)+ "は";
		mes "　事情を話した-";
		next;
		mes "[イワノフ]";
		mes "材料を集めてくれば、";
		mes "その楽器を作って";
		mes "くれると約束したのか。";
		next;
		mes "[イワノフ]";
		mes "必要な材料は";
		mes "^3131FF丸太 30個、";
		mes "丈夫な蔓 20個、";
		mes "山羊の角 20個、";
		mes "ラッコの毛皮 10個^000000か。";
		next;
		mes "[イワノフ]";
		mes "クジラ島はあの場所にいてくれるなら";
		mes "場所は俺が覚えているから、";
		mes "あんたの準備が出来次第、";
		mes "出発しようぜ！";
		set MOSK_1QUE,33;
		close;
	case 33:
	case 34:
	case 35:
	case 36:
	case 37:
	case 38:
		mes "[イワノフ]";
		mes "クジラ島に行くか？";
		next;
		if(select("まだ、準備が足りないです","出発しましょう") == 1) {
			mes "[イワノフ]";
			mes "では待っているぞ。";
			close;
		}
		mes "[イワノフ]";
		mes "それじゃあ、出発しよう！";
		close2;
		warp "mosk_fild01.gat",93,94;
		end;
	case 39:
	case 40:
		mes "[イワノフ]";
		mes "友よ！";
		mes "あんたと出会えて";
		mes "本当によかった。";
		next;
		mes "[イワノフ]";
		mes "もうできないと思っていた";
		mes "冒険ができたんだからな！";
		next;
		mes "[イワノフ]";
		mes "クジラ島の冒険は";
		mes "本当にすばらしいものだった。";
		mes "今でも興奮がおさまらない！";
		next;
		mes "[イワノフ]";
		mes "久々だ、こんな充実感は。";
		mes strcharinfo(0)+ "と";
		mes "出会えて本当によかったぜ！";
		close;
	case 41:
		mes "[イワノフ]";
		mes strcharinfo(0)+ "!!";
		mes "チャール様の前で";
		mes "凄い演奏をしたらしいな！";
		next;
		mes "[イワノフ]";
		mes "褒賞までもらったらしいじゃないか！";
		mes "やはりあんたはすごい……";
		mes "すごい冒険者だよ！";
		next;
		mes "[イワノフ]";
		mes "また、あんたと";
		mes "冒険がしたくてウズウズするぜ！";
		close;
	default:
		if(MOSK_1QUE > 90) {
			mes "[イワノフ]";
			mes "あんた、はやくクジラ島を";
			mes "探しに行こうぜ！";
			mes "準備ができたら";
			mes "話しかけてくれ！";
			if(MOSK_1QUE > 90 && MOSK_1QUE < 100)
				set MOSK_1QUE,4;
			else if(MOSK_1QUE > 200 && MOSK_1QUE < 300)
				set MOSK_1QUE,19;
			close;
		}
		mes "[イワノフ]";
		mes "その格好からすると";
		mes "あんたは、外国の冒険者だな？";
		next;
		mes "[イワノフ]";
		mes "俺も昔、冒険者をしていたんだ。";
		mes "体に限界がきちまったから";
		mes "今じゃあ、冒険を";
		mes "やめちまっているがね。";
		next;
		mes "[イワノフ]";
		mes "もし俺が20年若ければ、";
		mes "間違いなく、あんたのように";
		mes "冒険をしただろうに……";
		mes "時が過ぎるのは早すぎるぜ。";
		close;
	}
}

mosk_ship.gat,98,110,3	script	イワノフ	964,{
	switch(MOSK_1QUE){
	case 4:
		mes "[イワノフ]";
		mes "ハァ……";
		mes "潮風はやはりいいな。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "一緒に来て頂いて";
		mes "ありがとうございます。";
		next;
		mes "[イワノフ]";
		mes "友よ、";
		mes "みずくさい事を言うな。";
		mes "俺でも海の上なら";
		mes "あんたの力になれるだろう。";
		next;
		mes "[イワノフ]";
		mes "ただし、船の操作は";
		mes "あんたにも";
		mes "手伝ってもらいたいんだが。";
		next;
		mes "-" +strcharinfo(0)+ "は";
		mes "　うなずいた-";
		next;
		mes "[イワノフ]";
		mes "俺が海流の流れを読んで";
		mes "あんたに指示をだすから、";
		mes "俺の指示に従って、";
		mes "船の舵の方向を調節してくれ！";
		next;
		mes "[イワノフ]";
		mes "^FF0000海流の流れがない場合は";
		mes "こまめに俺に話しかけてくれ。^000000";
		mes "流れが変わったら";
		mes "すぐに指示をだすからな。";
		next;
		mes "[イワノフ]";
		mes "まずは、東に進もうか！";
		mes "船を東の方向に変えてくれ！";
		set MOSK_1QUE,5;
		close;
	case 5:
	case 20:
		mes "[イワノフ]";
		mes "まずは、東に進もうか！";
		mes "船を東の方向に変えてくれ！";
		close;
	case 6:
	case 21:
		if(rand(4)) {
			mes "[イワノフ]";
			mes "まだだな……まだ海流の";
			mes "動きが無い……";
			mes "特別な変化も見られないな……";
			next;
			mes "[イワノフ]";
			mes "しばらく、このまま";
			mes "進んでみようか。";
			next;
			mes "[イワノフ]";
			mes "また俺に話しかけてくれ。";
			close;
		}
		mes "[イワノフ]";
		mes "海流の流れが変わった……";
		mes "舵を北の方向に";
		mes "変えてくれないか？";
		set MOSK_1QUE,MOSK_1QUE+1;
		close;
	case 7:
	case 22:
		if(getvariableofnpc('mob,"舵#mosk")) {
			mes "[イワノフ]";
			mes "今はモンスターを倒すのが";
			mes "先決課題だ！";
			close;
		}
		mes "[イワノフ]";
		mes "北に進めるんだぞ!?";
		mes "早く舵の方向を修正するんだ！";
		close;
	case 8:
	case 10:
	case 23:
	case 25:
		if(getvariableofnpc('mob,"舵#mosk")) {
			mes "[イワノフ]";
			mes "今はモンスターを倒すのが";
			mes "先決課題だ！";
			close;
		}
		if(rand(4)) {
			mes "[イワノフ]";
			mes "まだだな……まだ海流の";
			mes "動きが無い……";
			mes "特別な変化も見られないな……";
			next;
			mes "[イワノフ]";
			mes "しばらく、このまま";
			mes "進んでみようか。";
			next;
			mes "[イワノフ]";
			mes "また俺に話しかけてくれ。";
			close;
		}
		if(MOSK_1QUE == 8 || OSK_1QUE == 10)
			set MOSK_1QUE,rand(91,94);
		else
			set MOSK_1QUE,rand(241,244);
		mes "[イワノフ]";
		mes "海流の流れが変わった……";
		mes "舵を" +((MOSK_1QUE%10 == 1)? "東": (MOSK_1QUE%10 == 2)? "西": (MOSK_1QUE%10 == 3)? "南": "北")+ "の方向に";
		mes "変えてくれないか？";
		close;
	case 91:
	case 92:
	case 93:
	case 94:
	case 241:
	case 242:
	case 243:
	case 244:
		mes "[イワノフ]";
		mes ((MOSK_1QUE%10 == 1)? "東": (MOSK_1QUE%10 == 2)? "西": (MOSK_1QUE%10 == 3)? "南": "北")+ "に進めるんだぞ!?";
		mes "早く舵の方向を修正するんだ！";
		close;
	case 11:
		emotion 5;
		mes "[イワノフ]";
		mes "おい!!";
		mes "海の向こうから";
		mes "何か妙な物が見えないか？";
		next;
		mes "[イワノフ]";
		mes "あれは一体!?";
		mes "あ、あんた！";
		mes "船首の方へ行って";
		mes "あれが何か見てくれ！";
		mes "早く!!";
		set MOSK_1QUE,12;
		close;
	case 12:
		mes "[イワノフ]";
		mes "あれは一体!?";
		mes "あ、あんた！";
		mes "船首の方へ行って";
		mes "あれが何か見てくれ！";
		mes "早く!!";
		close;
	case 19:
		mes "[イワノフ]";
		mes "無事クジラ島が";
		mes "発見できるといいな。";
		next;
		mes "[イワノフ]";
		mes "この船の基本的な";
		mes "操作方法は前回と同じだ。";
		mes "ここで、俺があんたに指示を出す。";
		mes "あんたは俺の指示に従って、";
		mes "船の舵の方向を調節すれば良い。";
		next;
		mes "[イワノフ]";
		mes "^FF0000海流の流れがない場合は";
		mes "こまめに俺に話しかけてくれ。^000000";
		mes "流れが変わったら";
		mes "すぐに指示をだすからな。";
		next;
		mes "[イワノフ]";
		mes "まずは、東に進もうか！";
		mes "船を東の方向に変えてくれ！";
		set MOSK_1QUE,20;
		close;
	case 26:
		mes "[イワノフ]";
		mes "おい、あれを見ろ!!";
		next;
		mes "-イワノフが指差す方向に";
		mes "　巨大な島があった。";
		mes "　クジラ島だ！-";
		next;
		mes "[イワノフ]";
		mes "あ、あれがクジラ島……";
		next;
		mes "[イワノフ]";
		mes "この目で実際に見ることが";
		mes "できるなんて……";
		next;
		mes "-イワノフの体が感動のあまり";
		mes "　震えている-";
		next;
		mes "[イワノフ]";
		mes "あっ、本当に家があるぞ！";
		mes "洗濯物まで干してある！";
		next;
		mes "[イワノフ]";
		mes "すげぇ……";
		mes "すげぇぜ……";
		mes "鳥肌がたっちまったぜ。";
		mes "……";
		next;
		mes "[イワノフ]";
		mes "おっと、";
		mes "あんたは早くクジラ島に行きな。";
		next;
		mes "[イワノフ]";
		mes "俺は、この前みたいに衝突したら、";
		mes "今度こそ船が壊れそうだから、";
		mes "少し距離をおいてクジラ島に";
		mes "ついていくからよ。";
		next;
		mes "[イワノフ]";
		mes "戻るときは手を振ってくれ！";
		mes "あんたを乗せに行くからよ。";
		set MOSK_1QUE,30;
		close2;
		warp "mosk_fild01.gat",93,94;
		end;
	default:	//未調査
		mes "[イワノフ]";
		mes "誰だ、あんたは？";
		mes "どうしてこの船に乗っている？";
		mes "今回は街まで送ってやるが、";
		mes "次はないぞ。";
		close2;
		warp "moscovia.gat",163,55;
		end;
	}
}

mosk_ship.gat,100,110,0	script	舵#mosk	111,{
	if('mob) {
		mes "[イワノフ]";
		mes "今はモンスターを倒す事に";
		mes "集中してくれ！";
		close;
	}
	if(MOSK_1QUE != 5 && MOSK_1QUE != 7 && MOSK_1QUE != 20 && MOSK_1QUE != 22 &&
		(MOSK_1QUE < 91 || MOSK_1QUE > 94) && (MOSK_1QUE < 241 || MOSK_1QUE > 244)) {
		mes "[イワノフ]";
		mes "今は舵を動かさないでくれ！";
		mes "舵の調節は俺からの指示が";
		mes "あった時のみにしてくれ！";
		close;
	}
	mes "どちらに進みましょうか？";
	next;
	set @menu,select("東","西","南","北");
	if(MOSK_1QUE == 5 || MOSK_1QUE == 20) {
		if(@menu != 1) {
			mes "[イワノフ]";
			mes "東に進めるんだぞ!!";
			mes "早く東に方向を変えてくれ!!";
			close;
		}
		mes "[イワノフ]";
		mes "よし！このまま東に行こう！";
		mes "俺から何らかの指示があったら";
		mes "速やかに舵を調節してくれ!!";
		set MOSK_1QUE,MOSK_1QUE+1;
		close;
	}
	if(MOSK_1QUE == 7 && @menu != 4 || MOSK_1QUE == 22 && @menu != 4 ||
		MOSK_1QUE%30 == 1 && @menu != 1 || MOSK_1QUE%30 == 2 && @menu != 2 || MOSK_1QUE%30 == 3 && @menu != 3 || MOSK_1QUE%30 == 4 && @menu != 4) {
		mes "[イワノフ]";
		mes ((MOSK_1QUE%30 == 1)? "東": (MOSK_1QUE%30 == 2)? "西": (MOSK_1QUE%30 == 3)? "南": "北")+ "に進めるんだぞ!?";
		mes "早く舵の方向を修正するんだ！";
		if(rand(4))
			close;
		next;
		if(rand(2)) {
			set 'mob,2;
			monster "mosk_ship.gat",89,112,"海の化け物",1579,1,"舵#mosk::OnKilled";
			monster "mosk_ship.gat",85,110,"海の化け物",1579,1,"舵#mosk::OnKilled";
		}
		else {
			set 'mob,4;
			monster "mosk_ship.gat",89,112,"海の化け物",1551,1,"舵#mosk::OnKilled";
			monster "mosk_ship.gat",82,110,"海の化け物",1579,1,"舵#mosk::OnKilled";
			//monster "mosk_ship.gat",82,114,"海の化け物",1579,1,"舵#mosk::OnKilled";
			monster "mosk_ship.gat",83,113,"海の化け物",1579,1,"舵#mosk::OnKilled";
			monster "mosk_ship.gat",85,110,"海の化け物",1551,1,"舵#mosk::OnKilled";

		}
		mes "[イワノフ]";
		mes "モンスターが現れたぞ!!";
		mes "戦闘の準備をしてくれ!!";
		close;
	}
	mes "[イワノフ]";
	mes "よし！しばらくはこのまま";
	mes ((MOSK_1QUE%30 == 1)? "東": (MOSK_1QUE%30 == 2)? "西": (MOSK_1QUE%30 == 3)? "南": "北")+ "に進もう！";
	mes "俺から何か指示があった時は";
	mes "また舵を調節してくれ!!";
	if(MOSK_1QUE == 7 || MOSK_1QUE == 22) {
		set MOSK_1QUE,MOSK_1QUE+1;
		close;
	}
	if(rand(4)) {
		set MOSK_1QUE,(MOSK_1QUE < 100)? 8: 23;
		close;
	}
	next;
	mes "[イワノフ]";
	mes "しまった……";
	mes "前に何かが現れたぞ!!";
	mes "モ、モンスターか!!";
	next;
	mes "[イワノフ]";
	mes "今回のモンスターは今までの";
	mes "モンスターと違う気がする……";
	mes "気を付けた方がよさそうだ!!";
	next;
	set 'mob,3;
	monster "mosk_ship.gat",85,111,"海の化け物",1425,1,"舵#mosk::OnKilled";
	monster "mosk_ship.gat",89,112,"海の化け物",1445,1,"舵#mosk::OnKilled";
	monster "mosk_ship.gat",90,106,"海の化け物",1445,1,"舵#mosk::OnKilled";
	mes "[イワノフ]";
	mes "^FF0000必ず、このモンスターは";
	mes "自分の力で倒してくれ！^000000";
	set MOSK_1QUE,(MOSK_1QUE < 100)? 10: 25;
	close;
OnKilled:
	set 'mob,'mob-1;
	if('mob)
		end;
	mes "[イワノフ]";
	mes "やっとモンスターが片付いたな！";
	mes "これで、やっと動ける……";
	if(MOSK_1QUE == 10 || MOSK_1QUE == 25)
		set MOSK_1QUE,MOSK_1QUE+1;
	close;
OnTimer300000:
	stopnpctimer;
	killmonster "mosk_ship.gat","舵#mosk::Onkilled";
	set 'mob,0;
	end;
}

mosk_ship.gat,81,110,0	script	船首#mosk	139,5,5,{
	if(MOSK_1QUE != 12)
		end;
	mes "[イワノフ]";
	mes "見ろ！";
	mes strcharinfo(0)+ "！";
	mes "前を見ろ!!";
	mes "危ない!!";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "（あ……あれは……？）";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "（何かが近づいてくる……）";
	next;
	mes "[イワノフ]";
	mes "危ない!!";
	mes strcharinfo(0)+ "……";
	mes "あれは……";
	mes "い、一体……?!";
	next;
	mes "-巨大な何かが目の前まで";
	mes "　せまってきた。";
	mes "　凄まじい音がし、";
	mes "　船が揺さぶられた-";
	set MOSK_1QUE,13;
	close2;
	warp "mosk_fild01.gat",95,93;
	end;
}

mosk_fild01.gat,86,104,3	script	奇妙な老人	963,{
	switch(MOSK_1QUE) {
	case 13:
		mes "[奇妙な老人]";
		mes "おお、";
		mes "気が付いたようだな。";
		mes "どうかね、";
		mes "痛いところはないか？";
		next;
		mes "[奇妙な老人]";
		mes "すまなかったね。";
		mes "君の乗っていた船に";
		mes "衝突しそうになってしまった。";
		mes "心からお詫びするよ。";
		next;
		mes "[奇妙な老人]";
		mes "それにしても";
		mes "陸の人がここに来たのは";
		mes "何年ぶりだろうか……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "ここはどこですか？";
		mes "あなたは誰ですか？";
		next;
		mes "[奇妙な老人]";
		mes "ここは……";
		mes "ふむ……";
		next;
		mes "[奇妙な老人]";
		mes "わしはこの島をクジラ島と呼んでいる。";
		mes "わし一人しかいない";
		mes "小さい島だよ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "ここが、噂の動く島ですか。";
		mes "クジラ島……";
		mes "もしかしてこの島は……？";
		next;
		mes "[奇妙な老人]";
		mes "気付いたか。";
		mes "そう、この島は、";
		mes "巨大なクジラの背中なんだよ。";
		next;
		mes "-" +strcharinfo(0)+ "は";
		mes "　驚愕した-";
		next;
		mes "[奇妙な老人]";
		mes "驚くのも無理はないな。";
		mes "ここはクジラの背中だが、";
		mes "草も木も生えておる。";
		next;
		mes "[奇妙な老人]";
		mes "生活できるように";
		mes "わしは家まで建てたよ。";
		mes "さらに船もある。";
		next;
		mes "[奇妙な老人]";
		mes "このクジラも";
		mes "わしが住んでいることを";
		mes "知っていてな。";
		mes "海に沈むことも";
		mes "ないんじゃよ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "あ、あなたは一体？";
		next;
		mes "[奇妙な老人]";
		mes "わしは普通の老人だよ。";
		mes "騒がしい世と縁を切り、ここで";
		mes "ゆったり過ごしているだけだよ。";
		next;
		mes "[奇妙な老人]";
		mes "さて、君も元気を";
		mes "取り戻したようだし、";
		mes "陸地に送ってあげよう。";
		mes "君の事を心配している人も";
		mes "いるだろう？";
		next;
		soundeffect "mos_gusli1.wav",0;
		mes "-老人は背負っていた楽器を";
		mes "　取り出し、演奏を始める-";
		next;
		mes "-演奏が始まると、";
		mes "　それにあわせて";
		mes "　島がゆっくり動き出した-";
		next;
		mes "[奇妙な老人]";
		mes "今日は、君と話せて";
		mes "楽しかったよ。";
		next;
		mes "[奇妙な老人]";
		mes "もう少しで、陸地に着くから";
		mes "安心して待ちなさい。";
		next;
		mes "[奇妙な老人]";
		mes "街の人に気付かれないように";
		mes "街に近づかなくてはな。";
		next;
		mes "-老人は目をつむり、楽器の";
		mes "　演奏を続けた-";
		set MOSK_1QUE,14;
		close;
	case 14:
		soundeffect "mos_gusli1.wav",0;
		mes "-老人は目をつむり、楽器の";
		mes "　演奏を続けている-";
		next;
		mes "-老人は目をつむり、楽器の";
		mes "　演奏を続けた-";
		set MOSK_1QUE,15;
		close;
	case 15:
		mes "[奇妙な老人]";
		mes "もう着いたようだな。";
		mes "陸地が君にも見えるだろう。";
		mes "気をつけて帰るがいい。";
		next;
		mes "[奇妙な老人]";
		mes "縁があれば";
		mes "また会うこともあるだろう。";
		mes "さようなら、冒険者よ。";
		close2;
		warp "moscovia.gat",163,54;
		end;
	case 30:
		mes "[奇妙な老人]";
		mes "おお、君は……";
		next;
		mes "[奇妙な老人]";
		mes "ふふふ。こうやって";
		mes "君にまた会えるとは。";
		mes "再会を嬉しく思うよ。";
		mes "今日は何か用がありそうだな？";
		next;
		menu "事情を説明する",-;
		mes "[奇妙な老人]";
		mes "ほう、";
		mes "そういう事があったのか……";
		next;
		mes "[奇妙な老人]";
		mes "確かに、この島を";
		mes "信じろと言っても";
		mes "無理かもしれんな。";
		next;
		mes "[奇妙な老人]";
		mes "それにしても";
		mes "わしはここで余生をゆったり";
		mes "過ごしたいだけなんじゃがのう……";
		next;
		mes "[奇妙な老人]";
		mes "そんな顔をするな。";
		mes "君のせいじゃない。";
		next;
		mes "[奇妙な老人]";
		mes "君にクジラ島の事を";
		mes "誰にも言ってはいけないなど";
		mes "わしは言っておらんしな。";
		next;
		mes "[奇妙な老人]";
		mes "それに、わしがその気になれば、";
		mes "誰にも見つからないような場所に";
		mes "クジラ島を移動させることも";
		mes "可能じゃ。";
		next;
		mes "[奇妙な老人]";
		mes "だから、心配するな。";
		next;
		mes "[奇妙な老人]";
		mes "それより、";
		mes "君の立場が悪くなったようじゃな。";
		mes "どうしたいのかね？";
		next;
		if(select("もう少し考えてみます","その楽器を貸してくれませんか？") == 1) {
			mes "[奇妙な老人]";
			mes "そうか。考えてみるとよい。";
			mes "考えに考えを重ねると、";
			mes "何か良い方法が";
			mes "見つかるかもしれん。";
			mes "どうしてもわからなければ";
			mes "人に聞くのもよいぞ。";
			close;
		}
		soundeffect "mos_gusli1.wav",0;
		mes "-老人は目をつむり、";
		mes "　楽器を手に取って";
		mes "　弾き始めた-";
		next;
		mes "[奇妙な老人]";
		mes "この楽器はこの一つしかないのじゃ。";
		mes "これを君に貸してしまうと";
		mes "このクジラ島を動かせなく";
		mes "なってしまうんじゃよ。";
		next;
		mes "[奇妙な老人]";
		mes "ふむ、どうしようかのう……";
		next;
		mes "[奇妙な老人]";
		mes "……";
		next;
		mes "[奇妙な老人]";
		mes "そうじゃ！　こうしよう。";
		next;
		mes "[奇妙な老人]";
		mes "実はな、わしが使っているこの楽器も";
		mes "もう古くなってしまってな。";
		mes "胴体の部分も磨り減って";
		mes "しまっているんじゃ。";
		mes "下手をしたらもう少しで";
		mes "壊れてしまうかもしれん。";
		next;
		mes "[奇妙な老人]";
		mes "そこでじゃ、この楽器を";
		mes "新しく作るための材料を";
		mes "集めてきて欲しいんじゃ。";
		next;
		mes "[奇妙な老人]";
		mes "材料があれば";
		mes "わしが新しく君の分とわしの分の";
		mes "楽器を作ろう。";
		next;
		mes "[奇妙な老人]";
		mes "君は楽器を手に入れられる。";
		mes "ついでにわしも新しい楽器が手に入る。";
		next;
		mes "[奇妙な老人]";
		mes "面倒をかけてしまうが、";
		mes "最高の楽器を";
		mes "作ることを約束するぞ。";
		next;
		mes "[奇妙な老人]";
		mes "材料は、^3131FF丸太 30個、";
		mes "丈夫な蔓 20個、";
		mes "山羊の角 20個、";
		mes "ラッコの毛皮 10個^000000が必要じゃ。";
		next;
		mes "[奇妙な老人]";
		mes "君が材料を持って来る時までは、";
		mes "君がまたすぐに来れるように";
		mes "クジラ島を移動させず、";
		mes "この場所にとどまらせておこう。";
		next;
		mes "[奇妙な老人]";
		mes "それでは、陸に戻る準備が";
		mes "出来たら、また話しかけて欲しい。";
		set MOSK_1QUE,31;
		close;
	case 31:
		mes "[奇妙な老人]";
		mes "陸地に戻るのかい？";
		next;
		if(select("材料をもう一度教えてください","陸地に戻る") == 1) {
			mes "[奇妙な老人]";
			mes "必要な材料は、";
			next;
			mes "[奇妙な老人]";
			mes "^3131FF丸太 30個、";
			mes "丈夫な蔓 20個、";
			mes "山羊の角 20個、";
			mes "ラッコの毛皮 10個^000000じゃ。";
			close;
		}
		mes "[奇妙な老人]";
		mes "おや、今回は君の仲間の船で";
		mes "陸地に戻るのか。";
		next;
		mes "[奇妙な老人]";
		mes "気をつけていくがよい。";
		next;
		mes "-" +strcharinfo(0)+ "は、";
		mes "　イワノフの船に手を振った。";
		mes "　イワノフの船が近づいてきた-";
		set MOSK_1QUE,32;
		close2;
		warp "moscovia.gat",162,56;
		end;
	case 33:
		mes "[奇妙な老人]";
		mes "ほう……材料を";
		mes "全部集めたのか？";
		next;
		if(countitem(7201) >= 30 && countitem(7197) >= 20 && countitem(7106) >= 20 && countitem(7065) >= 10) {
			delitem 7201,30;
			delitem 7197,20;
			delitem 7106,20;
			delitem 7065,10;
			set MOSK_1QUE,34;
			mes "[奇妙な老人]";
			mes "良いものを選んで集めて";
			mes "来てくれたな！ありがとう！";
			next;
			mes "[奇妙な老人]";
			mes "楽器が完成するまで、";
			mes "少し待ってくれ！";
			close;
		}
		mes "[奇妙な老人]";
		mes "ふむ……材料が足りないな……";
		mes "^3131FF丸太 30個、";
		mes "丈夫な蔓 20個、";
		mes "山羊の角 20個、";
		mes "ラッコの毛皮 10個^000000が";
		mes "必要じゃ。";
		next;
		mes "[奇妙な老人]";
		mes "どうするかね？";
		mes "もう一度、材料を集めに";
		mes "陸地に戻るか？";
		next;
		if(select("材料をもう一度教えてください","陸地に戻る") == 1) {
			mes "[奇妙な老人]";
			mes "必要な材料は、";
			mes "^3131FF丸太 30個、";
			mes "丈夫な蔓 20個、";
			mes "山羊の角 20個、";
			mes "ラッコの毛皮 10個^000000じゃ。";
			close;
		}
		mes "[奇妙な老人]";
		mes "気をつけていくがよい。";
		next;
		mes "-" +strcharinfo(0)+ "は、";
		mes "　イワノフの船に手を振った。";
		mes "　イワノフの船が近づいてきた-";
		next;
		soundeffect "mos_gusli1.wav",0;
		mes "[奇妙な老人]";
		mes "気をつけていくがよい。";
		mes " ";
		mes "-老人は楽器を弾いた-";
		close2;
		warp "moscovia.gat",162,56;
		end;
	case 34:
		if(rand(3)) {
			mes "[奇妙な老人]";
			mes "まだ、完成してないんじゃ。";
			mes "もう少し、待っててくれ。";
			close;
		}
		mes "[奇妙な老人]";
		mes "さぁ、楽器が完成した！";
		mes "これが君の分だ。";
		set MOSK_1QUE,35;
		getitem 2707,1;
		next;
		mes "[奇妙な老人]";
		mes "この楽器は^FF0000「グスリ」^000000と";
		mes "呼ばれるものだ。";
		mes "モスコビアの地で";
		mes "遥か遠い昔に住んでいた先祖達が";
		mes "使っていた伝統楽器なんじゃ。";
		next;
		mes "[奇妙な老人]";
		mes "この楽器の最後の伝授者は";
		mes "このわしじゃ。";
		mes "今となっては、陸の上では";
		mes "この楽器を見ることは";
		mes "できないじゃろう。";
		next;
		mes "[奇妙な老人]";
		mes "その楽器を見せれば、";
		mes "王も信じてくれるじゃろう。";
		next;
	case 35:
		mes "[奇妙な老人]";
		mes "さぁ、これから";
		mes "君はどうするかね？";
		next;
		switch(select("また、クジラ島に来る方法は？","グスリを教えて！","陸に戻る")){
		case 1:
			mes "[奇妙な老人]";
			mes "またクジラ島に来たければ";
			mes "モスコビアの船着場で";
			mes "グスリを弾くがよい。";
			next;
			mes "[奇妙な老人]";
			mes "楽器を習ってない君では";
			mes "演奏は無理じゃろうが、";
			mes "音くらい出せるじゃろ？";
			next;
			mes "[奇妙な老人]";
			mes "この島、";
			mes "いや、このクジラは";
			mes "グスリの音に";
			mes "敏感に反応するんじゃ。";
			next;
			mes "[奇妙な老人]";
			mes "君がグスリを弾けば、";
			mes "わしとこの島は、";
			mes "迎えに行くぞ。";
			next;
			mes "[奇妙な老人]";
			mes "ただし、人に見られてあまり";
			mes "騒がれたくないんじゃ。";
			mes "人がいなそうな場所から";
			mes "君を乗せるぞ。";
			close;
		case 2:
			mes "[奇妙な老人]";
			mes "グスリを習いたいのか。";
			next;
			mes "[奇妙な老人]";
			mes "グスリの演奏に興味を";
			mes "持ってくれて嬉しいぞ。";
			next;
			mes "[奇妙な老人]";
			mes "喜んで教えさせてもらうぞ。";
			next;
			mes "[奇妙な老人]";
			mes "グスリを装備してから";
			mes "わしに話しかけてくれ。";
			set MOSK_1QUE,36;
			close;
		case 3:
			mes "[奇妙な老人]";
			mes "またクジラ島に来たければ";
			mes "モスコビアの船着場で";
			mes "グスリを弾くがよい。";
			next;
			mes "[奇妙な老人]";
			mes "楽器を習ってない君では";
			mes "演奏は無理じゃろうが、";
			mes "音くらい出せるじゃろ？";
			next;
			mes "[奇妙な老人]";
			mes "この島、";
			mes "いや、このクジラは";
			mes "グスリの音に";
			mes "敏感に反応するんじゃ。";
			next;
			mes "[奇妙な老人]";
			mes "君がグスリを弾けば、";
			mes "わしとこの島は、";
			mes "迎えに行くぞ。";
			next;
			mes "[奇妙な老人]";
			mes "ただし、人に見られてあまり";
			mes "騒がれたくないんじゃ。";
			mes "人がいなそうな場所から";
			mes "君を乗せるぞ。";
			next;
			mes "[奇妙な老人]";
			mes "気をつけていくがよい。";
			next;
			mes "-" +strcharinfo(0)+ "は、";
			mes "　イワノフの船に手を振った。";
			mes "　イワノフの船が近づいてきた-";
			next;
			soundeffect "mos_gusli1.wav",0;
			mes "[奇妙な老人]";
			mes "気をつけていくがよい。";
			mes " ";
			mes "-老人は楽器を弾いた-";
			close2;
			warp "moscovia.gat",162,56;
			end;
		}
	case 36:
		mes "[奇妙な老人]";
		mes "グスリを習う準備は出来たかな？";
		mes "装備してから来なさい。";
		next;
		if(equippeditem(2707) == 0){
			mes "[奇妙な老人]";
			mes "ふむ……";
			mes "楽器を持ってなくては";
			mes "演奏ができんな。";
			next;
			mes "[奇妙な老人]";
			mes "グスリをちゃんと";
			mes "装備しなさい。";
			close;
		}
		mes "[奇妙な老人]";
		mes "よし、準備が出来たようじゃな。";
		mes "わしの演奏を聞いたら、";
		mes "ゆっくりまねしてみなさい。";
		next;
		soundeffect "mos_gusli1.wav",0;
		mes "[奇妙な老人]";
		mes "最初からうまくは出来ないから、";
		mes "焦らずに、ゆっくりと";
		mes "わしの演奏を聞いて、一つずつ";
		mes "やってみなさい。";
		next;
		if(getbaseclass(Class,2) == CLASS_BA) {
			emotion 21;
			mes "[奇妙な老人]";
			mes "ほう……";
			mes "いい腕をしておる……";
			next;
			mes "[奇妙な老人]";
			mes "そうか……";
			mes "大陸では楽器を演奏し";
			mes "歌を唄う冒険者達がいると";
			mes "聞いたが……";
			mes "君がそういう";
			mes "冒険者なんだね？";
			next;
			mes "[奇妙な老人]";
			mes "君なら、すぐに上達出来そうじゃ。";
			mes "君の演奏が非常に楽しみだ。";
			next;
			mes "[奇妙な老人]";
			mes "さぁ、今度は君が弾いてみなさい。";
			mes "さっき、わしが演奏した";
			mes "フレーズをそのまま";
			mes "演奏すればいい。";
			set '@rand,3;
			break;
		}
		mes "[奇妙な老人]";
		mes "さぁ、今度は君が弾いて見なさい！";
		mes "わしが演奏したフレーズを";
		mes "そのまま演奏すればいい。";
		set '@rand,6;
		break;
	case 37:
		mes "[奇妙な老人]";
		mes "グスリの練習をする準備は出来たかな？";
		mes "中々、上達しなくても";
		mes "あきらめてはいけないぞ。";
		mes "^FF0000できるまで何度でも";
		mes "練習あるのみじゃ。^000000";
		next;
		if(equippeditem(2707) == 0){
			mes "[奇妙な老人]";
			mes "ふむ……";
			mes "楽器を持ってなくては";
			mes "演奏ができんな。";
			next;
			mes "[奇妙な老人]";
			mes "グスリをちゃんと";
			mes "装備しなさい。";
			close;
		}
		mes "[奇妙な老人]";
		mes "ふむ……準備はいいようじゃの！";
		next;
		if(getbaseclass(Class,2) == CLASS_BA) {
			mes "[奇妙な老人]";
			mes "君の才能なら、今度は";
			mes "うまく行くはずだ！頑張れ!!";
			set '@rand,3;
			next;
		}
		else
			set '@rand,6;
		mes "[奇妙な老人]";
		mes "さぁ、弾いてみなさい。";
		mes "さきほど、わしが弾いたフレーズを";
		mes "弾けばよいんだよ。";
		break;
	case 38:
		mes "[奇妙な老人]";
		mes "さぁ、これから君は";
		mes "どうするつもりかね？";
		next;
		if(select("クジラ島にまた来る方法は？","陸地に戻る") == 1) {
			mes "[奇妙な老人]";
			mes "またクジラ島に来たければ";
			mes "モスコビアの船着場で";
			mes "グスリを弾くがよい。";
			next;
			mes "[奇妙な老人]";
			mes "この島、";
			mes "いや、このクジラは";
			mes "グスリの音に";
			mes "敏感に反応するんじゃ。";
			next;
			mes "[奇妙な老人]";
			mes "君がグスリを弾けば、";
			mes "わしとこの島は、";
			mes "迎えに行くぞ。";
			next;
			mes "[奇妙な老人]";
			mes "ただし、人に見られてあまり";
			mes "騒がれたくないんじゃ。";
			mes "人がいなそうな場所から";
			mes "君を乗せるぞ。";
			close;
		}
		mes "[奇妙な老人]";
		mes "またクジラ島に来たければ";
		mes "モスコビアの船着場で";
		mes "グスリを弾くがよい。";
		next;
		mes "[奇妙な老人]";
		mes "この島、";
		mes "いや、このクジラは";
		mes "グスリの音に";
		mes "敏感に反応するんじゃ。";
		next;
		mes "[奇妙な老人]";
		mes "君がグスリを弾けば、";
		mes "わしとこの島は、";
		mes "迎えに行くぞ。";
		next;
		mes "[奇妙な老人]";
		mes "ただし、人に見られてあまり";
		mes "騒がれたくないんじゃ。";
		mes "人がいなそうな場所から";
		mes "君を乗せるぞ。";
		next;
		mes "[奇妙な老人]";
		mes "では、";
		mes "気をつけて戻るがよい。";
		close2;
		warp "moscovia.gat",162,56;
		end;
	case 39:
	case 40:
	case 41:
		mes "[奇妙な老人]";
		mes "クジラ島へようこそ。";
		mes "ゆっくりしていきなさい。";
		next;
		switch(select("クジラ島を見たい","陸地に戻る","未開の島を探検したい")) {
		case 1:
			mes "[奇妙な老人]";
			mes "そうか、";
			mes "好きに見てまわりなさい。";
			mes "そんな広くはないがな。";
			close;
		case 2:
			mes "[奇妙な老人]";
			mes "わかった。";
			mes "いつでも遊びに来なさい。";
			next;
			soundeffect "mos_gusli1.wav",0;
			mes "-老人は目をつむり、";
			mes "　手に持っている楽器を";
			mes "　弾き始めた-";
			close2;
			warp "moscovia.gat",162,56;
			end;
		case 3:
			mes "[奇妙な老人]";
			mes "ほう……";
			next;
			mes "[奇妙な老人]";
			mes "モスコビアの周辺には";
			mes "人々が訪れる事がない";
			mes "未開の島がたくさんあるんじゃよ。";
			next;
			mes "[奇妙な老人]";
			mes "普通の船では、";
			mes "中々行けない場所じゃ。";
			mes "その未開の島に送ってあげられるが、";
			mes "行ってみるかね？";
			next;
			if(select("もう少し考えてみる","はい、送ってください") == 1) {
				mes "[奇妙な老人]";
				mes "そうか……。";
				mes "ゆっくり考えてみなさい。";
				close;
			}
			mes "[奇妙な老人]";
			mes "うむ、";
			mes "では送ろう。";
			next;
			mes "[奇妙な老人]";
			mes "戻る時は、";
			mes "わしの船を貸してあげるから、";
			mes "それでこのクジラ島まで";
			mes "戻ってくるがよい。";
			next;
			mes "[奇妙な老人]";
			mes "わしは君が冒険している間、";
			mes "魚釣りでもして待っているよ。";
			next;
			soundeffect "mos_gusli1.wav",0;
			mes "-老人は目をつむり、";
			mes "　手に持っている楽器を";
			mes "　弾き始めた-";
			close2;
			warp "mosk_fild02.gat",204,54;
			end;
		}
	default:	//未調査
		mes "[奇妙な老人]";
		mes "クジラ島へようこそ。";
		mes "ゆっくりしていきなさい。";
		next;
		if(select("クジラ島を見たい","陸地に戻る") == 1) {
			mes "[奇妙な老人]";
			mes "そうか、";
			mes "好きに見てまわりなさい。";
			mes "そんな広くはないがな。";
			close;
		}
		mes "[奇妙な老人]";
		mes "わかった。";
		mes "いつでも遊びに来なさい。";
		next;
		soundeffect "mos_gusli1.wav",0;
		mes "-老人は目をつむり、";
		mes "　手に持っている楽器を";
		mes "　弾き始めた-";
		close2;
		warp "moscovia.gat",162,56;
		end;
	}
	//演奏練習続き
	next;
	if(rand('@rand)) {
		mes "[奇妙な老人]";
		mes "ふむ……少し違うな……";
		mes "そこの弾き方がな……";
		mes "さぁ、今度は集中して";
		mes "弾いてみなさい。";
		next;
		mes "[奇妙な老人]";
		mes "ううむ、もう少し練習が必要だな。";
		mes "少し休むか。";
		mes "君の準備ができたら";
		mes "また練習を再開しよう。";
		set MOSK_1QUE,37;
		close;
	}
	soundeffect "mos_gusli1.wav",0;
	emotion 21;
	misceffect 7,"";
	mes "[奇妙な老人]";
	mes "ほう……";
	mes "いい腕をしておる……";
	next;
	mes "[奇妙な老人]";
	mes "もう、わしが君に教える必要はない。";
	mes "君なら、一人で練習を重ねれば、";
	mes "それだけでも上手になれるはず。";
	next;
	mes "[奇妙な老人]";
	mes "こんなに早く上達されては、";
	mes "わしが教えたとは";
	mes "言えないな。ふふふ。";
	next;
	mes "[奇妙な老人]";
	mes "君の腕なら、皆を魅了する";
	mes "演奏が出来るはずだよ。";
	set MOSK_1QUE,38;
	close;
}

mosk_in.gat,127,89,3	script	総理大臣 ドミトリー	967,{
	switch(MOSK_3QUE) {
	case 12:
	case 13:
		mes "[総理大臣 ドミトリー]";
		mes "君には反逆の疑いが掛かっている。";
		mes "自分の行動を見直し、";
		mes "早く容疑が晴れるように";
		mes "潔白を証明する事に集中しなさい！";
		close;
	case 14:
		mes "[総理大臣 ドミトリー]";
		mes "反逆の疑いが晴れただけで、";
		mes "君の事を完全に信用している";
		mes "わけではない。";
		close;
	case 20:
		mes "[総理大臣 ドミトリー]";
		mes "君の事はよく知っている。";
		mes "実は、君について";
		mes "調査をしていたんだ。";
		next;
		mes "[総理大臣 ドミトリー]";
		mes "君が、王宮の中央の広場で";
		mes "何か不思議な行動をしたと";
		mes "報告があってから、学者達に";
		mes "天気の研究をさせたのだ。";
		next;
		mes "[総理大臣 ドミトリー]";
		mes "天気を観測してみると、";
		mes "最低気温と最高気温の差が縮まり、";
		mes "昼の長さが伸びていると";
		mes "報告があった。どうやって夏を";
		mes "留めたかは解らないが……";
		mes "事実は認める事にした。";
		next;
		mes "[総理大臣 ドミトリー]";
		mes "チャール様には報告してある。";
		mes "これから、チャール様に謁見しなさい。";
		close;
	default:
		break;
	}
	switch(MOSK_1QUE) {
	case 16:
		mes "[総理大臣 ドミトリー]";
		mes "王宮には何の用かな？";
		next;
		if(select("王宮を見たいです","チャール様に謁見したいです") == 1) {
			mes "[総理大臣 ドミトリー]";
			mes "我がモスコビアは、君のような";
			mes "若い冒険者を歓迎する。";
			next;
			mes "[総理大臣 ドミトリー]";
			mes "ただし、";
			mes "チャール様に失礼がないように";
			mes "気をつけて欲しい。";
			next;
			mes "[総理大臣 ドミトリー]";
			mes "チャール様は面白い冒険話を";
			mes "好んでらっしゃる。";
			mes "何か話したい事があったら、";
			mes "また来るがよい。";
			close;
		}
		mes "[総理大臣 ドミトリー]";
		mes "陛下に謁見したいのか？";
		mes "用件は何かね？";
		next;
		if(select("挨拶","クジラ島の冒険話") == 1) {
			mes "[総理大臣 ドミトリー]";
			mes "挨拶なら、私が承る。";
			mes "何もわざわざチャール様に";
			mes "直接言う必要はない。";
			close;
		}
		mes "[総理大臣 ドミトリー]";
		mes "ほう……？";
		mes "冒険話！";
		mes "しかもあの動く島の話か！";
		mes "チャール様もきっと、";
		mes "お喜びになるだろう！";
		next;
		mes "[総理大臣 ドミトリー]";
		mes "謁見を許すぞ。";
		mes "チャール様が満足するような話で";
		mes "あれば、大きな褒賞を与えよう。";
		set MOSK_1QUE,17;
		close;
	case 17:
		mes "[総理大臣 ドミトリー]";
		mes "チャール様にはお伝えした。";
		mes "チャール様に申すがよい。";
		close;
	case 35:
	case 38:
		mes "[総理大臣 ドミトリー]";
		mes "すぐにチャール様に";
		mes "謁見しなさい。";
		close;
	case 39:
		mes "[総理大臣 ドミトリー]";
		mes "本当にひどい演奏だった。";
		mes "二度と聞きたくないな。";
		close;
	case 40:
		mes "[総理大臣 ドミトリー]";
		mes "どうしたのかね？";
		mes "チャール様はお休み中だ。";
		mes "特別な用事ではないなら、";
		mes "下がってくれ。";
		close;
	case 41:
		mes "[総理大臣 ドミトリー]";
		mes "君のグスリ演奏は本当に";
		mes "感動的だったね……";
		mes "いつでも良いから、その演奏を";
		mes "もう一度聞かせてくれ……";
		close;
	default:
		if(MOSK_1QUE < 16) {
			mes "[総理大臣 ドミトリー]";
			mes "外国の冒険者か。";
			mes "ここは国王";
			mes "チャール・アレクセイ3世様";
			mes "の王宮である。";
			mes "くれぐれも失礼がないように";
			mes "気をつけるように。";
			close;
		}
		if(MOSK_1QUE > 17 && MOSK_1QUE < 35) {
			mes "[総理大臣 ドミトリー]";
			mes "チャール様は休憩中だ。";
			mes "君はクジラ島探査に集中しなさい。";
			close;
		}
		mes "[総理大臣 ドミトリー]";
		mes "外国からの冒険者か。ここは、";
		mes "チャール・アレクセイ3世様";
		mes "のいる王宮だ。";
		mes "失礼が無いよう気をつけるが良い。";
		close;
	}
}

mosk_in.gat,131,92,3	script	チャール・アレクセイ3世	965,7,7,{
	switch(MOSK_3QUE) {
	case 12:
		mes "[チャール・アレクセイ3世]";
		mes "君がババヤガに会っている";
		mes "所を目撃した人々が";
		mes "数え切れない程にいるのだよ。";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "魔女と会うだけでも、";
		mes "罪に問われるのだが";
		mes "君が外国から来たという事を";
		mes "考え、今回だけ君に弁解の機会を";
		mes "当てる事にした。";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "何か思う事があれば、";
		mes "今すぐ話すが良い。";
		next;
		menu "事情を説明する",-;
		mes "-ババヤガと話した事や";
		mes "　今後の計画について話した-";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "ババヤガがそのような計画を……";
		mes "夏をとどめる魔法が真実ならば、";
		mes "喜ばしいことだ。";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "しかし、その話が君の";
		mes "潔白が証明できる証拠とは";
		mes "ならない。";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "ババヤガ達を倒し、彼女らが";
		mes "集めていると言うババヤガのきねを";
		mes "持って来たら、君の言う事を";
		mes "信じようではないか。";
		next;
		if(countitem(7762) < 40) {
			mes "[チャール・アレクセイ3世]";
			mes "身の潔白を証明するために";
			mes "ババヤガが持つババヤガのきねを40個";
			mes "持って来るがよい。";
			set MOSK_3QUE,13;
			close;
		}
		if(select("ババヤガのきねを見せる","じっとしている") == 2) {
			mes "[チャール・アレクセイ3世]";
			mes "身の潔白を証明するために";
			mes "ババヤガが持つババヤガのきねを40個";
			mes "持って来るがよい。";
			set MOSK_3QUE,13;
			close;
		}
		mes "[" +strcharinfo(0)+ "]";
		mes "はい、ここにあります。";
		next;
		mes "-ババヤガのきねを捧げた-";
		delitem 7762,40;
		next;
		mes "[チャール・アレクセイ3世]";
		mes "持ってきたか。";
		mes "とりあえず、話の一部は";
		mes "信じてあげよう。";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "夏をとどめることが";
		mes "できるのであれば";
		mes "国民は喜ぶであろう。";
		mes "それはわしにも喜ばしい事だ。";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "しかし、どんなことがあっても";
		mes "ババヤガの力を借りるなど";
		mes "絶対にあってはならないことだ。";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "そこでだ。";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "君の手で夏をとどめるのだ。";
		mes "ババヤガの名前を表に出さずにな。";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "したがって、君に";
		mes "ババヤガの所に出入りすることを";
		mes "特別に許可する。";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "頼んだぞ。";
		set MOSK_3QUE,14;
		close;
	case 13:
		mes "[チャール・アレクセイ3世]";
		mes "ババヤガが持つババヤガのきねを40個";
		mes "持ってきたのか？";
		next;
		if(select("はい、ここにあります","あの……忘れちゃいました") == 2) {
			mes "[チャール・アレクセイ3世]";
			mes "ババヤガの持つババヤガのきねを40個";
			mes "持って来るようにと";
			mes "わしは言ったはずだ。";
			next;
			mes "[チャール・アレクセイ3世]";
			mes "君はわしの言葉を無視しているのか？";
			close;
		}
		if(countitem(7762) < 40) {
			mes "[チャール・アレクセイ3世]";
			mes "ババヤガのきねが足りないではないか。";
			mes "数を間違ったのか？　それとも、";
			mes "わしに嘘をついたのか？";
			next;
			mes "[チャール・アレクセイ3世]";
			mes "今回だけは、冗談だと";
			mes "受け止めよう。";
			close;
		}
		mes "-ババヤガのきねを捧げた-";
		delitem 7762,40;
		next;
		mes "[チャール・アレクセイ3世]";
		mes "持ってきたか。";
		mes "とりあえず、話の一部は";
		mes "信じてあげよう。";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "夏をとどめることが";
		mes "できるのであれば";
		mes "国民は喜ぶであろう。";
		mes "それはわしにも喜ばしい事だ。";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "しかし、どんなことがあっても";
		mes "ババヤガの力を借りるなど";
		mes "絶対にあってはならないことだ。";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "そこでだ。";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "君の手で夏をとどめるのだ。";
		mes "ババヤガの名前を表に出さずにな。";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "したがって、君に";
		mes "ババヤガの所に出入りすることを";
		mes "特別に許可する。";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "頼んだぞ。";
		set MOSK_3QUE,14;
		close;
	case 14:
		mes "[チャール・アレクセイ3世]";
		mes "夏が永遠と続く事は";
		mes "国民の為に良い事だ。";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "しかし、ババヤガだけの力で";
		mes "それを成してはならない。";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "君が行うのだ。";
		mes "ババヤガの名前を表に出さずにな。";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "夏をとどめさせてくれ！";
		close;
	case 20:
		mes "[チャール・アレクセイ3世]";
		mes "おお、待っていたぞ！";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "既に大臣から、報告を聞いた。";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "国民も喜んでいる。";
		mes "わしは嬉しい限りだ！";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "国民に代わって、わしが君に";
		mes "褒賞をあたえよう！";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "さぁ、受け取りなさい！";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "さぁ、夏を";
		mes "楽しんでいくがいい！";
		set MOSK_3QUE,21;
		getitem 603,1;
		if(checkre()) {
			for(set '@i,0;'@i<20;set '@i,'@i+1)
				getexp 5000,0;
			for(set '@i,0;'@i<6;set '@i,'@i+1)
				getexp 0,5000;
		}
		else {
			for(set '@i,0;'@i<20;set '@i,'@i+1)
				getexp 50000,0;
			for(set '@i,0;'@i<6;set '@i,'@i+1)
				getexp 0,50000;
		}
		close;
	default:
		break;
	}
	switch(MOSK_1QUE) {
	case 16:
		mes "[チャール・アレクセイ3世]";
		mes "外国からの冒険者よ。";
		mes "わしに申したい事でもあるのか？";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "大事な用件じゃないのなら、";
		mes "総理大臣に謁見の";
		mes "申込をしなさい。";
		close;
	case 17:
		mes "[チャール・アレクセイ3世]";
		mes "ほう……";
		mes "わしに冒険話を";
		mes "聞かせてくれるのか！";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "どんな話を聞かせてくれるのだ？";
		next;
		mes "-国王にクジラ島について話した-";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "なんと！";
		mes "あの伝説の動く島を発見した";
		mes "と言うのか！";
		mes "詳しく聞いてみたいぞ！";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "さぁ、早く話したまえ！";
		next;
		menu "詳しく話す",-;
		mes "……";
		next;
		mes "…………";
		next;
		mes "………………";
		next;
		mes "……………………";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "なんと、クジラとは！";
		mes "非常に面白い話だが……";
		mes "どう思うかね？総理大臣。";
		next;
		mes "[総理大臣 ドミトリー]";
		mes "嘘とは思えませんが、";
		mes "完全に信用する事も出来ません。";
		mes "クジラがとてつもなく大きい生物で";
		mes "ある事は存じておりますが、";
		mes "その上に水が流れ、木が生え、";
		mes "人が住むなんて……";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "その通りだ。";
		mes "わしも今まで多くの冒険話を";
		mes "聞いてきたが、";
		mes "さすがに信じられないのだ。";
		next;
		mes "[総理大臣 ドミトリー]";
		mes "……陛下。";
		next;
		mes "[総理大臣 ドミトリー]";
		mes "クジラ島にいた老人が";
		mes "弾いたという楽器の";
		mes "事なのですが……";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "どうした、大臣？";
		mes "申してみろ。";
		next;
		mes "[総理大臣 ドミトリー]";
		mes "古い書物で、その楽器と";
		mes "一致する楽器の説明を";
		mes "読んだことがあります。";
		next;
		mes "[総理大臣 ドミトリー]";
		mes "今はもう存在しない、";
		mes "かつて、このモスコビアの地に";
		mes "あったという伝統楽器です。";
		next;
		mes "[総理大臣 ドミトリー]";
		mes "わが国でも、この楽器を";
		mes "知っている者は数少ないでしょう。";
		next;
		mes "[総理大臣 ドミトリー]";
		mes "本来であれば、";
		mes "この外国の冒険者が";
		mes "知っているわけがありません。";
		next;
		mes "[総理大臣 ドミトリー]";
		mes "すなわち、この冒険者が";
		mes "実際にその楽器を見た、";
		mes "と考える事ができます。";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "ううむ……";
		mes "しかし、それがクジラの島に";
		mes "行ったという証拠にはなるまい。";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "冒険者よ。";
		mes "本来なら、君に大きい褒賞を";
		mes "あたえたいのだが、";
		mes "すまぬが君の話をどうしても";
		mes "信じることができないのだ。";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "よし、わしがクジラ島の存在を";
		mes "信じられるような証拠を持って";
		mes "来てもらおう！";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "その老人が持っていた楽器を";
		mes "持ってくるのだ。";
		mes "そうすれば、君の話を信じて";
		mes "褒賞をあたえよう。";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "だが、その証拠を持ってこない場合は、";
		mes "わしに嘘を付いたと判断し、";
		mes "罰を下す！";
		next;
		mes "[総理大臣 ドミトリー]";
		mes "へ、陛下……";
		next;
		mes "[総理大臣 ドミトリー]";
		mes "この若者はわが国の";
		mes "国民ではありません。陛下に対し";
		mes "不敬な想いがあるとは思えません。";
		mes "陛下のいう事は……恐れ入りますが、";
		mes "厳しすぎると思われます……";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "いや、仮にこの若者が";
		mes "嘘を申しているとして、";
		mes "それを許してしまうと、";
		mes "これからこの国を訪れる多くの";
		mes "冒険者にわしの威厳が立たなくなる！";
		next;
		mes "[総理大臣 ドミトリー]";
		mes "………………";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "わかるな？";
		mes "君の責任は重い！";
		mes "早く、そのクジラ島の証拠を";
		mes "持ってきて、わしを安心させてくれ！";
		set MOSK_1QUE,18;
		close;
	case 35:
	case 38:
		mes "[チャール・アレクセイ3世]";
		mes "ほう、戻って来たか？";
		mes "例の楽器は持って来たんだな？";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "ふむ、今では";
		mes "クジラ島でしか手に入らない";
		mes "グスリという楽器か。";
		mes "早く見せるのだ。";
		next;
		if(countitem(2707) < 1) {
			mes "[チャール・アレクセイ3世]";
			mes "どういうつもりかね？";
			mes "君は楽器を持っていないではないか。";
			next;
			mes "[チャール・アレクセイ3世]";
			mes "楽器を持ってきてから、";
			mes "また私に話しかけなさい。";
			close;
		}
		mes "[チャール・アレクセイ3世]";
		mes "ほう……これがグスリか。";
		mes "総理大臣！この楽器が君が";
		mes "書物で見た楽器と一致しているか？";
		next;
		mes "[総理大臣 ドミトリー]";
		mes "正確にはわかりませんが、";
		mes "非常に似ております。";
		mes "そして、現在、わが国には";
		mes "この楽器に似た楽器はありません。";
		mes "全く新しい楽器だと思われます。";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "ほう……なるほど！";
		mes "信じるに値するな！";
		mes "この楽器の演奏は出来るのか？";
		next;
		if(MOSK_1QUE == 38) {
			mes "[" +strcharinfo(0)+ "]";
			mes "はい。クジラ島で楽器を習って";
			mes "来ました。";
			next;
			mes "[チャール・アレクセイ3世]";
			mes "おお、そうか！";
			mes "それは楽しみだな！";
			mes "早く弾いてくれ。";
			next;
			soundeffect "mos_gusli2.wav",0;
			mes "-演奏を始めると、王宮の";
			mes "皆が目をつむり、グスリの";
			mes "音色に魅入られていた-";
			next;
			emotion 28;
			emotion 28,"総理大臣 ドミトリー";
			mes "[チャール・アレクセイ3世]";
			mes "おお……";
			mes "何と美しい曲だ……";
			next;
			mes "[総理大臣 ドミトリー]";
			mes "はい……";
			next;
			mes "[チャール・アレクセイ3世]";
			mes "見える、見えるぞ……";
			mes "モスコビアの雄大な大地が!!";
			next;
			mes "[チャール・アレクセイ3世]";
			mes "すばらしい……";
			mes "すばらしいぞ！";
			next;
			mes "[チャール・アレクセイ3世]";
			mes "総理大臣よ！";
			next;
			mes "[総理大臣 ドミトリー]";
			mes "はい！";
			next;
			mes "[チャール・アレクセイ3世]";
			mes "この冒険者に褒賞を";
			mes "与えなさい!!";
			next;
			mes "[総理大臣 ドミトリー]";
			mes "褒賞は何を与えれば";
			mes "よいでしょうか？";
			next;
			mes "[チャール・アレクセイ3世]";
			mes "それは君に任す。";
			mes "しかし、素晴らしい音楽と";
			mes "面白い冒険話を聞かせてくれた";
			mes "冒険者の苦労に相応しい";
			mes "最高の褒賞を与えなさい。";
			next;
			mes "[総理大臣 ドミトリー]";
			mes "チャール様より褒賞を与える。";
			next;
			mes "[総理大臣 ドミトリー]";
			mes "心より君に感謝する。";
			set MOSK_1QUE,41;
			getitem 617,1;
			if(checkre()) {
				for(set '@i,0;'@i<30;set '@i,'@i+1)
					getexp 5000,0;
				for(set '@i,0;'@i<10;set '@i,'@i+1)
					getexp 0,5000;
			}
			else {
				for(set '@i,0;'@i<30;set '@i,'@i+1)
					getexp 50000,0;
				for(set '@i,0;'@i<10;set '@i,'@i+1)
					getexp 0,50000;
			}
			close;
		}
		if(select("演奏できる","演奏できない") == 2) {
			mes "[チャール・アレクセイ3世]";
			mes "ふむ……音色が聞けないのは";
			mes "非常に残念だが、仕方ない。";
			mes "君の言う事を信じよう。";
			next;
			mes "[総理大臣 ドミトリー]";
			mes "総理大臣、この冒険者に褒賞を";
			mes "与えなさい。";
			next;
			mes "[総理大臣 ドミトリー]";
			mes "褒賞は何が宜しいでしょうか？";
			next;
			mes "[チャール・アレクセイ3世]";
			mes "総理大臣に任す。";
			mes "わしは、これから少し休むとする。";
			next;
			mes "[総理大臣 ドミトリー]";
			mes "チャール様はグスリの演奏を";
			mes "お聴きになりたかったようだな。";
			mes "演奏できればもっと多くの褒賞を";
			mes "与えたのだが……";
			next;
			mes "[総理大臣 ドミトリー]";
			mes "それでは褒賞を受け取りなさい。";
			next;
			mes "[総理大臣 ドミトリー]";
			mes "下がってよいぞ。";
			set MOSK_1QUE,40;
			getitem 603,1;
			if(checkre()) {
				for(set '@i,0;'@i<20;set '@i,'@i+1)
					getexp 5000,0;
				for(set '@i,0;'@i<6;set '@i,'@i+1)
					getexp 0,5000;
			}
			else {
				for(set '@i,0;'@i<20;set '@i,'@i+1)
					getexp 50000,0;
				for(set '@i,0;'@i<6;set '@i,'@i+1)
					getexp 0,50000;
			}
			close;
		}
		mes "[チャール・アレクセイ3世]";
		mes "演奏もできるのか！";
		mes "ならば、今すぐ弾いてくれ。";
		mes "音色を聴きたいぞ。";
		next;
		emotion 6;
		emotion 6,"総理大臣 ドミトリー";
		mes "[チャール・アレクセイ3世]";
		mes "これは、何かね？";
		mes "わしをからかっているのか？";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "あまりにひどい演奏だ。";
		mes "そこに警備兵は居ないか!!";
		next;
		mes "[総理大臣 ドミトリー]";
		mes "陛下！";
		next;
		mes "[総理大臣 ドミトリー]";
		mes "落ち着いてください。";
		mes "外国から来た冒険者に、";
		mes "このような事で怒りを表すと……";
		mes "陛下の威厳に響きます……";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "……";
		mes "ふむ、確かに大臣の言うとおりだ。";
		next;
		mes "[チャール・アレクセイ3世]";
		mes "あまりに期待を裏切られたので";
		mes "怒りを抑えれなかった……";
		mes "その冒険者に適切な褒賞を与え";
		mes "帰らせなさい！";
		next;
		mes "[総理大臣 ドミトリー]";
		mes "ほ、褒賞は何を与えれば";
		mes "よろしいでしょうか？";
		next;
		emotion 32;
		mes "[チャール・アレクセイ3世]";
		mes "総理大臣に任す。";
		mes "あの演奏を聴いて";
		mes "頭が痛くなった……";
		next;
		mes "[総理大臣 ドミトリー]";
		mes "チャール様の寛大さに";
		mes "感謝するが良い。";
		next;
		mes "[総理大臣 ドミトリー]";
		mes "今までの苦労を考えて、";
		mes "わずかだが、褒賞をあたえる。";
		mes "下がるがいい。";
		next;
		mes "[総理大臣 ドミトリー]";
		mes "下がるがいい。";
		set MOSK_1QUE,39;
		getitem 603,1;
		if(checkre()) {
			for(set '@i,0;'@i<10;set '@i,'@i+1)
				getexp 5000,0;
			for(set '@i,0;'@i<2;set '@i,'@i+1)
				getexp 0,5000;
		}
		else {
			for(set '@i,0;'@i<10;set '@i,'@i+1)
				getexp 50000,0;
			for(set '@i,0;'@i<2;set '@i,'@i+1)
				getexp 0,50000;
		}
		close;
	case 39:
		mes "[チャール・アレクセイ3世]";
		mes "用事が無いなら、下がりなさい。";
		close;
	case 40:
		mes "[チャール・アレクセイ3世]";
		mes "おお、グスリを持ってきた冒険者か！";
		mes "珍しい物を見せてくれたことに";
		mes "礼を言うぞ。";
		close;
	case 41:
		mes "[チャール・アレクセイ3世]";
		mes "君か!!";
		mes "よく来てくれたな。";
		mes "あのグスリの演奏は";
		mes "すばらしかった。";
		mes "また機会があればグスリの演奏を";
		mes "して欲しいものだよ。";
		close;
	default:
		if(MOSK_1QUE < 16) {
			mes "[チャール・アレクセイ3世]";
			mes "モスコビアにようこそ。";
			mes "わしはここの国王である";
			mes "チャール・アレクセイ3世だ。";
			next;
			mes "[チャール・アレクセイ3世]";
			mes "君の故郷に戻ったら、";
			mes "このモスコビアの美しさと";
			mes "立派な統治者の事を皆に";
			mes "伝えてくれ。";
			close;
		}
		if(MOSK_1QUE > 17 && MOSK_1QUE < 35) {
			mes "[チャール・アレクセイ3世]";
			mes "わしは疲れた。";
			mes "これから休憩を取る。";
			mes "君はクジラ島の証拠を取る事に";
			mes "集中するが良い。";
			next;
			mes "[チャール・アレクセイ3世]";
			mes "クジラ島にいたという";
			mes "老人が持っていた楽器を";
			mes "持ってくるのだ。";
			mes "そうすれば、君の話を信じて";
			mes "褒賞をあたえよう。";
			close;
		}
		mes "[チャール・アレクセイ3世]";
		mes "モスコビアにようこそ！";
		mes "わしは、国王の";
		mes "アレクセイ 3世だ！";
		close;
	}
OnTouch:
	if(MOSK_3QUE != 12)
		end;
	mes "[チャール・アレクセイ3世]";
	mes "君がババヤガに会っている";
	mes "所を目撃した人々が";
	mes "数え切れない程にいるのだよ。";
	next;
	mes "[チャール・アレクセイ3世]";
	mes "魔女と会うだけでも、";
	mes "罪に問われるのだが";
	mes "君が外国から来たという事を";
	mes "考え、今回だけ君に弁解の機会を";
	mes "当てる事にした。";
	next;
	mes "[チャール・アレクセイ3世]";
	mes "何か思う事があれば、";
	mes "今すぐ話すが良い。";
	next;
	menu "事情を説明する",-;
	mes "-ババヤガと話した事や";
	mes "　今後の計画について話した-";
	next;
	mes "[チャール・アレクセイ3世]";
	mes "ババヤガがそのような計画を……";
	mes "夏をとどめる魔法が真実ならば、";
	mes "喜ばしいことだ。";
	next;
	mes "[チャール・アレクセイ3世]";
	mes "しかし、その話が君の";
	mes "潔白が証明できる証拠とは";
	mes "ならない。";
	next;
	mes "[チャール・アレクセイ3世]";
	mes "ババヤガ達を倒し、彼女らが";
	mes "集めていると言うババヤガのきねを";
	mes "持って来たら、君の言う事を";
	mes "信じようではないか。";
	next;
	if(countitem(7762) < 40) {
		mes "[チャール・アレクセイ3世]";
		mes "身の潔白を証明するために";
		mes "ババヤガが持つババヤガのきねを40個";
		mes "持って来るがよい。";
		set MOSK_3QUE,13;
		close;
	}
	if(select("ババヤガのきねを見せる","じっとしている") == 2) {
		mes "[チャール・アレクセイ3世]";
		mes "身の潔白を証明するために";
		mes "ババヤガが持つババヤガのきねを40個";
		mes "持って来るがよい。";
		set MOSK_3QUE,13;
		close;
	}
	mes "[" +strcharinfo(0)+ "]";
	mes "はい、ここにあります。";
	next;
	mes "-ババヤガのきねを捧げた-";
	delitem 7762,40;
	next;
	mes "[チャール・アレクセイ3世]";
	mes "持ってきたか。";
	mes "とりあえず、話の一部は";
	mes "信じてあげよう。";
	next;
	mes "[チャール・アレクセイ3世]";
	mes "夏をとどめることが";
	mes "できるのであれば";
	mes "国民は喜ぶであろう。";
	mes "それはわしにも喜ばしい事だ。";
	next;
	mes "[チャール・アレクセイ3世]";
	mes "しかし、どんなことがあっても";
	mes "ババヤガの力を借りるなど";
	mes "絶対にあってはならないことだ。";
	next;
	mes "[チャール・アレクセイ3世]";
	mes "そこでだ。";
	next;
	mes "[チャール・アレクセイ3世]";
	mes "君の手で夏をとどめるのだ。";
	mes "ババヤガの名前を表に出さずにな。";
	next;
	mes "[チャール・アレクセイ3世]";
	mes "したがって、君に";
	mes "ババヤガの所に出入りすることを";
	mes "特別に許可する。";
	next;
	mes "[チャール・アレクセイ3世]";
	mes "頼んだぞ。";
	set MOSK_3QUE,14;
	close;
}

moscovia.gat,136,46,0	script	桟橋#mosk	139,4,4,{
	if(MOSK_1QUE < 35 || MOSK_1QUE > 41)
		end;
	mes "-グスリを弾くと";
	mes "　クジラ島に行ける-";
	next;
	if(select("クジラ島に行く","やめる") == 2) {
		mes "[" +strcharinfo(0)+ "]";
		mes "（今は止めておこう。）";
		close;
	}
	if(equippeditem(2707) == 0) {
		mes "[" +strcharinfo(0)+ "]";
		mes "（グスリを装備しないと弾けない。";
		mes "　グスリを装備しよう。）";
		close;
	}
	soundeffect "mos_gusli2.wav",0;
	mes "-" +strcharinfo(0)+ "は";
	mes "　グスリを手に取り、";
	mes "　老人が演奏していたフレーズを";
	mes "　思い出して、弾き始めた-";
	next;
	mes "-海の向こうに";
	mes "　うっすらとクジラ島が現れた-";
	close2;
	warp "mosk_fild01.gat",95,93;
	end;
}

mosk_fild02.gat,198,53,0	script	帆船	111,{
	mes "-桟橋に奇妙な老人から借りた";
	mes "　帆船が停泊している。";
	mes "　遠くにクジラ島が見える-";
	mes " ";
	mes "-モスコビアの街に帰ろうか？-";
	next;
	if(select("帆船を利用して街に戻る","もっと探検する") == 2) {
		mes "-この未開の島を";
		mes "　もっと探検することにした-";
		close;
	}
	mes "-クジラ島を経由して";
	mes "　モスコビアの街へ";
	mes "　戻ることにした-";
	close2;
	warp "moscovia.gat",140,54;
	end;
}

//============================================================
// どんぐり好きのリスクエストNPC
//------------------------------------------------------------
mosk_fild01.gat,113,108,5	script	#大きいリス	1104,{}
mosk_fild01.gat,113,108,0	script	大きいリス	111,2,2,{
OnTouch:
	if(MaxWeight - Weight < 2000) {
		mes "-所持アイテムの重量が多いため";
		mes "　アイテムを受けとることができません-";
		mes "-所持アイテムを減らしてから、再度";
		mes "　話しかけてください-";
		close;
	}
	mes "-普通のリスよりも何倍も";
	mes "　体が大きいリスがいる-";
	next;
	mes "-リスは目が合うと";
	mes "　鼻をクンクンさせたり、";
	mes "　口元を動かしたりして、";
	mes "　落ち着きが無くなった-";
	next;
	if(countitem(1026) < 20) {
		mes "-リスはあなたを";
		mes "　チラチラと見ていたが、";
		mes "　やがて興味を失ったようだ-";
		close;
	}
	switch(select("どんぐりをあげる","気にしないでおく","リスの事を聞く")) {
	case 1:
		mes "-あなたはどんぐりを取り出し、";
		mes "　リスにあげた-";
		next;
		mes "-リスは一瞬警戒したが、";
		mes "　すぐにどんぐりを食べ始めた-";
		next;
		mes "-カリ　カリ　カリ　カリ-";
		mes "-カリ　カリ　カリ　カリ-";
		mes "-カリ　カリ　カリ　カリ-";
		next;
		mes "-どんぐりをあっという間に";
		mes "　食べきったリスは、";
		mes "　急に体を折って口から何かを";
		mes "　吐き出した-";
		delitem 1026,20;
		set '@rand,rand(1000);
		if ('@rand < 100) getitem 733,1;
		else if ('@rand == 100) {
			set '@rand,rand(150);
			if ('@rand < 10) getitem 718,1;
			else if ('@rand < 20) getitem 719,1;
			else if ('@rand < 30) getitem 720,1;
			else if ('@rand < 40) getitem 721,1;
			else if ('@rand < 50) getitem 722,1;
			else if ('@rand < 60) getitem 723,1;
			else if ('@rand < 70) getitem 725,1;
			else if ('@rand < 80) getitem 728,1;
			else if ('@rand < 90) getitem 729,1;
			else if ('@rand < 100) getitem 730,1;
			else getitem 7289,1;
		}
		else if ('@rand < 200) getitem 733,1;
		else if ('@rand == 200) {
			set '@rand,rand(150);
			if ('@rand < 10) getitem 718,1;
			else if ('@rand < 20) getitem 719,1;
			else if ('@rand < 30) getitem 720,1;
			else if ('@rand < 40) getitem 721,1;
			else if ('@rand < 50) getitem 722,1;
			else if ('@rand < 60) getitem 723,1;
			else if ('@rand < 70) getitem 725,1;
			else if ('@rand < 80) getitem 728,1;
			else if ('@rand < 90) getitem 729,1;
			else if ('@rand < 100) getitem 731,1;
			else {
				switch(rand(10)) {
					case 0:
					case 1:
					case 2: getitem 7292,1; break;
					case 3:
					case 4: getitem 7297,1; break;
					default: getitem 7290,1; break;
				}
			}
		}
		else if ('@rand < 300) getitem 733,1;
		else if ('@rand == 300) {
			set '@rand,rand(150);
			if ('@rand < 10) getitem 718,1;
			else if ('@rand < 20) getitem 719,1;
			else if ('@rand < 30) getitem 720,1;
			else if ('@rand < 40) getitem 721,1;
			else if ('@rand < 50) getitem 722,1;
			else if ('@rand < 60) getitem 723,1;
			else if ('@rand < 70) getitem 725,1;
			else if ('@rand < 80) getitem 728,1;
			else if ('@rand < 90) getitem 729,1;
			else if ('@rand < 100) getitem 732,1;
			else {
				if(rand(2)) getitem 7291,1;
				else getitem 7294,1;
			}
		}
		else if ('@rand < 400) getitem 733,1;
		else if ('@rand == 400) {
			set '@rand,rand(150);
			if ('@rand < 10) getitem 718,1;
			else if ('@rand < 20) getitem 719,1;
			else if ('@rand < 30) getitem 720,1;
			else if ('@rand < 40) getitem 721,1;
			else if ('@rand < 50) getitem 722,1;
			else if ('@rand < 60) getitem 723,1;
			else if ('@rand < 70) getitem 725,1;
			else if ('@rand < 80) getitem 728,1;
			else if ('@rand < 90) getitem 729,1;
			else if ('@rand < 100) getitem 730,1;
			else getitem 7295,1;
		}
		else if ('@rand < 500) getitem 733,1;
		else if ('@rand == 500) {
			set '@rand,rand(150);
			if ('@rand < 10) getitem 718,1;
			else if ('@rand < 20) getitem 719,1;
			else if ('@rand < 30) getitem 720,1;
			else if ('@rand < 40) getitem 721,1;
			else if ('@rand < 50) getitem 722,1;
			else if ('@rand < 60) getitem 723,1;
			else if ('@rand < 70) getitem 725,1;
			else if ('@rand < 80) getitem 728,1;
			else if ('@rand < 90) getitem 729,1;
			else if ('@rand < 100) getitem 731,1;
			else getitem 7293,1;
		}
		else if ('@rand < 600) getitem 724,1;
		else if ('@rand == 600) {
			set '@rand,rand(150);
			if ('@rand < 10) getitem 718,1;
			else if ('@rand < 20) getitem 719,1;
			else if ('@rand < 30) getitem 720,1;
			else if ('@rand < 40) getitem 721,1;
			else if ('@rand < 50) getitem 722,1;
			else if ('@rand < 60) getitem 723,1;
			else if ('@rand < 70) getitem 725,1;
			else if ('@rand < 80) getitem 728,1;
			else if ('@rand < 90) getitem 729,1;
			else if ('@rand < 100) getitem 732,1;
			else getitem 7292,1;
		}
		else if ('@rand < 700) getitem 724,1;
		else if ('@rand == 700) {
			set '@rand,rand(150);
			if ('@rand < 10) getitem 718,1;
			else if ('@rand < 20) getitem 719,1;
			else if ('@rand < 30) getitem 720,1;
			else if ('@rand < 40) getitem 721,1;
			else if ('@rand < 50) getitem 722,1;
			else if ('@rand < 60) getitem 723,1;
			else if ('@rand < 70) getitem 725,1;
			else if ('@rand < 80) getitem 728,1;
			else if ('@rand < 90) getitem 729,1;
			else if ('@rand < 100) getitem 730,1;
			else getitem 7290,1;
		}
		else if ('@rand < 800) getitem 724,1;
		else if ('@rand == 800) {
			set '@rand,rand(150);
			if ('@rand < 10) getitem 718,1;
			else if ('@rand < 20) getitem 719,1;
			else if ('@rand < 30) getitem 720,1;
			else if ('@rand < 40) getitem 721,1;
			else if ('@rand < 50) getitem 722,1;
			else if ('@rand < 60) getitem 723,1;
			else if ('@rand < 70) getitem 725,1;
			else if ('@rand < 80) getitem 728,1;
			else if ('@rand < 90) getitem 729,1;
			else if ('@rand < 100) getitem 731,1;
			else getitem 7296,1;
		}
		else if ('@rand < 900) getitem 724,1;
		else if ('@rand == 900) {
			set '@rand,rand(150);
			if ('@rand < 10) getitem 718,1;
			else if ('@rand < 20) getitem 719,1;
			else if ('@rand < 30) getitem 720,1;
			else if ('@rand < 40) getitem 721,1;
			else if ('@rand < 50) getitem 722,1;
			else if ('@rand < 60) getitem 723,1;
			else if ('@rand < 70) getitem 725,1;
			else if ('@rand < 80) getitem 728,1;
			else if ('@rand < 90) getitem 729,1;
			else if ('@rand < 100) getitem 732,1;
			else getitem 7297,1;
		}
		else if ('@rand < 1000) getitem 724,1;
		else getitem 727,1;
		close;
	case 2:
		mes "[" +strcharinfo(0)+ "]";
		mes "うん、可愛い可愛い。";
		close;
	case 3:
		mes "[老人]";
		mes "少し大きいリスだろう？";
		mes "昔、このリスをクジラの背中で";
		mes "発見した時は死にかけていたが、";
		mes "こんなに大きくなってしまった。";
		mes "ふふ。";
		next;
		mes "[老人]";
		mes "あぁ、そうなんだ。";
		mes "こいつは食いしん坊でね。";
		mes "^3131FFどんぐりを20個ずつ^000000あげないと";
		mes "見向きもしないんだよ";
		mes "ハハハ！";
		mes "だから大きくなったのかな。";
		close;
	}
}

moscovia.gat,208,182,7	script	どんぐり商人	967,{
	mes "[どんぐり商人]";
	mes "老若男女、皆が好きなどんぐり！";
	mes "お一つ100zenyと破格ですよ!!";
	next;
	if(select("どんぐりを買う","どんぐり？") == 2) {
		mes "[どんぐり商人]";
		mes "どんぐりを料理したり、";
		mes "リスの餌にしたりしますよね？";
		mes "まぁ、ある人はどんぐりで";
		mes "家を作るらしいですが……";
		mes "どんな風に作っているかは";
		mes "想像もつきませんね。";
		close;
	}
	mes "[どんぐり商人]";
	mes "これは最高級のどんぐりですよ！";
	mes "おいくつにするか";
	mes "これに書いてください。";
	mes "最大で500個まで一度に買えます。";
	while(1) {
		next;
		input '@num;
		if('@num == 0) {
			mes "[どんぐり商人]";
			mes "おや、いりませんか？";
			close;
		}
		if('@num < 0 || '@num > 500) {
			mes "[どんぐり商人]";
			mes "購入は一度に500個までで";
			mes "お願いします。";
			continue;
		}
		if(checkweight(1026,'@num) == 0) {
			mes "[どんぐり商人]";
			mes "お客様……";
			mes "手荷物で一杯みたいですよ？";
			mes "売り切れたりしませんから、";
			mes "ゆっくり所持品を";
			mes "整理してきてください。";
			close;
		}
		if('@num * 100 > Zeny) {
			mes "[どんぐり商人]";
			mes "お客様？　どうなされました？";
			mes "顔が真っ青なんですが……";
			mes "もしかして、お金が足りないとか……？";
			close;
		}
		set Zeny,Zeny-'@num*100;
		getitem 1026,'@num;
		mes "[どんぐり商人]";
		mes "ありがとうございます！";
		mes "どうですか？";
		mes "新鮮などんぐりでしょう？";
		close;
	}
}

//============================================================
// 耳当て帽作成クエストNPC
//------------------------------------------------------------
moscovia.gat,211,93,3	script	イリーナ	958,{
	if(MaxWeight - Weight < 1500) {
		mes "[イリーナ]";
		mes "所持アイテムが重すぎて、";
		mes "アイテムの受け渡しが";
		mes "できません。荷物を減らしてから";
		mes "話しかけてください。";
		close;
	}
	mes "[イリーナ]";
	mes "こんにちは。冒険者さん！";
	mes "モスコビアは楽しんでますか？";
	next;
	mes "[イリーナ]";
	mes "モスコビアの旅行を記念して";
	mes "モスコビアの特産品、";
	mes "耳あて帽を作ってみては";
	mes "いかがでしょう。";
	mes "本当に格好いいですよ。";
	next;
	if(select("耳あて帽の説明を聞く","耳あて帽を作る") == 1) {
		mes "[イリーナ]";
		mes "モスコビアは暖かいのに";
		mes "この分厚い帽子が";
		mes "何故特産品かわかりますか？";
		next;
		mes "[イリーナ]";
		mes "実は、モスコビアの冬は";
		mes "とても厳しくて、";
		mes "とても長いんです。";
		next;
		mes "[イリーナ]";
		mes "ここに初めて来た方には";
		mes "信じられませんよね。";
		next;
		mes "[イリーナ]";
		mes "その厳しい冬に、";
		mes "この帽子は必須となるんです。";
		mes "これが無いと、寒さに";
		mes "耐えられないんですよ。";
		next;
		mes "[イリーナ]";
		mes "今は夏ですが、";
		mes "今のうち、冬に備えて";
		mes "耳あて帽を作っておかないと";
		mes "いけないのです。";
		next;
		mes "[イリーナ]";
		mes "耳あて帽の防寒能力に";
		mes "ついては、私が保障しますよ。";
		close;
	}
	mes "[イリーナ]";
	mes "耳あて帽を作りますか？";
	mes "おすすめですよ。";
	next;
	mes "[イリーナ]";
	mes "材料を持って来てくれれば、";
	mes "すぐに作ります。";
	next;
	mes "[イリーナ]";
	mes "材料は、";
	mes "^0000FF狐の尻尾 20個、";
	mes "毛糸 10個、柔らかい布 10個、";
	mes "ラッコの毛皮 20個、糸巻 1個^000000が";
	mes "必要ですよ。";
	next;
	if(countitem(1022) < 20 || countitem(7038) < 10 || countitem(7166) < 10 || countitem(7065) < 20 || countitem(7217) < 1) {
		mes "[イリーナ]";
		mes "あら、材料が足りませんね。";
		next;
		mes "[イリーナ]";
		mes "もう一度材料を教えますから、";
		mes "揃えてくださいね。";
		next;
		mes "[イリーナ]";
		mes "^0000FF狐の尻尾 20個、";
		mes "毛糸 10個、柔らかい布 10個、";
		mes "ラッコの毛皮 20個、糸巻 1個^000000が";
		mes "必要です。";
		close;
	}
	mes "[イリーナ]";
	mes "材料が全部揃いましたね。";
	mes "少し待っててください。";
	mes "すぐに作ります！";
	delitem 1022,20;
	delitem 7038,10;
	delitem 7166,10;
	delitem 7065,20;
	delitem 7217,1;
	getitem 5243,1;
	next;
	mes "[イリーナ]";
	mes "どうですか？";
	mes "気に入りましたか？";
	next;
	mes "[イリーナ]";
	mes "耳あて帽が必要なら、";
	mes "材料があれば";
	mes "また作りますよ。";
	next;
	mes "[イリーナ]";
	mes "それでは、良い旅を！";
	close;
}

//============================================================
// 泣き虫のミハイルクエストNPC
//- Registry -------------------------------------------------
// MOSK_2QUE -> 0～
//------------------------------------------------------------
mosk_in.gat,144,279,5	script	カリーナ	959,{
	switch(MOSK_2QUE) {
	case 0:
		mes "[カリーナ]";
		mes "まったく……";
		mes "あの子はどこ行ったの？";
		mes "帰ったらお仕置きだからね！";
		mes "もう……お父さんに変な所だけ";
		mes "似てるんだから……";
		next;
		mes "[アンナ]";
		mes "ミハイルは臆病者！";
		mes "ミハイルの泣き虫！";
		next;
		mes "[カリーナ]";
		mes "こら！";
		mes "悪口は言っちゃだめって";
		mes "いつも言っているでしょ！";
		mes "一週間、掃除の手伝いを";
		mes "覚悟しておきなさい！";
		next;
		emotion 28,"アンナ#mosk";
		mes "[アンナ]";
		mes "えぇ～～～";
		next;
		if(select("話しかける","気にしないでおく") == 2) {
			mes "[カリーナ]";
			mes "まったく……";
			mes "アンナは何度言っても";
			mes "言うこと聞かないんだから……";
			close;
		}
		mes "[" +strcharinfo(0)+ "]";
		mes "あ、あの……こんにちは。";
		next;
		mes "[カリーナ]";
		mes "あら、いらっしゃい！";
		mes "お客さんに気付かなくて";
		mes "ごめんなさいね。";
		mes "パンケーキを買いに";
		mes "来たんですよね？";
		next;
		mes "[カリーナ]";
		mes "ごめんなさい。";
		mes "まだ開店の準備ができていなくて……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "いえ、パンケーキを";
		mes "買いに来たわけじゃありません。";
		mes "それより、何かあったみたいですが……";
		mes "大丈夫ですか？";
		next;
		mes "[カリーナ]";
		mes "あ……それが……";
		mes "ミハイル、うちの息子なんですが、";
		mes "私の大事なマトリョーシカ人形を";
		mes "壊して……それで怒られるのが";
		mes "怖くなったのか、帰ってこないんです。";
		next;
		mes "[カリーナ]";
		mes "男の子なのに弱虫で……";
		mes "よく泣くし……";
		next;
		mes "[カリーナ]";
		mes "とにかく、もう夕飯の時間なのに";
		mes "帰ってこないから……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "心配なら、私が息子さんを";
		mes "探してきましょうか？";
		next;
		mes "[カリーナ]";
		mes "心配？　違います！";
		mes "ただ、息子の弱い性格を";
		mes "何とかしたいだけです……";
		mes "今すぐ叱ってやりたいのに、";
		mes "それが出来なくて";
		mes "イライラしているだけです……";
		next;
		mes "-目の前の女性は帰ってこない";
		mes "　息子のことが心配のようだ-";
		next;
		mes "[カリーナ]";
		mes "でも……";
		mes "せっかくのご好意だし……";
		mes "本当に息子を探してくれるのですか？";
		next;
		if(select("いえ、言ってみただけです","はい、任せてください！") == 1) {
			mes "[カリーナ]";
			mes "そうですよね……";
			mes "旅人のあなたには";
			mes "関係ないことですから……";
			mes "冗談だったんですよね。";
			close;
		}
		mes "[カリーナ]";
		mes "本当ですか？";
		mes "ありがとうございます！";
		mes "ミハイルは臆病な子ですから、";
		mes "街の外には行っていないと思います。";
		next;
		mes "[カリーナ]";
		mes "そういえば、まだお名前を";
		mes "聞いていませんでしたね。";
		mes "あなたは？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "私は";
		mes strcharinfo(0)+ "です。";
		next;
		mes "[カリーナ]";
		mes strcharinfo(0)+ "さん";
		mes "ですね。";
		mes "私はカリーナ。";
		mes "そこにいるのは娘の";
		mes "アンナです。";
		next;
		mes "-アンナと呼ばれた女の子に";
		mes "　目を向ける-";
		next;
		mes "[アンナ]";
		mes "いーーーーーっだ！";
		next;
		mes "-私が気に入らないのか、";
		mes "　アンナは白い歯を見せて";
		mes "　不満をあらわにしている-";
		next;
		mes "[カリーナ]";
		mes "アンナ！";
		mes "お客さんに失礼でしょう！";
		next;
		mes "-カリーナは苦笑いを";
		mes "　しながら、話を続けた-";
		next;
		mes "[カリーナ]";
		mes "突然で申し訳ありませんが、";
		mes "息子のミハイルを";
		mes "よろしくお願いします。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "（息子の名前は";
		mes "　ミハイルと言うらしい。";
		mes "　まずは、家の中で情報を";
		mes "　集めてみよう）";
		next;
		mes "[カリーナ]";
		mes "もう！";
		mes "あの子ったら、どこに行ったのかしら！";
		set MOSK_2QUE,1;
		close;
	case 1:
		mes "[カリーナ]";
		mes "ミハイルは臆病な子ですので……";
		mes "街の何処かに隠れていると";
		mes "思います。";
		mes "全く、あの人に似て……";
		close;
	case 25:
		mes "[カリーナ]";
		mes "先程、ミハイルが帰ってきました。";
		mes "でも、また出て行ったんです。";
		mes "マトリョーシカ人形を持って……";
		next;
		mes "[カリーナ]";
		mes "まだ小さいのに……";
		mes "私が厳しすぎたかも知れませんね。";
		mes "ミハイルは自分なりに";
		mes "努力をしていたのかも";
		mes "知れないのに……";
		next;
		mes "-カリーナはミハイルが";
		mes "　戻ってきたことに";
		mes "　安心しているようだ-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "これから優しくしてあげれば";
		mes "良いんじゃありませんか？";
		next;
		mes "[カリーナ]";
		mes "はい、そうですね。";
		mes "今回の事はアンナが";
		mes "悪かったようです。";
		next;
		mes "[カリーナ]";
		mes "自分がやった事を";
		mes "弟のせいにして……";
		mes "アンナには少し厳しく";
		mes "しようかと思います。";
		next;
		mes "[カリーナ]";
		mes "それにしても……";
		mes "私たちのために色々してくれて……";
		mes "本当にありがとうございました。";
		mes "ミハイルからは危険な所にも";
		mes "行かれたと聞きました……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "なぁに、いつもの事です。";
		mes "気にしないでください。";
		next;
		mes "[カリーナ]";
		mes "そうですか……";
		mes "大したお礼は出来ませんが……";
		mes "お礼に美味しいパンケーキの";
		mes "作り方をお教えしても";
		mes "いいですか？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "はい。　是非おねがいします！";
		next;
		mes "[カリーナ]";
		mes "私はお店の準備がありますので……";
		mes "お手伝いのラリサに";
		mes "言っておきますね。";
		next;
		mes "[カリーナ]";
		mes "パンケーキの作り方は";
		mes "彼女に教わってください。";
		mes "彼女の腕も私におとらず、";
		mes "なかなかのものなんですから。";
		next;
		mes "[カリーナ]";
		mes "モスコビアのパンケーキは";
		mes "とっても美味しいですから！";
		mes "きっと、一度食べれば、";
		mes "やみつき間違いなしですよ。";
		mes "うふふ。";
		set MOSK_2QUE,100;
		if(checkre()) {
			for(set '@i,0;'@i<20;set '@i,'@i+1)
				getexp 5000,0;
			for(set '@i,0;'@i<6;set '@i,'@i+1)
				getexp 0,5000;
		}
		else {
			for(set '@i,0;'@i<20;set '@i,'@i+1)
				getexp 50000,0;
			for(set '@i,0;'@i<6;set '@i,'@i+1)
				getexp 0,50000;
		}
		close;
	default:
		if(MOSK_2QUE < 25) {
			mes "[" +strcharinfo(0)+ "]";
			mes "ミハイル君はまだ帰ってきて";
			mes "いませんか？";
			next;
			mes "[カリーナ]";
			mes "えぇ、まだ……";
			mes "まったく、どこへ行っているのか……";
			close;
		}
		mes "[カリーナ]";
		mes "私はいつも新しいメニューを";
		mes "考えているんですよ。";
		mes "えっと……";
		mes "「世界一辛いチリホットパンケーキ」";
		mes "なんてどうですか？";
		mes "何か、斬新な気がしませんか？";
		close;
	}
}

mosk_in.gat,148,274,1	script	アンナ#mosk	958,{
	switch(MOSK_2QUE) {
	case 0:
		mes "[カリーナ]";
		mes "まったく……";
		mes "あの子はどこ行ったの？";
		mes "帰ったらお仕置きだからね！";
		mes "もう……お父さんに変な所だけ";
		mes "似てるんだから……";
		next;
		mes "[アンナ]";
		mes "ミハイルは臆病者！";
		mes "ミハイルの泣き虫！";
		next;
		mes "[カリーナ]";
		mes "こら！";
		mes "悪口は言っちゃだめって";
		mes "いつも言っているでしょ！";
		mes "一週間、掃除の手伝いを";
		mes "覚悟しておきなさい！";
		next;
		emotion 28;
		mes "[アンナ]";
		mes "えぇ～～～";
		next;
		if(select("話しかける","気にしないでおく") == 2) {
			mes "[カリーナ]";
			mes "もう……";
			mes "どこに行ったのかしら！";
			close;
		}
		mes "[" +strcharinfo(0)+ "]";
		mes "あ、あの……こんにちは。";
		next;
		mes "[カリーナ]";
		mes "あら、いらっしゃい！";
		mes "お客さんに気付かなくて";
		mes "ごめんなさいね。";
		mes "パンケーキを買いに";
		mes "来たんですよね？";
		next;
		mes "[カリーナ]";
		mes "ごめんなさい。";
		mes "まだ開店の準備ができていなくて……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "いえ、パンケーキを";
		mes "買いに来たわけじゃありません。";
		mes "それより、何かあったみたいですが……";
		mes "大丈夫ですか？";
		next;
		mes "[カリーナ]";
		mes "あ……それが……";
		mes "ミハイル、うちの息子なんですが、";
		mes "私の大事なマトリョーシカ人形を";
		mes "壊して……それで怒られるのが";
		mes "怖くなったのか、帰ってこないんです。";
		next;
		mes "[カリーナ]";
		mes "男の子なのに弱虫で……";
		mes "よく泣くし……";
		next;
		mes "[カリーナ]";
		mes "とにかく、もう夕飯の時間なのに";
		mes "帰ってこないから……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "心配なら、私が息子さんを";
		mes "探してきましょうか？";
		next;
		mes "[カリーナ]";
		mes "心配？　違います！";
		mes "ただ、息子の弱い性格を";
		mes "何とかしたいだけです……";
		mes "今すぐ叱ってやりたいのに、";
		mes "それが出来なくて";
		mes "イライラしているだけです……";
		next;
		mes "-目の前の女性は帰ってこない";
		mes "　息子のことが心配のようだ-";
		next;
		mes "[カリーナ]";
		mes "でも……";
		mes "せっかくのご好意だし……";
		mes "本当に息子を探してくれるのですか？";
		next;
		if(select("いえ、言ってみただけです","はい、任せてください！") == 1) {
			mes "[カリーナ]";
			mes "そうですよね……";
			mes "旅人のあなたには";
			mes "関係ないことですから……";
			mes "冗談だったんですよね。";
			close;
		}
		mes "[カリーナ]";
		mes "本当ですか？";
		mes "ありがとうございます！";
		mes "ミハイルは臆病な子ですから、";
		mes "街の外には行っていないと思います。";
		next;
		mes "[カリーナ]";
		mes "そういえば、まだお名前を";
		mes "聞いていませんでしたね。";
		mes "あなたは？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "私は";
		mes strcharinfo(0)+ "です。";
		next;
		mes "[カリーナ]";
		mes strcharinfo(0)+ "さん";
		mes "ですね。";
		mes "私はカリーナ。";
		mes "そこにいるのは娘の";
		mes "アンナです。";
		next;
		mes "-アンナと呼ばれた女の子に";
		mes "　目を向ける-";
		next;
		mes "[アンナ]";
		mes "いーーーーーっだ！";
		next;
		mes "-私が気に入らないのか、";
		mes "　アンナは白い歯を見せて";
		mes "　不満をあらわにしている-";
		next;
		mes "[カリーナ]";
		mes "アンナ！";
		mes "お客さんに失礼でしょう！";
		next;
		mes "-カリーナは苦笑いを";
		mes "　しながら、話を続けた-";
		next;
		mes "[カリーナ]";
		mes "突然で申し訳ありませんが、";
		mes "息子のミハイルを";
		mes "よろしくお願いします。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "（息子の名前は";
		mes "　ミハイルと言うらしい。";
		mes "　まずは、家の中で情報を";
		mes "　集めてみよう）";
		next;
		mes "[カリーナ]";
		mes "もう！";
		mes "あの子ったら、どこに行ったのかしら！";
		set MOSK_2QUE,1;
		close;
	case 1:
		mes "[アンナ]";
		mes "もう！";
		mes "ミハイルなんか知らない！";
		mes "ミハイルの馬鹿！　怖がり！";
		close;
	case 2:
		mes "[アンナ]";
		mes "何よ！";
		mes "話すことでもあるの？";
		mes " ";
		mes "-アンナは叫ぶように聞いてきた-";
		while(1) {
			next;
			switch(select("ミハイルが隠れた場所","ミハイルとの関係","当時の状況について","その他の質問","話をやめる")) {
			case 1:
				mes "[" +strcharinfo(0)+ "]";
				mes "ミハイルはどこに隠れたか";
				mes "心当たりはないかな？";
				next;
				emotion 39;
				mes "[アンナ]";
				mes "馬鹿じゃない？";
				mes "あったら私が見つけてるわよ。";
				next;
				emotion 4,"";
				mes "[" +strcharinfo(0)+ "]";
				mes "そ、そうだよね……";
				mes "ハハハ……";
				break;
			case 2:
				mes "[" +strcharinfo(0)+ "]";
				mes "アンナはミハイルと仲が良いの？";
				next;
				mes "[アンナ]";
				mes "別に。";
				mes "ミハイルはいっつも私の後ろに";
				mes "隠れてるのよ。";
				next;
				mes "[アンナ]";
				mes "本を読んで欲しいってうるさいし、";
				mes "すぐに泣きだすし……";
				mes "正直面倒なの。";
				mes "友達なんか絶対にいないんだから。";
				next;
				mes "[" +strcharinfo(0)+ "]";
				mes "（アンナは活発な性格だけど、";
				mes "　ミハイルは大人しい性格なのか……）";
				break;
			case 3:
				mes "[" +strcharinfo(0)+ "]";
				mes "ミハイルがお母さんの";
				mes "マトリョーシカ人形を壊した時、";
				mes "アンナは何をしていたの？";
				next;
				mes "[アンナ]";
				mes "私はミハイルと一緒にいたわ。";
				next;
				mes "[" +strcharinfo(0)+ "]";
				mes "えっ？　そうなの？";
				mes "じゃ、何があったか詳しく";
				mes "教えてくれないかな？";
				next;
				mes "[アンナ]";
				mes "お母さんが出かけた後、";
				mes "私は本を読んでたわ。";
				mes "ミハイルは本を読んでって言ったり、";
				mes "お腹が空いたってうるさかったの。";
				next;
				mes "[アンナ]";
				mes "私は一人じゃ何も出来ないミハイルの";
				mes "面倒なんて見たくなかったから、";
				mes "そのまま本を読んでたのよ……";
				next;
				mes "[アンナ]";
				mes "そしたら、いつの間にか";
				mes "ミハイルがお母さんの";
				mes "マトリョーシカ人形を";
				mes "壊していたのよ！";
				next;
				mes "[アンナ]";
				mes "そのあと泣き出したのよ。";
				mes "まったく……";
				mes "そんなことになるなら";
				mes "最初からマトリョーシカ人形に";
				mes "触らなきゃよかったのに。";
				next;
				mes "[アンナ]";
				mes "仕方ないから、";
				mes "ミハイルに^3131FF接着剤^000000で";
				mes "マトリョーシカ人形を直せば";
				mes "って言ってあげたの。";
				next;
				mes "[アンナ]";
				mes "ミハイルは一目散に";
				mes "接着剤を探しに出ていったわ。";
				mes "そのまま帰ってきてないの。";
				next;
				mes "[" +strcharinfo(0)+ "]";
				mes "なるほど……";
				mes "そんな事があったんだ。";
				mes "じゃ、アンナは接着剤が";
				mes "手に入る所をミハイルに";
				mes "教えてあげたんだね。";
				next;
				mes "[" +strcharinfo(0)+ "]";
				mes "きっとそこにミハイルが";
				mes "いると思うけど……";
				next;
				mes "[アンナ]";
				mes "接着剤がどこにあるかなんて";
				mes "私は知らないわ。";
				mes "ミハイルもね。";
				next;
				mes "[" +strcharinfo(0)+ "]";
				mes "！！！！！！";
				next;
				mes "[アンナ]";
				mes "ミハイルは私の話も聞かずに";
				mes "行っちゃったから、";
				mes "どこにいったのかなんて、";
				mes "わからないのよ。";
				next;
				mes "[" +strcharinfo(0)+ "]";
				mes "ミハイルと仲良い友達や";
				mes "街の人は居るの？";
				next;
				mes "[アンナ]";
				mes "ハン！　あんなやつに";
				mes "友達なんているわけないじゃない。";
				mes "^3131FFアップルツリー旅館のおばさん^000000";
				mes "ぐらいじゃないの？";
				mes "ミハイルを可愛がってるのは。";
				next;
				mes "[アンナ]";
				mes "フン！";
				mes "ミハイルなんて、知らないんだから！";
				next;
				mes "-アンナは興奮して話を聞ける";
				mes "　状態ではなくなってしまった-";
				next;
				mes "[" +strcharinfo(0)+ "]";
				mes "（ふぅ……とりあえず、";
				mes "　^3131FFアップルツリー旅館^000000に";
				mes "　行ってみようか？）";
				set MOSK_2QUE,3;
				break;
			case 4:
				mes "[" +strcharinfo(0)+ "]";
				mes "アンナに何を聞いてみようか。";
				next;
				input '@str$;
				mes "[" +strcharinfo(0)+ "]";
				mes "アンナ。";
				mes "「" +'@str$+ "」って";
				mes "知ってる？";
				next;
				if('@str$ == "カリーナ") {
					mes "[アンナ]";
					mes "カリーナ？";
					mes "私のお母さんと同じ名前ね。";
					mes "お母さんはパンケーキを";
					mes "作るのがとても上手なのよ。";
					next;
					mes "[アンナ]";
					mes "とってもおいしいんだから。";
					mes "はぁ……";
					mes "甘い香りとふわっとした食感……";
					mes "私、何個だって食べられるわ。";
					next;
					mes "[アンナ]";
					mes "街中の人たちが、お母さんの";
					mes "パンケーキを褒めてるんだ～";
					mes "えへへ。";
				}
				else if('@str$ == "ミハイル") {
					mes "[アンナ]";
					mes "ミハイルの話は聞きたくない！";
					mes "弱虫だし、泣き虫だし！";
					mes "馬鹿なんだから！";
					next;
					mes "[アンナ]";
					mes "男の子はもっと強くなくっちゃ";
					mes "いけないの!!";
					mes "ミハイルなんて知らない！";
				}
				else {
					mes "[アンナ]";
					mes "ん～";
					mes "何だろう？";
					mes "私、知らな～い。";
				}
				break;
			case 5:
				mes "[アンナ]";
				mes "何よ！";
				mes "話すことなんて無いの！";
				next;
				mes "[アンナ]";
				mes "べーーーーーっだ！";
				next;
				mes "-アンナは舌を出して";
				mes "　私に見せている。";
				mes "　どうやら、私の事が";
				mes "　気に入らないみたいだ-";
				close;
			}
		}
	case 3:
		mes "[" +strcharinfo(0)+ "]";
		mes "アンナに聞ける事は全部聞いたし、";
		mes "^3131FFアップルツリー旅館^000000へ行ってみよう。";
		close;
	case 25:
	case 100:
		mes "[アンナ]";
		mes "もうっ！！";
		mes "許さないんだから！";
		next;
		mes "-アンナは機嫌が悪いようだ-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "どうしたの？";
		next;
		mes "[アンナ]";
		mes "ミハイルがお母さんに告げ口したの！";
		mes "ミハイルなんか嫌い！";
		next;
		mes "[カリーナ]";
		mes "アンナ!!";
		mes "ミハイルのことを";
		mes "悪く言うんじゃありません！";
		mes "そんな悪いこと言う子には";
		mes "パンケーキを作ってあげませんよ！";
		next;
		mes "[アンナ]";
		mes "っ！！！！！！";
		next;
		emotion 28;
		mes "[アンナ]";
		mes "う～……";
		mes "ごめんなさい……";
		close;
	default:
		if(MOSK_2QUE < 12) {
			mes "[アンナ]";
			mes "ミハイルは臆病者！";
			mes "ミハイルの泣き虫！";
			next;
			mes "[アンナ]";
			mes "いなくなるなんて、";
			mes "ずるいじゃないの……";
			mes " ";
			mes "-アンナは小さな声で";
			mes "　何かをつぶやいている-";
			close;
		}
		mes "[アンナ]";
		mes "ん～";
		mes "ひ～ま～";
		mes "つまんな～い！";
		next;
		mes "[アンナ]";
		mes "何か面白いこと無いかな～";
		close;
	}

}

mosk_in.gat,136,279,0	script	ベッド#mosk1	111,{
	mes "-ベッドの上には綺麗な";
	mes "　布団がかかっている。";
	mes "　綺麗でフカフカな枕だ。";
	mes "　このベッドならすぐに";
	mes "　眠れそうな気がする-";
	if(MOSK_2QUE != 11)
		close;
	next;
	if(select("他の物を調べる","ベッドを詳しく調べる") == 1) {
		mes "-ベッドを調べるのを止めた-";
		close;
	}
	mes "-ベッドの上を調べ始めた-";
	next;
	mes "-まずは布団から調べる。";
	mes "　フカフカな手触りだ。";
	mes "　いい素材を使っている";
	mes "　のだろう-";
	next;
	mes "-布団には特に異常は";
	mes "　無いようだ-";
	next;
	mes "-枕を調べ始める-";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "！！！！！！！";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "最高の手触り！";
	mes "極上の質感！";
	mes "（この枕は本当に";
	mes "　よく眠れそうだ……）";
	next;
	mes "-ベッドには特に異常は無かった-";
	close;
}
mosk_in.gat,161,279,3	duplicate(ベッド#mosk1)	ベッド#mosk2	111

mosk_in.gat,205,268,0	script	石窯	111,{
	switch(MOSK_2QUE) {
	case 0:
		mes "-家庭用の石窯がある。";
		mes "　暖房と料理の機能を";
		mes "　かね備えた便利な「かま」だ-";
		close;
	case 1:
		mes "-カリーナさんが";
		mes "　パンケーキを焼く時";
		mes "　使うと言う石窯。";
		mes "　長年使っている為か、";
		mes "　年期が入っている-";
		set MOSK_2QUE,2;
		close;
	case 2:
	case 3:
	case 4:
	case 5:
	case 6:
	case 7:
	case 8:
	case 9:
	case 10:
		mes "-カリーナさんが";
		mes "　パンケーキを焼く時";
		mes "　使うと言う石窯。";
		mes "　長年使っている為か、";
		mes "　年期が入っている-";
		close;
	case 11:
		mes "-カリーナさんが";
		mes "　パンケーキを焼く時";
		mes "　使うと言う石窯。";
		mes "　長年使っている為か、";
		mes "　年期が入っている-";
		next;
		if(select("他の物を調べる","石窯を詳しく調べる") == 1) {
			mes "-石窯を調べるのをやめた-";
			close;
		}
		mes "-石窯を調べ始めた-";
		next;
		mes "-まずは石窯の周辺を調べる。";
		mes "　保温性が高そうな良い石を";
		mes "　使っているようだ-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……ん？";
		mes " ";
		mes "-何かお酒の香りがしている-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "（どこから匂ってくるのだろう？）";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "！！！！！！！";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "この匂いは……";
		mes "お酒の匂い!?";
		next;
		mes "-石窯の前にパンの欠片が";
		mes "　落ちている！-";
		next;
		mes "-パンの欠片を掴む-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "これは!?";
		next;
		switch(select("ミハイルは石窯の中にいる？","ミハイルは石窯の近くにいる？","パンの欠片とミハイルは関係ない？")) {
		case 1:
			mes "-石窯の取っ手を掴み、";
			mes "　勢いよく扉を開けた！-";
			next;
			mes "[？？？？]";
			mes "わわっ！";
			next;
			mes "-石窯の奥の方から";
			mes "　ビックリしたような";
			mes "　声が聞こえる-";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "見つけた！";
			next;
			mes "-石窯の穴の中に手を伸ばす-";
			next;
			mes "-窯の中から伸ばした手を";
			mes "　逃れるように体を動かす音が";
			mes "　聞こえてきた-";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "（怖がっているのかな？）";
			next;
			mes "-小さな声でささやいてみる-";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "そこにいるのはミハイル？";
			mes "私は" +strcharinfo(0)+ "。";
			mes "お母さんから";
			mes "ミハイルくんの捜索を";
			mes "頼まれたんだよ。";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "ミハイルでしょう？";
			next;
			mes "-沈黙が返ってくる-";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "ミハイル。";
			mes "奥から出てきてくれないかな？";
			next;
			mes "-再度、沈黙が返ってくる-";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "（ミハイルは怯えて";
			mes "　いるのかもしれない。";
			mes "　落ち着いて聞いてみよう）";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "お姉ちゃんも、お母さんも";
			mes "心配しているよ。";
			mes "そこから出ておいで。";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "（うーん、何の反応も無いか？）";
			next;
			mes "[？？？？]";
			mes "………………だよ。";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "！！！！！！！！";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "何ていったの？";
			mes "良く聞こえないよ。";
			next;
			mes "[ミハイル]";
			mes "…………だめ…………だよ。";
			mes "ボク…………怒られちゃう…………";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "そんな事ないよ。";
			mes "何の心配してるのかな？";
			next;
			mes "[ミハイル]";
			mes "だって……………";
			mes "………お姉ちゃんが………";
			mes "………グスン。";
			next;
			mes "-ミハイルは泣いているようだ-";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "皆心配しているんだよ。";
			mes "お姉ちゃんだって心配しているよ。";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "マトリョーシカ人形を壊したのは";
			mes "わざとじゃないんでしょう？";
			mes "皆知っているから大丈夫だよ！";
			next;
			mes "[ミハイル]";
			mes "う～……グスン。";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "何があったのか話してごらん。";
			next;
			mes "[ミハイル]";
			mes "……マトリョーシカ……";
			mes "人形……";
			mes "ボクが壊したわけじゃ……無いよ。";
			next;
			mes "[ミハイル]";
			mes "おねえ……ちゃんが";
			mes "お姉ちゃんが……壊したんだ。";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "え!?";
			next;
			mes "[ミハイル]";
			mes "お姉ちゃんがボクが";
			mes "知らないうちに";
			mes "お母さんの作った";
			mes "パンケーキを食べてたんだ……";
			next;
			mes "[ミハイル]";
			mes "それで……ボクにもちょうだい";
			mes "って言ったら、";
			mes "お姉ちゃんが怒りだしたんだ。";
			next;
			mes "[ミハイル]";
			mes "お姉ちゃんだけが食べるのは";
			mes "ずるいって言い返したら、";
			mes "これは私が貰ったんだから";
			mes "って言って、";
			mes "近くのマトリョーシカ人形を";
			mes "つかんで、ボクに投げたんだ……";
			next;
			mes "[ミハイル]";
			mes "そしたら、ボクにあたって、";
			mes "マトリョーシカ人形が";
			mes "床に落ちて……";
			mes "……グスン。";
			next;
			mes "[ミハイル]";
			mes "壊れちゃった……";
			mes "う～……グスン。";
			next;
			mes "[ミハイル]";
			mes "それなのに……";
			mes "お姉ちゃんはボクが……";
			mes "ボクが……壊したって";
			mes "お母さんに言ったんだもん。";
			mes "ズズー…ズズー…グスン。";
			next;
			mes "-ミハイルの顔は泣きすぎて";
			mes "　クシャクシャになっている-";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "……お姉ちゃんに投げられて";
			mes "壊れたのに、それは言わなかったの？";
			next;
			mes "[ミハイル]";
			mes "……うん。";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "それじゃ、早くお母さんに";
			mes "本当の事を言いに行こう。";
			next;
			mes "-カリーナの所へ行こうと";
			mes "　石窯から離れようとする-";
			next;
			mes "[ミハイル]";
			mes "だ、ダメだよ！";
			next;
			mes "-暗い石窯の中から";
			mes "　小さな白い手が出てきて";
			mes "　私の腕を掴む-";
			next;
			mes "[ミハイル]";
			mes "ダメだよ……";
			mes "お母さん……絶対に怒る。";
			next;
			mes "[ミハイル]";
			mes "マトリョーシカ人形は";
			mes "あの人形は……";
			mes "おばあ……ちゃんの";
			mes "形見なんだもん……";
			mes "う～……グスン。";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "（マトリョーシカ人形は";
			mes "　お婆ちゃんの形見だったのか……";
			mes "　何とか直せないかな？）";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "もう泣かないで。";
			mes "ミハイルはマトリョーシカ人形を";
			mes "直そうとしてたんだから。";
			next;
			mes "[ミハイル]";
			mes "でも……ボクじゃ接着剤を";
			mes "取りにいけなかったんだもん。";
			mes "……シクシク。";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "それじゃ、私が接着剤を";
			mes "取ってこようか？";
			mes "そしたら、ミハイルが";
			mes "マトリョーシカ人形を直して、";
			mes "お母さんに謝る？";
			next;
			mes "[ミハイル]";
			mes "接着剤……";
			mes "……持って来てくれるの？";
			next;
			mes "-ミハイルは心配そうな顔を";
			mes "　しながらも、少し安心したようだ-";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "心配しなくても大丈夫!!";
			mes "すぐに持ってきてあげる!!";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "（接着剤か……";
			mes "　先ずは材料の確認をしないと……";
			mes "　^3131FFブルーク酒場のヴィクトール^000000に";
			mes "　詳しく聞いてみよう）";
			set MOSK_2QUE,12;
			close;
		case 2:
			mes "-パンの欠片は新鮮な香りがする-";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "今日、誰かが食べたのかな？";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "（ミハイルは石窯の";
			mes "　近くに居る気がする";
			mes "　どこにいるんだろう？）";
			close;
		case 3:
			mes "-パンの欠片からは";
			mes "　お酒の香りがしている-";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "この石窯は最近使われてない";
			mes "ように見えるけど……";
			next;
			mes "-パンの香りは周辺に漂っている-";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "このパンの欠片と";
			mes "お酒の匂いはどこから？";
			close;
		}
	case 12:
		mes "[" +strcharinfo(0)+ "]";
		mes "接着剤か……";
		mes "（先ずは^3131FFブルーク酒場のヴィクトール^000000に";
		mes "　接着剤の材料を";
		mes "　詳しく聞いてみよう）";
		close;
	case 24:
		mes "[" +strcharinfo(0)+ "]";
		mes "ミハイル！";
		next;
		mes "-トントンと石窯を叩いて";
		mes "　扉を開ける-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "接着剤を持ってきたよ！";
		next;
		mes "[ミハイル]";
		mes "……え!?";
		mes "本当に？";
		next;
		mes "-石窯の奥のほうから";
		mes "　驚いた様子の声が聞こえる-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "本当だよ！";
		mes "もう、心配いらないから";
		mes "出ておいで！";
		next;
		hideoffnpc "ミハイル#mosk";
		mes "-石窯からミハイルが出てくる。";
		mes "　ずっと石窯の中にいたためか、";
		mes "　ミハイルは灰まみれだ-";
		next;
		mes "-ミハイルは不安そうな顔で、";
		mes "　見つめている-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "はい！";
		next;
		mes "-灰まみれのミハイルに";
		mes "　ヴィクトールから";
		mes "　貰った接着剤を渡す-";
		next;
		mes "[ミハイル]";
		mes "うああー!!";
		mes "これだよ!!";
		mes "この接着剤があれば";
		mes "直せるよ！";
		next;
		mes "-ミハイルは目をキラキラさせて";
		mes "　喜んでいる-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "ミ、ミハイル。";
		mes "はいが、灰が舞ってる！";
		next;
		mes "-ミハイルをテーブルの";
		mes "　上にあったタオルで";
		mes "　綺麗に拭く-";
		next;
		mes "-すると、ミハイルは";
		mes "　接着剤を巧みに使い、";
		mes "　壊れたマトリョーシカ人形を";
		mes "　器用に繋ぎ合わせた-";
		next;
		mes "[ミハイル]";
		mes "やった!!";
		mes "直ったよ！";
		mes "本当にありがとう!!";
		next;
		mes "-ミハイルは大感激のようだ。";
		mes "　やった！　やった！　と言って";
		mes "　飛び跳ねている-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "どう致しまして。";
		mes "それより、一つ約束をしよう。";
		next;
		mes "[ミハイル]";
		mes "やくそく？";
		next;
		mes "-ミハイルはきょとんとしながら、";
		mes "　私を見つめた-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "そう、約束！";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "これからは";
		mes "すぐに泣かないって約束しよう。";
		next;
		mes "[ミハイル]";
		mes "すぐに泣かない……？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "そう！";
		mes "マトリョーシカ人形も";
		mes "直ったんだから、";
		mes "強くならなくっちゃね。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "ミハイルなら何だって";
		mes "やれば解決できる。";
		mes "だからミハイルは";
		mes "すぐに泣いたりしない事！";
		next;
		mes "[ミハイル]";
		mes "でも……";
		mes "ボク何もしてない。";
		mes "何もできなかった。";
		mes "……だから…………";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "そんなことないよ。";
		mes "人形を直す為に、";
		mes "ミハイルは必死に";
		mes "走り回ったんだから。";
		next;
		mes "-ミハイルはハッとした目で";
		mes "　私を見返す-";
		next;
		mes "[ミハイル]";
		mes "うん。";
		mes "わかった。";
		mes "ボク、すぐに泣いたりしないよ。";
		next;
		mes "-ミハイルは笑顔で約束をした-";
		next;
		mes "[ミハイル]";
		mes "それじゃ、ボク……";
		mes "お母さんにマトリョーシカ人形を";
		mes "返して、謝ってくるよ。";
		next;
		mes "[ミハイル]";
		mes strcharinfo(0)+ "。";
		mes "いろいろとありがとう！";
		next;
		mes "-ミハイルは元気一杯で";
		mes "　お礼の言葉を私に投げかけ、";
		mes "　カリーナの部屋の方へ";
		mes "　走っていった-";
		hideonnpc "ミハイル#mosk";
		delitem 7764,1;
		set MOSK_2QUE,25;
		next;
	default:
		mes "-家庭用の石窯がある。";
		mes "　暖房と料理の機能を";
		mes "　両方兼ね備えているようだ-";
		close;
	}
}

mosk_in.gat,202,269,5	script	ミハイル#mosk	962,{
	end;
OnInit:
	hideonnpc;
	end;
}

mosk_in.gat,135,191,5	script	旅館の女将さん	961,{
	mes "[旅館の女将さん]";
	mes "あら、いらっしゃい！";
	mes "ここはモスコビア随一の旅館、";
	mes "アップルツリーよ！";
	next;
	switch(MOSK_2QUE) {
	case 3:
		switch(select("位置をセーブする","休む - 5000z","ミハイルの事を聞く")) {
		case 1:
			savepoint "mosk_in.gat",142,189;
			mes "[旅館の女将さん]";
			mes "はい、位置セーブしたわよ。";
			mes "またよろしくお願いね。";
			close;
		case 2:
			if(Zeny < 5000){
				mes "[旅館の女将さん]";
				mes "旅館の利用料は 5000z よ。";
				mes "所持金を確かめてちょうだいね？";
				close;
			}
			mes "[旅館の女将さん]";
			mes "ゆっくりと休んでいらっしゃい。";
			close2;
			set Zeny,Zeny-5000;
			percentheal 100,100;
			warp "mosk_in.gat",215,181;
			end;
		case 3:
			emotion 3;
			mes "[旅館の女将さん]";
			mes "あらあら、ハンサムなお兄さんね。";
			mes "でも、旅の疲れのせいなのかしら？";
			mes "顔色がちょっと悪いみたいよ。";
			next;
			mes "[旅館の女将さん]";
			mes "どう？　お客さんの疲れを癒す";
			mes "最高級のスイートルームがあるわよ。";
			mes "一晩泊まっていかない？";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "あの……すみません。";
			mes "泊まりに来たんじゃなくて……";
			mes "ちょっと聞きたい事が";
			mes "あるんですけど……";
			next;
			emotion 23;
			mes "[旅館の女将さん]";
			mes "何ですって!?";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "い、いえ……";
			mes "たいしたことじゃ";
			mes "無いんです。";
			mes "ミハイル君のことで少し……";
			next;
			mes "[旅館の女将さん]";
			mes "あ～ら、そうなの。";
			mes "ミハイルくんのことなのね。";
			next;
			mes "-旅館の女将は一瞬だけ";
			mes "　考え込むそぶりを見せた-";
			next;
			mes "[旅館の女将さん]";
			mes "何を聞きたいのかは";
			mes "わからないけれど考えてみたら、";
			mes "会ったばかりの旅人さんに";
			mes "ミハイルくんのことを";
			mes "簡単に教えるわけには";
			mes "いかないわね。";
			next;
			mes "[旅館の女将さん]";
			mes "お客さんならミハイルくんのことも";
			mes "サービスしてあげたいところだけど、";
			mes "ただの通りすがりの旅人に";
			mes "そこまで親切にする義務なんて";
			mes "無いと思いません？";
			next;
			mes "[旅館の女将さん]";
			mes "そうね～";
			mes "この旅館で一晩泊まったら、";
			mes "ミハイルくんのことを";
			mes "教えてあげようかしら。";
			mes "どう？　一晩泊まってみない？";
			next;
			if(select("断る","一晩泊まって、ミハイルのことを聞く - 5000z") == 1) {
				emotion 7;
				mes "[旅館の女将さん]";
				mes "あら？　泊まってくれないの？";
				mes "いつでも待ってるから、";
				mes "いらっしゃいね。";
				close;
			}
			if(Zeny < 5000){
				mes "[旅館の女将さん]";
				mes "あら……";
				mes "あなたお金が足りないじゃないの。";
				mes "冷やかしはダメよ。";
				mes "いつでも待ってるから、";
				mes "いらっしゃいね。";
				close;
			}
			mes "[旅館の女将さん]";
			mes "あ～ら、気前がいいわね！";
			mes "さあ、こちらへどうぞ～";
			next;
			mes "[旅館の女将さん]";
			mes "早く上がってくださいね～";
			mes "そうだ、荷物は私が持ちますから。";
			mes "それじゃ、ゆっくり休んで";
			mes "くださいね。";
			close2;
			set MOSK_2QUE,4;
			set Zeny,Zeny-5000;
			percentheal 100,100;
			warp "mosk_in.gat",215,181;
			end;
		}
	case 4:
	case 5:
		mes "[旅館の女将さん]";
		mes "あ～ら、早起きなのね！";
		mes "あなた若いから元気が";
		mes "あり余っているのかしら。";
		mes "ふふふ。";
		while(1) {
			next;
			switch(select("アップルツリー旅館について聞く","ミハイルについて聞く","会話をやめる")) {
			case 1:
				mes "[旅館の女将さん]";
				mes "この旅館は、街の外にある";
				mes "大きいリンゴの木から名前を";
				mes "取ってるのよ。";
				next;
				mes "[旅館の女将さん]";
				mes "あの森の中で、自分の存在感を";
				mes "しっかりと出しているリンゴの";
				mes "木の様に、このモスコビアの";
				mes "名所になって欲しいと思って、";
				mes "名づけた名前なの。";
				mes "ふふふ。";
				break;
			case 2:
				mes "[旅館の女将さん]";
				mes "ミハイルくんの話だったわね。";
				mes "たしか、イバノッフ家の";
				mes "息子さんよね？";
				mes "そう言えば、最近来てたわね……";
				next;
				mes "[旅館の女将さん]";
				mes "何か壊したみたいで、";
				mes "接着剤が必要って言ってたけど、";
				mes "顔色も悪くてね。";
				next;
				mes "[旅館の女将さん]";
				mes "ブルブル震えていたのよ……";
				mes "肩を落として、";
				mes "本当に可哀想に見えたわ。";
				next;
				mes "[" +strcharinfo(0)+ "]";
				mes "それで、どうなりました？";
				mes "ミハイルに接着剤をあげましたか？";
				next;
				mes "[旅館の女将さん]";
				mes "いえ、それがね……";
				mes "私はそういった物の事は";
				mes "さっぱり分からなくて……";
				mes "主人は詳しいけど……";
				mes "今は……留守ですし……";
				next;
				mes "[旅館の女将さん]";
				mes "それで……";
				next;
				mes "[" +strcharinfo(0)+ "]";
				mes "……それで？";
				next;
				mes "[旅館の女将さん]";
				mes "奥の部屋の酒場に";
				mes "知っている男がいるから、";
				mes "そこで聞いてみたらって、";
				mes "言ってあげたのよ。";
				mes "もちろん、ミハイルくんは子供だから";
				mes "酒を飲んではダメって忠告してね。";
				next;
				mes "[" +strcharinfo(0)+ "]";
				mes "それで、ミハイルは酒場へ";
				mes "行きました？";
				next;
				mes "[旅館の女将さん]";
				mes "そうね。";
				mes "あの子……本当に必死だったし……";
				mes "酒場に行ったと思うわ。";
				mes "あんな表情で頼まれたことなんて、";
				mes "今までなかったんだから。";
				mes "よっぽどのことがあったんでしょうね。";
				next;
				mes "[" +strcharinfo(0)+ "]";
				mes "そうですか……";
				mes "わかりました。";
				next;
				mes "[旅館の女将さん]";
				mes "あなたに泊まってもらったのは";
				mes "そのくらい真剣になっている人にしか";
				mes "教えたくなかったからなのよ。";
				mes "見ず知らずの人に";
				mes "話すことではないから。";
				next;
				mes "[旅館の女将さん]";
				mes "そうそう。";
				mes "泊まりごこちは良かったかしら？";
				mes "また、日が暮れたら来てちょうだい。";
				mes "いつでも、待ってるわよ！";
				next;
				mes "[" +strcharinfo(0)+ "]";
				mes "（ミハイルは酒場へ";
				mes "　行ったのかな？";
				mes "　奥の部屋の酒場で";
				mes "　話を聞いてみよう）";
				set MOSK_2QUE,7;
				close;
			case 3:
				mes "[旅館の女将さん]";
				mes "あら？　休まないの？";
				next;
				mes "[旅館の女将さん]";
				mes "休みたいなら、絶対ここよ。";
				mes "アップルツリー旅館に";
				mes "勝る所はないわ!!";
				mes "上質なサービスを整えて、";
				mes "待ってるわ!!";
				close;
			}
		}
	default:
		if(select("位置セーブする","休む - 5000z") == 1) {
			savepoint "mosk_in.gat",142,189;
			mes "[旅館の女将さん]";
			mes "はい、セーブしたわ。";
			mes "ご利用ありがとうございますね。";
			close;
		}
		if(Zeny < 5000) {
			mes "[旅館の女将さん]";
			mes "旅館利用料は 5000z ですよ。";
			mes "所持金を確かめてちょうだいね。";
			close;
		}
		mes "[旅館の女将さん]";
		mes "では、ごゆっくりどうぞ。";
		close2;
		set Zeny,Zeny-5000;
		warp "mosk_in.gat",215,181;
		percentheal 100,100;
		end;
	}
}

mosk_in.gat,215,181,0	script	宿屋#mosk	139,1,1,{
	if(MOSK_2QUE != 4)
		end;
	mes "[" +strcharinfo(0)+ "]";
	mes "グー……グー……";
	mes "……………………";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "グー……グー……";
	mes "……………………";
	mes "ムニャムニャ……";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "グー……グー……";
	mes "……………………";
	mes "ムニャムニャ……";
	mes "ウーン……………";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "ファアア…………";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "ファアア…………";
	mes "………………ン？";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "寝すぎたかな……";
	mes "何時間くらい寝たんだろ……";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "ミハイルのことを聞くために";
	mes "泊まったけど、良い旅館では";
	mes "あったのかも。";
	mes "疲れが取れたみたいだし。";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "（とりあえず、一晩泊まったし";
	mes "　女将さんの所へ行ってみようかな。";
	mes "　約束したミハイルのことを";
	mes "　聞いてみよう）";
	set MOSK_2QUE,5;
	close;
}

mosk_in.gat,141,212,3	script	パブのマスター	964,{
	switch(MOSK_2QUE) {
	case 7:
		mes "[パブのマスター]";
		mes "いらっしゃい！";
		mes "どんな人でも歓迎ですよ！";
		mes "ここは^3131FFブルーク酒場^000000";
		mes "アレクサンドロ。";
		mes "私のことは「シャシャ」と";
		mes "呼んでください。";
		next;
		if(select("ミハイルの行方を聞く","飲み物を頼む") == 2) {
			mes "[シャシャ]";
			mes "冒険者の方ですか……";
			mes "随分お若いですね。";
			mes "ふむ……お客さんには";
			mes "これらの飲み物が";
			mes "良いかもしれませんね。";
			mes "どっちにしますか？";
			next;
			switch(select("ミルク - 1000z","リンゴジュース - 1000z","高いです!!")) {
			case 1:
				set '@itemid,519;
				break;
			case 2:
				set '@itemid,531;
				break;
			case 3:
				mes "[シャシャ]";
				mes "ハハッ。";
				mes "観光地とはそういうものですよ。";
				mes "それに、ここは酒場ですしね。";
				mes "お客さんも一杯どうです？";
				close;
			}
			if(Zeny < 1000) {
				mes "[シャシャ]";
				mes "お客さん。";
				mes "お金が足りないみたいですね……";
				mes "いくら商売だからって、";
				mes "無料ってわけには行きませんよ。";
				next;
				mes "[シャシャ]";
				mes "まぁ……";
				mes "旅行や冒険には";
				mes "お金がたくさん必要なのは";
				mes "わかりますけどね。";
				close;
			}
			set Zeny,Zeny-1000;
			getitem '@itemid,1;
			set MOSK_2QUE,9;
			mes "[シャシャ]";
			mes "はい、ご注文の" +getitemname('@itemid)+ "です！";
			mes "モスコビアの印象はいかがですか？";
			next;
		}
		mes "[" +strcharinfo(0)+ "]";
		mes "シャシャ、";
		mes "最近ミハイルと言う男の子が";
		mes "ここに来なかった？";
		next;
		mes "[シャシャ]";
		mes "あ！　可愛いお坊ちゃんですよね？";
		mes "はい、確かに来てましたよ。";
		mes "必死な顔で、強力な接着剤が";
		mes "必要だと言ってましたね。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "それで、ミハイルになんて？";
		next;
		mes "[シャシャ]";
		mes "残念ですが、私は接着剤の事は";
		mes "知りません。";
		mes "ですから、接着剤の事に";
		mes "詳しい男を紹介してあげましたよ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "それは誰ですか？";
		next;
		mes "[シャシャ]";
		mes "部屋の隅で飲んでいる男、";
		mes "ヴィクトールです。";
		mes "結構、ヒステリックな人でして、";
		mes "^3131FFハリネズミのヴィクトール^000000と";
		mes "呼ばれてますね……";
		next;
		mes "[シャシャ]";
		mes "まぁ、接着剤に関しては、";
		mes "一番詳しいと思いますよ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "シャシャ、ありがとう!!";
		next;
		mes "[シャシャ]";
		mes "どう致しまして～";
		if(MOSK_2QUE != 9)
			set MOSK_2QUE,8;
		close;
	case 8:
		mes "[シャシャ]";
		mes "酒場で働くと、色んなお客さんの";
		mes "話が聞けますね。";
		mes "色んな人生の様々な話……";
		mes "そこら辺の小説よりも";
		mes "真に迫っていて面白いですよ。";
		next;
		mes "[シャシャ]";
		mes "お客さんたちの話を聞いていると、";
		mes "一日なんて、あっという間に";
		mes "過ぎてしまいますしね。";
		mes "パブのマスターは";
		mes "本当に楽しいものですよ。";
		mes "ハハハ。";
		next;
		mes "[シャシャ]";
		mes "お客さんの話を";
		mes "聞かせてくれませんか？";
		mes "それとも、何かお飲み物を";
		mes "先に出しましょうか？";
		next;
		switch(select("ミルク - 1000z","リンゴジュース - 1000z","高すぎます！")) {
		case 1:
			set '@itemid,519;
			break;
		case 2:
			set '@itemid,531;
			break;
		case 3:
			mes "[シャシャ]";
			mes "ハハッ。";
			mes "観光地とはそういうものですよ。";
			mes "それに、ここは酒場ですしね。";
			mes "お客さんも一杯どうです？";
			close;
		}
		if(Zeny < 1000) {
			mes "[シャシャ]";
			mes "お客さん。";
			mes "お金が足りないみたいですね……";
			mes "いくら商売だからって、";
			mes "無料ってわけには行きませんよ。";
			next;
			mes "[シャシャ]";
			mes "まぁ……";
			mes "旅行や冒険には";
			mes "お金がたくさん必要なのは";
			mes "わかりますけどね。";
			close;
		}
		set Zeny,Zeny-1000;
		getitem '@itemid,1;
		set MOSK_2QUE,9;
		mes "[シャシャ]";
		mes "さあ、ご注文の" +getitemname('@itemid)+ "です。";
		mes "ごゆっくりどうぞ。";
		close;
	case 9:
		mes "[シャシャ]";
		mes "ヴィクトールとは";
		mes "話してみましたか？";
		close;
	default:
		mes "[パブのマスター]";
		mes "いらっしゃい！";
		mes "ここは^3131FFブルーク酒場^000000アレクサンドロ。";
		mes "私のことは「シャシャ」と";
		mes "呼んでください。";
		next;
		mes "[パブのマスター]";
		mes "今日もいい天気ですね。";
		mes "私も外へ飛び出して";
		mes "行きたいくらいですよ。";
		mes "ハハハハハ。";
		close;
	}
}

mosk_in.gat,147,202,3	script	ヴィクトール	968,{
	switch(MOSK_2QUE) {
	case 8:
		mes "[" +strcharinfo(0)+ "]";
		mes "あの……";
		mes "聞きたい事があるんですけど、";
		mes "少しお話を聞いていただいても";
		mes "いいですか？";
		next;
		mes "[ヴィクトール]";
		mes "君は誰だい？";
		mes "僕の貴重な時間を貸せっていうの？";
		mes "見ての通り、僕はグラスの中の酒を";
		mes "存分に楽しんでいる最中なんだ。";
		mes "貴重な時間を無駄に取らないでくれ。";
		next;
		mes "[ヴィクトール]";
		mes "君はここに飲みに";
		mes "来たんじゃないのかい？";
		next;
		mes "-ヴィクトールは酒場で";
		mes "　何も飲んでいない私が";
		mes "　気に入らないようだ-";
		close;
	case 9:
		mes "[" +strcharinfo(0)+ "]";
		mes "あの……";
		mes "聞きたい事があるんですけど、";
		mes "少しお話を聞いていただいても";
		mes "いいですか？";
		next;
		mes "[ヴィクトール]";
		mes "君は誰だい？";
		mes "僕の貴重な時間を貸せって";
		mes "言うのかい？";
		mes "見ての通り、僕はグラスの中のお酒を";
		mes "存分に楽しんでいる最中なんだ。";
		mes "貴重な時間を無駄に取らないでくれ。";
		next;
		mes "[ヴィクトール]";
		mes "ん？";
		mes "君もここに飲みに来ているのか？";
		mes "まあ、いい。";
		mes "一人で飲む酒はまずいからね！";
		next;
		mes "[ヴィクトール]";
		mes "よーし、特別に飲みながら";
		mes "話を聞こう。";
		mes "遠慮せずに話してくれ！";
		next;
		mes "-ヴィクトールは豪快に";
		mes "　酒を飲みながら、";
		mes "　叫ぶように話を切り出した-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "えーと……";
		mes "接着剤を探している子供に";
		mes "会いませんでした？";
		next;
		mes "[ヴィクトール]";
		mes "んー…………………";
		next;
		mes "[ヴィクトール]";
		mes "それは……";
		mes "ミハイルの事か？";
		mes "ミハイルがどうかしたのか？";
		next;
		mes "[ヴィクトール]";
		mes "まあ、最近会ったミハイルは";
		mes "何か様子が変だったけどな……";
		mes "僕は何もしてないぞ？";
		mes "何でミハイルのことを聞きたいんだ？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "ミハイルがお母さんの";
		mes "マトリョーシカ人形を";
		mes "壊したみたいで、";
		mes "人形を直す為に接着剤を探しに、";
		mes "あなたの所にきたと思うんです。";
		next;
		mes "-ヴィクトールは眉をしかめる-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "ミハイルは家を出てから";
		mes "未だに帰ってきていません。";
		mes "ミハイルがどこに行ったのか";
		mes "わからなくって、";
		mes "家族が心配しているんです。";
		next;
		mes "[ヴィクトール]";
		mes "………………何？";
		mes "それは……まずいな……";
		mes "まさか……あっちに行ったりは";
		mes "してないよな……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "あっち……？";
		next;
		mes "[ヴィクトール]";
		mes "ああ。";
		mes "ババヤガや怖い生き物が";
		mes "たくさん生息している所だよ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "その場所はどこですか？";
		next;
		mes "[ヴィクトール]";
		mes "そうだな……";
		mes "……なんというか。";
		next;
		mes "-ヴィクトールには";
		mes "　何か言いにくいことが";
		mes "　あるようだ-";
		next;
		mes "[ヴィクトール]";
		mes "ミハイルは……";
		mes "泣きながら接着剤が必要だと、";
		mes "言ってたよ。";
		mes "どうしても直さなきゃいけない";
		mes "って言い張ってね……";
		next;
		mes "[ヴィクトール]";
		mes "そうは言っても子供のいう事だろ？";
		mes "最初は子供のわがままを";
		mes "言っているんだろうって";
		mes "聞いてたんだけど……";
		next;
		mes "[ヴィクトール]";
		mes "まあ、ミハイルがあまりに";
		mes "真剣だったから、";
		mes "僕だって困惑して……";
		mes "接着剤の材料の場所を";
		mes "教えてあげたんだよ。";
		next;
		mes "[ヴィクトール]";
		mes "……僕は接着剤に詳しいけど、";
		mes "持ち歩いたりはしてないんだ。";
		mes "だから、材料を持って来れば、";
		mes "接着剤を作ってあげると";
		mes "約束したのさ。";
		next;
		mes "[ヴィクトール]";
		mes "接着剤の材料は、";
		mes "モスコビアの街から";
		mes "ずっと遠くに行った";
		mes "未開の島にあるんだ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "未開の島……";
		next;
		mes "[ヴィクトール]";
		mes "そう、未開の島だ。";
		mes "ほとんど人間の手が入っていない";
		mes "手付かずの島があるんだよ。";
		next;
		mes "[ヴィクトール]";
		mes "その島の中に沼があって";
		mes "沼の中央に接着剤の";
		mes "材料があるんだ。";
		next;
		mes "[ヴィクトール]";
		mes "その島には恐ろしい";
		mes "モンスターだって";
		mes "たくさんいる。";
		mes "とても危険な島だよ。";
		next;
		mes "[ヴィクトール]";
		mes "そして、島にはババヤガという";
		mes "モンスターがいる……";
		mes "極めつけはババヤガの大好物……";
		mes "……………";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "大好物は？";
		next;
		mes "[ヴィクトール]";
		mes "ババヤガの大好物は……";
		mes "子供なんだ……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "ええ!?";
		next;
		mes "[ヴィクトール]";
		mes "ミハイルみたいな";
		mes "可愛い子を見ると、よだれを出して";
		mes "飛びつくだろうね……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "そんな……";
		next;
		mes "[ヴィクトール]";
		mes "まあ……色々怖い話はミハイルに";
		mes "しておいたし……";
		mes "あんな泣き虫がそこまで行くわけが";
		mes "ないか……";
		next;
		mes "[ヴィクトール]";
		mes "まぁ、ちょっと大げさに言ったけど、";
		mes "でも、危ない所であるのは確かだろ？";
		mes "それに、ミハイルの様な子供が";
		mes "そこへ行くなんて、絶対に無理だよ。";
		next;
		mes "[ヴィクトール]";
		mes "しかも、最近は未開の島に行く";
		mes "船は無いんだ。";
		mes "あの島の付近は海流が強くて";
		mes "本当に大きな船じゃないと";
		mes "近寄ることもできないのさ。";
		next;
		mes "[ヴィクトール]";
		mes "ミハイルは自分が";
		mes "行けない所だってわかると";
		mes "泣くのもやめて";
		mes "黙り込んじゃってさ。";
		next;
		mes "[ヴィクトール]";
		mes "だから、あいつには";
		mes "僕の酒のつまみだった";
		mes "パンを二つ持たせたんだよ。";
		next;
		mes "[ヴィクトール]";
		mes "接着剤の材料集めは諦めて";
		mes "家に帰るように言っておいたよ。";
		next;
		mes "[ヴィクトール]";
		mes "マトリョーシカ人形を";
		mes "壊しただけで、";
		mes "あんなに必死になるなんてね。";
		next;
		mes "[ヴィクトール]";
		mes "まあ、最近は船も出ていないし、";
		mes "材料を求めに沼までは";
		mes "行けないと思うけどね……";
		next;
		mes "[ヴィクトール]";
		mes "とはいえ、あれからミハイルの姿が";
		mes "見えないことは気になるね……";
		mes "昔のように大きな船のような";
		mes "乗り物があると行けるんだろうけど……";
		mes "まさか……な。";
		next;
		mes "-お礼を言って別れを告げる-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "（ヴィクトールは家にいると";
		mes "　いっているけど、";
		mes "　本当に家にいるのだろうか。";
		mes "　もしかして、ミハイルは";
		mes "　未開の島へ向かって";
		mes "　しまったのではないだろうか？）";
		next;
		mes "-不安がよぎる-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "（今ならミハイルに";
		mes "　追いつけるかもしれない。";
		mes "　未開の島の沼の中……";
		mes "　ミハイルが向かうとしたら、";
		mes "　そこしかないけど、";
		mes "　どうやって……）";
		set MOSK_2QUE,10;
		close;
	case 10:
	case 11:
		mes "[ヴィクトール]";
		mes "モスコビアの周りには";
		mes "大きな未開の島がある。";
		mes "昔は定期的に船がでていたけど、";
		mes "今は行く人は少ないんじゃないかな。";
		mes "まぁ、どう言うわけか";
		mes "あの島の噂話は耳に入るからね……";
		next;
		mes "[ヴィクトール]";
		mes "島の森の奥には沼があってね。";
		mes "その沼の中央に";
		mes "接着剤の材料となる";
		mes "ネチョネチョする草が";
		mes "生えているんだ。";
		next;
		mes "[ヴィクトール]";
		mes "まあ、いくら必死でも、";
		mes "そんなに大変な道を";
		mes "ミハイルのような子供が";
		mes "行けるとは思えないけどな。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "（ミハイルはまだ見つかっていない。";
		mes "　やっぱり、ミハイルは未開の島へ";
		mes "　向かったのだろうか？";
		mes "　未開の島の沼の中……";
		mes "　ミハイルが向かうとしたら、";
		mes "　そこだろうけど……）";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "（なんとか向かって";
		mes "　みるしかないか……）";
		close;
	case 12:
		mes "[ヴィクトール]";
		mes "また来たのか？";
		mes "まさか……";
		mes "ミハイルがいなくなった事を";
		mes "僕のせいにする気なのかい？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "ミハイルは見つけましたよ。";
		mes "心配には及びません。";
		next;
		mes "[ヴィクトール]";
		mes "そうか、それは良かった。";
		mes "なら……僕に何の用だい？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "ミハイルの代わりに";
		mes "私が接着剤を作ろうと";
		mes "思いまして、作り方を教えて";
		mes "頂きたいんですけど。";
		next;
		mes "[ヴィクトール]";
		mes "へえ……そうか。";
		mes "壊れたマトリョーシカ人形は";
		mes "どんな状態なんだい？";
		mes "何もそこまでして直す必要が";
		mes "ある物なのか？";
		mes "まぁ、僕の知った事ではないけど……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……………………";
		next;
		mes "[ヴィクトール]";
		mes "わかった……";
		mes "教えてあげるよ。";
		mes "他ならぬ、ミハイルのことだし。";
		mes "あんなミハイルを放っておいたら、";
		mes "本当にあの島へ行きかねないしな。";
		next;
		mes "-ヴィクトールはミハイルの";
		mes "　ことを思い出したのか、";
		mes "　苦笑しながら呟いた-";
		next;
		mes "[ヴィクトール]";
		mes "接着剤の作成には";
		mes "ネチョネチョ草が必要だ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "ネチョネチョ草？";
		next;
		mes "[ヴィクトール]";
		mes "そう、ネチョネチョ草だ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "それはどこに行けば手に入るの？";
		next;
		mes "[ヴィクトール]";
		mes "ネチョネチョ草は";
		mes "モスコビアの周りの大きな島で";
		mes "手に入れることができる。";
		mes "まあ、島までは船で行くのが";
		mes "いいだろうね。";
		next;
		mes "[ヴィクトール]";
		mes "島の森の奥には沼があるんだけど、";
		mes "沼の中央にネチョネチョ草が";
		mes "生えているんだ。";
		mes "なんにしても時間は掛かるな。";
		mes "沼までの道は険しいしね……";
		mes "誰も行きたがらない所なんだよ。";
		next;
		mes "[ヴィクトール]";
		mes "接着剤を作りたければ、";
		mes "その沼の中央に生えている";
		mes "^3131FF「ネチョネチョ草 10個」^000000と";
		mes "^3131FF「乳鉢 1個」^000000を持って来てくれ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "（ヴィクトールが言っている沼は";
		mes "　ミハイルを探しに行ったときの";
		mes "　あの場所だろうか？）";
		set MOSK_2QUE,13;
		close;
	case 13:
	case 14:
	case 15:
	case 16:
	case 17:
	case 18:
	case 19:
	case 20:
	case 21:
	case 22:
		mes "[ヴィクトール]";
		mes "接着剤を作りたいなら、";
		mes "沼の中央に生えている";
		mes "^3131FF「ネチョネチョ草 10個」^000000と";
		mes "^3131FF「乳鉢 1個」^000000を持って来てくれ。";
		mes "まぁ、少し危険かも知れないけど、";
		mes "君になら簡単だろう？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "（ヴィクトールが言っている沼は";
		mes "　ミハイルを探しに行ったときの";
		mes "　あの場所だろうか？）";
		close;
	case 23:
		mes "[ヴィクトール]";
		mes "今度はまた何だい？";
		mes "あ、そうだ。";
		mes "接着剤が必要だって言ったよな～";
		mes "全く世話が焼ける……";
		next;
		if(countitem(7763) < 10 || countitem(7134) < 1) {
			mes "[ヴィクトール]";
			mes "あれ……";
			mes "接着剤の材料が足りないじゃないか。";
			mes "言っただろう？";
			mes "^3131FF「ネチョネチョ草 10個」^000000と";
			mes "^3131FF「乳鉢 1個」^000000が必要なんだよ。";
			next;
			mes "[ヴィクトール]";
			mes "酒場にいるからって、";
			mes "暇だと思われると困るんだけどな……";
			mes "早く持ってこないと、僕だって";
			mes "他に用事もあるし……";
			next;
			mes "[ヴィクトール]";
			mes "ミハイルの頼みだって言うから";
			mes "聞いてるって言うのに……";
			next;
			mes "[ヴィクトール]";
			mes "………………";
			mes "何のんびりしてるんだよ。";
			mes "早く接着剤の材料を";
			mes "持ってきなよ！";
			close;
		}
		mes "[ヴィクトール]";
		mes "早く材料を渡してくれ。";
		mes "作ってやるからさ！";
		next;
		mes "-ヴィクトールに材料を";
		mes "　渡すと乳鉢にネチョネチョ草を";
		mes "　放り込んだ。";
		mes "　そして凄い速さで";
		mes "　かき回し始める-";
		next;
		mes "[ヴィクトール]";
		mes "はぁあああーーー！";
		next;
		mes "[ヴィクトール]";
		mes "せぃーーーー！";
		next;
		mes "[ヴィクトール]";
		mes "やぁーーーー！";
		next;
		mes "[ヴィクトール]";
		mes "こいつーーーー！";
		next;
		mes "-ヴィクトールは汗まみれで";
		mes "　なにやら叫んでいる-";
		next;
		mes "[ヴィクトール]";
		mes "まだかーーーー！";
		mes "……っぐ！";
		next;
		mes "-ヴィクトールは";
		mes "　顔を真っ赤にして";
		mes "　かき回している-";
		next;
		mes "[ヴィクトール]";
		mes "……";
		next;
		mes "[ヴィクトール]";
		mes "……";
		mes "…………";
		next;
		mes "[ヴィクトール]";
		mes "……";
		mes "…………";
		mes "………………っ！";
		next;
		mes "[ヴィクトール]";
		mes "これでどうだーーーー！";
		next;
		mes "-一際大きな声で叫んだあと";
		mes "　ヴィクトールは手を止めた-";
		next;
		mes "[ヴィクトール]";
		mes "ふぅーー……";
		next;
		mes "[ヴィクトール]";
		mes "さぁ、出来たぞ！";
		next;
		mes "-ヴィクトールは";
		mes "　真っ赤な顔のまま満足そうに";
		mes "　接着剤を私に渡す-";
		next;
		mes "[ヴィクトール]";
		mes "接着剤は確かに渡したぞ！";
		mes "これで、僕には";
		mes "構わないでほしいな！";
		mes "ちゃんと、ミハイルに";
		mes "渡してくれよ！";
		delitem 7763,10;
		delitem 7134,1;
		set MOSK_2QUE,24;
		getitem 7764,1;
		close;
	default:
		mes "[ヴィクトール]";
		mes "ふぅ……";
		mes "何かな？";
		mes "僕は、静かに酒が飲みたい";
		mes "だけなんだけどな。";
		close;
	}
}

mosk_dun03.gat,153,90,0	script	泡立つ沼	844,{
	mes "-見ただけで、息が詰まりそうな";
	mes "　大きい沼が見える-";
	next;
	mes "-薄暗い気泡が泡立ち";
	mes "　何だか気味の悪い雰囲気を";
	mes "　かもし出している-";
	if(MOSK_2QUE == 10) {
		next;
		mes "-周辺を見渡し、";
		mes "　子供の気配を確認する-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "ここに誰かが来たような";
		mes "痕跡は見当たらないか……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "ここまでの道のりでも";
		mes "小さな子供の足跡は";
		mes "見当たらなかったし。";
		mes "とりあえず、ミハイルの家に";
		mes "戻ろう……";
		set MOSK_2QUE,11;
	}
	else if(MOSK_2QUE >= 13 && MOSK_2QUE <= 22) {
		next;
		mes "-沼の底に手を入れて、";
		mes "　ネチョネチョ草を";
		mes "　手触りで探してみた-";
		next;
		mes "-指先に何かが引っかかった！-";
		if(rand(2)) {
			set MOSK_2QUE,MOSK_2QUE+1;
			getitem 7763,1;
		}
		else {
			getitem 511,1;
		}
	}
	close;
}

mosk_in.gat,211,259,5	script	ラリサ	960,{
	switch(MOSK_2QUE) {
	case 100:
		mes "[ラリサ]";
		mes "あら～";
		mes "奥様の言っていた";
		mes strcharinfo(0)+ "さん";
		mes "ですよね？";
		mes "お坊ちゃんを見つけて";
		mes "下さったと聞きました。";
		next;
		mes "[ラリサ]";
		mes "本当に感謝しています。";
		mes "お坊ちゃんは本当に可愛くて";
		mes "良い子ですから。";
		next;
		mes "[ラリサ]";
		mes "お礼に、特製のパンケーキを";
		mes "用意しました。";
		mes "お口に合うと良いのですけれど……";
		set MOSK_2QUE,101;
		getitem 592,5;
		getitem 593,5;
		next;
		mes "[ラリサ]";
		mes "パンケーキが食べたく";
		mes "なったら、遠慮なく";
		mes "私におっしゃって下さいね。";
		mes "おいし～く焼いてあげますよ。";
		close;
	case 101:
		mes "[ラリサ]";
		mes "この前のパンケーキは";
		mes "いかがでしたか？";
		mes "美味しかったですか？";
		mes "ふふっ。";
		mes "それとも新しいパンケーキを";
		mes "焼いてみます？";
		next;
		if(select("焼く","やめる")==2) {
			mes "[ラリサ]";
			mes "それじゃ、また今度焼きましょう。";
			mes "私はいつでも歓迎ですからね！";
			close;
		}
		if(countitem(7031) < 1 || countitem(519) < 2 || countitem(548) < 1 || countitem(504) < 2 || countitem(1019) < 1 || countitem(518) < 1) {
			mes "[ラリサ]";
			mes "それでは焼きましょう！";
			mes "でも、基本の材料と";
			mes "トッピングの具はありますけど……";
			mes "足りない材料は用意して頂かないと";
			mes "作れませんね……";
			next;
			mes "[ラリサ]";
			mes "え～と、材料は……";
			mes "^3131FF古いフライパン 1個、";
			mes "ミルク 2個、チーズ 1個、";
			mes "白ポーション 2個、木屑 1個、";
			mes "ハチ蜜 1個^000000が必要です……";
			mes "材料を揃えて来てくださいね！";
			close;
		}
		mes "[ラリサ]";
		mes "えと……材料を確認しましょう。";
		mes "フライパンにミルク……";
		mes "生地を柔らかくするポーション、";
		mes "チーズ、ハチ蜜、火を起こす為の木屑。";
		mes "完璧ですね！";
		next;
		mes "[ラリサ]";
		mes "では、小麦粉を練り上げましょう。";
		mes "え～と、この小麦粉にベーキング";
		mes "パウダーと砂糖をいれますよ。";
		mes "ふるい器を使うと綺麗に";
		mes "混ざるんですよ。";
		next;
		mes "[ラリサ]";
		mes "だから、小麦粉は……？";
		next;
		switch(select("全部一気に入れる","ふるい器で丁寧に混ぜる","スプーンで混ぜる")) {
		case 1:
			mes "[ラリサ]";
			mes "ええ～～っ!?";
			mes "何てことをしようと";
			mes "してるんですか!?";
			mes "最初からやり直しです！";
			mes "小麦粉は、ふるい器で丁寧に";
			mes "混ぜるんですよ!!";
			break;
		case 2:
			mes "[ラリサ]";
			mes "そうです！";
			mes "砂糖とベーキングパウダーも";
			mes "一緒にふるい器で混ぜて";
			mes "くださいね～";
			break;
		case 3:
			mes "[ラリサ]";
			mes "ふるい器が無かったら";
			mes "スプーンを使いますけど、";
			mes "ふるい器があるので、";
			mes "便利なふるい器を";
			mes "使って作りましょう。";
			break;
		}
		next;
		mes "[ラリサ]";
		mes "ふるい器を使うと綺麗に";
		mes "練りあげる事ができるんです。";
		mes "さぁ、ここに卵と牛乳、ポーションを";
		mes "適量入れましょう。";
		mes "練りあげる時は、一つの方向へ";
		mes "丁寧に混ぜた方が良いんですよ。";
		next;
		if(select("物凄い速度で両方向で混ぜる","指示通りに従う") == 1) {
			mes "[ラリサ]";
			mes "ええっ!!!!!!!";
			mes "ダ、ダメです！";
			mes "乱暴に混ぜると仕上がりが";
			mes "酷くなります！";
			mes "パンが固くなるんです！";
		}
		else {
			mes "[ラリサ]";
			mes "あら～上手ですね！";
		}
		next;
		mes "[ラリサ]";
		mes "正しく混ぜると、焼くときに";
		mes "ふんわりと仕上がるんですよ。";
		mes "さて、焼いてみましょうか？";
		mes "フライパンに適量の練りを";
		mes "入れてください。";
		next;
		mes "[ラリサ]";
		mes "火は弱火にして、焼き具合に";
		mes "よる気泡の出来具合を";
		mes "見てください。";
		mes "気泡が出来て、穴が開いたら";
		mes "裏返してくださいね。";
		next;
		if(select("強火にする","今裏返そうか？") == 1) {
			mes "[ラリサ]";
			mes "あ!!";
			mes "ダメですよ！";
			mes "火を強くしようとしましたね！";
			mes "強火にすると、中は生のままで、";
			mes "表面だけ焦げてしまいます。";
			mes "じっと待ってください。";
		}
		else {
			mes "[ラリサ]";
			mes "ふむ。表面の焼き具合は……";
			mes "良いですね。";
			mes "本当に上手な仕上がりに";
			mes "なってますよ。";
		}
		next;
		mes "[ラリサ]";
		mes "さぁ……裏返してください。";
		mes "こんがり狐色になっているのが";
		mes "美味しそうですよね～";
		mes "トッピングは何にしましょうか？";
		mes "チーズとハチ蜜のシロップは基本";
		mes "トッピングで入りますけど……";
		next;
		switch(select("キャビア","マッシュルーム","ハニー","イチゴジャム","サワークリーム")) {
		case 1:
			mes "[ラリサ]";
			mes "キャビアですか？";
			mes "ちょうど1個分が残ってますよ！";
			mes "これは、贅沢なパンケーキですね！";
			mes "はい！　出来ました！";
			set '@itemid,591;
			break;
		case 2:
			mes "[ラリサ]";
			mes "マッシュルームですか？";
			mes "香りが良くなりますよ～";
			mes "はい！　出来ました！";
			set '@itemid,595;
			break;
		case 3:
			mes "[ラリサ]";
			mes "ハニーですね？　甘いから";
			mes "パンケーキとは相性が";
			mes "良いんですよ。";
			mes "はい！　出来ました！";
			set '@itemid,593;
			break;
		case 4:
			mes "[ラリサ]";
			mes "イチゴジャムはパンケーキを";
			mes "一層美味しくしてくれますよね～";
			mes "甘酸っぱさが良いですよね？";
			mes "はい！　出来ました！";
			set '@itemid,592;
			break;
		case 5:
			mes "[ラリサ]";
			mes "サワークリームですか？";
			mes "リフレッシュさせてくれる";
			mes "食材ですよね？　ふふふ。";
			mes "はい！　出来ました！";
			set '@itemid,594;
			break;
		}
		delitem 7031,1;
		delitem 519,2;
		delitem 548,1;
		delitem 504,2;
		delitem 1019,1;
		delitem 518,1;
		getitem '@itemid,1;
		close;
	default:
		mes "[ラリサ]";
		mes "アンナお嬢様は";
		mes "ちょっと意地悪な面もありますが、";
		mes "ミハイルお坊ちゃんは";
		mes "とても優しい子ですよ。";
		next;
		mes "[ラリサ]";
		mes "でも……";
		mes "先ほどからお坊ちゃんが";
		mes "見当たらないんです……";
		close;
	}
}

//============================================================
// ババヤガの魔術クエストNPC
//- Registry -------------------------------------------------
// MOSK_3QUE -> 0～
//------------------------------------------------------------
mosk_in.gat,215,46,5	script	ババヤガ	970,7,7,{
	switch(MOSK_3QUE) {
	case 0:
	case 1:
		mes "[ババヤガ]";
		mes "なんだい？";
		mes "あたいが怖くないのかい？";
		mes "よしよし、こっちへ来な！";
		mes "ちょうど夕飯を何にしようか";
		mes "考えていたとこだよ。";
		mes "ヒーッヒッヒッヒ！";
		next;
		mes "-" +strcharinfo(0)+ "は逃げ出した-";
		close2;
		warp "mosk_dun02.gat",53,217;
		end;
	case 2:
		mes "[ババヤガ]";
		mes "ひいぃ……";
		mes "よ、寄るな！";
		mes "触るな！　近寄るな!!";
		next;
		mes "[ババヤガ]";
		mes "そ、そうだ！";
		mes "あたいを見逃すってんなら、";
		mes "いいものをあげよう！";
		next;
		if(select("いいもの？","いらない") == 1) {
			mes "[ババヤガ]";
			mes "そうだよ。";
			mes "お前が集めているきねを";
			mes "もっとやろう！";
			mes "集めているんだろう？";
			next;
			menu "これだけあれば十分だよ",-;
		}
		mes "[ババヤガ]";
		mes "うぐ……";
		mes "な、なら……";
		mes "傷口に塗る薬はどうだい!?";
		mes "少し臭うけど凄く良く効くんだよ！";
		mes "絶対に役に立つよ！";
		next;
		menu "別に……いらないけど？",-;
		mes "[ババヤガ]";
		mes "あーぅー……";
		mes "えぇい、ならこれでどうだい！";
		mes "あたいの魔術で、ここに二度と冬が";
		mes "来ない秘薬を作ってやるよ！";
		next;
		mes "[ババヤガ]";
		mes "多分、街の人間が喜ぶだろうし、";
		mes "王のチャールから褒美が貰えるかも";
		mes "知れないよ！";
		mes "どうだい、悪い話じゃないよ！";
		next;
		if(select("嘘じゃない？","興味がない") == 2) {
			mes "[ババヤガ]";
			mes "あーもう！";
			mes "あんたは一体何なんだい！";
			mes "あたいをどうしたら";
			mes "見逃してくれるんだい！";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "（さて、どうしたものか……）";
			set MOSK_3QUE,3;
			close;
		}
		mes "[ババヤガ]";
		mes "も、勿論だよ！";
		mes "嘘じゃないよ！";
		mes "まぁ……あたいも年なんで、";
		mes "材料集めやら何やら";
		mes "一人じゃできないけど……";
		next;
		mes "[ババヤガ]";
		mes "だから、あんたがちょっとだけ";
		mes "手伝ってくれればいいんだよ。";
		mes "そしたら、あたいが冬の来ない";
		mes "秘薬を完成させてやるよ！";
		next;
		if(select("いいよ、信じてあげる","やだよ、めんどい") == 2) {
			mes "[ババヤガ]";
			mes "そ、そう言わずに！";
			mes "そんなに大変じゃないからさ！";
			next;
			mes "[ババヤガ]";
			mes "だからね？";
			mes "これであたいを見逃しておくれよ！";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "（さて、どうしようか……）";
			set MOSK_3QUE,4;
			close;
		}
		mes "[ババヤガ]";
		mes "おぉ、そうかい！";
		mes "これで取引成立だね！";
		mes "ふぅ……命拾いした……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……一つ言っておくけど、";
		mes "別にあなたをどうこう";
		mes "しようなんて考えてなかったよ。";
		next;
		mes "[ババヤガ]";
		mes "…………ぇ？";
		next;
		mes "[ババヤガ]";
		mes "あー………………";
		next;
		mes "[ババヤガ]";
		mes "えぇい！";
		mes "それならそうとさっさと言いな！";
		mes "こちとらいつ襲われるかって";
		mes "ビクビクしてたんだからね！";
		next;
		mes "[ババヤガ]";
		mes "はぁ……まぁいいわ。";
		mes "あたいも暇だし、";
		mes "あんたの気が変わって襲われちゃ";
		mes "それこそたまんないからねぇ。";
		mes "さっきいった秘薬は約束通り";
		mes "完成させてあげるよ。";
		next;
		mes "[ババヤガ]";
		mes "っと……";
		mes "全然使ってないから、";
		mes "どこに魔術の本を置いたのか";
		mes "忘れてしまったよ……";
		mes "すぐ探すから、";
		mes "ちょっと待ってておくれ。";
		set MOSK_3QUE,5;
		close;
	case 3:
		mes "[ババヤガ]";
		mes "ひぃ！";
		mes "ま、また来た！";
		next;
		mes "[ババヤガ]";
		mes "ほら……ねぇ？";
		mes "さっきも言ったように、";
		mes "冬を無くしてしまえば";
		mes "チャールから凄い褒美が";
		mes "きっと貰えるんだよ！";
		next;
		mes "[ババヤガ]";
		mes "考えてもみてごらんよ！";
		mes "あたいに何かするより、";
		mes "英雄になって、褒美を貰った方が";
		mes "得だと思わないかい!?";
		next;
		if(select("ふむ……なら詳しく話して","どうかな……") == 2) {
			mes "[ババヤガ]";
			mes "ひぃー！！";
			mes "お願いだよ！";
			mes "損得で考えておくれよ！";
			next;
			mes "[ババヤガ]";
			mes "だからね？";
			mes "これであたいを見逃しておくれよ！";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "（さて、どうしようか……）";
			close;
		}
		mes "[ババヤガ]";
		mes "そ、その気になってくれたかい！";
		mes "まぁ……あたいも年なんで、";
		mes "材料集めやら何やら";
		mes "一人じゃできないけど……";
		next;
		mes "[ババヤガ]";
		mes "だから、あんたがちょっとだけ";
		mes "手伝ってくれればいいんだよ。";
		mes "そしたら、あたいが冬の来ない";
		mes "秘薬を完成させてやるよ！";
		next;
		if(select("いいよ、信じてあげる","やだよ、めんどい") == 2) {
			mes "[ババヤガ]";
			mes "そ、そう言わずに！";
			mes "そんなに大変じゃないからさ！";
			next;
			mes "[ババヤガ]";
			mes "だからね？";
			mes "これであたいを見逃しておくれよ！";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "（さて、どうしようか……）";
			set MOSK_3QUE,4;
			close;
		}
		mes "[ババヤガ]";
		mes "おぉ、そうかい！";
		mes "これで取引成立だね！";
		mes "ふぅ……命拾いしたわ……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……一つ言っておくけど、";
		mes "別にあなたをどうこう";
		mes "しようなんて考えてなかったよ。";
		next;
		mes "[ババヤガ]";
		mes "…………ぇ？";
		next;
		mes "[ババヤガ]";
		mes "あー………………";
		next;
		mes "[ババヤガ]";
		mes "えぇい！";
		mes "それならそうとさっさと言いな！";
		mes "こちとらいつ襲われるかって";
		mes "ビクビクしてたんだからね！";
		next;
		mes "[ババヤガ]";
		mes "はぁ……まぁいいわ。";
		mes "あたいも暇だし、";
		mes "あんたの気が変わって襲われちゃ";
		mes "それこそたまんないからねぇ。";
		mes "さっきいった秘薬は約束通り";
		mes "完成させてあげるよ。";
		next;
		mes "[ババヤガ]";
		mes "っと……";
		mes "全然使ってないから、";
		mes "どこに魔術の本を置いたのか";
		mes "忘れてしまったよ……";
		mes "すぐ探すから、";
		mes "ちょっと待ってておくれ。";
		set MOSK_3QUE,5;
		close;
	case 4:
		mes "[ババヤガ]";
		mes "考え直しておくれよ！";
		mes "少し手を借りるだけだよ！";
		mes "そんなに大変じゃないのに";
		mes "それだけでチャールから褒美が";
		mes "きっと貰えるんだよ！";
		next;
		if(select("……まぁ……良いよ","どうしよっかな……") == 2) {
			mes "[ババヤガ]";
			mes "お願いだよ！";
			mes "損得で考えておくれよ！";
			next;
			mes "[ババヤガ]";
			mes "だからね？";
			mes "これであたいを見逃しておくれよ！";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "（さて、どうしようか……）";
			close;
		}
		mes "[ババヤガ]";
		mes "おぉ、そうかい！";
		mes "これで取引成立だね！";
		mes "ふぅ……命拾いしたわ……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……一つ言っておくけど、";
		mes "別にあなたをどうこう";
		mes "しようなんて考えてなかったよ。";
		next;
		mes "[ババヤガ]";
		mes "…………ぇ？";
		next;
		mes "[ババヤガ]";
		mes "あー………………";
		next;
		mes "[ババヤガ]";
		mes "えぇい！";
		mes "それならそうとさっさと言いな！";
		mes "こちとらいつ襲われるかって";
		mes "ビクビクしてたんだからね！";
		next;
		mes "[ババヤガ]";
		mes "はぁ……まぁいいわ。";
		mes "あたいも暇だし、";
		mes "あんたの気が変わって襲われちゃ";
		mes "それこそたまんないからねぇ。";
		mes "さっきいった秘薬は約束通り";
		mes "完成させてあげるよ。";
		next;
		mes "[ババヤガ]";
		mes "っと……";
		mes "全然使ってないから、";
		mes "どこに魔術の本を置いたのか";
		mes "忘れてしまったよ……";
		mes "すぐ探すから、";
		mes "ちょっと待ってておくれ。";
		set MOSK_3QUE,5;
		close;
	case 5:
		mes "[ババヤガ]";
		mes "おやおや、よく見たら";
		mes "あたいのすぐそばに";
		mes "本があったよ。";
		mes "どれどれ……";
		mes "確か、季節の魔術は……";
		next;
		mes "[ババヤガ]";
		mes "ふむ……ふむ……";
		next;
		mes "[ババヤガ]";
		mes "んー…………";
		mes "何はともあれ、まずは材料だねぇ。";
		mes "それじゃあ前言ったように";
		mes "材料集めは頼んだよ。";
		next;
		mes "[ババヤガ]";
		mes "先ずは……";
		mes "バッタの足が20個で……";
		next;
		mes "[ババヤガ]";
		mes "フム……";
		mes "それに、菌糸が5個。";
		next;
		mes "[ババヤガ]";
		mes "それに……えっと……";
		mes "赤いコウモリの翼が20個。";
		next;
		mes "[ババヤガ]";
		mes "あと……えーっと……";
		mes "なんだったかねぇ……あれ……";
		mes "そう！　あれだよあれ";
		mes "べとべとする液体10個も";
		mes "必要だねぇ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……それ、本当に必要なの？";
		next;
		mes "[ババヤガ]";
		mes "そ……そうだよ……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "（何か嘘くさいなぁ……）";
		next;
		if(select("まぁ……わかったよ","……嘘だ！") == 1) {
			mes "[ババヤガ]";
			mes "ま、まぁ魔術にも色々あってね、";
			mes "不思議なものを色々使うのさね！";
			set '@flag,1;
		}
		else {
			mes "[ババヤガ]";
			mes "ヒッ！";
			mes "わ、悪かったよ……";
			mes "ちょっと今切れてたから";
			mes "ほしかっただけなんだよ……";
			next;
			mes "[ババヤガ]";
			mes "も、もう騙そうなんてしないから、";
			mes "そう怒らないでおくれよ……";
			set '@flag,0;
		}
		next;
		mes "[ババヤガ]";
		mes "さ、さて……";
		mes "他に必要な材料は……";
		next;
		mes "[ババヤガ]";
		mes "魔女の星の砂10個、";
		mes "きれいな小石10個……";
		next;
		mes "[ババヤガ]";
		mes "それに……これは陽気を";
		mes "生み出すものだね。";
		mes "雷管1個、";
		mes "レッドブラッド5個、";
		mes "燃えている心臓10個。";
		next;
		mes "[ババヤガ]";
		mes "最後に、不滅のシンボルである";
		mes "ダイヤモンド1個が必要だね。";
		mes "妙なものや傷ついているのは";
		mes "だめだけど、";
		mes "カラットはいくつでもいいさね。";
		next;
		mes "[ババヤガ]";
		mes "じゃあ、もう一回";
		mes "材料を言うからちゃんと";
		mes "覚えるんだよ。";
		next;
		mes "[ババヤガ]";
		mes "^FF0000バッタの足20個、";
		mes "菌糸5個、";
		mes "赤いコウモリの翼20個、";
		if('@flag) mes "べとべとする液体10個、";
		mes "魔女の星の砂10個^000000と……";
		next;
		mes "[ババヤガ]";
		mes "^FF0000きれいな小石10個、";
		mes "雷管1個、";
		mes "レッドブラッド5個、";
		mes "燃えている心臓10個^000000。";
		next;
		mes "[ババヤガ]";
		mes "そして、最後に傷が無い";
		mes "普通の^FF0000ダイヤモンド1個^000000。";
		mes "カラットはいくつでもいいさね。";
		next;
		mes "[ババヤガ]";
		mes "あたいはここで準備をしているから、";
		mes "あんたは材料を頼んだよ。";
		set MOSK_3QUE,'@flag? 6: 7;
		close;
	case 6:
	case 7:
		mes "[ババヤガ]";
		mes "おやおや、以外と早かったねぇ。";
		next;
		mes "[ババヤガ]";
		mes "こっちの準備はいいけど、";
		mes "そっちはどうだい？";
		mes "材料を見してもらうよ。";
		next;
		if(countitem(940) < 20 || countitem(7119) < 5 || countitem(7006) < 20 || (MOSK_3QUE == 6 && countitem(938) < 10) ||
			countitem(1061) < 10 || countitem(7041) < 10 || countitem(1051) < 5 || countitem(990) < 5 || countitem(7097) < 10 ||
			(countitem(730) < 1 && countitem(731) < 1 && countitem(732) < 1)) {
			mes "[ババヤガ]";
			mes "おや？";
			mes "材料が足りないみたいだねぇ。";
			next;
			mes "[ババヤガ]";
			mes "材料がないと何も始まらないよ。";
			mes "もう一度材料を言うから";
			mes "ちゃんと覚えるんだよ。";
			next;
			mes "[ババヤガ]";
			mes "^FF0000バッタの足20個、";
			mes "菌糸5個、";
			mes "赤いコウモリの翼20個、";
			if(MOSK_3QUE == 6) mes "べとべとする液体10個、";
			mes "魔女の星の砂10個^000000と……";
			next;
			mes "[ババヤガ]";
			mes "^FF0000きれいな小石10個、";
			mes "雷管1個、";
			mes "レッドブラッド5個、";
			mes "燃えている心臓10個^000000。";
			next;
			mes "[ババヤガ]";
			mes "そして、最後に傷が無い";
			mes "普通の^FF0000ダイヤモンド1個^000000。";
			mes "カラットはいくつでもいいさね。";
			close;
		}
		delitem 940,20;
		delitem 7119,5;
		delitem 7006,20;
		if(MOSK_3QUE == 6) delitem 938,10;
		delitem 1061,10;
		delitem 7041,10;
		delitem 1051,5;
		delitem 990,5;
		delitem 7097,10;
		if(countitem(730)) delitem 730,1;
		else if(countitem(731)) delitem 731,1;
		else if(countitem(732)) delitem 732,1;
		if(MOSK_3QUE == 6) {
			set MOSK_3QUE,8;
			mes "[ババヤガ]";
			mes "よしよし、全部揃っているみたいねぇ。";
			mes "フフ……これだけあれば、";
			mes "当分は大丈夫だねぇ……";
			next;
			mes "[ババヤガ]";
			mes "さて、材料が揃った所で、";
			mes "次はどうするのかねぇ……";
		}
		else {
			set MOSK_3QUE,8;
			mes "[ババヤガ]";
			mes "よしよし、全部揃っているみたいねぇ。";
			mes "さて、材料が揃った所で、";
			mes "次はどうするのかねぇ……";
		}
		next;
		mes "-ババヤガは本を読み出した-";
		next;
		mes "[ババヤガ]";
		mes "…………なッ！";
		mes "こんなのがいるのかい!?";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "ん？";
		mes "何か材料が抜けてた？";
		next;
		mes "[ババヤガ]";
		mes "まぁ……そんなとこだけど……";
		mes "これはちょっと……ねぇ……";
		next;
		mes "[ババヤガ]";
		mes "ここで長い間眠っている";
		mes "竜の話は知っているかい？";
		mes "その竜が持つ物が一つだけ";
		mes "必要みたいだよ。";
		next;
		mes "[ババヤガ]";
		mes "その竜の巣には、ひさご……";
		mes "と言っても想像がつかないかい？";
		mes "まぁ、不思議な形をした瓶が";
		mes "あるんだけど、その瓶には";
		mes "人の言葉を込めれるそうだよ。";
		next;
		mes "[ババヤガ]";
		mes "それが必要なんだけど……";
		mes "あんたがいくら強くても";
		mes "さすがに無理だろうねぇ。";
		next;
		mes "[ババヤガ]";
		mes "んー、代わりになる物は";
		mes "ないのかねぇ……";
		mes "まったく、無茶な事が書いてある";
		mes "本だねぇ！";
		close;
	case 8:
		mes "[ババヤガ]";
		mes "竜の巣から生きて帰るなんて";
		mes "考えない方がいいさね。";
		mes "相当な腕前の実力者でも";
		mes "命に関わるんだよ。";
		next;
		mes "[ババヤガ]";
		mes "命が惜しいなら、";
		mes "魔法のひさごはあきらめたほうが";
		mes "いいかもしれないねぇ……";
		mes "しかし、代わりなんてあるのかねぇ……";
		close;
	case 9:
		mes "[ババヤガ]";
		mes "それは……まさか!?";
		mes "そのひさごを竜の巣から";
		mes "とってきたってのかい!?";
		next;
		mes "[ババヤガ]";
		mes "スキを見て盗んだのか、";
		mes "竜を倒してきたのか";
		mes "知らないけど、どっちにせよ";
		mes "あんたはすごいねぇ……";
		next;
		mes "[ババヤガ]";
		mes "さて、そのひさごには";
		mes "人の声を込める事が可能だって";
		mes "言ったのは覚えてるかい？";
		next;
		mes "[ババヤガ]";
		mes "次にする事は、";
		mes "人々の本音を聞いて、";
		mes "そのひさごに入れてくる事さね。";
		next;
		mes "[ババヤガ]";
		mes "ただし、強引に言わせちゃいけないよ。";
		mes "「冬はもう来ないで！」";
		mes "って言ってください。";
		mes "なんて誘導するのは駄目なんだよ。";
		next;
		mes "[ババヤガ]";
		mes "自然と話を進めながら機会を";
		mes "うかがうのが良いさね。";
		mes "それに、もう一つ注意する事があるよ。";
		next;
		mes "[ババヤガ]";
		mes "全部で三人分の声を";
		mes "集めなきゃならないんだけど、";
		mes "子供、若者、年寄りと";
		mes "世代別に必要さね。";
		mes "ま、年寄りはある程度";
		mes "若者より年上なら大丈夫かねぇ。";
		next;
		mes "[ババヤガ]";
		mes "あたいらがやろうとしている魔術は、";
		mes "人々の望みを力にしないと";
		mes "うまくいかないんだよ。";
		mes "難しいだろうけど";
		mes "がんばっておいで。";
		set MOSK_3QUE,10;
		close;
	case 10:
		mes "[ババヤガ]";
		mes "魔法のひさごに、";
		mes "冬が来ないで欲しいと願う";
		mes "言葉自体を詰めれば良いさね。";
		next;
		mes "[ババヤガ]";
		mes "でも、願う言葉を詰める。";
		mes "これには条件があるよ。";
		mes "まず一つ。";
		mes "強引に言わせない事。";
		next;
		mes "[ババヤガ]";
		mes "自然と話を進めながら機会を";
		mes "うかがうのが良いさね。";
		mes "それに、もう一つ注意する事があるよ。";
		next;
		mes "[ババヤガ]";
		mes "そしてもう一つ。";
		mes "子供、若者、年寄りと";
		mes "世代別に一人ずつ必要さね。";
		mes "ま、年寄りはある程度";
		mes "若者より年上なら大丈夫かねぇ。";
		next;
		mes "[ババヤガ]";
		mes "それじゃ、がんばっておいで。";
		close;
	case 14:
		mes "[ババヤガ]";
		mes "やれやれ。";
		mes "何をしたかしらないけど、";
		mes "チャールの兵隊共が";
		mes "いなくなったよ……";
		mes "そういえば、";
		mes "ちゃんと声は集めてきたかい？";
		next;
		mes "[ババヤガ]";
		mes "ん、大丈夫みたいだねぇ。";
		mes "それじゃ、このひさごは";
		mes "少し預かっておくよ。";
		delitem 7761,1;
		next;
		mes "[ババヤガ]";
		mes "それじゃ、次は実際の";
		mes "秘薬作りだよ。";
		mes "先ずはあたいが読んでいた";
		mes "この本を読みな。";
		next;
		mes "[ババヤガ]";
		mes "あたいも年でねぇ、";
		mes "ちょっと材料を組み合わせるのが";
		mes "辛いんだよ。";
		mes "なぁに、本の通りやればいいから";
		mes "あんたでもできるさね。";
		next;
		mes "[ババヤガ]";
		mes "本来はあんたにゃ到底";
		mes "読めない本だけど、";
		mes "今回の魔術に必要な所は";
		mes "あたいが訳しておいたよ。";
		next;
		mes "[ババヤガ]";
		mes "それじゃ、できたらあたいに";
		mes "見せにおいで。";
		set MOSK_3QUE,15;
		close;
	case 15:
	case 16:
		mes "[ババヤガ]";
		mes "魔術によって秘薬を完成させるのは、";
		mes "不思議な何かじゃないんだよ。";
		next;
		mes "[ババヤガ]";
		mes "本当に必要なのは";
		mes "何かを成し遂げようとする想い。";
		mes "強く望めば必ず叶うと言うだろう？";
		mes "それが魔術の本質なんだよ。";
		next;
		mes "[ババヤガ]";
		mes "あんたは強く想えばいい。";
		mes "あとは、本に書いてある通り";
		mes "そこの鍋に材料を入れて";
		mes "しばらく煮れば秘薬の完成さね。";
		close;
	case 17:
		mes "[ババヤガ]";
		mes "ふん……";
		mes "自分で作ってて、";
		mes "何かおかしいと思わなかったのかい？";
		next;
		mes "[ババヤガ]";
		mes "これじゃダメだね。";
		mes "材料はまだあるから、";
		mes "もう一回やってみな！";
		set MOSK_3QUE,16;
		close;
	case 18:
		mes "[ババヤガ]";
		mes "どれどれ……";
		next;
		mes "[ババヤガ]";
		mes "ほう……";
		mes "ちゃんと本に書いてある通り";
		mes "できたみたいだね。";
		mes "これなら大丈夫だよ。";
		next;
		mes "[ババヤガ]";
		mes "じゃ、これで本当に最後だよ。";
		mes "この秘薬を瓶につめてっと……";
		mes "さ、この瓶を街の中央で";
		mes "壊してくるんだよ。";
		next;
		mes "[ババヤガ]";
		mes "そしたら、人々の望み通り、";
		mes "この街に夏が続くようになるさね。";
		set MOSK_3QUE,19;
		getitem 7765,1;
		close;
	case 19:
		mes "[ババヤガ]";
		mes "街の中央……";
		mes "そうだねぇ、地面に変なマークが";
		mes "あるとこらへんかねぇ。";
		mes "そこでその秘薬を壊しておいで。";
		mes "そしたら、人々の望み通り、";
		mes "この街に夏が続くようになるさね。";
		next;
		mes "[ババヤガ]";
		mes "その後は、";
		mes "人々に自慢をするなり、";
		mes "チャールから褒美をもらうなり";
		mes "好きにしたらいいさね。";
		mes "ヒッヒッヒ。";
		close;
	default:
		mes "[ババヤガ]";
		mes "なんだい、あたいはもう";
		mes "約束は守ったろう？";
		mes "もう用は無いはずだよ。";
		next;
		mes "[ババヤガ]";
		mes "あたいはこう見えても";
		mes "忙しいんだから、";
		mes "もう来ないでおくれ。";
		close;
	}
OnTouch:
	switch(MOSK_3QUE) {
	case 0:
		if(countitem(7762) < 40) {
			mes "[ババヤガ]";
			mes "何者かは知らないけど、";
			mes "命が惜しかったら";
			mes "さっさと出ていきな！";
			set MOSK_3QUE,1;
			close2;
			warp "mosk_dun02.gat",53,217;
			end;
		}
		else if(BaseLevel < 60) {
			mes "[ババヤガ]";
			mes "なんだい、こんな所へ。";
			mes "ヒッヒッヒ。";
			mes "命が惜しくはないのかい？";
			next;
			mes "[ババヤガ]";
			mes "……ん？";
			mes "そ、それは……!?";
			next;
			mes "[ババヤガ]";
			mes "それはあたいらが使う";
			mes "きねじゃないか！";
			mes "しかも、そんなに沢山……";
			next;
			mes "[ババヤガ]";
			mes "……いやいや、まさかね。";
			mes "あたいらがお前のような";
			mes "青二才にやられるわけ無い！";
			mes "どこで盗んできたのか知らないけど、";
			mes "そのきねをさっさと返しな！";
			delitem 7762,rand(1,20);
			set MOSK_3QUE,1;
			close2;
			warp "mosk_dun02.gat",53,217;
			end;
		}
		set MOSK_3QUE,2;
		mes "[ババヤガ]";
		mes "なんだい、こんな所へ。";
		mes "ヒッヒッヒ。";
		mes "命が惜しくはないのかい？";
		next;
		mes "[ババヤガ]";
		mes "……ん？";
		mes "そ、それは……!?";
		next;
		mes "[ババヤガ]";
		mes "それはあたいらが使う";
		mes "きねじゃないか！";
		mes "しかも、そんなに沢山……";
		next;
		mes "[ババヤガ]";
		mes "一体……";
		mes "お前は……何者なんだい!?";
		close;
	case 1:
		if(countitem(7762) < 40) {
			mes "[ババヤガ]";
			mes "なんだい、また来たのかい？";
			mes "あたいが怖くないようだねぇ？";
			mes "よしよし、こっちへ来な！";
			mes "ちょうど夕飯を何にしようか";
			mes "考えていたとこだよ。";
			mes "ヒーッヒッヒッヒ！";
			next;
			mes "-" +strcharinfo(0)+ "は逃げ出した-";
			close2;
			warp "mosk_dun02.gat",53,217;
			end;
		}
		else if(BaseLevel < 60) {
			mes "[ババヤガ]";
			mes "おやおや、また来たのかい。";
			mes "若僧のくせに生意気だねぇ。";
			next;
			mes "[ババヤガ]";
			if(Sex) {
				mes "もしかしてあれかい？";
				mes "あたいに気があるのかい？";
				mes "それならそうと早く言いなよ。";
			}
			else {
				mes "おぉ、そうだそうだ。";
				mes "最近、体調が悪かったけど、";
				mes "お前を食べたら元気になりそうだ！";
			}
			mes "ヒーッヒッヒッヒ！";
			next;
			mes "-" +strcharinfo(0)+ "は逃げ出した-";
			close2;
			warp "mosk_dun02.gat",53,217;
			end;
		}
		set MOSK_3QUE,2;
		mes "[ババヤガ]";
		mes "おやおや、また来たのかい。";
		mes "ヒッヒッヒ。";
		mes "命が惜しくはないのかい？";
		next;
		mes "[ババヤガ]";
		mes "……ん？";
		mes "そ、それは……!?";
		next;
		mes "[ババヤガ]";
		mes "それはわしらが使う";
		mes "きねじゃないか！";
		mes "何でそんなにたくさんのきねを";
		mes "持っているんだい!?";
		next;
		mes "[ババヤガ]";
		mes "一体……";
		mes "お前は……何者なんだい!?";
		close;
	default:
		end;
	}
}

mosk_dun03.gat,225,233,0	script	骨の山	111,5,5,{
	if(MOSK_3QUE != 8) {
		mes "[" +strcharinfo(0)+ "]";
		mes "骨がたくさん積んである……";
		close;
	}
	mes "[" +strcharinfo(0)+ "]";
	mes "骨がたくさん積んである……";
	mes "いかにも何かありそうな所だ。";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "もうちょっと近付いて";
	mes "調べてみよう。";
	close;
OnTouch:
	if(MOSK_3QUE != 8)
		end;
	mes "[" +strcharinfo(0)+ "]";
	mes "骨がたくさん積んである……";
	mes "あるとすればこの辺りかな？";
	mes "人の言葉を込めれる";
	mes "ひさごがあるのは……";
	while(1) {
		next;
		if(select("探してみる","また今度にする") == 2) {
			mes "[" +strcharinfo(0)+ "]";
			mes "またの機会にしよう。";
			close;
		}
		if(getbaseclass(Class) == CLASS_TF) {
			mes "[" +strcharinfo(0)+ "]";
			mes "ま、職業柄こんなの";
			mes "見つけ出すのは簡単だね。";
			mes "……ふーん……";
			mes "これが人の言葉を";
			mes "込めれるひさごか……";
			set MOSK_3QUE,9;
			getitem 7761,1;
			close;
		}
		if(rand(20) < 5) {
			mes "[" +strcharinfo(0)+ "]";
			mes "あった！";
			mes "これが人の言葉を";
			mes "込めれるひさごか……";
			set MOSK_3QUE,9;
			getitem 7761,1;
			close;
		}
		mes "………………";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "ん……見つからないなぁ……";
		mes "もう少しよく探してみよう。";
	}
}

moscovia.gat,252,203,5	script	子供#mosk1	958,{
	if(MOSK_3QUE != 10 || MOSK_3QUE_SUB & 0x01) {
		mes "[子供]";
		mes "街の外には、";
		mes "人を食う恐ろしいババヤガが";
		mes "住んでるんだって！";
		next;
		mes "[子供]";
		mes "ママがそう言ってたんだよ！";
		mes "本当だよ！";
		close;
	}
	mes "[" +strcharinfo(0)+ "]";
	mes "ねぇねぇ、ちょっといいかな？";
	next;
	mes "[子供]";
	mes "ん、なぁに？";
	next;
	menu "夏は好きかな？",-;
	if(rand(10) < 7) {
		mes "[子供]";
		mes "夏は好きだけど、";
		mes "遊ぶ時間は冬と変わんないね。";
		mes "まだ明るくても、";
		mes "早く帰らないと怒られちゃう。";
		next;
		mes "[子供]";
		mes "ママはいっつも言うの。";
		mes "暗い時に外を出歩く悪い子は";
		mes "ババヤガに連れてかれるってさ。";
		close;
	}
	mes "[子供]";
	mes "うん！　ポカポカで大好き!!";
	mes "もう冬は来ないで欲しいなぁ～";
	misceffect 215,"";
	set MOSK_3QUE_SUB,MOSK_3QUE_SUB | 0x01;
	if(MOSK_3QUE_SUB == 0x07) {
		set MOSK_3QUE,11;
		set MOSK_3QUE_SUB,0;
	}
	close;
}

moscovia.gat,233,204,3	script	青年#mosk2	968,{
	if(MOSK_3QUE != 10 || MOSK_3QUE_SUB & 0x02) {
		mes "[青年]";
		mes "ふぅ……";
		mes "季節がどうなっても、";
		mes "俺の心はずっと冬のまま……か。";
		close;
	}
	mes "[青年]";
	mes "ふぅ……";
	mes "季節がどうなっても、";
	mes "俺の心はずっと冬のまま……か。";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "あの……ちょっといいですか？";
	next;
	mes "[青年]";
	mes "……何ですか？";
	next;
	menu "冬は……お嫌いですか？",-;
	if(rand(10) < 7) {
		mes "[青年]";
		mes "恋人がいれば、冬だって";
		mes "暖かいかも知れない……";
		mes "はは……俺には関係ない話か……";
		mes "……はぁ……もういい？";
		mes "一人にしてくれ……";
		close;
	}
	mes "[青年]";
	mes "そうだね……嫌い。";
	mes "寒いし、暖房代もかかる……";
	mes "何一つ良い事はないよ。";
	misceffect 215,"";
	set MOSK_3QUE_SUB,MOSK_3QUE_SUB | 0x02;
	if(MOSK_3QUE_SUB == 0x07) {
		set MOSK_3QUE,11;
		set MOSK_3QUE_SUB,0;
	}
	close;
}

moscovia.gat,219,229,5	script	おじさん#mosk3	964,{
	if(MOSK_3QUE != 10 || MOSK_3QUE_SUB & 0x04) {
		mes "[おじさん]";
		mes "ここの人は強健な身体と";
		mes "強い精神力が売りさ！";
		mes "一番の自慢だよ！";
		next;
		mes "[おじさん]";
		mes "寒い冬だって、";
		mes "我々にはへっちゃらってもんだ！";
		close;
	}
	mes "[" +strcharinfo(0)+ "]";
	mes "あの……ちょっといいですか？";
	next;
	mes "[おじさん]";
	mes "ん、何だい？";
	next;
	menu "冬は嫌いですか？",-;
	if(rand(10) < 7) {
		mes "[おじさん]";
		mes "ふむ、君は冬が嫌いなのか？";
		mes "私は鍛えたおかげで";
		mes "冬にも耐えれるようになったよ。";
		mes "どうだい、君も鍛えてみたら？";
		close;
	}
	mes "[おじさん]";
	mes "まぁな……";
	mes "冬がなくなると、";
	mes "誰だって喜ぶだろうな！";
	mes "いちいち寒さに耐えるなんて";
	mes "苦労を背負わなくていいからな！";
	misceffect 215,"";
	set MOSK_3QUE_SUB,MOSK_3QUE_SUB | 0x04;
	if(MOSK_3QUE_SUB == 0x07) {
		set MOSK_3QUE,11;
		set MOSK_3QUE_SUB,0;
	}
	close;
}

moscovia.gat,255,203,3	script	子供#mosk4	962,{
	if(MOSK_3QUE != 10 || MOSK_3QUE_SUB & 0x01) {
		mes "[子供]";
		mes "わー！　外国から来た人だ!!";
		mes "冒険者？　冒険者だよね？";
		next;
		mes "[子供]";
		mes "何か面白い話してよ!!";
		mes "竜とは戦ってみた？";
		mes "金色に光る剣や盾は持ってる？";
		mes "ねぇねぇ、早く話してよ！";
		close;
	}
	mes "[子供]";
	mes "わー！　外国から来た人だ!!";
	mes "冒険者？　冒険者だよね？";
	next;
	mes "[子供]";
	mes "ここには何しにきたの？";
	mes "冒険に出る時に雪が降ってたら";
	mes "どうするの？";
	next;
	menu "冒険には暖かくなってから行くかな？",-;
	if(rand(10) < 7) {
		mes "[子供]";
		mes "今度はどこへ行くの？";
		mes "いつ、行くの？";
		next;
		mes "[子供]";
		mes "口から火を噴き、";
		mes "一回の羽ばたきで、";
		mes "10人を倒すっていう竜を";
		mes "退治しに行くの？";
		close;
	}
	mes "[子供]";
	mes "そうなんだ。";
	mes "ボクもいつかは";
	mes "ピカピカ光る鎧を着て、";
	mes "金色に光る剣を持って";
	mes "冒険に出るんだよ！";
	next;
	mes "[子供]";
	mes "あーぁ、冬なんてこなくて、";
	mes "ずっと夏のままだったら";
	mes "毎日冒険できるんだろうなぁ。";
	misceffect 215,"";
	set MOSK_3QUE_SUB,MOSK_3QUE_SUB | 0x01;
	if(MOSK_3QUE_SUB == 0x07) {
		set MOSK_3QUE,11;
		set MOSK_3QUE_SUB,0;
	}
	close;
}

moscovia.gat,204,188,5	script	若いお姉さん#mosk5	959,{
	if(MOSK_3QUE != 10 || MOSK_3QUE_SUB & 0x02) {
		mes "[若いお姉さん]";
		mes "暖かい春がきて～";
		next;
		mes "[若いお姉さん]";
		mes "ひまわりが咲き～";
		close;
	}
	mes "[若いお姉さん]";
	mes "暖かい春がきて～";
	next;
	mes "[若いお姉さん]";
	mes "ひまわりが咲き～";
	next;
	menu "ご機嫌ですね～",-;
	if(rand(10) < 7) {
		mes "[若いお姉さん]";
		mes "えぇ、とっても。";
		mes "ひまわりが咲いたんですよ。";
		mes "これから毎日が楽しみです。";
		close;
	}
	mes "[若いお姉さん]";
	mes "えぇ、とっても。";
	mes "だって、暖かいんですもの！";
	next;
	mes "[若いお姉さん]";
	mes "冬はもうこないで欲しいです。";
	mes "きっとひまわりもそう思ってますよ。";
	misceffect 215,"";
	set MOSK_3QUE_SUB,MOSK_3QUE_SUB | 0x02;
	if(MOSK_3QUE_SUB == 0x07) {
		set MOSK_3QUE,11;
		set MOSK_3QUE_SUB,0;
	}
	close;
}

moscovia.gat,167,97,3	script	おばさん#mosk6	961,{
	if(MOSK_3QUE != 10 || MOSK_3QUE_SUB & 0x04) {
		mes "[おばさん]";
		mes "暖かくなったからって、";
		mes "子供たちは舞い上がっちゃって……";
		next;
		mes "[おばさん]";
		mes "もう日が暮れるし、";
		mes "そろそろ帰ってくるかねぇ。";
		close;
	}
	mes "[おばさん]";
	mes "暖かくなったからって、";
	mes "子供たちは舞い上がっちゃって……";
	next;
	menu "本当、暖かくなりましたね。",-;
	if(rand(10) < 7) {
		mes "[おばさん]";
		mes "そうだねぇ。";
		mes "暖かくなって子供も元気に";
		mes "外で遊んでいるよ。";
		next;
		mes "[おばさん]";
		mes "でも、おかげで洗濯が大変だよ。";
		mes "まぁ……元気な証拠だから";
		mes "しょうがないけどねぇ。";
		close;
	}
	mes "[おばさん]";
	mes "そうだねぇ。";
	mes "暖かくなって子供も元気に";
	mes "外で遊んでいるよ。";
	next;
	mes "[おばさん]";
	mes "冬は寒いし、暗い。";
	mes "良い事なんて何も無い。";
	mes "冬なんて来なきゃいいよ。";
	misceffect 215,"";
	set MOSK_3QUE_SUB,MOSK_3QUE_SUB | 0x04;
	if(MOSK_3QUE_SUB == 0x07) {
		set MOSK_3QUE,11;
		set MOSK_3QUE_SUB,0;
	}
	close;
}

moscovia.gat,202,102,3	script	子供#mosk7	962,{
	if(MOSK_3QUE != 10 || MOSK_3QUE_SUB & 0x01) {
		mes "[子供]";
		mes "怖い竜の話を知ってる？";
		next;
		mes "[子供]";
		mes "普段は自分の巣で寝てるけど、";
		mes "たまに外に出て、目に見える全てを";
		mes "焼き尽くすんだって。";
		next;
		mes "[子供]";
		mes "これは、うちのお婆ちゃんの";
		mes "お婆ちゃんのお婆ちゃんの";
		mes "お婆ちゃんの時からあった";
		mes "お話らしいよ。";
		close;
	}
	mes "[子供]";
	mes "怖い竜の話を知ってる？";
	next;
	mes "[子供]";
	mes "普段は自分の巣で寝てるけど、";
	mes "たまに外に出て、目に見える全てを";
	mes "焼き尽くすんだって。";
	next;
	mes "[子供]";
	mes "これは、うちのお婆ちゃんの";
	mes "お婆ちゃんのお婆ちゃんの";
	mes "お婆ちゃんの時からあった";
	mes "お話らしいよ。";
	next;
	menu "不思議な話が好きなの？",-;
	if(rand(10) < 7) {
		mes "[子供]";
		mes "うん！　好きだよ。";
		mes "うちのお婆ちゃんは";
		mes "色んなお話を聞かせてくれるんだよ。";
		close;
	}
	mes "[子供]";
	mes "うん！　好きだよ。";
	mes "でも、冬になると、";
	mes "あんまり外に出なくなるから、";
	mes "お婆ちゃんの知ってるお話以外が";
	mes "聞けなくなっちゃうんだ。";
	next;
	mes "[子供]";
	mes "冬が来なかったら、";
	mes "もっと面白い話をたくさん";
	mes "聞けるのになぁ……";
	misceffect 215,"";
	set MOSK_3QUE_SUB,MOSK_3QUE_SUB | 0x01;
	if(MOSK_3QUE_SUB == 0x07) {
		set MOSK_3QUE,11;
		set MOSK_3QUE_SUB,0;
	}
	close;
}

moscovia.gat,220,172,3	script	青年#mosk8	968,{
	if(MOSK_3QUE != 10 || MOSK_3QUE_SUB & 0x02) {
		mes "[青年]";
		mes "あ～ぁ、私もあなたの様に";
		mes "新しい世界に旅立ちたいです！";
		close;
	}
	mes "[青年]";
	mes "あ～ぁ、私もあなたの様に";
	mes "新しい世界に旅立ちたいです！";
	next;
	menu "それはいつ頃ですか？",-;
	if(rand(10) < 7) {
		mes "[青年]";
		mes "そうですね……";
		mes "ま、そのうちですね。";
		close;
	}
	mes "[青年]";
	mes "そうですね。";
	mes "こう暖かいと今すぐにでも";
	mes "旅に出たいと思います。";
	next;
	mes "[青年]";
	mes "でも、寒くなったら……";
	mes "寒くなったら旅どころか";
	mes "何もしたくなくなりますよね。";
	mes "まったく……冬は嫌いです。";
	misceffect 215,"";
	set MOSK_3QUE_SUB,MOSK_3QUE_SUB | 0x02;
	if(MOSK_3QUE_SUB == 0x07) {
		set MOSK_3QUE,11;
		set MOSK_3QUE_SUB,0;
	}
	close;
}

moscovia.gat,253,175,3	script	おじさん#mosk9	964,{
	if(MOSK_3QUE != 10 || MOSK_3QUE_SUB & 0x04) {
		mes "[おじさん]";
		mes "今のチャール様は少し厳しくて";
		mes "怖い方だけど、";
		mes "国民の事を思ってくれる";
		mes "とても良い方だね。";
		close;
	}
	mes "[" +strcharinfo(0)+ "]";
	mes "あの……ちょっといいですか？";
	next;
	mes "[おじさん]";
	mes "ん、何だい？";
	next;
	menu "冬は何をしていますか？",-;
	if(rand(10) < 7) {
		mes "[おじさん]";
		mes "まぁ、家の中で";
		mes "家族と一緒に過ごすかな。";
		mes "外は寒いからね。";
		close;
	}
	mes "[おじさん]";
	mes "冬は寒くて外にも出れない。";
	mes "雪もたくさん降るし、";
	mes "本当に不便だ。";
	next;
	mes "[おじさん]";
	mes "魚も全然取れやしない……";
	mes "冬なんて無くなれば良いのになぁ。";
	misceffect 215,"";
	set MOSK_3QUE_SUB,MOSK_3QUE_SUB | 0x04;
	if(MOSK_3QUE_SUB == 0x07) {
		set MOSK_3QUE,11;
		set MOSK_3QUE_SUB,0;
	}
	close;
}

moscovia.gat,168,135,3	script	おばさん#mosk10	961,{
	if(MOSK_3QUE != 10 || MOSK_3QUE_SUB & 0x04) {
		mes "[おばさん]";
		mes "何だか最近、外国の人が多いね。";
		next;
		mes "[おばさん]";
		mes "ここは観光名所でも無いと";
		mes "思うんだけど……";
		mes "まぁ、賑わうのはいいことさね。";
		close;
	}
	mes "[おばさん]";
	mes "何だか最近、外国の人が多いね。";
	next;
	mes "[おばさん]";
	mes "ここは観光名所でも無いと";
	mes "思うんだけど……";
	next;
	menu "ここは暖かくていい所ですから",-;
	if(rand(10) < 7) {
		mes "[おばさん]";
		mes "あっはっはっは！";
		mes "そんな事ないよ！";
		mes "冬になったら本当に寒くて、";
		mes "家から一歩も出られなくなるよ。";
		close;
	}
	mes "[おばさん]";
	mes "あっはっはっは！";
	mes "そんなの今だけさね！";
	mes "冬になったら本当に寒くて、";
	mes "家から一歩も出られなくなるよ。";
	next;
	mes "[おばさん]";
	mes "寒い冬が好きな人は";
	mes "ここにはいないだろうねぇ。";
	mes "まったく……冬なんて";
	mes "無くなっちゃえばいいのにねぇ？";
	mes "あっはっはっは。";
	misceffect 215,"";
	set MOSK_3QUE_SUB,MOSK_3QUE_SUB | 0x04;
	if(MOSK_3QUE_SUB == 0x07) {
		set MOSK_3QUE,11;
		set MOSK_3QUE_SUB,0;
	}
	close;
}

moscovia.gat,192,80,3	script	若いお姉さん#mosk11	959,{
	if(MOSK_3QUE != 10 || MOSK_3QUE_SUB & 0x02) {
		mes "[若いお姉さん]";
		mes "ひまわりは良いですよ。";
		mes "種で油を作れるし、";
		mes "茎では薬を作れます。";
		close;
	}
	mes "[若いお姉さん]";
	mes "ひまわりは良いですよ。";
	mes "種で油を作れるし、";
	mes "茎では薬を作れます。";
	next;
	menu "ひまわりはいつ咲きますか？",-;
	if(rand(10) < 7) {
		mes "[若いお姉さん]";
		mes "普通は夏に咲きますね。";
		mes "広い草原にひまわりが咲いている";
		mes "光景を目にしたら、あなたも";
		mes "ひまわりが好きになりますよ。";
		close;
	}
	mes "[若いお姉さん]";
	mes "普通は夏に咲きますね。";
	mes "広い草原にひまわりが咲いている";
	mes "光景を目にしたら、あなたも";
	mes "ひまわりが好きになりますよ。";
	next;
	mes "[若いお姉さん]";
	mes "夏がずっと続いてくれれば、";
	mes "きっと年中ひまわりが";
	mes "見れるでしょうね……";
	mes "もう冬が来ないといいのに……";
	misceffect 215,"";
	set MOSK_3QUE_SUB,MOSK_3QUE_SUB | 0x02;
	if(MOSK_3QUE_SUB == 0x07) {
		set MOSK_3QUE,11;
		set MOSK_3QUE_SUB,0;
	}
	close;
}

moscovia.gat,211,215,5	script	青年#mosk12	967,{
	if(MOSK_3QUE != 10 || MOSK_3QUE_SUB & 0x02) {
		mes "[青年]";
		mes "成功する人は言います！";
		mes "好機を狙えと!!";
		next;
		mes "[青年]";
		mes "暖かくなった今！";
		mes "女性のガードが緩くなった今！";
		mes "今こそが告白するチャンス！";
		close;
	}
	mes "[青年]";
	mes "成功する人は言います！";
	mes "好機を狙えと!!";
	next;
	mes "[青年]";
	mes "暖かくなった今！";
	mes "女性のガードが緩くなった今！";
	mes "今こそが告白するチャンス！";
	next;
	menu "暖かくなって良かったですね",-;
	if(rand(10) < 7) {
		mes "[青年]";
		mes "えぇ、これからが俺の出番！";
		mes "よーし、がんばるぞー！";
		close;
	}
	mes "[青年]";
	mes "えぇ、これからが俺の出番！";
	next;
	mes "[青年]";
	mes "ハッ！　そうか！";
	mes "ずっと冬さえ来なければ";
	mes "俺の人生はバラ色！";
	mes "かー！　冬はもう来るなー！";
	misceffect 215,"";
	set MOSK_3QUE_SUB,MOSK_3QUE_SUB | 0x02;
	if(MOSK_3QUE_SUB == 0x07) {
		set MOSK_3QUE,11;
		set MOSK_3QUE_SUB,0;
	}
	close;
}

moscovia.gat,149,112,3	script	おじさん#mosk13	964,{
	if(MOSK_3QUE != 10 || MOSK_3QUE_SUB & 0x04) {
		mes "[おじさん]";
		mes "俺にも君のような時があった。";
		mes "暑苦しい程夢中になり";
		mes "冒険に出ていた時が……";
		close;
	}
	mes "[おじさん]";
	mes "俺にも君のような時があった。";
	mes "暑苦しい程夢中になり";
	mes "冒険に出ていた時が……";
	next;
	menu "今はお休み中ですか？",-;
	if(rand(10) < 7) {
		mes "[おじさん]";
		mes "そうだな。";
		mes "ずっとこんな暖かい日差しを";
		mes "浴びながら休んでいたいもんだ。";
		close;
	}
	mes "[おじさん]";
	mes "そうだな。";
	mes "ずっとこんな暖かい日差しを";
	mes "浴びながら休んでいたいもんだ。";
	next;
	mes "[おじさん]";
	mes "今の暖かい天気がずっと続いて";
	mes "欲しいよ。";
	mes "寒い冬じゃ日光浴や散歩なんて";
	mes "全然できないからな。";
	misceffect 215,"";
	set MOSK_3QUE_SUB,MOSK_3QUE_SUB | 0x04;
	if(MOSK_3QUE_SUB == 0x07) {
		set MOSK_3QUE,11;
		set MOSK_3QUE_SUB,0;
	}
	close;
}

moscovia.gat,196,71,3	script	青年#mosk14	968,{
	if(MOSK_3QUE != 10 || MOSK_3QUE_SUB & 0x02) {
		mes "[青年]";
		mes "この地に生まれた男は";
		mes "広い海の荒い波を超え、";
		mes "大人になります。";
		next;
		mes "[青年]";
		mes "あなたは船が好きですか？";
		close;
	}
	mes "[青年]";
	mes "この地に生まれた男は";
	mes "広い海の荒い波を超え、";
	mes "大人になります。";
	next;
	menu "でも、冬は……",-;
	if(rand(10) < 7) {
		mes "[青年]";
		mes "おや、ご存知でしたか。";
		mes "そうですね。冬になると";
		mes "海に流氷が出来て、";
		mes "船を出せなくなりますね。";
		mes "まぁ、少し休憩ってことです。";
		close;
	}
	mes "[青年]";
	mes "おや、ご存知でしたか。";
	mes "そうですね。冬になると";
	mes "海に流氷が出来て、";
	mes "船を出せなくなりますね。";
	next;
	mes "[青年]";
	mes "冬が来ないと良いけど……";
	mes "ありえない話ですよね。";
	misceffect 215,"";
	set MOSK_3QUE_SUB,MOSK_3QUE_SUB | 0x02;
	if(MOSK_3QUE_SUB == 0x07) {
		set MOSK_3QUE,11;
		set MOSK_3QUE_SUB,0;
	}
	close;
}

moscovia.gat,234,168,5	script	おじさん#mosk15	964,{
	if(MOSK_3QUE != 10 || MOSK_3QUE_SUB & 0x04) {
		mes "[おじさん]";
		mes "あの王宮、格好いいと思わないか？";
		mes "あの王宮はな、俺の爺さんの";
		mes "爺さんが作ったんだよ。";
		close;
	}
	mes "[おじさん]";
	mes "あの王宮、格好いいと思わないか？";
	mes "あの王宮はな、俺の爺さんの";
	mes "爺さんが作ったんだよ。";
	next;
	mes "[おじさん]";
	mes "物凄く丈夫だし、";
	mes "冬だって暖かいんだよ。";
	mes "凄いだろう？";
	next;
	menu "冬はそんなに寒いんですか？",-;
	if(rand(10) < 7) {
		mes "[おじさん]";
		mes "そうだな。";
		mes "建物の中にいないと";
		mes "辛い季節だなぁ……";
		close;
	}
	mes "[おじさん]";
	mes "そうだな。";
	mes "建物の中にいないと";
	mes "辛い季節だなぁ……";
	next;
	mes "[おじさん]";
	mes "やっぱ備えがないと";
	mes "辛い冬はみんな嫌いだろうな。";
	mes "まったく、冬が無ければいいんだが……";
	misceffect 215,"";
	set MOSK_3QUE_SUB,MOSK_3QUE_SUB | 0x04;
	if(MOSK_3QUE_SUB == 0x07) {
		set MOSK_3QUE,11;
		set MOSK_3QUE_SUB,0;
	}
	close;
}

moscovia.gat,228,80,3	script	子供#mosk16	962,{
	if(MOSK_3QUE != 10 || MOSK_3QUE_SUB & 0x01) {
		mes "[子供]";
		mes "さってと。";
		mes "今日は何して遊ぼっかなー？";
		close;
	}
	mes "[子供]";
	mes "さってと。";
	mes "今日は何して遊ぼっかなー？";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "あの……ちょっといいかな？";
	next;
	mes "[子供]";
	mes "ん、なぁに？";
	next;
	menu "夏は好き？",-;
	if(rand(10) < 7) {
		mes "[子供]";
		mes "勿論、夏は好きだよ。";
		mes "なになに？";
		mes "アンケートか何か？";
		close;
	}
	mes "[子供]";
	mes "勿論、夏は好きだよ。";
	mes "今日もどこで遊ぶか";
	mes "悩んでたくらいだよ！";
	next;
	mes "[子供]";
	mes "でも、それも今だけなんだよなぁ。";
	mes "冬になると外に遊びに行くなんて";
	mes "できなくなっちゃうからねー";
	mes "あーぁ、冬なんて";
	mes "来なきゃいいのに！";
	misceffect 215,"";
	set MOSK_3QUE_SUB,MOSK_3QUE_SUB | 0x01;
	if(MOSK_3QUE_SUB == 0x07) {
		set MOSK_3QUE,11;
		set MOSK_3QUE_SUB,0;
	}
	close;
}

mosk_dun02.gat,53,220,0	script	#ババヤガの家	45,1,1,{
	switch(MOSK_3QUE) {
	case 11:
		hideoffnpc "兵士1#mosk";
		hideoffnpc "兵士2#mosk";
		hideoffnpc "兵士3#mosk";
		mes "[兵士]";
		mes "そこの者、止まれ！";
		next;
		mes "[兵士]";
		mes "お前がババヤガと";
		mes "繋がっているとの情報を得たため、";
		mes "身柄を拘束させてもらう！";
		next;
		mes "[兵士]";
		mes "弁解はチャール様の前でせよ。";
		mes "さぁ、早くついてこい！";
		close2;
		hideonnpc "兵士1#mosk";
		hideonnpc "兵士2#mosk";
		hideonnpc "兵士3#mosk";
		set MOSK_3QUE,12;
		warp "mosk_in.gat",125,92;
		end;
	case 12:
	case 13:
		hideoffnpc "兵士1#mosk";
		hideoffnpc "兵士2#mosk";
		hideoffnpc "兵士3#mosk";
		mes "[兵士]";
		mes "止まれ！";
		mes "我々はここでババヤガを";
		mes "警戒監視している。";
		mes "お前は先ほど他の調査員が";
		mes "チャール様の元へ連行したはずだ。";
		next;
		if(select("逃げる","事情を説明する") == 1) {
			mes "[兵士]";
			mes "我々がここを動けぬと知り、";
			mes "この場を逃げるつもりか……";
			mes "だが覚えておけ。";
			mes "すぐに自分の足でチャール様の";
			mes "元へいかなかった場合、";
			mes "お前は指名手配されるかもしれんぞ！";
			close2;
			hideonnpc "兵士1#mosk";
			hideonnpc "兵士2#mosk";
			hideonnpc "兵士3#mosk";
			warp "mosk_dun02.gat",100,100;
			end;
		}
		mes "-今までの事を説明しようとしたが、";
		mes "　言葉を遮られた-";
		next;
		mes "[兵士]";
		mes "弁解はチャール様の前でせよ。";
		mes "お前にどんな目的があろうが、";
		mes "我々の任務はここでババヤガを";
		mes "監視し続ける事だ。";
		next;
		mes "[兵士]";
		mes "わかったら、すぐに自分の足で";
		mes "チャール様の元へ行け！";
		mes "でなければ、お前は";
		mes "指名手配されるかもしれんぞ！";
		close2;
		hideonnpc "兵士1#mosk";
		hideonnpc "兵士2#mosk";
		hideonnpc "兵士3#mosk";
		end;
	default:
		warp "mosk_in.gat",215,41;
		end;
	}
}

mosk_dun02.gat,53,215,3	script	兵士1#mosk	966,{
	mes "[兵士]";
	mes "我々はチャール様の直属軍だ。";
	mes "ここに緊急配備されている。";
	mes "くれぐれも我々の邪魔をするな！";
	close;
OnInit:
	hideonnpc;
	end;
}
mosk_dun02.gat,50,217,3	duplicate(兵士1#mosk)	兵士2#mosk	966
mosk_dun02.gat,56,217,5	duplicate(兵士1#mosk)	兵士3#mosk	966

mosk_in.gat,217,45,0	script	#本	111,{
	switch(MOSK_3QUE) {
	case 15:
		mes "[" +strcharinfo(0)+ "]";
		mes "とても大きな本が置いてある。";
		mes "文字は解読できないし、";
		mes "何の意味かわからない挿絵がある。";
		mes "読めるのはババヤガが";
		mes "訳した部分だけだ……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "よし、読んでみよう。";
		next;
		mes "-……つまり、この魔術は";
		mes "　我々が使う魔術のうち、";
		mes "　唯一純粋な魔術と言える-";
		next;
		mes "-通常、魔術は悪魔との契約を";
		mes "　介しているものが多いが、";
		mes "　この魔術は自然現象と";
		mes "　人間の思念を活かしたものであり、";
		mes "　悪魔の力は混在していない-";
		next;
		mes "-そして、この魔術は";
		mes "　二つの特徴を持つ-";
		next;
		mes "-一つ、自然現象へ干渉する事-";
		mes "-頑なな学者の考えに反し、";
		mes "　この世界は目には見えない";
		mes "　精巧なルールに従っている-";
		next;
		mes "-その精巧なルールに";
		mes "　軽い刺激を与えるだけで、";
		mes "　通常ではありえない";
		mes "　不自然な現象が起きる-";
		mes "-簡潔に言えば、奇跡が具現化する-";
		next;
		mes "-多くの天候魔術が";
		mes "　これに当てはまる-";
		mes "-しかし、自然現象に対する知識が";
		mes "　十分に無ければ、ルールに";
		mes "　触れる事は不可能だ-";
		next;
		mes "-なぜなら、この世界を構成している";
		mes "　ルールは複雑に、";
		mes "　密に繋がっているからだ-";
		mes "-そのルールの構造を全て理解するのは";
		mes "　至難の業といえる-";
		next;
		mes "-しかし、既に存在している魔術を";
		mes "　そのまま再現するのは容易である-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "説明が長すぎるな……";
		next;
		mes "-二つ目の特徴は、";
		mes "　この魔術が人間の欲望を";
		mes "　代弁している事-";
		next;
		mes "-人間の欲望や想いは決して軽くない-";
		mes "-事実、人の思念が炎を象り、";
		mes "　実際のエネルギーとして";
		mes "　現れる事もある-";
		next;
		mes "-では、実際に天候を操る";
		mes "　魔術を記述する-";
		next;
		mes "-湿気があり、人気の無い空間にて";
		mes "　材料を煮る事ができる容器を置く-";
		mes "-最後に必要となるのは";
		mes "　術者の強い意志-";
		next;
		mes "-材料は正しい工程を踏み、";
		mes "　もし工程を誤った場合は";
		mes "　直ちに中断せよ-";
		next;
		mes "-魔術の漏洩を防ぐ為、";
		mes "　材料の名称を暗号化するが、";
		mes "　この本を読める者なら、";
		mes "　正しい名称が推測できるだろう-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "やっと魔術の説明か……";
		mes "よし、ここに何か挟んでおこう。";
		mes "そうすれば、今度からは";
		mes "材料の所から読める。";
		set MOSK_3QUE,16;
		next;
		mes "-^0000FF季節魔術^000000：^FF0000温暖化^000000-";
		mes "-まず、加熱した容器にて";
		mes "　次の三種を混ぜ入れる-";
		next;
		mes "-○夜空を音を頼りに飛ぶ者の";
		mes "　　赤き友の羽";
		mes "　○日光を嫌う植物の体を";
		mes "　　構成する組織";
		mes "　○常に跳ね続けている者の足-";
		next;
		mes "-これら三種を混ぜ合わせると、";
		mes "　空に昇るものが留まろうとする-";
		mes "-それだけでも天候に変化はあるが、";
		mes "　まだ気付く程ではない-";
		next;
		mes "-次に、この世界の大部分を";
		mes "　構成する物を入れる-";
		mes "-そして、20回混ぜてしばらく待つ-";
		mes "-短時間で色と匂いの変化に";
		mes "　気が付くはずである-";
		next;
		mes "-何回も言うが、";
		mes "　全ての工程は正確な手順で";
		mes "　行わなければならない-";
		mes "-少しでも疑問を抱いたら、";
		mes "　直ちにやり直した方がいい-";
		next;
		mes "-そして、次の二種を更に入れる-";
		mes "-○魔女が持つ砂";
		mes "　○綺麗な砂を固めた物-";
		mes "-これらを入れた後、";
		mes "　液体の匂いが変わったのを確認する-";
		next;
		mes "-匂いの変化を確認した後、";
		mes "　15回混ぜる-";
		mes "-すると、液体の色が変化するので、";
		mes "　更に三種の材料を入れる-";
		next;
		mes "-まず、太陽に似た石-";
		mes "-次に、起爆剤となる物-";
		mes "-そして、石でありながら、";
		mes "　熱を持ち、鼓動している物-";
		mes "-これらを順番どおりに入れれば";
		mes "　天候に変化が見られるだろう-";
		next;
		mes "-最後に、持続性を持たすため、";
		mes "　変化を頑なに受け入れない";
		mes "　「永遠の象徴」を入れる-";
		next;
		mes "-完成した液体を人間の欲望が";
		mes "　詰まった瓶に一時的に入れ、";
		mes "　天候の変化を願う者が集う地域の";
		mes "　ほぼ中央で散布すれば";
		mes "　魔術は完成する-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "これ以上はババヤガが";
		mes "翻訳していない……";
		close;
	case 16:
		if(select("前書きから読む","しおりをした部分から読む") == 1) {
			mes "-……つまり、この魔術は";
			mes "　我々が使う魔術のうち、";
			mes "　唯一純粋な魔術と言える-";
			next;
			mes "-通常、魔術は悪魔との契約を";
			mes "　介しているものが多いが、";
			mes "　この魔術は自然現象と";
			mes "　人間の思念を活かしたものであり、";
			mes "　悪魔の力は混在していない-";
			next;
			mes "-そして、この魔術は";
			mes "　二つの特徴を持つ-";
			next;
			mes "-一つ、自然現象へ干渉する事-";
			mes "-頑なな学者の考えに反し、";
			mes "　この世界は目には見えない";
			mes "　精巧なルールに従っている-";
			next;
			mes "-その精巧なルールに";
			mes "　軽い刺激を与えるだけで、";
			mes "　通常ではありえない";
			mes "　不自然な現象が起きる-";
			mes "-簡潔に言えば、奇跡が具現化する-";
			next;
			mes "-多くの天候魔術が";
			mes "　これに当てはまる-";
			mes "-しかし、自然現象に対する知識が";
			mes "　十分に無ければ、ルールに";
			mes "　触れる事は不可能だ-";
			next;
			mes "-なぜなら、この世界を構成している";
			mes "　ルールは複雑に、";
			mes "　密に繋がっているからだ-";
			mes "-そのルールの構造を全て理解するのは";
			mes "　至難の業といえる-";
			next;
			mes "-しかし、既に存在している魔術を";
			mes "　そのまま再現するのは容易である-";
			next;
			mes "-二つ目の特徴は、";
			mes "　この魔術が人間の欲望を";
			mes "　代弁している事-";
			next;
			mes "-人間の欲望や想いは決して軽くない-";
			mes "-事実、人の思念が炎を象り、";
			mes "　実際のエネルギーとして";
			mes "　現れる事もある-";
			next;
			mes "-では、実際に天候を操る";
			mes "　魔術を記述する-";
			next;
			mes "-湿気があり、人気の無い空間にて";
			mes "　材料を煮る事ができる容器を置く-";
			mes "-最後に必要となるのは";
			mes "　術者の強い意志-";
			next;
			mes "-材料は正しい工程を踏み、";
			mes "　もし工程を誤った場合は";
			mes "　直ちに中断せよ-";
			next;
			mes "-魔術の漏洩を防ぐ為、";
			mes "　材料の名称を暗号化するが、";
			mes "　この本を読める者なら、";
			mes "　正しい名称が推測できるだろう-";
			next;
		}
		mes "-^0000FF季節魔術^000000：^FF0000温暖化^000000-";
		mes "-まず、加熱した容器にて";
		mes "　次の三種を混ぜ入れる-";
		next;
		mes "-○夜空を音を頼りに飛ぶ者の";
		mes "　　赤き友の羽";
		mes "　○日光を嫌う植物の体を";
		mes "　　構成する組織";
		mes "　○常に跳ね続けている者の足-";
		next;
		mes "-これら三種を混ぜ合わせると、";
		mes "　空に昇るものが留まろうとする-";
		mes "-それだけでも天候に変化はあるが、";
		mes "　まだ気付く程ではない-";
		next;
		mes "-次に、この世界の大部分を";
		mes "　構成する物を入れる-";
		mes "-そして、20回混ぜてしばらく待つ-";
		mes "-短時間で色と匂いの変化に";
		mes "　気が付くはずである-";
		next;
		mes "-何回も言うが、";
		mes "　全ての工程は正確な手順で";
		mes "　行わなければならない-";
		mes "-少しでも疑問を抱いたら、";
		mes "　直ちにやり直した方がいい-";
		next;
		mes "-そして、次の二種を更に入れる-";
		mes "-○魔女が持つ砂";
		mes "　○綺麗な砂を固めた物-";
		mes "-これらを入れた後、";
		mes "　液体の匂いが変わったのを確認する-";
		next;
		mes "-匂いの変化を確認した後、";
		mes "　15回混ぜる-";
		mes "-すると、液体の色が変化するので、";
		mes "　更に三種の材料を入れる-";
		next;
		mes "-まず、太陽に似た石-";
		mes "-次に、起爆剤となる物-";
		mes "-そして、石でありながら、";
		mes "　熱を持ち、鼓動している物-";
		mes "-これらを順番どおりに入れれば";
		mes "　天候に変化が見られるだろう-";
		next;
		mes "-最後に、持続性を持たすため、";
		mes "　変化を頑なに受け入れない";
		mes "　「永遠の象徴」を入れる-";
		next;
		mes "-完成した液体を人間の欲望が";
		mes "　詰まった瓶に一時的に入れ、";
		mes "　天候の変化を願う者が集う地域の";
		mes "　ほぼ中央で散布すれば";
		mes "　魔術は完成する-";
		close;
	default:
		if(MOSK_3QUE < 14) {
			mes "-とても大きな本が置いてある-";
			close;
		}
		mes "[" +strcharinfo(0)+ "]";
		mes "秘薬の作り方が載っている本だ。";
		mes "……また薬を作ろうとしない限り";
		mes "必要ないだろう。";
		close;
	}
}

mosk_in.gat,221,43,0	script	#鍋	111,{
	if(MOSK_3QUE != 16)
		end;
	mes "[" +strcharinfo(0)+ "]";
	mes "かなり怪しい鍋がある。";
	mes "何かがすでに入っているが……";
	mes "見なかったことにしよう……";
	mes "恐らくババヤガが下拵えを";
	mes "しておいたものだろう。";
	mes "さて、作業を始めてみようか。";
	setarray '@itemname$,"赤いコウモリの翼","菌糸","バッタの足","魔女の星の砂","きれいな小石";
	while('@count < 3) {
		next;
		mes "-何をしますか？-";
		next;
		switch(select("材料を入れる","水を入れる","混ぜる","終わり")) {
		case 1:
			set '@num,select(printarray('@itemname$))-1;
			mes "-" +'@itemname$['@num]+ "を入れた-";
			mes "-匂いが少し変わったようだ-";
			if('@num < 4 && '@flag & (1 << '@num) == 0) {
				misceffect 44;
				set '@flag,'@flag | (1 << '@num);
				set '@success,'@success+1;
			}
			else {
				misceffect 53;
			}
			break;
		case 2:
			mes "-水で少し薄くなったようだが、";
			mes "　他に変化は無さそうだ-";
			misceffect 53;
			break;
		case 3:
			mes "-棒を使って何回か";
			mes "　かき混ぜてみた-";
			mes "-しかし、特に変化は無いようだ-";
			misceffect 53;
			break;
		case 4:
			mes "[" +strcharinfo(0)+ "]";
			mes "これで大丈夫かな？";
			mes "ババヤガに聞いてみよう。";
			misceffect 192;
			set MOSK_3QUE,17;
			close;
		}
		set '@count,'@count+1;
	}
	next;
	misceffect 109;
	mes "-気泡が出てきて、";
	mes "　液体の質が変わってきているのが";
	mes "　目に見えてきた-";
	while('@count < 7) {
		next;
		mes "-次はどうしますか？-";
		next;
		switch(select("材料を入れる","水を入れる","混ぜる","終わり")) {
		case 1:
			set '@num,select(printarray('@itemname$))-1;
			mes "-" +'@itemname$['@num]+ "を入れた-";
			mes "-匂いが少し変わったようだ-";
			if(('@count == 5 || '@count == 6) && '@num > 3 && '@flag & (1 << '@num) == 0) {
				misceffect 44;
				set '@flag,'@flag | (1 << '@num);
				set '@success,'@success+1;
			}
			else {
				misceffect 53;
			}
			break;
		case 2:
			if('@count == 3) {
				mes "-水を少し入れると、";
				mes "　何かに反応したのか、";
				mes "　ぐつぐつと煮える音が";
				mes "　途端に大きくなった-";
				misceffect 373;
				set '@success,'@success+1;
			}
			else {
				mes "-水で少し薄くなったようだが、";
				mes "　他に変化は無さそうだ-";
				misceffect 53;
			}
			break;
		case 3:
			if('@count == 4) {
				mes "[" +strcharinfo(0)+ "]";
				mes "何回混ぜるんだったかな？";
				next;
				input '@num;
				if('@num == 0) {
					mes "-混ぜるのを止めた-";
					continue;
				}
				else if('@num < 0 || '@num > 100) {
					mes "[" +strcharinfo(0)+ "]";
					mes "いや……そんなに";
					mes "混ぜなくてよかった気が……";
					mes "もう一度思い出してみよう。";
					continue;
				}
				else if('@num == 20) {
					mes "[" +strcharinfo(0)+ "]";
					mes "確か20回だった！";
					next;
					mes "-20回混ぜると、";
					mes "　色も綺麗になり、匂いも良くなった-";
					misceffect 224;
					set '@success,'@success+1;
				}
				else {
					mes "-棒を使って何回か";
					mes "　かき混ぜてみた-";
					mes "-しかし、特に変化は無いようだ-";
				}
			}
			else {
				mes "-棒を使って何回か";
				mes "　かき混ぜてみた-";
				mes "-しかし、特に変化は無いようだ-";
				misceffect 53;
			}
			break;
		case 4:
			mes "[" +strcharinfo(0)+ "]";
			mes "これで大丈夫かな？";
			mes "ババヤガに聞いてみよう。";
			misceffect 192;
			set MOSK_3QUE,17;
			close;
		}
		set '@count,'@count+1;
	}
	mes "[" +strcharinfo(0)+ "]";
	mes "確か、この後は";
	mes "少し待つんだったかな……";
	next;
	mes "……………………";
	next;
	mes "……………………";
	next;
	mes "-鍋の中身の匂いが凄く良くなった-";
	setarray '@itemname$,"魔女の星の砂","きれいな小石","雷管","レッドブラッド","燃えている心臓";
	while(1) {
		next;
		mes "-次はどうしますか？-";
		next;
		switch(select("材料を入れる","水を入れる","混ぜる","終わり")) {
		case 1:
			if('@count == 11)
				set '@itemname$[5],"ダイヤモンド";
			else
				set '@itemname$[5],"";
			set '@num,select(printarray('@itemname$))-1;
			mes "-" +'@itemname$['@num]+ "を入れた-";
			mes "-匂いが少し変わったようだ-";
			if(('@count == 8 && '@num == 3) || ('@count == 9 && '@num == 2) || ('@count == 10 && '@num == 4) || ('@count == 11 && '@num == 5)) {
				misceffect 44;
				set '@flag,'@flag | (1 << '@num);
				set '@success,'@success+1;
			}
			else {
				misceffect 53;
			}
			break;
		case 2:
			mes "-水で少し薄くなったようだが、";
			mes "　他に変化は無さそうだ-";
			misceffect 53;
			break;
		case 3:
			if('@count == 7) {
				mes "[" +strcharinfo(0)+ "]";
				mes "何回混ぜるんだったかな？";
				next;
				input '@num;
				if('@num == 0) {
					mes "-混ぜるのを止めた-";
					continue;
				}
				else if('@num < 0 || '@num > 100) {
					mes "[" +strcharinfo(0)+ "]";
					mes "いや……そんなに";
					mes "混ぜなくてよかった気が……";
					mes "もう一度思い出してみよう。";
					continue;
				}
				else if('@num == 15) {
					mes "[" +strcharinfo(0)+ "]";
					mes "確か15回だった！";
					next;
					mes "-15回混ぜると、";
					mes "　透明で澄んだ色になった-";
					misceffect 224;
					set '@success,'@success+1;
				}
				else {
					mes "-棒を使って何回か";
					mes "　かき混ぜてみた-";
					mes "-しかし、特に変化は無いようだ-";
				}
			}
			else {
				mes "-棒を使って何回か";
				mes "　かき混ぜてみた-";
				mes "-しかし、特に変化は無いようだ-";
				misceffect 53;
			}
			break;
		case 4:
			mes "[" +strcharinfo(0)+ "]";
			mes "これで大丈夫かな？";
			mes "ババヤガに聞いてみよう。";
			if('@success < 12) {
				misceffect 192;
				set MOSK_3QUE,17;
			}
			else {
				misceffect 110;
				set MOSK_3QUE,18;
			}
			close;
		}
		set '@count,'@count+1;
	}
}

moscovia.gat,224,190,0	script	#街の中央	844,{
	if(MOSK_3QUE != 19)
		end;
	mes "[" +strcharinfo(0)+ "]";
	mes "この辺りかな……";
	mes "この街の中心は……";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "よし、やってみよう！";
	next;
	mes "-ババヤガの秘薬を";
	mes "　地面に落として割った-";
	misceffect 63,"";
	delitem 7765,1;
	set MOSK_3QUE,20;
	next;
	mes "-何か暖かい風に吹かれた";
	mes "　気がする-";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "これで……変わったかな？";
	mes "さすがに季節をすぐに";
	mes "確認するのは無理かな……";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "とりあえず、";
	mes "チャール王に報告してみよう。";
	close;
}
