//= Athena Script ==============================================================
// Ragnarok Online 1st Class Tutorial Quest Script	by Blaze
//==============================================================================

//============================================================
// 剣士クエストNPC
//- Registry -------------------------------------------------
// QUE_SWORDMAN -> 0～22
//------------------------------------------------------------
izlude_in.gat,82,163,3	script	シューレン	733,{
	if(Job == Job_Novice) {
		mes "[シューレン]";
		mes "君、自分の将来の事を考えて";
		mes "いるかな？";
		mes "どうだろう……君のその人生を";
		mes "ソードマンとして過ごしてみないか。";
		next;
		mes "[シューレン]";
		mes "一つの道を貫く！";
		mes "剣に己の全てを懸ける！";
		next;
		mes "[シューレン]";
		mes "もし、決意が固まったら、あちらの";
		mes "剣士ギルドを訪ねるといい。";
		close;
	}
	if(getbaseclass(Class,2) == CLASS_KN || getbaseclass(Class,2) == CLASS_CR) {
		mes "[シューレン]";
		mes "ほう、ソードマンから転職したのか。";
		mes "君が熱き日々を送ってきたことの";
		mes "成果であるから、誇りを持つように。";
		mes "しかしやはり、私の立場からすると";
		mes "未来への可能性を秘めている";
		mes "生き生きしたソードマンが好きだ。";
		close;
	}
	if(Job != Job_Swordman) {
		mes "[シューレン]";
		mes "私が相手をできるのはソードマンのみ。";
		mes "残念だが、私が君に教えてあげられる";
		mes "ことは何もない。";
		close;
	}
	switch(QUE_SWORDMAN) {
	case 0:
		mes "[シューレン]";
		mes "同じ道を歩む者として自己紹介しよう。";
		mes "私は、このプロンテラのナイト、";
		mes "シューレン・サリアと申す。";
		next;
		mes "[シューレン]";
		mes "身内の恥のようで、あまり言いたくは";
		mes "ないのだが、最近のソードマンは軟弱に";
		mes "なってきている。そのような者達が、";
		mes "そのまま転職してしまうと将来、";
		mes "騎士団の質が問われることと";
		mes "なってしまう。";
		next;
		mes "[シューレン]";
		mes "君は、どうだ？";
		mes "ソードマンの基本、^FF0000バッシュ^000000は";
		mes "どれくらい修めたかな？";
		next;
		if(getskilllv(5) >= 10) goto L_Bash10;
		else if(getskilllv(5) >= 5) goto L_Bash5;
		else if(getskilllv(5)) goto L_Bash1;
		mes "[シューレン]";
		mes "まだバッシュを修めていないのか。";
		mes "ふむ……まだ君には修練の余地がある。";
		mes "バッシュを学ぶようお奨めしよう。";
		next;
		set QUE_SWORDMAN,1;
		if(checkre())
			getexp 49,0;
		else
			getexp 490,0;
		mes "[シューレン]";
		mes "しかし、まだ基本が成っていない";
		mes "状態では、修練も大変だろう。";
		mes "少し力を与えるとしよう。";
		next;
		mes "[シューレン]";
		mes "時代がどう変わっても、ソードマンの";
		mes "基本は^FF0000バッシュ^000000だ。";
		mes "それでは、修練に励んでくれたまえ。";
		close;
	case 1:
		mes "[シューレン]";
		mes "バッシュを修めてきたか？";
		mes "いいか、何度も言うが、バッシュは";
		mes "ソードマンの基本だ。";
		next;
		if(getskilllv(5) >= 10) goto L_Bash10;
		else if(getskilllv(5) >= 5) goto L_Bash5;
		else if(getskilllv(5) == 0) {
			mes "[シューレン]";
			mes "まだバッシュを修めていないのか……";
			mes "君は、なんのためにソードマンに";
			mes "なったんだ？";
			close;
		}
	L_Bash1:
		mes "[シューレン]";
		mes "バッシュを修めてはいるが、まだ";
		mes "充分ではないようだ。よし、私が";
		mes "バッシュについて、特別に";
		mes "講義してあげよう。";
		next;
		callsub L_Bash;
		next;
		set QUE_SWORDMAN,2;
		if(checkre())
			getexp 58,0;
		else
			getexp 585,0;
		mes "[シューレン]";
		mes "私から見れば、まだまだだが、";
		mes "ここまでの努力は評価しよう。";
		next;
		mes "[シューレン]";
		mes "しかし、これで満足はするな。";
		mes "君はまだまだ若造だ。";
		mes "いいか、自分に溺れるようであれば、";
		mes "私はもう二度と力を貸さないと";
		mes "心得たまえ。";
		close;
	case 2:
		mes "[シューレン]";
		mes "バッシュの修練は進んでいるか？";
		mes "いつも言っているが、バッシュこそ";
		mes "剣の技の基本だ。";
		next;
		if(getskilllv(5) >= 10) goto L_Bash10;
		else if(getskilllv(5) < 5) {
			mes "[シューレン]";
			mes "^FF0000バッシュ！　^0000FFバッシュ！";
			mes "^FF0000バッシュ！　^0000FFバッシュ！";
			mes "^FF0000バッシュ！　^0000FFバッシュ！";
			mes "^000000スクランブル～！　^FF0000バッシュ！^000000";
			next;
			mes "[シューレン]";
			mes "どこの誰が作ったのか知らないが、";
			mes "このような歌がある。これぞ";
			mes "バッシュの主題歌という気概を";
			mes "感じないか？　こんな歌が作られるほど";
			mes "バッシュは重要なスキルということだ。";
			next;
			mes "[シューレン]";
			mes "それまで重要なバッシュを熟知せず、";
			mes "ソードマンたりえるか。否！";
			mes "更に修練を積み、バッシュの理解を";
			mes "深めてきなさい。";
			close;
		}
	L_Bash5:
		mes "[シューレン]";
		mes "ふむ、バッシュはそこそこ修めて";
		mes "いるようだ。あと一歩という所か。";
		mes "念のため、バッシュについて、";
		mes "講義するとしよう。1度聞いているかも";
		mes "しれないが、復習とでも思って";
		mes "くれたまえ。";
		next;
		callsub L_Bash;
		next;
		set QUE_SWORDMAN,3;
		if(checkre())
			getexp 83,0;
		else
			getexp 830,0;
		mes "[シューレン]";
		mes "あと一歩ではあるが、ここまでの";
		mes "努力は評価しよう。";
		next;
		mes "[シューレン]";
		mes "しかし、これで満足はするな。";
		mes "君はまだまだ若造だ。";
		mes "いいか、自分に溺れるようであれば、";
		mes "私はもう二度と力を貸さないと";
		mes "心得たまえ。";
		close;
	case 3:
		mes "[シューレン]";
		mes "バッシュの講義を始めて、";
		mes "大分経ったな。";
		mes "Lv10までマスターしてこそ";
		mes "真のバッシュだ。";
		next;
		if(getskilllv(5) < 10) {
			mes "[シューレン]";
			mes "まだ、あと一歩というところか。";
			mes "いいか、バッシュはLv10まで";
			mes "マスターしてこそ、真のバッシュだ。";
			mes "頑張ってくれたまえ！";
			close;
		}
	L_Bash10:
		mes "[シューレン]";
		mes "ほぉ、バッシュを完璧に";
		mes "マスターしたのか。凄いな。";
		mes "しかし、いつも言っているがバッシュは";
		mes "基本だ。基本をマスターしてからこそ、";
		mes "真のソードマンとしての道が";
		mes "始まるのだ。";
		next;
		set QUE_SWORDMAN,4;
		if(checkre())
			getexp 97,0;
		else
			getexp 970,0;
		getitem 2503,1;
		mes "[シューレン]";
		mes "しかし、良くここまで頑張った。";
		mes "これは、その褒美だ。";
		mes "決して、感心したとか、それが";
		mes "嬉しいから与えるのではないからな！";
		next;
		mes "[シューレン]";
		mes "これからも精進するように。";
		mes "基本を終わらせた後の道は、";
		mes "まだまだ長いのだからな。";
		close;
	case 4:
		mes "[シューレン]";
		mes "バッシュをマスターしたことこそ、";
		mes "基本ができた証。基本ができたからこそ";
		mes "スキルの応用や技術が活きる。";
		mes "基本だけでは、己の道は開けないのだ！";
		next;
		mes "[シューレン]";
		mes "……と、言うは易しだが、現実は";
		mes "厳しいものだ。そこで、バッシュ以外で";
		mes "必要となるスキルを教えるとしよう。";
		next;
		mes "[シューレン]";
		mes "^FF0000HP回復力向上^000000は、取得したか？";
		mes "バッシュほどではないが、これも";
		mes "かなり基本と言える。";
		next;
		if(getskilllv(4) < 10) {
			if(getskilllv(4) == 0) {
				mes "[シューレン]";
				mes "まだ修めていないのか。";
				mes "そんな君のために、少し説明して";
				mes "あげるとしよう。";
			}
			else {
				mes "[シューレン]";
				mes "適当に修めたな。";
				mes "まだまだだとしか言いようがないな。";
				mes "念のため、このスキルの説明をしよう。";
			}
			next;
			mes "[シューレン]";
			mes "HP回復力向上は、使用する場面を";
			mes "指定して使う、アクティブスキルでは";
			mes "ない。自動的に自分に適応される";
			mes "パッシブスキルだ。1回習得して";
			mes "しまえば、特に気にしていなくても、";
			mes "そのスキルの効果は発揮され続ける。";
			next;
			mes "[シューレン]";
			mes "名前を聞けばわかるように、";
			mes "このスキルは、体力(HP)の回復力を";
			mes "向上させることにより、体力を";
			mes "早く回復できるスキルだ。";
			mes "特にこれといった特徴は無いと";
			mes "思うかもしれないが……";
			next;
			mes "[シューレン]";
			mes "1秒を争う戦いの中、少しでも";
			mes "多くの体力を温存できれば、";
			mes "生き残る確率がどれだけ高くなる";
			mes "ことか。";
			mes "そう思うと、バッシュより重要な";
			mes "スキルと言えるかもしれないな。";
			next;
			mes "[シューレン]";
			mes "修めて損のないスキルだ。";
			set QUE_SWORDMAN,5;
		}
		else {
			mes "[シューレン]";
			mes "ほぉ。既にマスターしているのか。";
			mes "では、説明する必要もないだろう。";
			mes "ソードマンとしての基本は完璧だと";
			mes "見ていいだろう。これは褒美だ。";
			set QUE_SWORDMAN,5;
			if(checkre())
				getexp 112,0;
			else
				getexp 1120,0;
		}
		next;
		mes "[シューレン]";
		mes "ふむ、HP回復力向上の話は";
		mes "これくらいにしようか。";
		mes "次は、プロボックについて講義しよう。";
		mes "少し準備があるので、また後で会おう。";
		close;
	case 5:
		mes "[シューレン]";
		mes "さて、プロボックについて教えようと";
		mes "思っていたのだが、その前に";
		mes "君に一つ頼みがある。";
		mes "なに、そんなに難しいことでは";
		mes "ないから、これも修練の一環と思って";
		mes "やってみてくれたまえ。";
		next;
		mes "[シューレン]";
		mes "^FF0000ゲフェン^000000に調査に向かったナイト";
		mes "^FF0000ディキュイ^000000を探し、";
		mes "私からの伝言を伝えるように。";
		next;
		mes "[シューレン]";
		mes "^0000FF暗殺者の件はどうした？";
		mes "正体はわかったか？";
		mes "これから私達はどうすればいい？^000000";
		next;
		mes "[シューレン]";
		mes "この言葉を伝えて欲しい。";
		mes "そして、ディキュイの返した";
		mes "言葉をよく覚え、";
		mes "私のところに戻ってくること。";
		next;
		mes "[シューレン]";
		mes "ここからゲフェンの間には";
		mes "あまり強いモンスターは棲息しない。";
		mes "気楽な気持ちで行ってくるといい。";
		mes "もし、強力な敵と遭遇してしまったら";
		mes "逃げるのも兵法だと覚えておくといい。";
		next;
		mes "[シューレン]";
		mes "カプラサービスもあるだろうが、";
		mes "楽ばかりしていると、体がなまって";
		mes "しまうぞ。";
		next;
		mes "[シューレン]";
		mes "今回のこの依頼は、君自身を";
		mes "強くするためでもあるのだから、";
		mes "なるべく自力で歩いて行って欲しい。";
		mes "それでは頼む。";
		set QUE_SWORDMAN,6;
		close;
	case 6:
		mes "[シューレン]";
		mes "^FF0000ゲフェン^000000に調査に向かったナイト";
		mes "^FF0000ディキュイ^000000を探し、";
		mes "私からの伝言を渡すように。";
		next;
		mes "[シューレン]";
		mes "^0000FF暗殺者の件はどうした？";
		mes "正体はわかったか？";
		mes "これから私達はどうすればいい？^000000";
		next;
		mes "[シューレン]";
		mes "この言葉を伝えて欲しい。";
		mes "そして、ディキュイの言葉を良く覚え、";
		mes "私のところに戻ってくること。";
		next;
		mes "[シューレン]";
		mes "自力で向かって欲しかったが、";
		mes "ちょっと急ぎで確めて欲しくなった。";
		mes "近くまで送るから、急いで欲しい。";
		close2;
		warp "gef_fild07.gat",35,192;
		end;
	case 7:
		mes "[シューレン]";
		mes "おぉ、もう帰ってきたか。";
		mes "1人前じゃないか。うん。";
		mes "ハハハッ。";
		next;
		mes "[シューレン]";
		mes "それで、あいつは何と言っていた？";
		next;
		mes "[シューレン]";
		mes "うん…………";
		mes "そうか。今のところ、安心か。";
		mes "しかし、まだ油断はできないようだ……";
		mes "あ、いや。こちらの話だ。";
		mes "それでは講義を始めよう。";
		next;
		mes "[シューレン]";
		mes "HP回復力向上までは終わらせたから、";
		mes "次はプロボックだったな。";
		mes "君は、プロボックについて、";
		mes "どれくらい知っている？";
		next;
		if(getskilllv(6) >= 5) goto L_Provoke5;
		else if(getskilllv(6)) goto L_Provoke1;
		mes "[シューレン]";
		mes "まだプロボックを修めていないか。";
		mes "このような応用スキルを使いこなせて";
		mes "こそ、真のソードマンと言えるのだ。";
		mes "まず、スキルについて説明しよう。";
		next;
		callsub L_Provoke;
		next;
		mes "[シューレン]";
		mes "よし、これからの修練は、";
		mes "プロボックを中心にするといい。";
		set QUE_SWORDMAN,8;
		close;
	case 8:
		mes "[シューレン]";
		mes "プロボックの修練はどうだ？";
		mes "プロボックに限らないが、";
		mes "世の中何事も努力が物を言うものさ。";
		next;
		if(getskilllv(6) >= 5) goto L_Provoke5;
		else if(getskilllv(6) == 0) {
			mes "[シューレン]";
			mes "修練に励みなさい。";
			close;
		}
	L_Provoke1:
		mes "[シューレン]";
		mes "習得したようだが、まだ弱いな。";
		mes "それでは、プロボックを有効に";
		mes "使えないだろう。";
		next;
		callsub L_Provoke;
		next;
		mes "[シューレン]";
		mes "もう少し、プロボックの修練を";
		mes "頑張るように。";
		set QUE_SWORDMAN,9;
		close;
	case 9:
		mes "[シューレン]";
		mes "修練の方は進んだか？";
		mes "プロボックもそれなりに";
		mes "使えるだろう。";
		next;
		if(getskilllv(6) < 5) {
			mes "[シューレン]";
			mes "修練に励みなさい。";
			close;
		}
	L_Provoke5:
		if(getskilllv(6) < 10) {
			mes "[シューレン]";
			mes "そこそこ、プロボックを使える";
			mes "ようになったみたいだな。";
			mes "基本スキルではないから、";
			mes "あえてマスターする必要はないだろう。";
			mes "そうだ、これを贈るとしようか。";
			set QUE_SWORDMAN,10;
			if(checkre())
				getexp 112,0;
			else
				getexp 1120,0;
		}
		else {
			mes "[シューレン]";
			mes "プロボックをマスターしていると？";
			mes "凄いな！　挑発の王とでも言おうか。";
			mes "そこまでマスターするのは大変";
			mes "だったろう。";
			mes "その努力を評して、これをあげよう。";
			set QUE_SWORDMAN,10;
			if(checkre())
				getexp 126,0;
			else
				getexp 1260,0;
		}
		next;
		mes "[シューレン]";
		mes "次は何が良いか……";
		mes "そうだな、^FF0000インデュア^000000を";
		mes "教えよう。";
		close;
	case 10:
		mes "[シューレン]";
		mes "これから、インデュアについて";
		mes "説明するとしよう。";
		next;
		if(getskilllv(8)) goto L_Endure1;
		callsub L_Endure;
		next;
		mes "[シューレン]";
		mes "これから、インデュアを修練し";
		mes "攻撃に屈しない強靭な精神を";
		mes "育てなさい。";
		set QUE_SWORDMAN,11;
		close;
	case 11:
		mes "[シューレン]";
		mes "インデュアは修練してきたか？";
		next;
		if(getskilllv(8) == 0) {
			mes "[シューレン]";
			mes "引き続き、修練するように。";
			close;
		}
	L_Endure1:
		if(getskilllv(8) < 2) {
			mes "[シューレン]";
			mes "インデュアをある程度は修練した";
			mes "みたいだな。うん、悪くない。";
			mes "使い方は分かっていると思うが、";
			mes "復習も兼ねて、説明するとしよう。";
			next;
			callsub L_Endure;
			next;
			mes "[シューレン]";
			mes "……とは言ってみたものの、君に";
			mes "インデュアの説明は必要なかったかな。";
			set QUE_SWORDMAN,12;
		}
		else {
			mes "[シューレン]";
			mes "……とは言ってみたものの、君に";
			mes "インデュアの説明はこれ以上";
			mes "必要なさそうだ。自力でそこまで";
			mes "頑張るとは凄いじゃないか。";
			mes "その努力を評して、これをあげよう。";
			set QUE_SWORDMAN,12;
			if(checkre())
				getexp 126,0;
			else
				getexp 1260,0;
		}
		next;
		mes "[シューレン]";
		mes "次の講義だが……";
		mes "講義はしばらく中止して、また仕事を";
		mes "頼みたい。前に会ったディキュイを";
		mes "覚えているか？";
		mes "あいつが、君に用があるそうだ。";
		next;
		mes "[シューレン]";
		mes "ディキュイの仕事を終えてから、";
		mes "また戻ってくるといい。";
		close;
	case 12:
		mes "[シューレン]";
		mes "ゲフェンのディキュイに";
		mes "早く会いに行ってやってくれ。";
		close;
	default:
		mes "[シューレン]";
		mes "……………………";
		close;
	case 20:
		mes "[シューレン]";
		mes "おかえり。何があったか、";
		mes "ディキュイから聞いている。";
		mes "大変だったようだね……";
		mes "でも、君にとって、良い経験に";
		mes "なったと思うよ。";
		next;
		mes "[シューレン]";
		mes "さて、講義に戻るとしようか。";
		mes "あと少しだし、簡単に終わらせると";
		mes "しよう。";
		next;
		mes "[シューレン]";
		mes "そうだね。";
		mes "剣修練とマグナムブレイクの";
		mes "説明をしよう。";
		mes "まず、剣修練だ。";
		next;
		mes "[シューレン]";
		mes "剣修練には、^FF0000剣修練^000000と";
		mes "^FF0000両手剣修練^000000の2種類がある。";
		mes "両方とも、パッシブスキルだ。";
		next;
		mes "[シューレン]";
		mes "^FF0000剣修練は、短剣や片手剣を";
		mes "装備している時、攻撃力が増し、";
		mes "両手剣修練は、両手剣を";
		mes "装備している時の攻撃力が増す。^000000";
		next;
		if(getskilllv(2) >= 10 || getskilllv(3) >= 10) {
			mes "[シューレン]";
			mes "ほほう。マスターしているのか。";
			mes "スキルを上げている最中は";
			mes "それ程実感できなかったと思うが、";
			mes "マスターした今、自分が強くなった";
			mes "ことを実感できるのではないかな。";
			next;
			mes "[シューレン]";
			mes "これは、今までの努力に対する";
			mes "褒美だ。";
			mes "あまり有頂天にならないように。";
			set QUE_SWORDMAN,21;
			if(checkre())
				getexp 186,0;
			else
				getexp 1860,0;
			next;
		}
		mes "[シューレン]";
		mes "では、最後にマグナムブレイクの";
		mes "説明をするとしよう。";
		set QUE_SWORDMAN,21;
		close;
	case 21:
		mes "[シューレン]";
		mes "これが最後の講義だ。";
		mes "前にも言った通り、マグナムブレイクに";
		mes "ついて説明しよう。";
		next;
		mes "[シューレン]";
		mes "マグナムブレイクは ^FF0000バッシュの";
		mes "レベルが5以上で習得できるように";
		mes "なる。LV10がマスターレベルで、";
		mes "自分の周辺の敵にダメージを与える";
		mes "アクティブスキルだ。^000000";
		next;
		mes "[シューレン]";
		mes "^FF0000敵は、マグナムブレイクをくらうと";
		mes "その勢いでノックバックする。";
		mes "その後、スキル使用者の武器に";
		mes "火属性が付与され、しばらくの間";
		mes "攻撃力が20%増加する。^000000";
		next;
		mes "[シューレン]";
		mes "敵に囲まれた時などに使うと";
		mes "良いだろう。";
		next;
		mes "[シューレン]";
		mes "^FF0000ただし、自分にもダメージが";
		mes "返ってくるので、体力が少ない時の";
		mes "使用は気をつけたほうがいいだろう。^000000";
		next;
		if(getskilllv(7) > 5) {
			mes "[シューレン]";
			mes "マグナムブレイクを、かなり修練";
			mes "してきたみたいだな。";
			mes "どちらかと言えば普段からあまり";
			mes "連続して使うスキルではないが、";
			mes "覚えていて無駄なことはない。";
			next;
			mes "[シューレン]";
			mes "その努力を評して、少しばかりだが";
			mes "褒美を与えよう。";
			mes "ゴホン、あまりはしゃぐんじゃないぞ。";
			set QUE_SWORDMAN,22;
			if(checkre())
				getexp 186,0;
			else
				getexp 1860,0;
			getitem 1113,1;
			next;
		}
		mes "[シューレン]";
		mes "これで、ソードマンのスキルについての";
		mes "講義は終わりだ。";
		mes "長かったが、その分君の血や肉に";
		mes "なったと信じているよ。";
		next;
		mes "[シューレン]";
		mes "こそして……暗殺者関係の話だが、";
		mes "深く調べたりしないように。";
		mes "調べたところで、今の君の力では";
		mes "どうすることもできないだろう……";
		next;
		mes "[シューレン]";
		mes "私達、高位のナイトでさえ、";
		mes "詳しい事は知らされていない。";
		mes "つまり我々でもこれ以上";
		mes "手の出しようがないんだ。";
		next;
		mes "[シューレン]";
		mes "いいか、あの件については忘れる事だ。";
		mes "もし、また何かあったら、君へ協力を";
		mes "仰ぐことはあるかもしれないがな。";
		next;
		mes "[シューレン]";
		mes "これからも、修練に励んでくれたまえ。";
		mes "^FF0000JOBレベルが40以上になれば";
		mes "ナイト、もしくはクルセイダーに";
		mes "転職することもできる。^000000";
		next;
		mes "[シューレン]";
		mes "私達の出会いはここで終わりだが、";
		mes "君の人生は、終わりではない。";
		if(QUE_SWORDMAN == 21) {
			next;
			mes "[シューレン]";
			mes "そして、これは最後の贈り物だ。";
			set QUE_SWORDMAN,22;
			getitem 1113,1;
		}
		mes "これからも、頑張ってくれたまえ。";
		close;
	case 22:
		mes "[シューレン]";
		mes "講義は全て終わった。これからは";
		mes "自分が学んだ事を忘れずに、";
		mes "努力と修練を忘れぬよう";
		mes "頑張ってくれたまえ。";
		close;
	}
L_Bash:
	mes "[シューレン]";
	mes "バッシュは^FF0000敵単体を対象とする";
	mes "攻撃系スキル^000000で^FF0000Lv10^000000まで";
	mes "修練することができる。";
	mes "^FF0000打撃系^000000スキルでもあり、";
	mes "単に切るより高等な技術が必要となる。";
	next;
	mes "[シューレン]";
	mes "当たり前だが、スキルレベルが";
	mes "高いということは、そのスキルに対する";
	mes "熟練度が高いということだ。熟練度が";
	mes "高ければ、正確かつ有効に、";
	mes "そのスキルを使うことができ、敵に";
	mes "与えるダメージも向上する。";
	next;
	mes "[シューレン]";
	mes "どのスキルにも言えることだが、";
	mes "スキルはやたらと使うことができない。";
	mes "なぜなら、特殊な技であるスキルは";
	mes "^FF0000使う度にSPを消費するからだ。^000000";
	mes "ソードマンは、剣に重点を置くため、";
	mes "あまりSPが高くない。";
	next;
	mes "[シューレン]";
	mes "極稀に、SPの高い頭脳明晰な";
	mes "ソードマンもいるが、それらは少数に";
	mes "過ぎない。重要なのは、バッシュが";
	mes "良いスキルだと言っても^FF0000乱発は注意^000000と";
	mes "言うことだ。";
	next;
	mes "[シューレン]";
	mes "バッシュの威力と使い方は、自分で";
	mes "戦闘を重ね、学びなさい。";
	return;
L_Provoke:
	mes "[シューレン]";
	mes "^FF0000プロボック^000000は、簡単に言えば";
	mes "相手を^FF0000挑発する^000000スキルだ。";
	mes "いいか、これを卑怯と思う無かれ。";
	mes "相手の力を100%発揮できないように";
	mes "することも、立派な戦法なのだ。";
	next;
	mes "[シューレン]";
	mes "^FF0000プロボックをかけられた相手は、";
	mes "頭に血が上り、理性を失う。";
	mes "理性を失った分、攻撃力が増すが";
	mes "防御への配慮が薄くなり、防御力が";
	mes "落ちる。^000000";
	next;
	mes "[シューレン]";
	mes "攻撃力の上がった相手は危険だが、";
	mes "防御力が弱くなった分、倒しやすい。";
	mes "うまく利用すれば、相手をうまく";
	mes "倒すことができる。";
	next;
	mes "[シューレン]";
	mes "使い方の一例を教えるとしよう。";
	mes "バッシュ1撃ではギリギリ倒せない";
	mes "相手がいるとしよう。その相手に";
	mes "プロボックをかける。";
	next;
	mes "[シューレン]";
	mes "理性を失って近付いてきたところで";
	mes "間合いを読み、相手が攻撃するより";
	mes "先にバッシュを一発！";
	mes "それで終わりだ。";
	next;
	mes "[シューレン]";
	mes "もちろん、これは机上論でしかない。";
	mes "このように全てが簡単にいけば、";
	mes "どれだけ楽なことか。";
	next;
	mes "[シューレン]";
	mes "^FF0000プロボックは、スキルレベルを";
	mes "上げるほど、スキルレベルに応じて";
	mes "敵の攻撃力も上がるが、その分、";
	mes "防御力も下がる。^000000";
	next;
	mes "[シューレン]";
	mes "このスキルも、バッシュのようにSPを";
	mes "消費する。つまり、バッシュと同じく";
	mes "^FF0000乱発には注意^000000だ。";
	return;
L_Endure:
	mes "[シューレン]";
	mes "インデュアは、言ってしまえば";
	mes "根性で耐える力だ。つまり、いくら";
	mes "攻撃が当たっても、痛くないぞ！と";
	mes "笑い飛ばすスキルだ。";
	next;
	mes "[シューレン]";
	mes "いくら鍛えぬいた肉体の持ち主でも、";
	mes "攻撃が当たれば痛い。";
	mes "そして、痛いと思った瞬間、攻撃や";
	mes "防御にスキができてしまう。";
	next;
	mes "[シューレン]";
	mes "良く考えると、それほど問題では";
	mes "ないかもしれない。だが、相手の";
	mes "攻撃スピードが速く、一瞬のスキの";
	mes "せいで、こちらが力を発揮できなく";
	mes "なってしまう可能性も0ではない。";
	next;
	mes "[シューレン]";
	mes "インデュアは、そんな悔しさを解消する";
	mes "ためのスキルでもある。";
	mes "^FF0000インデュアを発動すると、それから";
	mes "しばらくの間は、いくら攻撃が";
	mes "当たっても、動作が硬直することなく";
	mes "100%力を発揮することができる。^000000";
	next;
	mes "[シューレン]";
	mes "発動時間だが、そう長くは無い。";
	mes "相手の攻撃を受け、耐えるというのは";
	mes "もの凄い忍耐力と、鋼のような精神力を";
	mes "必要とするからだ。";
	next;
	mes "[シューレン]";
	mes "もちろん、^FF0000スキルレベルが上がれば";
	mes "発動時間も長くなる。^000000";
	mes "そして、^FF00001回インデュアを使った後";
	mes "少しだけ時間をおかなければ";
	mes "再びインデュアは使えない。^000000";
	return;
}

geffen.gat,154,143,3	script	ディキュイ	734,{
	if(Job == Job_Novice) {
		mes "[ディキュイ]";
		mes "ソードマンは知っているな？";
		mes "ソードマンになれば、鉄のように強靭な";
		mes "身体と精神を持つことになる。";
		mes "もちろん、努力次第だがな。";
		next;
		mes "[ディキュイ]";
		mes "他の職業と比べると、1番体で勝負する";
		mes "職業だから、真に自分の力を信じる";
		mes "職業だと言える！";
		next;
		mes "[ディキュイ]";
		mes "まだ、自分の未来を決めかねて";
		mes "いるなら、ソードマンになってみろ。";
		mes "もし既に決まっていても";
		mes "ソードマンを志していたらどうだ？";
		close;
	}
	if(Job != Job_Swordman) {
		mes "[ディキュイ]";
		mes "ソードマンじゃないな。";
		mes "あっちいけ！";
		mes "俺が相手をするのはソードマンだけだ！";
		close;
	}
	switch(QUE_SWORDMAN) {
	default:
		mes "[ディキュイ]";
		mes "……用がないなら、去れ。";
		mes "俺がお前の相手をする必要は";
		mes "なさそうだ。";
		close;
	case 6:
		mes "[ディキュイ]";
		mes "おう。お前は良い奴だな。";
		mes "どうして分かるかだって？";
		mes "はは、それはお前がソードマン";
		mes "だからさ！　ソードマンに悪い奴は";
		mes "いないってな！　アッハッハ！";
		next;
		mes "[ディキュイ]";
		mes "冗談はこれくらいにして、お前、";
		mes "シューレンの使いか？";
		mes "……全然頼もしそうじゃないな。";
		mes "まぁ、見掛けだけで判断することも";
		mes "ないか。";
		next;
		mes "[ディキュイ]";
		mes "で、どんな伝言を持ってきたんだ？";
		next;
		if(select("殺人者の……","暗殺者の……")==1) set '@word1$,"殺人";
		else set '@word1$,"暗殺";
		mes "["+strcharinfo(0)+"]";
		mes '@word1$+"者の件はどうした？";
		next;
		if(select("正体は……","背後……")==1) set '@word2$,"正体";
		else set '@word2$,"背後";
		mes "["+strcharinfo(0)+"]";
		mes '@word2$+"はわかったか？";
		next;
		if(select("今日から私達は……","これから私達は……")==1) set '@word3$,"今日";
		else set '@word3$,"これ";
		mes "["+strcharinfo(0)+"]";
		mes '@word3$+"から私達はどうすればいい？";
		next;
		mes "[ディキュイ]";
		mes '@word1$+"者の件はどうした？";
		mes '@word2$+"はわかったか？";
		mes '@word3$+"から私達はどうすればいい？";
		mes "……と言われたのか？";
		next;
		if(('@word1$ != "暗殺")||('@word2$ != "正体")||('@word3$ != "これ")) {
			mes "[ディキュイ]";
			mes "何だ、いったい。訳がわからないぞ。";
			mes "間違って覚えてないか？";
			mes "きちんと確認してこい。";
			close;
		}
		mes "[ディキュイ]";
		mes "大体、言いたいことはわかった。";
		mes "シューレンめ、相変わらず心配性だな。";
		mes "まぁ、わからないでもないが……";
		mes "よし、帰って、こう伝えろ。";
		next;
		mes "[ディキュイ]";
		mes "まだだ。";
		mes "しかし、もうすぐ正体をつかめそうだ。";
		mes "その時は、もう一度お願いする。";
		next;
		mes "[ディキュイ]";
		mes "以上だ。";
		mes "ここまで来るのは大変だったろう。";
		mes "これを受け取るがいい。";
		set QUE_SWORDMAN,7;
		if(checkre())
			getexp 112,0;
		else
			getexp 1120,0;
		next;
		mes "[ディキュイ]";
		mes "それじゃ、生真面目なシューレンの";
		mes "ところへ送ってやるよ。";
		mes "じゃあな。";
		next;
		warp "izlude.gat",35,78;
		end;
	case 7:
		mes "[ディキュイ]";
		mes "こんな所でグズグズしてないで";
		mes "早くシューレンに伝えに行け。";
		mes "「まだだ。";
		mes "しかし、もうすぐ正体をつかめそうだ。";
		mes "その時は、もう1度お願いする。」";
		next;
		mes "[ディキュイ]";
		mes "以上を伝えろ。内容については";
		mes "詮索するな。知ったところで";
		mes "良いことなんて一つもないからな。";
		close;
	case 8:
	case 9:
	case 10:
	case 11:
		mes "[ディキュイ]";
		mes "ちゃんとシューレンに伝えたか？";
		mes "これ以上、お前に頼むような仕事は";
		mes "ないぞ。";
		close;
	case 12:
		mes "[ディキュイ]";
		mes "久しぶりだな！　うまくいってるか？";
		mes "少し見ないうちに、なかなか強くなった";
		mes "みたいじゃないか。";
		mes "さて、早速だが、仕事の内容だ。";
		next;
		mes "[ディキュイ]";
		mes "前に、暗殺者がどうのって話が";
		mes "あっただろう。その続きだ。";
		mes "誰が暗殺者か絞り込むのを手伝って";
		mes "欲しい。";
		next;
		mes "[ディキュイ]";
		mes "^FF0000モロク^000000へ行き、そこで^FF0000ムトー^000000、";
		mes "^FF0000ゲイル^000000、^FF0000ハンス^000000、^FF0000バングル^000000を探せ。";
		mes "そして、その中の誰が暗殺者か";
		mes "探し出すんだ。それが、お前の任務だ。";
		next;
		mes "[ディキュイ]";
		mes "四人と話した後、ここに戻って来い。";
		mes "長居は危険だしな。";
		next;
		mes "[ディキュイ]";
		mes "いいか、犯人が4人の内誰か";
		mes "俺に報告するんだ。";
		mes "わかったな？";
		next;
		mes "[ディキュイ]";
		mes "それと、忘れるな。";
		mes "これは^FF0000極秘任務^000000だ。";
		mes "友人知人であろうと、親兄弟であろうと";
		mes "^FF0000絶対に任務について話してはいけない。^000000";
		next;
		mes "[ディキュイ]";
		mes "わかったな？";
		mes "わかったら、さっさと行け！";
		mes "幸運を祈る！";
		next;
		mes "[ディキュイ]";
		mes "ん、モロクは遠い？　確かにな。";
		mes "よし、近くまで送ってやる。";
		mes "ウラァァァ！";
		set QUE_SWORDMAN,13;
		close2;
		warp "moc_fild07.gat",359,201;
		end;
	case 13:
		mes "[ディキュイ]";
		mes "モロクだ。";
		mes "早く行け！";
		close;
	case 14:
		mes "[ディキュイ]";
		mes "モロクはどうだった？";
		mes "暗号がどうたらという";
		mes "情報が入ってきたが、いったい何だ？";
		next;
		mes "[ディキュイ]";
		mes "一応……ハンスって奴の";
		mes "暗号から教えてくれ。";
		next;
		input '@str$;
		if('@str$ == "ハンンダウアテゾ") {
			mes "[ディキュイ]";
			mes "ハンンダウアテゾ？";
			mes "変な暗号もあったもんだ。";
			mes "じゃあ、バングルは何って言ってた？";
			next;
			input '@str$;
			if('@str$ == "バザソダヘチクラ") {
				mes "[ディキュイ]";
				mes "バザソダヘチクラ……";
				mes "なんなんだ？";
				mes "新しい宗教のお経か？";
				mes "次、ムトーは？";
				next;
				input '@str$;
				if('@str$ == "ンニバルヨハツル") {
					mes "[ディキュイ]";
					mes "ンニバルヨハツル";
					mes "なんだかなぁ……";
					mes "とにかく、最後だ。";
					mes "ゲイルは何と言ってた？";
					next;
					input '@str$;
					if('@str$ == "シンハグシコガイ") {
						mes "[ディキュイ]";
						mes "シンハグシコガイ……";
						mes "何か意味があるのか？";
						mes "全然わからないな……";
						mes "お前はわかるか？";
						next;
						mes "[ディキュイ]";
						mes "俺としては、これが言葉なのかさえ";
						mes "わからない。しかし、これが犯人を";
						mes "捕まえる重要な手掛かりだってのは";
						mes "確かだ。";
						set QUE_SWORDMAN,15;
						close;
					}
				}
			}
		}
		mes "[ディキュイ]";
		mes "そんなのあるか。";
		mes "もう一度確認して来い。";
		close;
	case 15:
		mes "[ディキュイ]";
		mes "暗号文の順番や組み合わせが";
		mes "違うのかもしれない。";
		mes "並べ方を変えてみようか。";
		next;
		mes "[ディキュイ]";
		mes "お前が決めてみろ。";
		setarray '@word$,"ンニバルヨハツル","ハンンダウアテゾ","シンハグシコガイ","バザソダヘチクラ";		//名前元、selectで使う名前、4番目の番号を参照用の3つを用意
		setarray '@name$,"ムトー","ハンス","ゲイル","バングル";
		copyarray '@copy$,'@name$,4;
		setarray '@elem,0,1,2,3;
		for(set '@i,0; '@i<3; set '@i,'@i+1) {
			next;
			set '@j,select('@copy$[0],'@copy$[1],'@copy$[2],'@copy$[3])-1;
			set '@res['@i],'@j;		//選択番号を'@res配列に順に格納
			set '@copy$['@j],"";		//選択したものは空文字で埋める
			set '@elem['@j],0;		//'@elem配列を0にしておく
			mes "[ディキュイ]";
			mes ('@i+1)+ "番目は"+'@name$['@j]+"。";
			if('@i==2) set '@res[3],'@elem[0]+'@elem[1]+'@elem[2]+'@elem[3];	//4番目は'@elemの中の残った値
			else mes ('@i+2)+ "番目は？";
		}
		next;
		//それぞれ選んだ順番に名前が列挙
		mes "[ディキュイ]";
		mes '@name$[('@res[0])]+"、"+'@name$[('@res[1])]+"、"+'@name$[('@res[2])]+"、"+'@name$[('@res[3])];
		mes " ";
		mes '@word$[('@res[0])];	//１番目に選んだ人の暗号
		mes '@word$[('@res[1])];	//２番目に選んだ人の暗号
		mes '@word$[('@res[2])];	//３番目に選んだ人の暗号
		mes '@word$[('@res[3])];	//４番目の人の暗号
		next;
		if('@res[0] == 3 && '@res[1] == 2 && '@res[2] == 0 && '@res[3] == 1) set QUE_SWORDMAN,16;
		else if('@res[0] == 2 && '@res[1] == 0 && '@res[2] == 1 && '@res[3] == 3) set QUE_SWORDMAN,17;
		else {
			mes "[ディキュイ]";
			mes "訳わからんな。";
			mes "他の組み合わせも試してみよう。";
			close;
		}
		mes "[ディキュイ]";
		mes "…………ん？";
		mes "おい、最" +(QUE_SWORDMAN == 16? "初": "後")+ "の1行を外して";
		mes "読めば……!!";
		close;
	case 16:
	case 17:
		mes "[ディキュイ]";
		if(QUE_SWORDMAN == 16) mes "バザソダヘチクラ";
		mes "シンハグシコガイ";
		mes "ンニバルヨハツル";
		mes "ハンンダウアテゾ";
		if(QUE_SWORDMAN == 17) mes "バザソダヘチクラ";
		next;
		mes "[ディキュイ]";
		mes "そうか！";
		mes "犯人の暗号だけ外して読むんだ！";
		mes "お前も気がついたはずだ。";
		mes "犯人が誰か！";
		next;
		setarray '@name$,"ハンス","バングル","ゲイル","ムトー";
		if(select("ハンス","バングル","ゲイル","ムトー") != 2) {
			mes "[ディキュイ]";
			mes "……どうして" +'@name$[@menu-1]+ "が犯人なんだ。";
			mes "もう1回、ちゃんと解読してみろ。";
			close;
		}
		mes "[ディキュイ]";
		mes "そう、犯人はバングルだ！";
		mes "バングルの暗号文だけ外して";
		mes "ゲイル、ムトー、ハンスの順に";
		mes "文を縦読みすればいい！";
		next;
		mes "[ディキュイ]";
		mes "「真犯人はバングルだ。証拠は";
		mes "あがっているぞ。」";
		mes " ";
		mes "こう読める！";
		next;
		mes "[ディキュイ]";
		mes "この暗号を完全に信用するわけには";
		mes "いかないが、やっと手に入れた";
		mes "手掛かりだ。";
		next;
		mes "[ディキュイ]";
		mes "お前、モロクに行って、";
		mes "バングルを見張れ！";
		mes "いいな、早くだ！";
		set QUE_SWORDMAN,18;
		if(checkre())
			getexp 162,0;
		else
			getexp 1620,0;
		close2;
		warp "moc_fild07.gat",359,201;
		end;
	case 18:
		mes "[ディキュイ]";
		mes "何をしている！";
		mes "早くモロクに向い、バングルを";
		mes "見張るんだ！";
		close;
	case 19:
		mes "[ディキュイ]";
		mes "どうした、バングルを見張れと言った";
		mes "だろう。何かあったか？";
		next;
		mes "[ディキュイ]";
		mes "……なんだと?!";
		mes "バングルが死んだ?!";
		mes "自殺らしい？";
		mes "……犯人だったから自殺したのか？";
		mes "それとも……";
		next;
		mes "[ディキュイ]";
		mes "何か、裏を感じる。";
		mes "だが、それ以上はわからないな。";
		mes "残りの3名は秘密裏に監視を";
		mes "続けることにしよう。";
		next;
		mes "[ディキュイ]";
		mes "それで、何か新しい事実が";
		mes "出てくればいいが……ひとまず";
		mes "事件は終わりか。";
		mes "ありがとうよ。";
		next;
		mes "[ディキュイ]";
		mes "さて、早くシューレンのところに";
		mes "戻りな。じゃあな！";
		mes "お疲れ！";
		set QUE_SWORDMAN,20;
		close2;
		warp "izlude.gat",35,78;
		end;
	case 20:
	case 21:
	case 22:
		mes "[ディキュイ]";
		mes "頑張って任務をこなし、";
		mes "立派なソードマンになれよ。";
		close;
	}
}

morocc_in.gat,51,101,3	script	ゲイル	89,{
	if((QUE_SWORDMAN == 13) || (QUE_SWORDMAN == 14)) {
		mes "[ゲイル]";
		mes "どうして、私が暗殺者なんだ。";
		mes "私は、暗殺者なんかじゃない。";
		next;
		mes "[ゲイル]";
		mes "誰が死んだかもしらないのに……";
		mes "とにかく、私じゃないんだ！";
		next;
		mes "[ゲイル]";
		mes "私が知っていることといえば、あの日";
		mes "酒場で飲んでいたら、誰かが変な";
		mes "暗号を教えてくれたくらいだ。";
		next;
		mes "[ゲイル]";
		mes "見た目はごく普通の男が、酔っ払って";
		mes "近付いてきて、ボソっとつぶやいて";
		mes "言ったんだ。";
		next;
		mes "[ゲイル]";
		mes "^FF0000シンハグシコガイ^000000";
		mes " ";
		mes "こんな変な文章だったんだ。";
		mes "どうして、こんな変な文を";
		mes "覚えられたのか不思議だけど、";
		mes "酔ってたからかな……";
		next;
		mes "[ゲイル]";
		mes "いつか、困った状況になったら、この";
		mes "暗号を教えてやれと言われたんだ。";
		mes "だけど、本当に何がなんだか";
		mes "わからないよ。";
		next;
		mes "[ゲイル]";
		mes "私は、犯人じゃないんだ！";
		mes "頼む、わかってくれよ。";
		set QUE_SWORDMAN,14;
		close;
	}
	mes "[ゲイル]";
	mes "平和が一番！";
	mes "そう思いませんか？";
	mes "なのに最近、あちこちが荒れている";
	mes "みたいで、私も不安です。";
	close;
}

morocc.gat,82,292,5	script	ムトー	84,{
	if((QUE_SWORDMAN ==  13)|| (QUE_SWORDMAN == 14)) {
		mes "[ムトー]";
		mes "あなたも……";
		mes "これ以上、教えられることは";
		mes "ないです。";
		next;
		mes "[ゲイル]";
		mes "^FF0000ンニバルヨハツル^000000";
		mes " ";
		mes "……確かに、言いましたからね。";
		mes "もっとも、何を言ったところで";
		mes "無駄でしょう。早く真犯人を捕まえて";
		mes "私を自由にしてください。";
		set QUE_SWORDMAN,14;
		close;
	}
	mes "[ムトー]";
	mes "自分なりに頑張って生活している";
	mes "つもりなのに、たまにとんでもない事が";
	mes "起こったり。でも、それも人生の";
	mes "試練ってもんじゃないですかね。";
	close;
}

morocc.gat,240,72,3	script	ハンス	86,{
	if((QUE_SWORDMAN == 13) || (QUE_SWORDMAN == 14)) {
		mes "[ハンス]";
		mes "ソードマンさん！";
		mes "僕は決して、犯人じゃありません！";
		mes "僕は、普通に暮らしてきた";
		mes "平凡な一市民です！";
		next;
		mes "[ハンス]";
		mes "もう見張られるのはウンザリです！";
		mes "早く僕の無罪を証明してください！";
		mes "暗号でもなんでも教えますから！";
		next;
		mes "[ハンス]";
		mes "^FF0000ハンンダウアテゾ^000000";
		mes " ";
		mes "これが暗号です。";
		mes "僕、これがどういう意味なのか";
		mes "本当に何もわからないんです！";
		next;
		mes "[ハンス]";
		mes "え、この暗号ですか？";
		mes "僕に何か起こったら、これを教えて";
		mes "あげればいいって、誰かに言われて";
		mes "いたんです。";
		next;
		mes "[ハンス]";
		mes "僕は記憶力が悪いほうなのに、";
		mes "どうして、こんな意味不明な文を";
		mes "覚えているんだろう……あの男が、";
		mes "魔法でも使って、忘れないように";
		mes "したとしか思えません！";
		next;
		mes "[ハンス]";
		mes "とにかく、僕が知っていることは";
		mes "これだけです！";
		mes "どうか、僕の無罪を証明してください！";
		set QUE_SWORDMAN,14;
		close;
	}
	mes "[ハンス]";
	mes "何か用ですか？";
	mes "今の世の中、普通に暮らすのも";
	mes "大変で困っちゃいますよ。";
	close;
}

morocc_in.gat,12,156,3	script	バングル	97,{
	if((QUE_SWORDMAN == 13) || (QUE_SWORDMAN == 14)) {
		mes "[バングル]";
		mes "私は人を殺したことなんかないです。";
		mes "私は潔白です。";
		mes "変な男が教えてくれた暗号も";
		mes "知っています。";
		next;
		mes "[バングル]";
		mes "^FF0000バザソダヘチクラ^000000";
		mes " ";
		mes "これがどういう意味なのか";
		mes "わかりませんが、私は何一つ";
		mes "隠すことなんかありません。";
		next;
		mes "[バングル]";
		mes "普通に暮らしているのに、このような";
		mes "扱いを受ける気持ち、わかりますか？";
		mes "私が無罪だったら、どんな補償を";
		mes "してくれるって言うんです？";
		next;
		mes "[バングル]";
		mes "早く犯人を捕まえてください。";
		mes "不愉快でしかたない。";
		set QUE_SWORDMAN,14;
		close;
	}
	if(QUE_SWORDMAN >= 18) {
		mes "-死んでいる-";
		mes "-その顔は恨みと悲しみで";
		mes "固まっている-";
		mes "-死んでからそれ程経っていないのか";
		mes "死後硬直はそれほど広がっていない-";
		next;
		mes "-彼の胸に、ナイフで刺したような";
		mes "深い傷がある-";
		mes "-彼の右手には、ナイフが一つ";
		mes "ぎゅっと握られている-";
		if(QUE_SWORDMAN == 18) set QUE_SWORDMAN,19;
		close;
	}
	mes "[バングル]";
	mes "他の都市を見てみたいが、";
	mes "お金がないので旅行なんて無理。";
	mes "一儲けして、旅行でもしたい";
	mes "気分ですよ。";
	close;
}

//============================================================
// アコライトクエストNPC
//- Registry -------------------------------------------------
// QUE_ACOLYTE -> 0～25
//------------------------------------------------------------
prt_church.gat,179,15,1	script	プラ神父	110,{
	if(QUE_2ARCHER == 7) {
		mes "[プラ神父]";
		mes "聖堂関係者で、王宮と関わりの";
		mes "ある方にお会いしたいと？";
		next;
		mes "[プラ神父]";
		mes "その方は今、修道院に出張して";
		mes "おられます。^3131FFプロンテラ北東^000000の";
		mes "聖カピトーリナ修道院に行き、";
		mes "マギンス司教をお訪ねなさい。";
		close;
	}
	if(Job != Job_Acolyte) {
		mes "[プラ神父]";
		mes "神の祝福がいつもあなたと共に";
		mes "ありますよう。";
		close;
	}
	switch(QUE_ACOLYTE) {
	case 0:
		mes "[プラ神父]";
		mes "オーディン様のお導きにより、";
		mes "こうして出会いがあることに";
		mes "感謝いたします。";
		next;
		mes "[プラ神父]";
		mes "ところで、あなたはこれから";
		mes "アコライトとして、どう生きて";
		mes "ゆきたいのですか？";
		mes "少しばかり、心配でしてな。";
		next;
		if(select("心配ありません","私は何をすればいいのでしょう？")==1) {
			mes "[プラ神父]";
			mes "その固い意志が秘められた清き瞳。";
			mes "はい、安心しました。";
			next;
			mes "[プラ神父]";
			mes "しかし、もし迷うことがあったら";
			mes "いつでも私のもとへおいでなさい。";
			mes "必ず、あなたのお役に立ちましょう。";
			close;
		}
		mes "[プラ神父]";
		mes "プロンテラの北東に修道院があります。";
		mes "そう、聖カピトーリナ修道院です。";
		mes "そこへ向かい、^3131FFシスター・アステ^000000に";
		mes "お会いなさい。";
		next;
		mes "[プラ神父]";
		mes "シスター・アステは慈悲深きお方。";
		mes "あなたに必要なことを教えてくださる";
		mes "でしょう。";
		next;
		mes "[プラ神父]";
		mes "これからアコライトとして生きて";
		mes "ゆく以上、あなたが学ばなければ";
		mes "ならないことはたくさんあります。";
		next;
		mes "[プラ神父]";
		mes "次にお会いする時、あなたが";
		mes "見違えるほど成長しているのを";
		mes "楽しみに、こちらで待っていますよ。";
		mes "すぐにシスター・アステにお会いに";
		mes "行かれるというなら、私が彼女のもとへ";
		mes "送って差し上げましょう。";
		set QUE_ACOLYTE,1;
		break;
	case 22:
		if(countitem(7181) < 1) {
			mes "[プラ神父]";
			mes "神の祝福がいつもあなたと共に";
			mes "ありますよう。";
			close;
		}
		emotion 0;
		mes "[プラ神父]";
		mes "おやおや、あなたはいつぞやの……";
		mes "しばらく見ないうちに、だいぶ";
		mes "成長されたようですな。";
		next;
		mes "[プラ神父]";
		mes "私に用が？";
		mes "おや、なんと。領収書が修道院に";
		mes "送られていたとは。どうりで連絡が";
		mes "遅いと思っていました。";
		mes "ありがとうございます。";
		next;
		mes "[プラ神父]";
		mes "さて、久しぶりですし、その成長を";
		mes "お祝いして、何か差し上げたいの";
		mes "ですが……";
		next;
		mes "[プラ神父]";
		mes "……これなんてどうでしょうか？";
		next;
		mes "[プラ神父]";
		mes "どちらか1つ、差し上げましょう。";
		mes "私の祖父が使っていたものですが、";
		mes "よければお使いください。";
		next;
		if(select("杖","鈍器")==1)
			getitem 1604,1;
		else
			getitem 1510,1;
		delitem 7181,1;
		set QUE_ACOLYTE,23;
		close;
	case 25:
		mes "[プラ神父]";
		mes "これからは、自分の力で未来を";
		mes "切り開きなさい。";
		next;
		mes "[プラ神父]";
		mes "私はいつでもここから、あなたの信心や";
		mes "慈悲、それに勇気を信じていますよ。";
		mes "神の祝福がいつもあなたと共に";
		mes "ありますよう。";
		close;
	default:
		mes "[プラ神父]";
		mes "シスター・アステは慈悲深きお方。";
		mes "あなたに必要なことを教えてくださる";
		mes "でしょう。";
		break;
	}
	next;
	if(select("修道院に行く","修道院に行かない")==2) {
		mes "[プラ神父]";
		mes "修道院に行く時は、遠慮なく";
		mes "私に声をおかけなさい。";
		mes "修道院へ送って差し上げましょう。";
		close;
	}
	mes "[プラ神父]";
	mes "シスター・アステによろしく。";
	mes "それでは、行ってらっしゃい。";
	close2;
	warp "prt_monk.gat",30,250;
	end;
}

prt_monk.gat,230,106,3	script	アステ	79,{
	switch(QUE_ACOLYTE) {
	case 1:
		mes "[アステ]";
		mes "このような遠い所まで、";
		mes "よくいらっしゃいました。";
		mes "何かご用でしょうか？";
		next;
		if(select("遊びに来ました","プラ神父の紹介で来ました")==1) {
			mes "[アステ]";
			mes "ここはいつも静かで平和です。";
			mes "ベンチに座り、自然を感じるだけでも";
			mes "なにかを学べるのではないかしら。";
			close;
		}
		mes "[アステ]";
		mes "プラ神父の？";
		mes "でしたら、これから私がアコライトに";
		mes "ついての授業をいたしましょう。";
		mes "アコライト様が納得できるような";
		mes "授業になると良いですわ。";
		next;
		mes "[アステ]";
		mes "ここまでの長旅で、お疲れでしょう。";
		mes "少し休憩なさってはいかがかしら。";
		mes "修道院を見て回るのも良いですわね。";
		mes "休憩が終わりましたら、";
		mes "授業を開始いたしましょう。";
		set QUE_ACOLYTE,2;
		close;
	case 2:
		mes "[アステ]";
		mes "ここ、聖カピトーリナ修道院は、";
		mes "花々が咲き誇り、鳥達がさえずる";
		mes "美しく平和な場所です。";
		mes "ここにいますと、";
		mes "心が洗われるようですわ。";
		next;
		mes "[アステ]";
		mes "さて、それでは授業を始めると";
		mes "いたしましょう。";
		next;
		mes "[アステ]";
		mes strcharinfo(0)+ "様は、";
		mes "どのようなアコライトを目指すか、";
		mes "お考えになったことは";
		mes "ありますでしょうか？";
		mes "これからの自分を頭に思い描くのは";
		mes "とても重要なことですのよ。";
		next;
		if(select("人を助け、癒したい","神罰を下したい")==1) {
			mes "[アステ]";
			mes "治療を施し、危機に瀕した仲間を";
			mes "支援する……あなたは^3131FFプリースト^000000を";
			mes "目指し、アコライトの道をお選びに";
			mes "なったのですね。";
			mes "誠に素晴らしいことです。";
			next;
			mes "[アステ]";
			mes "プリーストは、仲間を支援する能力も";
			mes "ありますが、自らの力で魔を退ける";
			mes "こともできます。";
			next;
			mes "[アステ]";
			mes "戦士のように武器を持ち、モンスターと";
			mes "戦うことも可能ですわ。";
			mes "ただし、^3131FF刃のある武器は使用禁止^000000という";
			mes "規定がありますので、お忘れなく。";
		}
		else {
			mes "[アステ]";
			mes "拳に信心を込め、神罰を下す者達は";
			mes "^3131FFモンク^000000と呼ばれています。";
			mes "彼らはとても直接的な方法で";
			mes "信義を表現いたします。";
			next;
			mes "[アステ]";
			mes "しかし、このような方法はかなりの";
			mes "忍耐力を必要とします。";
			mes "その修行のため彼らは";
			mes "その身一つで大陸を旅するのです。";
		}
		next;
		mes "[アステ]";
		mes "しかし、それもまだはるか遠い";
		mes "未来のお話。";
		mes "ゆっくりと、自分の将来について";
		mes "お考えください。";
		next;
		mes "[アステ]";
		mes "それでは、話をもとに戻しましょう。";
		next;
		mes "[アステ]";
		mes strcharinfo(0)+ "様は、";
		mes "聖職者の、一番基本となるスキルは";
		mes "何だとお考えになりますか？";
		next;
		switch(select("ヒール","アクアベネディクタ","テレポート")) {
		case 1:
			mes "[アステ]";
			mes "はい。";
			mes "^3131FFヒール^000000は私達聖職者が人を";
			mes "助ける時、一番基本とするスキルです。";
			mes "自分と他人の体力を回復することの";
			mes "できるスキルですわ。";
			break;
		case 2:
			mes "[アステ]";
			mes "^3131FFアクアベネディクタ^000000は普通の";
			mes "水に祝福を与え、神聖な聖水へと";
			mes "変換するスキルです。";
			mes "重要ではありますが、基本とは";
			mes "言えないのではないでしょうか？";
			next;
			mes "[アステ]";
			mes "聖職者に与えられし、神聖なる力……";
			mes "聖職者の基本となるスキルは";
			mes "やはり^3131FFヒール^000000です。";
			break;
		case 3:
			mes "[アステ]";
			mes "^3131FFテレポート^000000は瞬間的に移動する";
			mes "スキルですわ。神が私達にお与え";
			mes "くださった、神々しい力には違い";
			mes "ありませんが、基本とは言えないのでは";
			mes "ないでしょうか？";
			next;
			mes "[アステ]";
			mes "聖職者に与えられし、神聖なる力……";
			mes "聖職者の基本となるスキルは";
			mes "やはり^3131FFヒール^000000です。";
			break;
		}
		next;
		mes "[アステ]";
		mes "ヒールは、その神聖な力で^3131FF不死属性の";
		mes "モンスターにダメージ^000000を与えることが";
		mes "できますわ。";
		mes "Shiftキーを押しながら、";
		mes "モンスターにヒールをかければ、";
		mes "神聖な力によって浄化されます。";
		next;
		mes "[アステ]";
		mes "体の中から湧き出る、この温かい力を";
		mes "手に集め……";
		next;
		mes "[アステ]";
		mes "ヒール!!";
		npcskillsupport 28,9999;
		heal 9999,0;
		set QUE_ACOLYTE,3;
		if(getskilllv(28) == 0) {
			if(checkre())
				getexp 0,10;
			else
				getexp 0,100;
			misceffect 71,"";
		}
		close;
	case 3:
		mes "[アステ]";
		mes "ここで、アコライト様に一つ、課題を";
		mes "お出ししたいと思います。";
		mes "基本を知るには知識も必要ですが、";
		mes "修練も疎かにしてはならないのです。";
		next;
		if(getskilllv(28) >= 3) {
			mes "[アステ]";
			mes "まぁ、アコライト様！";
			mes "すでにご自分でヒールを習得されて";
			mes "おられたのですね。";
			mes "素晴しいです！";
			next;
			mes "[アステ]";
			mes "では次の授業を行うとしましょう。";
			set QUE_ACOLYTE,5;
			close;
		}
		mes "[アステ]";
		mes "それでは、これからヒールを";
		mes "^3131FFLv3^000000まで修練してきて";
		mes "くださいませ。";
		next;
		mes "[アステ]";
		mes "まだアコライト様は体力が少ないと";
		mes "思いますので、強いモンスターに";
		mes "挑むより、弱いモンスターをたくさん";
		mes "相手になさると良いと思います。";
		next;
		mes "[アステ]";
		mes "しかし、いくら弱肉強食の世とはいえ、";
		mes "聖職者として、犠牲となった";
		mes "小さな命にも感謝する心を";
		mes "お忘れなきよう。";
		next;
		mes "[アステ]";
		mes "そして、私から、このメイスを";
		mes "お貸ししましょう。";
		next;
		mes "[アステ]";
		mes "この付近のモンスターは、";
		mes "アコライト様には、少々危険ですので";
		mes "^3131FFプロンテラ周辺のモンスター^000000を";
		mes "相手になさるといいでしょう。";
		next;
		mes "[アステ]";
		mes "アコライト様のセーブポイントを、";
		mes "この修道院に変更しておきましょう。";
		mes "ヒールをLv3まで習得されましたら、";
		mes "この蝶の羽を使って、ここに戻って";
		mes "くることができます。";
		next;
		mes "[アステ]";
		mes "もしくは^3131FFプロンテラ大聖堂のプラ神父^000000に";
		mes "お頼みすれば、こちらに送って";
		mes "くださいます。";
		next;
		mes "[アステ]";
		mes "それでは、神の祝福がいつもあなたと";
		mes "共にありますよう。";
		set QUE_ACOLYTE,4;
		getitem 1504,1;
		getitem 602,1;
		savepoint "prt_monk.gat",30,250;
		close;
	case 4:
		if(getskilllv(28) < 3) {
			mes "[アステ]";
			mes "お辛いですか、アコライト様？";
			mes "しかし、基本は何より重要なのです。";
			mes "辛いでしょうが、これも神がお与えに";
			mes "なった試練……";
			next;
			mes "[アステ]";
			mes "努力が結果に繋がり、ご自身へと";
			mes "昇華される日が、1日でも早く";
			mes "訪れますよう。";
			close;
		}
		mes "[アステ]";
		mes "おかえりなさいませ。";
		mes "立派に課題を終えられたのですね。";
		if(countitem(1504) < 1) {
			mes "あら、お貸ししたメイスは？";
			mes "あれはこちらの備品ですので、";
			mes "お持ちいただけませんか？";
			close;
		}
		set QUE_ACOLYTE,5;
		delitem 1504,1;
		if(Job == Job_Acolyte && Upper == UPPER_HIGH) {
			if(checkre())
				getexp 200,100;
			else
				getexp 2000,1000;
		}
		else {
			if(checkre())
				getexp 100,50;
			else
				getexp 1000,500;
		}
		misceffect 71,"";
		close;
	case 5:
		mes "[アステ]";
		mes "それでは、アコライトに関係する職業に";
		mes "ついてご説明いたしましょう。";
		next;
		mes "[アステ]";
		mes "修練を積んだノービスは、";
		mes "プロンテラ大聖堂でアコライトへと";
		mes "転職できます。今の";
		mes strcharinfo(0)+ "様の";
		mes "ような方ですね。";
		mes "これを、1次転職と呼びます。";
		next;
		mes "[アステ]";
		mes "アコライトとなり、";
		mes "^3131FFJOBレベルが40^000000以上に";
		mes "なりましたら、2次転職の資格を";
		mes "得ることができます。";
		next;
		mes "[アステ]";
		mes "2次転職により、もう少し細かく、";
		mes "専門的な職業へと";
		mes "分かれることになります。";
		next;
		mes "[アステ]";
		mes "神聖な祝福の使徒である^3131FFプリースト^000000と";
		mes "拳に神の意志を込めた神罰の代行者、";
		mes "^3131FFモンク^000000です。";
		next;
		mes "[アステ]";
		mes "そして、2次転職後も修練を積み、";
		mes "やがては天空のヴァルキリー様と";
		mes "お会いになることができれば、";
		mes "生まれ変わり新たな人生を";
		mes "歩むこともできます。";
		next;
		mes "[アステ]";
		mes "その後も修練を重ねることにより";
		mes "^3131FFハイプリースト^000000や^3131FFチャンピオン^000000";
		mes "といった上位の職に就くことも";
		mes "できるのです。";
		next;
		mes "[アステ]";
		mes "お分かりになりましたか？";
		mes "今は難しくとも、徐々にわかるように";
		mes "なると思いますわ。";
		set QUE_ACOLYTE,6;
		close;
	case 6:
		mes "[アステ]";
		mes strcharinfo(0)+ "様、";
		mes "ただいま、1通の手紙が届きました。";
		mes "しかし、どうやら間違って";
		mes "配達されてきたみたいで……";
		mes "宛先は……ガイ神父ですわね。";
		next;
		mes "[アステ]";
		mes "私は、少しばかり忙しく、";
		mes "持ち場を離れられません。";
		mes "よろしければ、この手紙をガイ神父に";
		mes "届けていただけませんか？";
		mes "ガイ神父は、そこの建物の";
		mes "中にいらっしゃいます。";
		set QUE_ACOLYTE,7;
		getitem 7148,1;
		close;
	case 7:
		mes "[アステ]";
		mes "私は、少しばかり忙しく、";
		mes "持ち場を離れられません。";
		mes "よろしければ、この手紙をガイ神父に";
		mes "届けていただけませんか？";
		mes "ガイ神父は、そこの建物の";
		mes "中にいらっしゃいます。";
		close;
	case 9:
		mes "[アステ]";
		mes "フェイヨンにお手伝いに";
		mes "赴かれていたのですって？";
		mes "まぁまぁ……大変でしたのね。";
		mes "お顔に傷が……";
		next;
		mes "[アステ]";
		mes "ブレッシング!!";
		npcskillsupport 34,0;
		sc_start 10,240000,10;
		next;
		mes "[アステ]";
		mes "次にお教えするスキルは";
		mes "^FF0000ブレッシング^000000です。";
		mes "神の祝福を与えるスキルで、^3131FFSTR^000000、";
		mes "^3131FFINT^000000、^3131FFDEX^000000の能力を上昇させ、";
		mes "^3131FF呪い^000000を解く効果を持っています。";
		next;
		mes "[アステ]";
		mes "ヒールと同じように使用すれば、";
		mes "不死属性モンスターを呪い状態に";
		mes "することができます。";
		next;
		mes "[アステ]";
		mes "ブレッシングは、";
		mes "^FF0000ディバインプロテクション^000000という";
		mes "不死属性や悪魔形モンスターに";
		mes "対する防御力を高めるスキルを";
		mes "Lv5まで修練を積めば習得する";
		mes "ことができます。";
		next;
		mes "[アステ]";
		mes "神に仕える者とし、人に神の祝福を";
		mes "分け与えることができるのは、";
		mes "本当に幸せなことです。";
		mes "私は、毎日神に感謝の祈りを";
		mes "捧げております。";
		next;
		mes "[アステ]";
		mes "さて、私はまた自分の仕事に";
		mes "戻らねばならないのですが……";
		next;
		mes "[アステ]";
		mes "そうですわ！";
		mes "北東の墓地に、この間迷い込んできた";
		mes "子犬がいるのです。";
		mes "ちょうど、餌の時間ですので、";
		mes "その子犬に餌を持って";
		mes "行っていただけませんか？";
		next;
		mes "-子犬の餌を受け取った-";
		set QUE_ACOLYTE,10;
		close;
	case 11:
	case 12:
		mes "[アステ]";
		mes "悪霊を祓う方法ですか？";
		next;
		mes "[アステ]";
		mes "ふむ……これもきっと、天が";
		mes "アコライト様に与えたもうた";
		mes "試練なのでしょう。";
		next;
		mes "[アステ]";
		mes "アコライト様は、もうその答えを";
		mes "ご存知ですよ。";
		mes "よく考えてみてください。";
		set QUE_ACOLYTE,12;
		close;
	case 13:
		mes "[アステ]";
		mes "ディバインプロテクションを習得すると";
		mes "ブレッシングを覚えられるようになると";
		mes "いうお話は覚えていますか？";
		next;
		mes "[アステ]";
		mes "スキルウィンドウを開いてみると";
		mes "分かると思いますが、ディバイン";
		mes "プロテクションをある程度修練しますと";
		mes "^3131FFデーモンベイン^000000と^3131FFエンジェラス^000000を";
		mes "覚えられるようになります。";
		next;
		mes "[アステ]";
		mes "^3131FFデーモンベイン^000000は";
		mes "不死属性や悪魔形モンスターに対する";
		mes "攻撃力が向上する、戦闘に直接";
		mes "影響のあるスキルです。";
		next;
		mes "[アステ]";
		mes "デーモンベインをLv3まで習得すると、";
		mes "ディバインプロテクションの強化版、";
		mes "^3131FFシグナムクルシス^000000を";
		mes "習得できるようになります。";
		next;
		misceffect 40;
		mes "[アステ]";
		mes "ディバインプロテクションが自分の";
		mes "防御力を向上させるスキルなら、";
		mes "シグナムクルシスは、モンスターの";
		mes "防御力を低下させるスキルです。";
		next;
		misceffect 41;
		mes "[アステ]";
		mes "^3131FFエンジェラス^000000はパーティーの";
		mes "防御力を上昇させるスキルで、VITの";
		mes "影響を受けます。VITが高いほど、";
		mes "効果は大きくなるでしょう。";
		next;
		mes "[アステ]";
		mes "これでディバインプロテクションに";
		mes "関するスキルツリーの説明は終了です。";
		mes "少し、休憩してから次へと";
		mes "進みましょうか。";
		set QUE_ACOLYTE,14;
		close;
	case 14:
		mes "[アステ]";
		mes "はい、授業再開と参りましょう。";
		mes "今度はヒールと関係のあるスキルで、";
		mes "^3131FF速度増加^000000についてお話しましょうか。";
		next;
		mes "[アステ]";
		mes "速度増加は^3131FFヒール^000000をLv3まで";
		mes "習得すると覚えられるようになります。";
		mes "言葉通り^3131FF敏捷性(AGI)^000000を";
		mes "上昇させるスキルです。";
		next;
		mes "[アステ]";
		mes "^3131FF回避率^000000、^3131FF攻撃速度^000000、";
		mes "^3131FF移動速度^000000が向上します。";
		next;
		mes "[アステ]";
		mes "一度、是非その効果を自分で";
		mes "確かめてみてくださいませ。";
		set QUE_ACOLYTE,15;
		npcskillsupport 29,0;
		sc_start 12,240000,10;
		close;
	case 15:
		mes "[アステ]";
		mes "速度増加Lv1を習得すると、";
		mes "^3131FF速度減少^000000を覚えられる";
		mes "ようになります。";
		next;
		mes "[アステ]";
		mes "名称から分かるとおり、速度を減少させ";
		mes "移動速度と回避率、攻撃速度を下げる";
		mes "ことができます。";
		mes "速度増加の反対と覚えておくと";
		mes "分かりやすいと思いますわ。";
		next;
		mes "[アステ]";
		mes "さて、ヒールに関係のあるスキルでも";
		mes "最後のスキル、^3131FFキュアー^000000に";
		mes "ついてです。";
		next;
		misceffect 66;
		mes "[アステ]";
		mes "ヒールをLv2まで習得すると覚えられる";
		mes "ようになるスキルで、^3131FF沈黙^000000、";
		mes "^3131FF混乱^000000、^3131FF暗黒^000000などの状態異常を";
		mes "治療することができます。";
		mes "また、アンデッドに使用すると、";
		mes "対象を混乱状態にすることができます。";
		next;
		mes "[アステ]";
		mes "ヒール、キュアー、速度増加、";
		mes "速度減少です。";
		mes "よく覚えておいてくださいませ。";
		set QUE_ACOLYTE,16;
		close;
	case 16:
		mes "[アステ]";
		mes "それでは、最後のスキルツリーの説明と";
		mes "参りましょうか。";
		mes "ふふ。いつの間にかアコライト様も";
		mes "こんなに凛々しいお顔になって。";
		mes "私、とても嬉しいですわ。";
		next;
		mes "[アステ]";
		mes "アコライトへ転職直後、^3131FFルアフ^000000という";
		mes "スキルを習得することができます。";
		next;
		mes "[アステ]";
		mes "ルアフは^3131FF隠れている敵^000000を";
		mes "見つけるスキルです。";
		mes "マジシャンのスキル、^3131FFサイト^000000と";
		mes "とても似ている効果を持っています。";
		next;
		misceffect 33;
		mes "[アステ]";
		mes "サイトは隠れている敵を発見するだけ";
		mes "ですが、ルアフは発見時、相手に";
		mes "ダメージも与えます。";
		next;
		mes "[アステ]";
		mes "ルアフを習得しますと、";
		mes "^3131FFテレポート^000000という";
		mes "空間移動スキルを覚えられるように";
		mes "なります。";
		next;
		mes "[アステ]";
		mes "テレポートは、ランダムに";
		mes "瞬間移動をするか、自分のセーブ";
		mes "ポイントへ移動できる効果を持って";
		mes "おります。";
		next;
		mes "[アステ]";
		mes "また、テレポートをマスターすると";
		mes "^3131FFワープポータル^000000を習得できる";
		mes "ようになります。";
		mes "ワープポータルを習得すると、";
		next;
		mes "[アステ]";
		mes "^FF0000ブルージェムストーンを1個消費^000000して";
		mes "記録した場所へ移動できる";
		mes "ワープゲートを開けるようになります。";
		next;
		mes "[アステ]";
		mes "ワープポータルは、スキルを";
		mes "マスターした時点で";
		mes "^3131FF自分のセーブポイント^000000に加え、";
		mes "^3131FFワープ空間を開く場所を最高3つまで^000000";
		mes "ワープ先として使用することが";
		mes "できます。";
		next;
		mes "[アステ]";
		mes "ダンジョンや、町から遠すぎる";
		mes "フィールドは記録できませんが、";
		mes "街や、その近接フィールドで";
		mes "^FF0000/memo^000000コマンドを";
		mes "実行すると、ワープゲートの転送先";
		mes "として記録することが可能です。";
		next;
		mes "[アステ]";
		mes "テレポートとワープポータルは";
		mes "聖職者にとって、生活に役立つ";
		mes "スキルとして活用されていますわ。";
		next;
		mes "[アステ]";
		mes "私も、修道院と実家の位置を記録して";
		mes "毎日の行き来に活用しています。";
		next;
		mes "[アステ]";
		mes "さて、これでルアフ関連スキルの";
		mes "説明も最後。";
		mes "^3131FFニューマ^000000について";
		mes "説明いたしましょう。";
		next;
		misceffect 141,"";
		mes "[アステ]";
		mes "ニューマは、3×3セルの9マスを";
		mes "^FF0000遠距離物理攻撃^000000から完全に";
		mes "防御してくれるスキルです。";
		mes "したがって、遠距離攻撃を主体とする";
		mes "アーチャー系の方と行動を共にする";
		mes "時は気をつけなければなりません。";
		next;
		mes "[アステ]";
		mes "アンデッドモンスターには、遠距離";
		mes "攻撃をしてくるモンスターもいますから";
		mes "ニューマで防御し、ヒールで攻撃する";
		mes "などの戦法も可能です。";
		next;
		mes "[アステ]";
		mes "さて、かなり多くの情報をお伝えして";
		mes "きましたが……もう一度";
		mes "お聞きになりますか？";
		next;
		if(select("また教えてください","次へ進みましょう")==1) {
			mes "[アステ]";
			mes "はい、それではまた";
			mes "ご説明しましょう。";
			close;
		}
		mes "[アステ]";
		mes "はい、わかりました。";
		set QUE_ACOLYTE,17;
		close;
	case 17:
		mes "[アステ]";
		mes "あ、また郵便が……";
		mes "あらあらあら、また間違って届いて";
		mes "いますわ。最近、修道院を";
		mes "プロンテラ大聖堂と勘違いしている";
		mes "方のなんと多いことか……";
		next;
		mes "[アステ]";
		mes "あの……";
		next;
		mes "[アステ]";
		mes "今度もまた、お願いしてもよろしい";
		mes "でしょうか？";
		mes "あの、それと、ついでに修道院から";
		mes "プロンテラ大聖堂への郵便も";
		mes "お届け願えないでしょうか？";
		next;
		mes "[アステ]";
		mes "いくつか、優先度の高い品が";
		mes "ありますので、これから教える順番に";
		mes "お届けくださいませ。";
		next;
		mes "[アステ]";
		mes "まずは、^3131FFバイノ^000000様宛ての";
		mes "小包を届けてください。";
		next;
		mes "[アステ]";
		mes "次は修道院入口の^3131FFヘザー^000000様。";
		mes "この方のクッキーはとても";
		mes "美味しいのですよ。";
		next;
		mes "[アステ]";
		mes "三番目は、修道院で熱心に武器を";
		mes "売っていらっしゃる^3131FF武器商人^000000様へ";
		mes "ブラックスミスギルドからの小包を";
		mes "お届けください。";
		next;
		mes "[アステ]";
		mes "四番目は……";
		mes "そこの建物にいらっしゃる";
		mes "カルヴィン神父にお手紙を届けて";
		mes "ください。";
		next;
		mes "[アステ]";
		mes "最後は、大聖堂のプラ神父さまに";
		mes "この領収書をお渡しください。";
		mes "聖堂側は物品の支給が活発なのですね。";
		mes "うらやましい……";
		next;
		mes "[アステ]";
		mes "はい、それではこの小包と手紙を";
		mes "お願いいたします。";
		set QUE_ACOLYTE,18;
		getitem 7183,1;
		getitem 7181,1;
		getitem 1081,2;
		getitem 7148,1;
		close;
	case 18:
	case 19:
	case 20:
	case 21:
	case 22:
		mes "[アステ]";
		mes "よろしいですか？";
		next;
		mes "[アステ]";
		mes "まずは、^3131FFバイノ^000000様宛ての";
		mes "小包を届けてください。";
		next;
		mes "[アステ]";
		mes "次は修道院入口の^3131FFヘザー^000000様。";
		mes "この方のクッキーはとても";
		mes "美味しいのですよ。";
		next;
		mes "[アステ]";
		mes "三番目は、修道院で熱心に武器を";
		mes "売っていらっしゃる^3131FF武器商人^000000様へ";
		mes "ブラックスミスギルドからの小包を";
		mes "お届けください。";
		next;
		mes "[アステ]";
		mes "四番目は……";
		mes "そこの建物にいらっしゃる";
		mes "カルヴィン神父にお手紙を届けて";
		mes "ください。";
		next;
		mes "[アステ]";
		mes "最後は、大聖堂のプラ神父さまに";
		mes "領収書をお渡しください。";
		close;
	case 23:
		mes "[アステ]";
		mes "お帰りなさいませ。";
		mes "プラ神父のご様子は";
		mes "いかがでしたか？";
		next;
		mes "[アステ]";
		mes "私達は、数多くの人とすれ違い、";
		mes "縁を結び、幾多の思い出を胸に抱き";
		mes "生きています。";
		next;
		mes "[アステ]";
		mes "心が荒れ、寂しくて寂しくて";
		mes "しかたのない時、記憶の奥に大切に";
		mes "しまっておいた、光り輝く思い出が";
		mes "あなたを癒してくれることでしょう。";
		next;
		mes "[アステ]";
		mes "出会いを大切にし、美しく温かい";
		mes "思い出があるからこそ、人は、遠い";
		mes "未来で静かに微笑みながら、生の喜びを";
		mes "享受することができるのです。";
		next;
		mes "[アステ]";
		mes "プラ神父にとって、アコライト様は";
		mes "良い出会いだったのではないかと";
		mes "いう気がいたします。";
		next;
		mes "[アステ]";
		mes "では、最後の授業と参りましょうか。";
		set QUE_ACOLYTE,24;
		close;
	case 24:
		mes "[アステ]";
		mes "最後のスキルは、";
		mes "^3131FFアクアベネディクタ^000000です。";
		next;
		mes "[アステ]";
		mes "水は、全ての生命の根源であり、";
		mes "万物の母であります。";
		next;
		mes "[アステ]";
		mes "水を、このような器に入れ、";
		mes "神に祈りを捧げながら";
		mes "両手に神聖な力を集め……";
		next;
		misceffect 39;
		mes "[アステ]";
		mes "アクアベネディクタ!!";
		next;
		mes "[アステ]";
		mes "このようにすれば、^3131FF聖水^000000が";
		mes "できます。";
		mes "ただ、^3131FF足を水につけていなければ^000000";
		mes "使うことができませんので";
		mes "注意してくださいませ。";
		next;
		mes "[アステ]";
		mes "はい、授業はここまでです。";
		mes "お疲れ様でした。";
		next;
		mes "[アステ]";
		mes "あ、そうですわ！";
		mes "大聖堂で、もう一つ特殊なスキルに";
		mes "ついて教えてくれるかもしれません。";
		mes "一度、立ち寄ってみてはいかが";
		mes "でしょうか？";
		next;
		mes "[アステ]";
		mes "神の祝福がいつもあなたと共に";
		mes "ありますように。";
		mes "ごきげんよう。";
		set QUE_ACOLYTE,25;
		if(checkre())
			getexp 500,300;
		else
			getexp 5000,3000;
		misceffect 71,"";
		close;
	default:
		mes "[アステ]";
		mes "人と喧嘩してしまった場合、";
		mes "喧嘩の後にその方と共に";
		mes "温かい食事をいただきましょう。";
		next;
		mes "[アステ]";
		mes "美味しい食べ物を分け合う時、";
		mes "殺伐としていた心も、春の陽に";
		mes "溶ける雪のようにしだいに";
		mes "和らいでいくのです。";
		next;
		mes "[アステ]";
		mes "愛しい人と争ってしまったら、";
		mes "是非一度お試しくださいませ。";
		close;
	}
}

monk_in.gat,18,38,6	script	ガイ神父	110,{
	switch(QUE_ACOLYTE) {
	case 7:
		if(countitem(7148) < 1) {
			mes "[ガイ神父]";
			mes "私に何か？";
			mes "手紙？　その手紙はどこに？";
			close;
		}
		mes "[ガイ神父]";
		mes "私に何か？";
		next;
		emotion 0;
		mes "[ガイ神父]";
		mes "これは……故郷の母からの手紙では";
		mes "ありませんか。";
		mes "わざわざありがとうございます。";
		set QUE_ACOLYTE,8;
		delitem 7148,1;
		close;
	case 8:
		if(countitem(957) >= 5) {
			mes "[ガイ神父]";
			mes "おかえりなさい。";
			mes "どれどれ……一つ……二つ……";
			next;
			mes "[ガイ神父]";
			mes "はい。お疲れ様でした。";
			mes "いやはや、本当に頼もしい。";
			next;
			mes "[ガイ神父]";
			mes "そう、シスター・アステが";
			mes "お待ちですよ。";
			mes "神の祝福がいつもあなたと共に";
			mes "ありますよう。";
			set QUE_ACOLYTE,9;
			percentheal 100,100;
			if(checkre())
				getexp 200,200;
			else
				getexp 2000,2000;
			misceffect 71,"";
			close;
		}
		mes "[ガイ神父]";
		mes "この間、遠くフェイヨンの長老から";
		mes "電報がありました。フェイヨン地下";
		mes "洞窟のゾンビによる被害が増えている";
		mes "ため、修道院の力を借りたいという";
		mes "ものでした。";
		next;
		mes "[ガイ神父]";
		mes "しかし、修道院は今、とても忙しく";
		mes "人手が足りない状態です……";
		next;
		emotion 0;
		mes "[ガイ神父]";
		mes "……！";
		next;
		mes "[ガイ神父]";
		mes strcharinfo(0)+ "様、";
		mes "この仕事をお任せしたいのですが、";
		mes "よろしいでしょうか？";
		mes "フェイヨン地下洞窟にいる";
		mes "スケルトンとゾンビを退治して";
		mes "ください。";
		next;
		mes "[ガイ神父]";
		mes "仕事を成し遂げた証として";
		mes "^3131FF亡者の爪^000000を^3131FF5個^000000";
		mes "お持ち帰りいただければ、";
		mes "わずかながらお礼もいたします。";
		next;
		mes "[ガイ神父]";
		mes "フェイヨンへ行かれますか？";
		next;
		if(select("出発！","準備してきます")==2)
			close;
		mes "[ガイ神父]";
		mes "それでは、フェイヨンへお送りします。";
		mes "フェイヨン地下洞窟のモンスターを";
		mes "退治し、亡者の爪5個をお持ち帰り";
		mes "ください。神の祝福がいつもあなたと";
		mes "共にありますよう。";
		close2;
		warp "payon.gat",161,58;
		end;
	default:
		mes "[ガイ神父]";
		mes "……私達と一緒に、神の恩寵を……";
		close;
	}
}

prt_monk.gat,235,245,5	script	子犬	81,{
	mes "[犬]";
	mes "わんわん！";
	mes "わんわん！";
	if(QUE_ACOLYTE == 10) {
		while(1) {
			next;
			switch(select("餌をあげる","撫でる","バイバイ")) {
			case 1:
				if('@count < 5) {
					emotion 3;
					mes "[犬]";
					mes "わんわん！";
					set '@count,'@count+1;
					continue;
				}
				emotion 6;
				mes "[犬]";
				mes "ガルルルルル……";
				next;
				mes "-子犬は鋭い目付きでうなった-";
				continue;
			case 2:
				emotion 3;
				mes "[犬]";
				mes "クゥーンクゥーン";
				continue;
			case 3:
				mes "[犬]";
				mes "わんわん！";
				break;
			}
			break;
		}
	}
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "可愛いな～";
	close;
}

prt_monk.gat,243,238,0	script	#boy_voi	139,5,5,{
	if(QUE_ACOLYTE != 10)
		end;
	mes "[？？]";
	mes "…………おねえちゃん……";
	close;
}

prt_monk.gat,226,257,6	script	苦しんでいる少年	93,{
	if(QUE_ACOLYTE >= 13) {
		emotion 18;
		mes "[少年]";
		mes "助けてくれてありがとう！";
		mes "おねえちゃんがいなくて寂しいけど……";
		mes "僕、頑張るよ！";
		close;
	}
	mes "[少年]";
	mes "……おねえちゃん………";
	mes "……ウウ……ごほ、ごほん！";
	mes "………………ウォー……";
	mes "……僕…………………………";
	switch(QUE_ACOLYTE) {
	case 10:
		next;
		mes "[少年]";
		mes "…………君は……修道院の……人？";
		mes "………………";
		next;
		mes "[少年]";
		mes "………………";
		next;
		mes "[少年]";
		mes "……おねえちゃん…………";
		next;
		mes "[少年]";
		mes "……ごほ、ごほっ";
		mes "…………苦しい……";
		next;
		menu "病気？",-;
		mes "[少年]";
		mes "おねえちゃんは……";
		next;
		mes "[少年]";
		mes "おねえちゃんは……キレイで……";
		mes "優しかった……";
		next;
		mes "[少年]";
		mes "でも、おねえちゃんは…………";
		mes "ある日、変な人が来て…………";
		mes "……そいつに…………";
		next;
		mes "[少年]";
		mes "ごほっごほっ…………";
		mes "あって……全身に毒が……";
		mes "おねえちゃん、体が冷たくなって……";
		mes "それで……ごほっ!!";
		next;
		mes "[少年]";
		mes "僕は……毒にかからなかったけど……";
		mes "その時から、悪い夢ばかり……";
		mes "体が重くて…………";
		mes "とても……つらい……苦しい……";
		next;
		mes "[少年]";
		mes "ごほごほっ、ごほごほっ！";
		next;
		mes "[少年]";
		mes "このまま……おねえちゃんみたく……";
		mes "死ぬのかな…………";
		next;
		mes "[少年]";
		mes "おねえちゃん……";
		next;
		mes "-少年の状態はかなり危ないようだ-";
		mes "-あなたは、注意深く少年を";
		mes "観察してみた-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "大丈夫？";
		next;
		misceffect 196;
		soundeffect "_curse.wav",0;
		emotion 23,"";
		mes "[" +strcharinfo(0)+ "]";
		mes "……これは!!";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "少年に悪霊が憑いている！";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "よし、きっと君を元気に";
		mes "してあげる！";
		set QUE_ACOLYTE,11;
		close;
	case 11:
		next;
		mes "[少年]";
		mes "痛い……苦しい……";
		close;
	case 12:
		next;
		mes "-あなたは少年に近付いた-";
		mes "-少年に手をかざし、目を閉じ、";
		mes "聖なる言葉を唱えた-";
		next;
		switch(select("ヒール!!","ブレッシング!!","キュアー!!","リカバリー!!","シグナムクルシス!!","聖体降福!!")) {
		case 1:
			mes "[" +strcharinfo(0)+ "]";
			mes "ヒール!!";
			misceffect 312;
			next;
			mes "-何も起きなかった-";
			close;
		case 2:
			break;
		case 3:
			if(getskilllv(35) < 1) {
				mes "-スキルをまだ習得していない-";
				close;
			}
			mes "[" +strcharinfo(0)+ "]";
			mes "キュアー!!";
			misceffect 66;
			next;
			mes "-何も起きなかった-";
			close;
		case 5:
			if(getskilllv(32) < 1) {
				mes "-スキルをまだ習得していない-";
				close;
			}
			mes "[" +strcharinfo(0)+ "]";
			mes "シグナムクルシス!!";
			misceffect 40;
			next;
			mes "-何も起きなかった-";
			close;
		case 4:
		case 6:
			mes "-アコライトが使える";
			mes "スキルではありません-";
			close;
		}
		if(getskilllv(34) < 1) {
			mes "-スキルをまだ習得していない-";
			close;
		}
		mes "[" +strcharinfo(0)+ "]";
		mes "ブレッシング!!";
		next;
		if(rand(10) >= getskilllv(34)) {
			mes "[" +strcharinfo(0)+ "]";
			mes "くっ……";
			mes "まだ力不足なのか……";
			close;
		}
		misceffect 42;
		mes "[" +strcharinfo(0)+ "]";
		mes "成功だ!!";
		next;
		mes "-スキルの使い方が以前より";
		mes "上手くなった気がする-";
		set QUE_ACOLYTE,13;
		if(checkre())
			getexp 0,100;
		else
			getexp 0,1000;
		misceffect 71,"";
		next;
		mes "[少年]";
		mes "あ……";
		mes "身が……軽くなった……";
		mes "……君が……治してくれたの？";
		mes "これが……神の力なんだ……";
		close;
	default:
		close;
	}
}

prt_monk.gat,197,228,3	script	バイノ	89,{
	if(QUE_ACOLYTE >= 19) {
		emotion 31;
		mes "[バイノ]";
		mes "ウオオオオオオオオオオオオオッ!!!!!";
		mes "ビビのためにも頑張るぞーっ!!!!!";
		close;
	}
	mes "[バイノ]";
	mes "ふぅー、やれやれ……";
	if(QUE_ACOLYTE != 18 || countitem(1081) < 1)
		close;
	next;
	mes "ん？　私に小包？";
	next;
	mes "[バイノ]";
	mes "アアッ！　これは故郷の幼馴染で";
	mes "マイ・スウィートハニー！";
	mes "ビビからの手作りチョコレート!!";
	next;
	misceffect 363;
	misceffect 343;
	mes "[バイノ]";
	mes "ウオオオオオオオオオオオオオッ!!!!!";
	mes "ビビ！　愛してる！　最高!!";
	mes "お前のためなら、このバイノ！";
	mes "死に物狂いで働いて、お金持ちになって";
	mes "故郷に錦を飾ってみせるぜ!!!!";
	next;
	emotion 15;
	mes "[バイノ]";
	mes "おっとっと。";
	mes "これ、届けてくれてありがとうな。";
	mes "愛のプレゼントに、ハートが感動で";
	mes "グラグラしてやがる。故郷で待っている";
	mes "スウィートハニーのために、頑張って";
	mes "働いて働いて働きまくってやるさ！";
	set QUE_ACOLYTE,19;
	delitem 1081,1;
	close;
}

prt_monk.gat,28,260,5	script	ヘザー	50,{
	mes "[ヘザー]";
	mes "ふう、今日も一日、有意義な汗を";
	mes "流しました。";
	if(QUE_ACOLYTE != 19 || countitem(7148) < 1)
		close;
	next;
	mes "[ヘザー]";
	mes "え？　私に手紙？";
	mes "母からだ！";
	next;
	misceffect 254;
	mes "[ヘザー]";
	mes "ウオオオオオオオオオオオオオッ!!!!!";
	mes "お母さん、あなたの熱く美しい愛を";
	mes "確かに受け取りました。";
	mes "アアアアッ!!!!!";
	next;
	mes "[ヘザー]";
	mes "お母さん、ありがとう。";
	mes "あなたも、ありがとう。";
	mes "これ、お礼です。冷める前にどうぞ。";
	set QUE_ACOLYTE,20;
	delitem 7148,1;
	getitem 538,1;
	close;
}

prt_monk.gat,135,263,0	script	武器商人	139,9,9,{
	if(QUE_ACOLYTE != 20 || countitem(1081) < 1)
		end;
	mes "[武器商人]";
	mes "ヤッホーイ!!　ギルドに頼んでおいた";
	mes "物がやっと来たか！";
	mes "いやー、ここって遠いでしょう。";
	mes "物品調達がすごく難しいんですよ。";
	next;
	mes "[武器商人]";
	mes "ありがとうございますっ。";
	mes "これからも当店のご愛用";
	mes "よろしくお願いしますよ～。";
	set QUE_ACOLYTE,21;
	delitem 1081,1;
	close;
}
monk_in.gat,103,176,7	script	カルヴィン	60,{
	if(QUE_ACOLYTE != 21 || countitem(7183) < 1) {
		mes "[カルヴィン]";
		mes "安らかに眠りたまえ……";
		close;
	}
	mes "[カルヴィン]";
	mes "永遠の平安と安息をお与えください……";
	next;
	mes "[カルヴィン]";
	mes "今、死者のために祈りを捧げている";
	mes "ところです。";
	mes "忙しいので、急ぎの用事でなければ、";
	mes "また後にしていただけませんか？";
	next;
	mes "[カルヴィン]";
	mes "手紙？　ああ、妹ですね。";
	mes "今度は一体、何に巻き込まれた";
	mes "ことやら……";
	next;
	mes "[カルヴィン]";
	mes "伝えてくれて、ありがとうございます。";
	set QUE_ACOLYTE,22;
	delitem 7183,1;
	close;
}

prt_monk.gat,219,164,3	script	グロリア	95,{
	if(Job == Job_Acolyte && QUE_ACOLYTE == 25) {
		mes "[グロリア]";
		mes "ウワ～、アステ様の授業を全部";
		mes "終えたんですか……すごい……";
		close;
	}
	if(Job != Job_Acolyte || QUE_ACOLYTE == 0) {
		mes "[グロリア]";
		mes "こんにちは。";
		mes "私はグロリア・ラブ。";
		mes "珍しい名前でしょう。";
		next;
		mes "[グロリア]";
		mes "私の父はゲフェンのブラックスミスで、";
		mes "私が生まれた日に、とても難しい";
		mes "武器を完成させたそうです。";
		next;
		mes "[グロリア]";
		mes "それで、神が幸運を授けて";
		mes "くださったと、グロリアと言う名前に";
		mes "したそうです。";
		next;
		mes "[グロリア]";
		mes "父も母もこの名前が好きだから、";
		mes "私もこの名前が大好きです。";
		close;
	}
	mes "[グロリア]";
	mes "私は、まだアコライトとして未熟で";
	mes "毎日、間違いばかりしています。";
	next;
	mes "[グロリア]";
	mes "今日も、神父さんにいっぱい迷惑を";
	mes "かけてしまいました……";
	next;
	mes "[グロリア]";
	mes "でも、そんな私にも得意なことが";
	mes "あるんです！";
	next;
	mes "[グロリア]";
	mes "それは、ワープポータル！";
	mes "まだLv2だけど、ワープポータルが";
	mes "得意なんです！";
	mes "1つはここ、もう1つはプロンテラを";
	mes "メモしてあるんですよ。";
	next;
	mes "[グロリア]";
	mes "……自慢するほどのスキルでも";
	mes "ないですね……しくしく。";
	next;
	mes "[グロリア]";
	mes "とにかく！";
	mes "あなたが望むなら、プロンテラへ";
	mes "送ってあげましょう。";
	next;
	if(select("プロンテラしかないの？","プロンテラまでお願いします")==1) {
		emotion 28;
		mes "[グロリア]";
		mes "ワープポータルには";
		mes "^4A4AFFブルージェムストーン^000000が1つ必要です。";
		mes "うう、ごめんなさい……";
		mes "プロンテラ行きしか持って";
		mes "ないんです……";
		close;
	}
	mes "[グロリア]";
	mes "任せてください！";
	close2;
	warp "prontera.gat",116,72;
	end;
}

prt_monk.gat,153,210,3	script	クルーレ・ベルチェ	95,{
	if(Job != Job_Acolyte) {
		mes "[クルーレ・ベルチェ]";
		mes "よう、こんにちは。";
		mes "今日の陽射しは気持ちいいね～。";
		close;
	}
	if(JobLevel < 40 && BaseLevel <= 25) {
		mes "[クルーレ・ベルチェ]";
		mes "ふーん、まだガキじゃないか。";
		mes "まだ充分にスキルを習得していない";
		mes "みたいだね。";
		next;
		mes "[クルーレ・ベルチェ]";
		mes "私があんたくらいの時は、";
		switch(rand(4)) {
		case 0:
			mes "^3131FF緑色のカエル^000000を相手に";
			mes "修行を積んだもんだが。";
			break;
		case 1:
			mes "^3131FF顔のついたキノコ^000000みたいな奴らを";
			mes "相手に修行を積んだもんだが。";
			break;
		case 2:
			mes "^3131FFゴキブリ^000000を相手に修行を";
			mes "積んだもんだが……";
			mes "あああ～、思い出すのも嫌だ！";
			break;
		case 3:
			mes "^3131FFゾンビ^000000を相手に";
			mes "修行を積んだもんだが。";
			mes "木がいっぱいあった町だったね。";
			mes "そこの洞窟にわんさか居たもんさ。";
			break;
		}
		mes "並大抵の苦労じゃなかったさ。";
		mes "白魚のような私の手が、水ぶくれで";
		mes "酷い有様だったね……";
		next;
		mes "[クルーレ・ベルチェ]";
		mes "私のようになりたいなら、あんたも";
		mes "まだまだ苦労しなきゃならないね。";
		mes "まあ、無理だろうがね。";
		mes "ホーホッホッホ！";
		next;
		emotion 29;
		mes "[クルーレ・ベルチェ]";
		mes "せいぜい、頑張りな～。";
		close;
	}
	if(JobLevel < 40 && BaseLevel <= 35) {
		mes "[クルーレ・ベルチェ]";
		mes "ふーん、まだガキじゃないか。";
		mes "まだ充分にスキルを習得していない";
		mes "みたいだね。";
		next;
		mes "[クルーレ・ベルチェ]";
		mes "私があんたくらいの時は、";
		switch(rand(5)) {
		case 0:
			mes "^3131FF白い鼠^000000に^3131FF大きなゴキブリ^000000と";
			mes "戦ったもんさ。";
			break;
		case 1:
			mes "^3131FF海の中^000000にいた記憶しかないね～";
			break;
		case 2:
			mes "^3131FF恐ろしい木の化け物^000000と戦ったもんさ。";
			break;
		case 3:
			mes "^3131FF腐りかけたオーク^000000と戦ったもんさ。";
			break;
		case 4:
			mes "^3131FF修道院前の猿^000000と一戦交えたもんさ。";
			break;
		}
		next;
		mes "[クルーレ・ベルチェ]";
		mes "楽しい思い出ばかりじゃないさ。";
		mes "またやれって言われても、二度と";
		mes "ごめんだね。";
		next;
		mes "[クルーレ・ベルチェ]";
		mes "私のようになりたいなら、あんたも";
		mes "まだまだ苦労しなきゃならないね。";
		mes "まあ、無理だろうがね。";
		mes "ホーホッホッホ！";
		next;
		emotion 29;
		mes "[クルーレ・ベルチェ]";
		mes "せいぜい、頑張りな～。";
		close;
	}
	if(JobLevel < 40 && BaseLevel <= 45) {
		mes "[クルーレ・ベルチェ]";
		mes "ふーん、間の抜けてるアコライトだね。";
		next;
		mes "[クルーレ・ベルチェ]";
		mes "私があんたくらいの時は、";
		switch(rand(6)) {
		case 0:
			mes "^3131FF恐ろしい悪霊^000000とやり合ったもんさ。";
			mes "辛かったよ。^3131FFゲフェンの西^000000に";
			mes "とても恐ろしい悪霊が住んでてね……";
			next;
			mes "[クルーレ・ベルチェ]";
			break;
		case 1:
			mes "^3131FFかわいいポポリン^000000と遊んだ時も";
			mes "あったね。それでも油断は";
			mes "できなかったさ。でもね、あんなに";
			mes "かわいい奴らと、どうして戦えるって";
			mes "いうんだい！";
			next;
			mes "[クルーレ・ベルチェ]";
			break;
		case 2:
			mes "^3131FF鉄砲を持った奴ら^000000とかなり";
			mes "激しい戦いを繰り広げたもんさ。";
			mes "恐ろしい奴らだったが、ニューマさえ";
			mes "あれば大丈夫だったさ！";
			next;
			mes "[クルーレ・ベルチェ]";
			break;
		case 3:
			mes "^3131FF矢を射る悪魔^000000とケンカしてたな。";
			mes "ゲフェン西の悪魔の棲家には、そんな";
			mes "奴らも居てね。";
			next;
			mes "[クルーレ・ベルチェ]";
			mes "アコライトだけじゃない。";
			mes "聖職者全員が、みんなそれぞれの";
			mes "戦いを繰り広げているのさ。";
			next;
			mes "[クルーレ・ベルチェ]";
			break;
		case 4:
			mes "^3131FF固い豚^000000みたいな奴と戦ったね。";
			mes "力もあったし、防御力もあって、";
			mes "強い奴だった。";
			break;
		case 5:
			mes "^3131FF砂漠で砂の塊^000000と戦ったね。";
			break;
		}
		mes "楽しい思い出ばかりじゃないさ。";
		mes "またやれって言われても、二度と";
		mes "ごめんだね。";
		next;
		mes "[クルーレ・ベルチェ]";
		mes "私のようになりたいなら、あんたも";
		mes "まだまだ苦労しなきゃならないね。";
		mes "まあ、無理だろうがね。";
		mes "ホーホッホッホ！";
		next;
		emotion 29;
		mes "[クルーレ・ベルチェ]";
		mes "せいぜい、頑張りな～。";
		close;
	}
	mes "[クルーレ・ベルチェ]";
	mes "ふーん、ちょっと学があるからって";
	mes "その目付きは何？";
	mes "こんな所で暇つぶしてるなら、";
	mes "悪霊退治に行くなり、";
	mes "さっさと転職するなりしちまいな！";
	mes "ったく、気に入らないね！";
	close;
}

prt_monk.gat,217,123,0	script	　#tu_monk	139,10,10,{
	if(Job != Job_Acolyte || (QUE_ACOLYTE != 4 && QUE_ACOLYTE != 10 && QUE_ACOLYTE != 25))
		end;
	mes "[どこからか聞こえてくる声]";
	mes "……………………";
	next;
	mes "-あそこの窓から";
	mes "聞こえてくるみたいだ-";
	close;
}

prt_monk.gat,223,123,0	script	窓の向こうの声	111,{
	if(Job == Job_Acolyte && QUE_ACOLYTE >= 4 && QUE_ACOLYTE <= 9) {
		mes "[窓の向こうの声]";
		mes "……様、王宮内の雰囲気が尋常では";
		mes "ありません。";
		next;
		mes "[窓の向こうの声]";
		mes "何のお話ですか？";
		mes "何かあったのですか？";
		next;
		mes "[窓の向こうの声]";
		mes "まだ、正確に何があったかは";
		mes "わかりませんが……";
		mes "大臣達の顔が皆暗く、";
		mes "何かを恐れているようなのです。";
		mes "何かあったものと思われます。";
		next;
		mes "[窓の向こうの声]";
		mes "……まだ何とも言えませんね。";
		mes "私達は、事態を見守るとしましょう。";
		mes "事が大きくなれば、また何か反応が";
		mes "あるはずです。";
		next;
		mes "[窓の向こうの声]";
		mes "はい。しかし神父様……私は何か、";
		mes "悪い予感がしてなりません。";
		close;
	}
	if(Job == Job_Acolyte && QUE_ACOLYTE >= 10 && QUE_ACOLYTE <= 24) {
		mes "[窓の向こうの声]";
		mes "王宮から連絡が来ました。";
		mes "強力な退魔師を派遣して欲しいと";
		mes "言っています。";
		next;
		mes "[窓の向こうの声]";
		mes "退魔？";
		mes "王国がゾンビに襲われたのですか？";
		next;
		mes "[窓の向こうの声]";
		mes "いいえ、そうではなさそうですが……";
		mes "老練で有能な方を頼むと言っています。";
		next;
		mes "[窓の向こうの声]";
		mes "ほほう、一体何が……";
		next;
		mes "[窓の向こうの声]";
		mes "また何か情報が入り次第、お知らせに";
		mes "上がります。";
		next;
		mes "[窓の向こうの声]";
		mes "お願いします。";
		close;
	}
	if(Job == Job_Acolyte && QUE_ACOLYTE >= 25) {
		mes "[窓の向こうの声]";
		mes "……様、^3131FFゲオルグの呪い^000000について";
		mes "何かご存知ではありませんか？";
		next;
		mes "[窓の向こうの声]";
		mes "ゲオルグは、我等が国王、";
		mes "トリスタン3世の先祖だったかと。";
		mes "それ以上は知りません。";
		next;
		mes "[窓の向こうの声]";
		mes "ゲオルグには、実は呪いが";
		mes "かけられていたらしいのです。";
		next;
		mes "[窓の向こうの声]";
		mes "呪い？";
		next;
		mes "[窓の向こうの声]";
		mes "はい。";
		mes "ルーン・ミッドガッツ王国の建国時に、";
		mes "どうしてかは知りませんが、";
		mes "ヨルムンガンドから呪いを受けた";
		mes "そうです。";
		next;
		mes "[窓の向こうの声]";
		mes "ヨルムンガンド……ミッドガルドを";
		mes "一飲みにできるほど巨大な蛇ですね。";
		mes "いったい、どんな呪いを？";
		next;
		mes "[窓の向こうの声]";
		mes "その呪いとは、^3131FF王家の第1子は、必ず";
		mes "成人できずに死んでしまう^000000と";
		mes "いうことらしいのです。";
		next;
		mes "[窓の向こうの声]";
		mes "!!!!";
		mes "そのような……それでは、今まで";
		mes "第1王子や王女が亡くなっていたのは、";
		mes "呪いのせいだと？";
		next;
		mes "[窓の向こうの声]";
		mes "王家にそのような秘密があるとは、";
		mes "私も知りませんでした。";
		mes "確かに、これは一大事です。";
		next;
		mes "[窓の向こうの声]";
		mes "まさか、王宮で……";
		mes "第1王子が亡くなられたのですか？";
		next;
		mes "[窓の向こうの声]";
		mes "いいえ。亡くなられたのは";
		mes "第2王子だそうです。";
		next;
		mes "[窓の向こうの声]";
		mes "何?!";
		next;
		mes "[窓の向こうの声]";
		mes "声をお抑えください……";
		next;
		mes "[窓の向こうの声]";
		mes "……事故ですか？";
		next;
		mes "[窓の向こうの声]";
		mes "まだ正確な原因は判っておりません。";
		mes "王宮側では、私達プロンテラ教区の力を";
		mes "借り、ヨルムンガンドの呪いを解く";
		mes "依頼をしたい意向だそうです。";
		next;
		mes "[窓の向こうの声]";
		mes "ヨルムンガンドの呪い……果して、";
		mes "我等の力で可能なのでしょうか？";
		next;
		mes "[窓の向こうの声]";
		mes "私にも判りません……";
		mes "今度の仕事は、あまりにも巨大で……";
		mes "最悪の場合、我等にもかなりの被害が";
		mes "出るかもしれません。";
		next;
		mes "[窓の向こうの声]";
		mes "教区はどうするつもりなのでしょう？";
		next;
		mes "[窓の向こうの声]";
		mes "老練な神父達は、もうかなりの";
		mes "お年です。";
		mes "現在活動中の聖職者を対象に";
		mes "調査を進めているようです。";
		next;
		mes "[窓の向こうの声]";
		mes "そうですね……";
		next;
		mes "[窓の向こうの声]";
		mes "王族及び王国の維持にとって重要な";
		mes "事ゆえ、慎重に事を進めることに";
		mes "なりそうです。";
		mes "私はまた、王国側の監視を";
		mes "続けねばなりません。";
		next;
		mes "[窓の向こうの声]";
		mes "他に何かわかり次第、お知らせ";
		mes "いたします。";
		mes "ただし、事をもみ消す様子が";
		mes "見られましたので、少々時間が";
		mes "掛かるかもしれません。";
		next;
		mes "[窓の向こうの声]";
		mes "……お願いいたします。";
		next;
		mes "[窓の向こうの声]";
		mes "ああ、天よ。我等の神聖なる";
		mes "ルーン・ミッドガッツの未来から";
		mes "邪悪な雲を取り除きたまえ……";
		close;
	}
	mes "-何も聞こえない-";
	close;
}

//============================================================
// アーチャークエストNPC
//- Registry -------------------------------------------------
// QUE_1ARCHER -> 0～16
// QUE_2ARCHER -> 0～10
//------------------------------------------------------------
payon_in02.gat,67,65,3	script	吟遊詩人ゼティ	51,{
	mes "[ゼティ]";
	mes "美しき女神イドゥン～";
	mes "美しくて白い豊饒の女神～♪";
	mes "彼女の籠いっぱいに盛られた林檎～♪";
	mes "その甘～い林檎のおかげで～";
	mes "神々は永遠に老いることがない～♪";
	switch(Job) {
	case Job_Novice:
		close;
	case Job_Archer:
		break;
	case Job_Bard:
	case Job_Minstrel:
		next;
		mes "[ゼティ]";
		mes "おお、あなたは！";
		next;
		misceffect 295,"";
		emotion 21;
		mes "[ゼティ]";
		mes "アルミ缶の上にあるみかん！";
		mes "本が沈んでる……ぶっく、ぶっく！";
		mes "ウフッ！";
		close;
	case Job_Dancer:
	case Job_Wanderer:
		next;
		mes "[ゼティ]";
		mes "おお、美しいダンサーのお嬢さん、";
		mes "私と合奏しませんか？";
		close;
	default:
		next;
		mes "[ゼティ]";
		mes "おや、退屈そうですね。";
		mes "そんなあなたに捧げましょう～♪";
		next;
		mes "[ゼティ]";
		mes "アルミ缶の上にあるみかん！";
		mes "本が沈んでる……ぶっく、ぶっく！";
		mes "ウハハハハハッ!!!!";
		close;
	}
	next;
	emotion 0;
	mes "[ゼティ]";
	mes "おや、アーチャーじゃないですか。";
	mes "私も以前は、アーチャーでしたよ。";
	mes "あ、そうだ。これ、どう思いますか？";
	next;
	emotion 3;
	mes "[ゼティ]";
	mes "アルミ缶の上にあるみかん！";
	mes "本が沈んでる……ぶっく、ぶっく！";
	next;
	emotion 29;
	mes "[ゼティ]";
	mes "ね、ね？　面白いでしょう？";
	mes "そうだ、君も一つどうですか？";
	next;
	if(Sex) {
		menu "寒いジョークを言う",-;
		misceffect 295,"";
		emotion 21;
		mes "[ゼティ]";
		mes "むむむむむ！";
		mes "すごい!!　君には素質がある!!!";
		mes "君もバードになってみませんか？";
	}
	else {
		menu "スクリーム",-;
		misceffect 296,"";
		emotion 21;
		mes "[ゼティ]";
		mes "むむむむむ！";
		mes "すごい!!　君には素質がある!!!";
		mes "君は是非ダンサーになってください！";
	}
	next;
	mes "[ゼティ]";
	mes "その為にはまず、";
	mes "アーチャーから卒業しなくては。";
	next;
	mes "[ゼティ]";
	mes "実は、私はこの^3131FF転職所の隣^000000にある";
	mes "「イカロス」という";
	mes "^3131FFアーチャーの集まり^000000の一員です。";
	next;
	mes "[ゼティ]";
	mes "さぁ、たくさんの経験を積んで、";
	mes "一日でも早く転職し、";
	mes "私と一緒に歌いましょう～♪";
	close;
}

pay_arche.gat,127,154,4	script	案内板	835,{
	mes "アーチャーギルド　→";
	mes "←　イカロス";
	close;
}

payon_in02.gat,54,13,2	script	マスター・カバック	55,{
	mes "[マスター・カバック]";
	mes "私はイカロスのマスター・カバック。";
	mes "歓迎しますぞ、お若いの。";
	next;
	switch(select("イカロスってなんですか？","最近の話題って何ですか？","アーチャーについて聞く")) {
	case 1:
		mes "[マスター・カバック]";
		mes "ほう、イカロスの話を";
		mes "聞いたことはないかな？";
		next;
		mes "[マスター・カバック]";
		mes "イカロスは、蝋で作られた";
		mes "羽で空を飛んだ。だが、";
		mes "好奇心で太陽に近付き過ぎたため、";
		mes "羽の蝋が溶けてしまい、";
		mes "空から落ちて死んでしまった";
		mes "……かわいそうな青年だ。";
		next;
		mes "[マスター・カバック]";
		mes "もちろん、結果は悲劇だ。";
		mes "だが、彼の冒険心と勇気は";
		mes "人一倍だったと私は思っている。";
		next;
		mes "[マスター・カバック]";
		mes "ここは、そのイカロスの様に";
		mes "壮大な夢と目標を";
		mes "追い求める者が集う場所だ。";
		next;
		mes "[マスター・カバック]";
		mes "町のあちらこちらにいる";
		mes "彼らの目を見てみなさい。";
		mes "皆、清く輝いた目をしているだろう。";
		mes "素晴らしい事だ。";
		next;
		mes "[マスター・カバック]";
		mes "もう一つ、気がついただろうか。";
		mes "イカロスは弓の名手だった。";
		mes "そして、この町もアーチャーや、";
		mes "それを目指す者であふれている。";
		next;
		switch(Job) {
		case Job_Novice:
			mes "[マスター・カバック]";
			mes "君もアーチャーになりたいなら、";
			mes "彼らに助言を求めてみたらどうだろう。";
			mes "きっと参考になる話を";
			mes "教えてくれると思うよ。";
			close;
		case Job_Archer:
			mes "[マスター・カバック]";
			mes "君もアーチャーのようだが、";
			mes "彼らに狩りのことなど、";
			mes "助言を求めてみたらどうだろう。";
			mes "きっと、参考になる話を";
			mes "教えてくれると思うよ。";
			close;
		case Job_Hunter:
		case Job_Ranger:
			mes "[マスター・カバック]";
			mes "彼らの中には、君と同じように";
			mes "弓を扱う者もいる。";
			next;
			mes "[マスター・カバック]";
			mes "しかし、彼らは常に";
			mes "新しいことを求め、";
			mes "冒険へと旅立っている。";
			mes "時々は、ここに立ち寄って";
			mes "欲しいものだ。";
			close;
		case Job_Bard:
		case Job_Minstrel:
			mes "[マスター・カバック]";
			mes "彼らの中には、";
			mes "君のように楽器を手に";
			mes "数々の冒険譚を歌う者がいる。";
			next;
			mes "[マスター・カバック]";
			mes "しかし、彼らは滅多にここには来ない。";
			mes "彼らは何にも縛られず、";
			mes "心赴くままに愛を求める旅人。";
			mes "時々は、ここに立ち寄って";
			mes "欲しいものだ。";
			close;
		case Job_Dancer:
		case Job_Wanderer:
			mes "[マスター・カバック]";
			mes "彼らの中には、";
			mes "軽い身を活かし、美しい踊りで、";
			mes "人々を魅了する者もいる。";
			next;
			mes "[マスター・カバック]";
			mes "しかし、滅多にここには";
			mes "姿を見せることはないな。";
			mes "彼らは風のように、";
			mes "自由気ままに旅をする者。";
			mes "時々は、ここに立ち寄って";
			mes "欲しいものだ。";
			close;
		default:
			mes "[マスター・カバック]";
			mes "彼らはアーチャーについて";
			mes "役に立つ知識を持っている。";
			mes "彼らとの話を通じ、";
			mes "自分とは異なる職業に対する";
			mes "理解を深めてみたらどうかね？";
			close;
		}
	case 2:
		if(Job != Job_Archer) {
			mes "[マスター・カバック]";
			mes "そうだな……";
			mes "最近、特にこれと言った話題はないな。";
			mes "あの窓の外の陽光の様に、";
			mes "穏やかで平和だよ。";
			mes "何か面白い話が入ったら、";
			mes "教えてあげよう。";
			close;
		}
		switch(QUE_2ARCHER) {
		case 0:
			mes "[マスター・カバック]";
			mes "いいところへ来た、";
			mes strcharinfo(0) +"。";
			mes "たった今、アルデバランの";
			mes "錬金術師ギルドから";
			mes "支援要請が来てな。";
			next;
			mes "[マスター・カバック]";
			mes "錬金術師ギルドでは、";
			mes "フローラ畑を経営して、";
			mes "ギルド資金の足しにしている。";
			mes "だが最近、泥棒がその畑を";
			mes "荒らしているそうなのだ。";
			next;
			mes "[マスター・カバック]";
			mes "幸い、アルケミストには";
			mes "フローラを召喚する秘術がある。";
			mes "それを活用し、畑の修復はできたが、";
			mes "被害が続発しているため、";
			mes "フローラ召喚の材料が";
			mes "そろそろ尽きるらしい。";
			next;
			mes "[マスター・カバック]";
			mes "そこで、材料である^3131FF食人植物の花^000000と";
			mes "^3131FF植物の茎^000000が欲しいそうだ。";
			mes "それらを持って来てくれたら、";
			mes "買い取ると言っていた。";
			mes "興味があるなら、";
			mes "一度行ってみるんだな。";
			next;
			mes "[マスター・カバック]";
			mes "詳しい内容は、錬金術師ギルドで";
			mes "直接聞く方がいいだろう。";
			set QUE_2ARCHER,1;
			close;
		case 1:
			mes "[マスター・カバック]";
			mes "ふむ……………………";
			next;
			mes "[マスター・カバック]";
			mes "…………………………";
			next;
			menu "どうかしましたか？",-;
			mes "[マスター・カバック]";
			mes "ああ、実は少々問題が起こってな。";
			mes "マスターという地位は、";
			mes "大きな力を結束されるが、";
			mes "自分で自由に席を外すことが";
			mes "できないという短所がある。";
			next;
			mes "[マスター・カバック]";
			mes "この間、私はイカロスの一員の";
			mes "一人に、旅をしながら";
			mes "ルーンミッドガッツ王国に";
			mes "関する情報を集め、";
			mes "知らせるよう指令を出した。";
			next;
			mes "[マスター・カバック]";
			mes "彼は指示に従い、手紙により";
			mes "数々の報告を送ってきた。";
			next;
			mes "[マスター・カバック]";
			mes "しかし、急に彼らからの連絡が";
			mes "途切れてしまった。";
			mes "彼が、何か大きな事件にでも";
			mes "巻き込まれてはいないかと心配でな。";
			next;
			mes "[マスター・カバック]";
			mes "彼を探してくれないか？";
			mes "彼の名前は、^3131FF風のアステル^000000。";
			mes "彼はあまり人ごみが好きではないが、";
			mes "私の命令で、いつも人通りが";
			mes "多い所にいるはずだ。";
			next;
			mes "[マスター・カバック]";
			mes "彼が無事かどうか確認できたら、";
			mes "少しばかり、彼に";
			mes "協力してくれないだろうか。";
			mes "それでは、よろしく頼む。";
			set QUE_2ARCHER,2;
			close;
		case 2:
			mes "[マスター・カバック]";
			mes "どうか、アステルを探し出してくれ。";
			mes "彼はきっと、人がたくさん";
			mes "集まる場所にいる。";
			close;
		case 9:
			mes "[マスター・カバック]";
			mes "そうか。";
			mes "アステルを探し出してくれて、";
			mes "ありがとう。私は彼を信じ、";
			mes "このまま見守り続けるとしよう。";
			set QUE_2ARCHER,10;
			if(checkre())
				getexp 200,100;
			else
				getexp 2000,1000;
			close;
		default:
			mes "[マスター・カバック]";
			mes "そうだな……";
			mes "最近、特にこれと言った話題はないな。";
			mes "あの窓の外の陽光の様に、";
			mes "穏やかで平和だよ。";
			mes "何か面白い話が入ったら、";
			mes "教えてあげよう。";
			close;
		}
	case 3:
		switch(QUE_1ARCHER) {
		case 0:
			if(Job == Job_Novice) {
				mes "[マスター・カバック]";
				mes "ん、アーチャーになりたいのか？";
			}
			else if(Job == Job_Archer && Upper != UPPER_HIGH) {
				mes "[マスター・カバック]";
				mes "君は私達と同じ道を";
				mes "目指している者だね。";
				mes "そうか、アーチャーについて";
				mes "勉強したいのか。";
			}
			else if((Job == Job_Archer && Upper == UPPER_HIGH) || getbaseclass(Class,2) == CLASS_HT || getbaseclass(Class,2) == CLASS_BA || getbaseclass(Class,2) == CLASS_DC) {
				mes "[マスター・カバック]";
				mes "君は既にアーチャーとして";
				mes "充分に経験を積んだはずだが、";
				mes "復習でもしようというのかな？";
				mes "ふむ、基本を忘れないのは";
				mes "良い心がけだ。";
			}
			else if(Job != Job_Archer) {
				mes "[マスター・カバック]";
				mes "君は私達と異なる道を";
				mes "目指している者だな。";
				mes "私達アーチャーを仲間にし、";
				mes "冒険を志すのもよいだろう。";
				next;
				mes "[マスター・カバック]";
				mes "パートナーについて知識を深めるのは";
				mes "仲間として立派なことだ。";
				mes "アーチャーについて勉強したいのかな？";
			}
			next;
			if(select("はい","いいえ")==2) {
				mes "[マスター・カバック]";
				mes "そうか。イカロスはいつでも";
				mes "君の来訪を歓迎しよう。";
				mes "何かあったら、また訪ねて来なさい。";
				close;
			}
			mes "[マスター・カバック]";
			mes "よし、分かった。";
			mes "では、適任者を紹介しよう。";
			mes "イカロスの西、丘の上に修練場がある。";
			mes "そこに、イカロスの一員";
			mes "^3131FFシズノ^000000がいる。";
			mes "彼女にこの手紙を渡しなさい。";
			set QUE_1ARCHER,1;
			next;
			mes "-" +strcharinfo(0)+ "は、";
			mes "マスター・カバックの";
			mes "手紙を受け取った-";
			next;
			mes "[マスター・カバック]";
			mes "彼女は誰よりも冷静沈着で聡明だ。";
			mes "きっと、役に立つだろう。";
			close;
		case 1:
		case 2:
			mes "[マスター・カバック]";
			mes "フェイヨン地下洞窟入口前の";
			mes "修練場にいる、シズノに会いなさい。";
			close;
		case 3:
			mes "[マスター・カバック]";
			mes strcharinfo(0) +"、";
			mes "シズノのレクチャーはどうだった？";
			mes "まあ、理論の授業は、";
			mes "楽しいものではないかもしれない。";
			mes "しかし、それでも知識は蓄えておけば、";
			mes "いつかきっと大きな力となるだろう。";
			next;
			if(Job != Job_Archer) {
				mes "[マスター・カバック]";
				mes "理論の次は実技だが、";
				mes "こちらはアーチャーのみとなっている。";
				close;
			}
			mes "[マスター・カバック]";
			mes "理論の次は実技だ。";
			mes "外の^3131FFレイデン・カルス^000000に";
			mes "私に言われてきたと話せば、";
			mes "スキルについて説明してくれるはずだ。";
			next;
			mes "[マスター・カバック]";
			mes "彼に一度会うといいだろう。";
			set QUE_1ARCHER,4;
			close;
		case 4:
			mes "[マスター・カバック]";
			mes "レイデン・カルスは、";
			mes "この建物の外にいるはずだ。";
			mes "いなかったのか？";
			close;
		default:
			mes "[マスター・カバック]";
			mes "ずいぶんと立派になったな。";
			mes "もし、まだ自分に何か足りないと";
			mes "思う時があれば、仲間との会話を通じ、";
			mes "様々な経験を積んでいくがいい。";
			close;
		}
	}
}

pay_arche.gat,103,165,5	script	レイデン・カルス	832,{
	if((MaxWeight - Weight) < 2000) {
		mes "[レイデン・カルス]";
		mes "何そんなに持ってやがる。";
		mes "重くないのか？";
		close;
	}
	switch(QUE_1ARCHER) {
	case 0:
		mes "[レイデン・カルス]";
		mes "おおう、初めまして！";
		mes "マスターのおっさんなら……";
		mes "（ハッ!!）";
		mes "いや、あー、ごほん！";
		next;
		mes "[レイデン・カルス]";
		mes "正式に挨拶しよう。";
		mes "俺は、この大陸の全アーチャーを";
		mes "統括＆支配する^3131FFイカロスのマスター、";
		mes "レイデン・カルス^000000だ。";
		mes "イカロスへようこそ。";
		mes "心から歓迎しよう。";
		next;
		emotion 21;
		mes "[レイデン・カルス]";
		mes "ところで、君は運がいい！";
		mes "今、イカロスは絶賛、特別期間にて";
		mes "加入費が50%割引中！";
		mes "しかも、初回手数料は無料!!";
		next;
		emotion 3;
		mes "[レイデン・カルス]";
		mes "職業制限もなし！";
		mes "そして、男性には特別に、";
		mes "キレイなダンサーのお姉ちゃんが";
		mes "特別加入サービスをしてくれる";
		mes "絶好のチャアアンスッ!!";
		next;
		emotion 18;
		mes "[レイデン・カルス]";
		mes "清楚なお嬢さんは、特別に私が";
		mes "デートしてあげましょううううッ!!";
		next;
		emotion 8;
		mes "[レイデン・カルス]";
		mes "どう？";
		mes "加入費はたったの100万zeny!!";
		mes "今この時期を逃せば一生後悔するよ。";
		mes "フフフフフフフ。";
		next;
		emotion 32,"アルペスト";
		mes "[アルペスト]";
		mes "レイデン、悪戯は";
		mes "それくらいにしておけ。";
		mes "マスターなら、そこの建物の中だよ。";
		mes "冒険者さん。";
		emotion 23;
		mes "[レイデン・カルス]";
		mes "あ、てめぇ、このジジイ!!";
		next;
		emotion 7;
		mes "[レイデン・カルス]";
		mes "チェッ。";
		mes "マスターなら、建物の中だ。";
		mes "加入費？　冗談だよ、冗談！";
		mes "ちょっとからかっただけだ!!";
		close;
	case 4:
		mes "[レイデン・カルス]";
		mes "あぁ？";
		mes "何か用か？";
		next;
		if(select("スキルについて教えてください","いえ、あの……")==2) {
			mes "[レイデン・カルス]";
			mes "何だ～？";
			mes "用がないなら、あっち行け！";
			close;
		}
		mes "[レイデン・カルス]";
		mes "なに？";
		mes "マスターが寄こした?!";
		next;
		mes "[レイデン・カルス]";
		mes "……………………";
		next;
		emotion 29;
		mes "[レイデン・カルス]";
		mes "はぁ…………";
		next;
		mes "[レイデン・カルス]";
		mes "あのな、俺は忙しいんだ。";
		mes "知らない奴なんかのために";
		mes "そうそう貴重な時間を";
		mes "割くわけにはいかねぇよ。";
		next;
		mes "[レイデン・カルス]";
		mes "そこで、条件がある！";
		next;
		mes "[レイデン・カルス]";
		mes "これから、このレイデン・カルスが";
		mes "誰とも知らない馬の骨のために、";
		mes "貴重な時間を割いて、";
		mes "スキルについて説明するわけだ。";
		mes "当然、俺は偉い！";
		next;
		mes "[レイデン・カルス]";
		mes "だ・か・ら!!";
		mes "今からこのレイデン・カルス様を";
		mes "^3131FFマスター^000000と呼べ！";
		mes "俺に忠誠を誓い、俺の話を";
		mes "聞きさえすれば、地上最強の";
		mes "アーチャーになれること間違いなし！";
		next;
		mes "[レイデン・カルス]";
		mes "さあ、どうよ？";
		next;
		if(select("教えてください、マスター！","えぇ～、嫌です")==2) {
			mes "[レイデン・カルス]";
			mes "何だって！";
			mes "それが教えを乞う態度かよ!!";
			mes "け、それなら俺も無視だ無視！";
			mes "けっけっけっ!!";
			close;
		}
		mes "[レイデン・カルス]";
		mes "フッ、そうこなくちゃな。";
		mes "いいか、これからもちゃんと";
		mes "マスターと呼べ！";
		next;
		mes "[レイデン・カルス]";
		mes "よし、それでは使えそうな奴かどうか";
		mes "見てやる……ふん……";
		next;
		mes "[レイデン・カルス]";
		mes "ウムムムムム……";
		next;
		mes "-レイデンは眉毛をしかめながら";
		mes "ジロジロとあなたを見定めた-";
		next;
		if(JobLevel >= 40) {
			mes "[レイデン・カルス]";
			mes "お前さ、もう転職してもいいくらい";
			mes "腕を磨いてないか？";
			mes "そのまま転職していいんじゃねえ？";
			close;
		}
		else if(JobLevel < 5) {
			mes "[レイデン・カルス]";
			mes "かあ～!!";
			mes "転職したばっかのヒヨっ子かよ！";
			mes "教えがいがあるぜ!!";
		}
		else {
			mes "[レイデン・カルス]";
			mes "ああああ～、中途半端にやってる奴が";
			mes "一番面倒なんだよな……まあ、いいか。";
		}
		mes "言っておくがな、俺の授業は早いぞ！";
		mes "無駄口なんかさせないからな！";
		next;
		mes "[レイデン・カルス]";
		mes "グフフフフフフ";
		mes "さあ、早速授業を始めるぜ！";
		mes "さっさと矢と弓を準備して来い!!";
		set QUE_1ARCHER,5;
		close;
	case 5:
		mes "[レイデン・カルス]";
		mes "用意できたか？";
		mes "いいか、俺の授業で無駄口きいたら";
		mes "ただじゃおかねえからな！";
		mes "いいか、俺を信じてついてこい！";
		mes "さすれば、世界で2番目に強い";
		mes "アーチャーになれる！";
		next;
		mes "[レイデン・カルス]";
		mes "あん？　何故2番目なのかって？";
		mes "俺が1番目だからさ！";
		next;
		mes "[レイデン・カルス]";
		mes "気に入らないなら辞めてもいいぜ。";
		mes "先生に不満のある生徒なんて";
		mes "別にいらねえし。";
		next;
		if(select("マスター、よろしくお願いします！","じゃあ、やめます")==2) {
			mes "[レイデン・カルス]";
			mes "ああ、そうか。";
			mes "じゃあ、あーばよー。";
			close;
		}
		mes "[レイデン・カルス]";
		mes "グワハハハハハハ！";
		mes "いいだろう！";
		mes "それでは授業を始めようか！";
		next;
		mes "[レイデン・カルス]";
		mes "アーチャーのスキルを覚える過程は、";
		mes "そんなに複雑じゃない。";
		mes "転職するまでに、";
		mes "大体のスキルを覚えちまう。";
		mes "だから、俺を信じてついてこい！";
		next;
		menu "はい、マスター！",-;
		emotion 33;
		mes "[レイデン・カルス]";
		mes "おおう、気合入ってるねえ。";
		next;
		mes "[レイデン・カルス]";
		mes "それじゃあ、スキルウィンドウを";
		mes "開けてみな。^FF0000ふくろうの目^000000と";
		mes "^FF0000ダブルストレイフィング^000000があるだろう？";
		next;
		mes "[レイデン・カルス]";
		mes "まず、ふくろうの目だ！";
		next;
		mes "[レイデン・カルス]";
		mes "いいか、俺達アーチャーは、";
		mes "どんな遠くの敵でも性格に把握し、";
		mes "どんなに素早い敵も逃さない、";
		mes "そんな動体視力が要求される。";
		next;
		mes "[レイデン・カルス]";
		mes "夜空を支配するふくろうの目から";
		mes "逃れられる者はいない！";
		mes "そんな、ふくろうの目に匹敵する";
		mes "視力が必要なんだ。解るか？";
		next;
		if(getskilllv(43) >= 3) {
			emotion 7;
			mes "[レイデン・カルス]";
			mes "何だ、説明はいらないってか？";
			mes "ええい、じゃあ次の段階へGOだ！";
			set QUE_1ARCHER,7;
			if(checkre())
				getexp 50,0;
			else
				getexp 500,0;
			close;
		}
		mes "[レイデン・カルス]";
		mes "おし、それじゃあ早速宿題だ！";
		mes "今から^3131FFふくろうの目をLv3^000000まで";
		mes "上げてこい！";
		mes "なに、^3131FFプロンテラ南南西^000000で";
		mes "コンドルでも狩ってりゃすぐだ。";
		set QUE_1ARCHER,6;
		next;
		mes "[レイデン・カルス]";
		mes "まあ、別の場所でもいいがな。";
		mes "狩り場が分からないってなら、";
		mes "助けてやってもいいぜ。";
		next;
		if(select("助けてください","自力で頑張ります")==2) {
			emotion 6;
			mes "[レイデン・カルス]";
			mes "チ、マスターの言うことは";
			mes "聞くもんだぜ～。";
			close;
		}
		mes "[レイデン・カルス]";
		mes "おし、プロンテラまでは送ってやる。";
		mes "いいか、^3131FFプロンテラ南南西^000000だ。";
		mes "迷子になるなよ。";
		next;
		if(select("今すぐ出発～！","ちょっと後で出発～")==2) {
			mes "[レイデン・カルス]";
			mes "何だ、トイレか？";
			close;
		}
		emotion 9;
		mes "[レイデン・カルス]";
		mes "大変な時は、俺の顔を思い出して";
		mes "頑張るんだぜ！";
		next;
		mes "[レイデン・カルス]";
		mes "おし、いざプロンテラへ!!";
		close2;
		warp "prontera.gat",116,72;
		end;
	case 6:
		if(getskilllv(43) < 3) {
			mes "[レイデン・カルス]";
			mes "あのなあ～……";
			mes "俺が言ったのは「ふくろうの目」！";
			mes "何か別のスキル覚えてきてねえ？";
			close;
		}
		mes "[レイデン・カルス]";
		mes "よお、おかえり。";
		next;
		emotion 0;
		mes "[レイデン・カルス]";
		mes "おう、目付きがちっとは鋭くなったな。";
		mes "よし、マスターからご褒美だ！";
		misceffect 224;
		set QUE_1ARCHER,7;
		if(checkre())
			getexp 50,0;
		else
			getexp 500,0;
		next;
		emotion 32;
		mes "[レイデン・カルス]";
		mes "悪くないな。";
		mes "あとは、自力で何とかしな。";
		mes "いちいち、マスターが最後まで";
		mes "面倒みる必要もないだろう。";
		mes "もちろん、これから教える";
		mes "スキルも同じだ。";
		next;
		mes "[レイデン・カルス]";
		mes "よし、じゃあ次に行くとするか。";
		close;
	case 7:
		mes "[レイデン・カルス]";
		mes "スキルウィンドウを開いてみな。";
		next;
		mes "[レイデン・カルス]";
		mes "ふくろうの目をLv3まで上げたんだ。";
		mes "ワシの目が新しく出てるだろう。";
		next;
		mes "[レイデン・カルス]";
		mes "ワシと言えば、何だ？";
		next;
		if(select("鋭い目付き","マスター")==1) {
			mes "[レイデン・カルス]";
			mes "おう、その通り！";
		}
		else {
			emotion 14;
			mes "[レイデン・カルス]";
			mes "グワハハハハハハハ！";
			mes "何言ってやがる、こいつぅ。";
		}
		next;
		mes "[レイデン・カルス]";
		mes "ワシは、空高く飛びながら、";
		mes "静かに地上のターゲットを探す。";
		mes "そして、ターゲットが見つかったら";
		mes "即急降下。その鋭い爪で獲物を捕る!!";
		next;
		emotion 3;
		mes "[レイデン・カルス]";
		mes "空のカリスマだ。";
		mes "しびれるね～。";
		next;
		mes "[レイデン・カルス]";
		mes "ワシが空高くから華麗に狩る様に";
		mes "^3131FFワシの目^000000で、お前も";
		mes "遠くのターゲットを";
		mes "攻撃できるようになる。";
		mes "ちなみに、命中率も上がる。";
		next;
		emotion 22;
		mes "[レイデン・カルス]";
		mes "今でも遠距離攻撃が可能だって？";
		mes "No・No・No・No～！";
		mes "その程度で満足してもらっちゃあ";
		mes "困るね～。";
		next;
		mes "[レイデン・カルス]";
		mes "いいか！　ワシの目を修練して、";
		mes "射程距離を伸ばしてこい！";
		next;
		mes "[レイデン・カルス]";
		mes "そして、二つ目の宿題だ！";
		mes "今から、野生のマンドラゴラを";
		mes "狩ってこい！";
		next;
		mes "[レイデン・カルス]";
		mes "マンドラゴラは固定型の";
		mes "モンスターで、移動しないから、";
		mes "遠距離攻撃の練習にはうってつけだ！";
		next;
		mes "[レイデン・カルス]";
		mes "マンドラゴラは、主に";
		mes "ミョルニール山脈に棲息している。";
		mes "参考にするように！";
		next;
		if(getskilllv(44) >= 3) {
			emotion 1;
			mes "[レイデン・カルス]";
			mes "うん？";
			mes "ちょっと待った……";
			next;
			mes "[レイデン・カルス]";
			mes "何だあ?!　もうワシの目を";
			mes "取ってるじゃないか！　何で俺は";
			mes "わざわざ説明したんだ……しくしく。";
			mes "よし、負けずに次の授業だ！";
			mes "まさか次のスキルも";
			mes "もう取っちまってやしないよな？";
			set QUE_1ARCHER,9;
			getitem 1752,500;
			close;
		}
		mes "[レイデン・カルス]";
		mes "よし、じゃあ奴らが住んでいる近くに";
		mes "送ってやる。プロンテラだ！";
		mes "奴らの多くは、プロンテラの東に";
		mes "いるはずだからな。";
		next;
		mes "[レイデン・カルス]";
		mes "今度の目標は、射程距離が";
		mes "どれくらい長くなるかを、";
		mes "自分の目で確認することだ。いいな。";
		mes "マンドラゴラは地属性だから、";
		mes "炎の矢がよく効く！";
		mes "これで頑張ってこい！";
		set QUE_1ARCHER,8;
		getitem 1752,300;
		next;
		mes "[レイデン・カルス]";
		mes "よし、出発するか？";
		next;
		if(select("出発する","ちょっと待って")==2) {
			mes "[レイデン・カルス]";
			mes "あんまり待てねえな。";
			mes "すぐ戻って来い！";
			close;
		}
		mes "[レイデン・カルス]";
		mes "よし、行ってこ～い！";
		close2;
		warp "prontera.gat",116,72;
		end;
	case 8:
		if(getskilllv(44) >= 3) {
			mes "[レイデン・カルス]";
			mes "おう、もう帰ったか！";
			mes "ワシの目はもう大丈夫か？";
			mes "よし、これは褒美だ！";
			mes "生徒が頼もしく成長していくのを";
			mes "見るのは、マスターとしても";
			mes "嬉しいもんさ！";
			set QUE_1ARCHER,9;
			getitem 1752,500;
			close;
		}
		mes "[レイデン・カルス]";
		mes "マンドラゴラは、プロンテラの東に";
		mes "多数、棲息している。";
		mes "そこで、ワシの目をLv3以上にして、";
		mes "射程距離の勉強をしてくるように。";
		next;
		mes "[レイデン・カルス]";
		mes "よし、出発するか？";
		next;
		if(select("出発する","ちょっと待って")==2) {
			mes "[レイデン・カルス]";
			mes "あんまり待てねえな。";
			mes "すぐ戻って来い！";
			close;
		}
		mes "[レイデン・カルス]";
		mes "よし、行ってこ～い！";
		close2;
		warp "prontera.gat",116,72;
		end;
	case 9:
		mes "[レイデン・カルス]";
		mes "よし、次はスキルらしい";
		mes "スキルを覚えてみっか。";
		mes "ふくろうの目もワシの目も";
		mes "パッシブスキルだからな。";
		mes "わざわざ発動させなくても、常時、";
		mes "自動的に適用されるスキルなんだ。";
		next;
		mes "[レイデン・カルス]";
		mes "次のスキルはアーチャーの華!!!!";
		mes "^3131FFダブルストレイフィング^000000だ!!!!";
		next;
		if(getskilllv(46) >= 3) {
			mes "[" +strcharinfo(0)+ "]";
			mes "もうそのスキルについては";
			mes "よく知っています。";
			next;
			mes "[レイデン・カルス]";
			mes "……………………";
			mes "お前、かわいくねえ生徒だな。";
			set QUE_1ARCHER,10;
			close;
		}
		mes "[レイデン・カルス]";
		mes "これはな、使えるスキルだ！";
		mes "狙ったターゲットに、";
		mes "素早く連続で矢を2連発！";
		mes "スキルレベルが上がれば上がるほど、";
		mes "攻撃力が増し、マスターすればかなりの";
		mes "ダメージを敵に与えることができる。";
		next;
		mes "[レイデン・カルス]";
		mes "このように矢をかけ、";
		mes "ターゲットに向けて集中……";
		mes "そして……一気に射る!!!!";
		next;
		emotion 21;
		mes "[レイデン・カルス]";
		mes "く～～～～～～～～!!";
		mes "こんな風に、ダブルストレイフィングの";
		mes "感覚に徐々に慣れて、";
		mes "ひたすら練習すべし！";
		if(getskilllv(46) == 0) {
			misceffect 224;
			set QUE_1ARCHER,10;
			if(checkre())
				getexp 0,50;
			else
				getexp 0,500;
		}
		next;
		mes "[レイデン・カルス]";
		mes "そしてもう一つ。";
		mes "^FF0000アローシャワー^000000というスキルがある。";
		mes "ダブルストレイフィングが2連発なら、";
		mes "アローシャワーは言葉通り、たくさんの";
		mes "矢をいっぺんに射るスキルだ。";
		next;
		emotion 18;
		mes "[レイデン・カルス]";
		mes "使いこなすには、少々難易度が高い。";
		mes "俺もまだ使いこなせてないからな～。";
		mes "それはまあ、俺の事情だが……";
		mes "とにかくコントロール感覚さえ養えば、";
		mes "使いこなせるようになるだろう。";
		close;
	case 10:
		mes "[レイデン・カルス]";
		mes "夏があれば冬がある！";
		mes "お中元があれば、お歳暮があるように！";
		mes "これから中間試験を兼ねて";
		mes "テストを行う！";
		next;
		emotion 21;
		mes "[レイデン・カルス]";
		mes "ズバリその名も「ヒドラ討伐隊」！";
		next;
		mes "[レイデン・カルス]";
		mes "首都プロンテラの衛星都市";
		mes "イズルードから、バイラン島へ";
		mes "向かう定期船がある。";
		mes "その船に乗って、バイラン島へ行け。";
		next;
		mes "[レイデン・カルス]";
		mes "バイラン島には、";
		mes "海底洞窟のダンジョンがある。";
		mes "そこにヒドラが多く棲息している。";
		mes "バイラン島のダンジョンは海底洞窟！";
		mes "だから水!!　^3131FF水は火に強く風に弱い^000000!!";
		next;
		mes "[レイデン・カルス]";
		mes "そこで、ヒドラを倒し^3131FF触手10個^000000と、";
		mes "きのこから^3131FFクリスタルブルー1個^000000を";
		mes "集めてこれたら、テスト合格とする！";
		next;
		mes "[レイデン・カルス]";
		mes "イズルードはプロンテラから";
		mes "徒歩でも行ける。";
		mes "まずプロンテラに向かうと";
		mes "分かりやすいだろう。";
		mes "おし、それじゃあさっさと行ってこい！";
		set QUE_1ARCHER,11;
		close;
	case 11:
		if(countitem(962) < 10 || countitem(991) < 1) {
			mes "[レイデン・カルス]";
			mes "イズルードからバイラン島へ行き、";
			mes "海底洞窟で触手10個と";
			mes "クリスタルブルー1個を";
			mes "集めてこいってんだ！";
			close;
		}
		mes "[レイデン・カルス]";
		mes "おし、ちょっくら見せてみな……";
		next;
		emotion 21;
		mes "[レイデン・カルス]";
		mes "よし！　合格だ！";
		mes "これからも強くなるためには、";
		mes "果てしない努力が必要だってことを";
		mes "忘れるなよ。いいな！";
		misceffect 224;
		set QUE_1ARCHER,12;
		if(checkre())
			getexp 100,100;
		else
			getexp 1000,1000;
		getitem 1707,1;
		close;
	case 12:
		mes "[レイデン・カルス]";
		mes "おおお、いつのまにか、残すスキルは";
		mes "ただ一つになってるじゃないか。";
		mes "このスキルがないアーチャーは";
		mes "あんこの入ってない饅頭ってなくらい、";
		mes "重要なスキルだ。";
		next;
		mes "[レイデン・カルス]";
		mes "スキルウィンドウを開けてみな。";
		mes "お前が取らなければいけない最後の";
		mes "スキル、^FF0000集中力向上^000000が見えるだろう。";
		next;
		mes "[レイデン・カルス]";
		mes "…………………………";
		next;
		mes "[レイデン・カルス]";
		mes "さあ、さあさあさあ！";
		mes "心を鎮めて、俺をジッと見るんだ。";
		next;
		mes "[レイデン・カルス]";
		mes "俺達はいつも、冷静さを維持しつつ、";
		mes "理性で弓の弦を引かなければならない。";
		mes "平常心が失われれば、矢は外れる。";
		next;
		mes "[レイデン・カルス]";
		mes "俺達は集中力向上によって、";
		mes "平常心を維持し、";
		mes "神経を一点に集中させることで";
		mes "一時的に^3131FFいくつかの能力値を極限まで^000000";
		mes "上げることができるのさ。";
		next;
		mes "[レイデン・カルス]";
		mes "アーチャー時代は、これの効果を";
		mes "そこまで実感できないかもしれないが、";
		mes "成長すれば成長するほど、";
		mes "この威力を感じられるようになる。";
		set QUE_1ARCHER,13;
		close;
	case 13:
		emotion 32;
		mes "[レイデン・カルス]";
		mes "ああ、終わった終わった！";
		mes "これで全部終わったな！　ああ？";
		mes "色々あって疲れた？";
		mes "俺はもっと疲れた!!";
		mes "……とでも言うと思ったか？";
		next;
		emotion 32;
		mes "[レイデン・カルス]";
		mes "こう見えても、お前がいない間は";
		mes "別の仕事を片付けてるんだ。";
		mes "遊んでばっかりいると思ったら";
		mes "大間違いだぜ。";
		next;
		mes "[レイデン・カルス]";
		mes "中間テストがあったんだ。";
		mes "最終テストもあるってのが道理だろ？";
		mes "今度は、かなり難しいかもしれないぜ。";
		mes "まあ、その分少しは手助けすっから";
		mes "心配すんな。";
		next;
		mes "[レイデン・カルス]";
		mes "これから、ミョルニール山脈に行って";
		mes "フローラから^3131FF食人植物の花5個^000000と";
		mes "^3131FF植物の茎20個^000000を集めてこい。";
		mes "けっこう危険な場所だが、";
		mes "そこにいる俺の弟子のアコライトが";
		mes "お前を助けることになってる。";
		next;
		mes "[レイデン・カルス]";
		mes "まあ、それなりに役に立つだろう。";
		mes "おし、じゃあこれをやるとするか。";
		next;
		mes "[レイデン・カルス]";
		mes "優しいマスターでよかったな～、お前！";
		next;
		mes "[レイデン・カルス]";
		mes "何があっても退かない勇気も大事だが";
		mes "無謀な挑戦をすると死ぬ確率が";
		mes "増えるだけだ。状況を把握し、";
		mes "適切な行動を取る決断力と";
		mes "注意力を得てくるこった。";
		set QUE_1ARCHER,14;
		getitem 601,10;
		getitem 501,10;
		getitem 602,1;
		next;
		mes "[レイデン・カルス]";
		mes "おし、それじゃあまず";
		mes "準備してこいや！";
		close;
	case 14:
	case 15:
		if(countitem(1032) < 5 || countitem(905) < 20) {
			mes "[レイデン・カルス]";
			mes "おし、出発するか？";
			mes "目標地点は^3131FFプロンテラ北北西^000000の";
			mes "ミョルニール山脈！";
			mes "食人植物の花5個と植物の茎20個！";
			mes "忘れるんじゃねえぞ！";
			next;
			if(select("出発！","待った！")==2) {
				mes "[レイデン・カルス]";
				mes "はあ、何で？";
				close;
			}
			emotion 18;
			mes "[レイデン・カルス]";
			mes "GOーーーーー!!";
			mes "フローラに頭を食われるなよ！";
			close2;
			warp "mjolnir_11.gat",25,221;
			end;
		}
		mes "[レイデン・カルス]";
		mes "ん、どうした？";
		mes "俺の顔に何かついてるか？";
		next;
		mes "[レイデン・カルス]";
		mes "顔って言えば、俺は色白い";
		mes "坊ちゃんみたいなのは、";
		mes "なよなよしてて嫌いだな。";
		mes "やはり、冒険者なら、少しくらい";
		mes "傷があって、鋭い野獣みたいな";
		mes "感じの方が格好いいじゃないか！";
		next;
		mes "[レイデン・カルス]";
		mes "俺の弟子には会ったか？";
		mes "あいつ、肝っ玉が小さくて心配なんだが";
		mes "……自分のことは自分で";
		mes "何とかしないとな！";
		next;
		mes "[レイデン・カルス]";
		mes "よし、これは合格祝いだ！";
		misceffect 224;
		set QUE_1ARCHER,16;
		if(checkre())
			getexp 300,300;
		else
			getexp 3000,3000;
		getitem 1770,500;
		next;
		emotion 18;
		mes "[レイデン・カルス]";
		mes "これで、全ての過程が終了した。";
		mes "いつの間にか、真のアーチャーの顔に";
		mes "なっちまってるじゃないか！";
		next;
		emotion 32;
		mes "[レイデン・カルス]";
		mes "まったく、マスターも人使い荒いぜ。";
		next;
		emotion 21;
		mes "[レイデン・カルス]";
		mes "お前が、心から自分の職業を";
		mes "愛するようになれば、俺は幸せだ。";
		mes strcharinfo(0)+ "、";
		mes "お前は俺の誇りだ!!";
		mes "これからも頑張れ!!";
		close;
	default:
		mes "[レイデン・カルス]";
		mes "俺は、この町が好きだ。";
		mes "一面の緑の中、鳥達が常に歌い、飛ぶ";
		mes "フェイヨン……";
		next;
		mes "[レイデン・カルス]";
		mes "草地に横になって空を眺めていれば、";
		mes "ただただ幸せってなもんだ。";
		next;
		emotion 32;
		mes "[レイデン・カルス]";
		mes "何より、心強い仲間が";
		mes "こんなに集まってくる！";
		mes "毎日、なんだかんだと喧嘩しちまうが、";
		mes "まぁ、仲が良いほど、ってな。";
		next;
		mes "[レイデン・カルス]";
		mes "……仲間って、いいよな。";
		mes "なぁ、そう思わねえか？";
		close;
	}
}

pay_arche.gat,84,139,3	script	シズノ	727,{
	misceffect 1,"#ArcherTarget";
	mes "[シズノ]";
	mes "ハーーーーッ!!";
	mes "ダブルストレイフィング!!";
	misceffect 1,"#ArcherTarget";
	next;
	mes "[シズノ]";
	mes "アーチャーとは、";
	mes "弓を生活の中心に据える";
	mes "人々の略称です。";
	next;
	mes "[シズノ]";
	mes "シーフの中にも弓を扱う者はいます。";
	mes "ですが、彼らは短剣を持ってこそ、";
	mes "その真価を発揮します。";
	mes "つまり彼らは、あくまでも";
	mes "補助的な武器として弓を使うので、";
	mes "アーチャーとは呼べません。";
	next;
	mes "[シズノ]";
	mes "私達アーチャーは、";
	mes "弓を専門的に扱う者なのです。";
	next;
	switch(QUE_1ARCHER) {
	case 0:
		mes "[シズノ]";
		mes "あなたにも風の加護がありますように。";
		close;
	default:
		break;
	case 2:
		mes "[シズノ]";
		mes "どうでしたか？";
		mes "アーチャーについて、";
		mes "少しは知識が深まりましたか？";
		mes "これらは、アーチャーの道を";
		mes "選んだ方にとっては、";
		mes "どれも必要な知識と言えるものです。";
		next;
		mes "[シズノ]";
		mes "それでは、マスターの下へ";
		mes "お戻りください。";
		next;
		mes "[シズノ]";
		mes "あなたにも風の加護がありますように。";
		misceffect 224;
		set QUE_1ARCHER,3;
		if(checkre()) {
			if(JobLevel > 20) getexp 0,50;
			else if(JobLevel > 10) getexp 0,25;
			else if(JobLevel > 1) getexp 0,10;
			else getexp 0,3;
		}
		else {
			if(JobLevel > 20) getexp 0,500;
			else if(JobLevel > 10) getexp 0,250;
			else if(JobLevel > 1) getexp 0,100;
			else getexp 0,30;
		}
		close;
	}
	mes "-カバックの手紙をシズノに渡した-";
	mes "-彼女は目を細くしながら、";
	mes "手紙を静かに読んでいた-";
	next;
	mes "[シズノ]";
	mes "……マスターは、";
	mes "私にあなたを任すと言っています。";
	next;
	mes "[シズノ]";
	mes "分かりました。";
	mes "では、何について知りたいのですか？";
	while(1) {
		next;
		switch(select("アーチャーについて","アーチャーのステータスについて","特にありません")) {
		case 1:
			mes "[シズノ]";
			mes "アーチャーとは、";
			mes "優れた技術と明快なセンスにより";
			mes "^3131FF弓^000000を扱う者を指します。";
			next;
			mes "[シズノ]";
			mes "弓は^3131FF遠距離^000000攻撃を主とします。";
			mes "ある程度の実力を身につけない限り、";
			mes "1対1の近接戦には無理があります。";
			next;
			mes "[シズノ]";
			mes "敵が近付く前に倒す、もしくは";
			mes "他の職業とパーティーを組んだ際の";
			mes "後方射撃で実力を発揮します。";
			next;
			mes "[シズノ]";
			mes "アーチャーは、";
			mes "ノービスから転職可能です。";
			mes "そして、アーチャーとしてある程度";
			mes "経験を積んだ後、アーチャーの";
			mes "2次職である^3131FFハンター^000000や";
			mes "^3131FFバード、ダンサー^000000に転職できます。";
			next;
			mes "[シズノ]";
			mes "2次職となった後も、最終レベルまで";
			mes "経験を積むと、ヴァルキリーの導きで";
			mes "転生ノービスに転生できます。";
			mes "そして転生アーチャーへ転職した後は、";
			mes "^3131FFスナイパー^000000や^3131FFクラウン、ジプシー^000000へと";
			mes "転職が可能になります。";
			next;
			mes "[シズノ]";
			mes "ノービス";
			mes "　↓";
			mes "アーチャー";
			mes "　↓";
			mes "ハンター、バード、ダンサー";
			next;
			mes "[シズノ]";
			mes "転生ノービス";
			mes "　↓";
			mes "転生アーチャー";
			mes "　↓";
			mes "スナイパー、クラウン、ジプシー";
			next;
			mes "[シズノ]";
			mes "このような感じですね。";
			if(QUE_1ARCHER == 1)
				set QUE_1ARCHER,2;
			continue;
		case 2:
			mes "[シズノ]";
			mes "それでは、アーチャーと";
			mes "ステータスの関係について";
			mes "説明いたしましょう。";
			while(1) {
				next;
				switch(select("STR","^3131FFAGI^000000","VIT","^FF9900INT^000000","^FF3131DEX^000000","LUK","会話終了")) {
				case 1:
					mes "[シズノ]";
					mes "一般的に、武器の攻撃力を";
					mes "上げるには、STRを上げます。";
					mes "しかし、アーチャーの武器である弓は";
					mes "^FF3131DEX^000000により";
					mes "攻撃力の増減が決まります。";
					next;
					mes "[シズノ]";
					mes "つまり、STRはアーチャーにとって";
					mes "一番関係のないステータスと";
					mes "言えるかもしれません。";
					next;
					mes "[シズノ]";
					mes "しかし、もし、あなたも砂漠に住む";
					mes "彼らの様に短剣で戦いたいのなら";
					mes "STRを上げてもよいでしょう。";
					next;
					mes "[シズノ]";
					mes "もう一つ。アーチャーの狩りには";
					mes "矢が欠かせません。";
					mes "しかし、矢が切れてしまうと";
					mes "狩りができないため、";
					mes "狩りに赴いていられる時間が";
					mes "限られてしまいます。";
					next;
					mes "[シズノ]";
					mes "^3131FFSTR^000000を上げると、";
					mes "所持品の重量の限界量が増えます。";
					mes "その分、矢を持ち歩けるようには";
					mes "なります。";
					if(QUE_1ARCHER == 1)
						set QUE_1ARCHER,2;
					continue;
				case 2:
					mes "[シズノ]";
					mes "ご存知かと思いますが^FF3131AGI^000000は";
					mes "^FF3131攻撃速度(ASPD)^000000と^FF3131回避率(FLEE)^000000に";
					mes "影響するステータスです。";
					next;
					mes "[シズノ]";
					mes "序盤に、攻撃速度と回避率が低いと";
					mes "狩りが困難に感じられるでしょうが、";
					mes "^FF3131AGI^000000を上げれば";
					mes "徐々にそれも克服できるでしょう。";
					if(QUE_1ARCHER == 1)
						set QUE_1ARCHER,2;
					continue;
				case 3:
					mes "[シズノ]";
					mes "体力の向上に影響する^3131FFVIT^000000は";
					mes "アーチャーにとって特に目立った影響を";
					mes "与えるステータスではありません。";
					next;
					mes "[シズノ]";
					mes "しかし、アーチャーは基本的に体力が";
					mes "弱いので、^3131FFVIT^000000を上げることにより";
					mes "その欠点をある程度";
					mes "補うこともできます。";
					next;
					mes "[シズノ]";
					mes "ただ、早く矢を射るのが好きな";
					mes "私にとって、VITはちょっと";
					mes "鈍そうなイメージがあります……";
					if(QUE_1ARCHER == 1)
						set QUE_1ARCHER,2;
					continue;
				case 4:
					mes "[シズノ]";
					mes "^FF0000INT^000000は、アーチャーに";
					mes "深く関わりのあるステータスです。";
					next;
					mes "[シズノ]";
					mes "^FF0000INT^000000が上がると、";
					mes "SPの最大値が上がります。";
					mes "これによりスキルを多岐にわたり";
					mes "使えるようになります。";
					next;
					mes "[シズノ]";
					mes "アーチャーの2次職である";
					mes "^3131FFハンターの場合、ファルコンが";
					mes "与えるダメージ^000000に影響します。";
					mes "INTが高ければ高いほど、";
					mes "ダメージが増えます。";
					if(QUE_1ARCHER == 1)
						set QUE_1ARCHER,2;
					continue;
				case 5:
					mes "[シズノ]";
					mes "アーチャーにとって、一番重要な";
					mes "ステータスが^3131FFDEX^000000です。";
					next;
					mes "[シズノ]";
					mes "^FF3131DEX^000000はアーチャー系が";
					mes "使う武器、^3131FF弓、楽器、鞭^000000の";
					mes "^3131FF攻撃力を増加^000000させます。";
					mes "正確にモンスターの急所を狙うことが";
					mes "モンスターへダメージを";
					mes "与える事につながるのです。";
					next;
					mes "[シズノ]";
					mes "一般の武器はSTRが影響しますから";
					mes "それと比べると珍しいと言えます。";
					next;
					mes "[シズノ]";
					mes "^FF3131DEX^000000はそれ以外にも";
					mes "他の職業と同じく、";
					mes "^3131FF命中率(HIT)^000000に効果を発揮し、";
					mes "^3131FF攻撃速度(ASPD)^000000にも若干影響します。";
					if(QUE_1ARCHER == 1)
						set QUE_1ARCHER,2;
					continue;
				case 6:
					mes "[シズノ]";
					mes "^FF0000LUK^000000は完全回避と";
					mes "クリティカル発生率に影響します。";
					mes "それ以外に、アーチャーの2次職である";
					mes "ハンターのスキル、^3131FFブリッツビート^000000の";
					mes "発動率に影響します。";
					next;
					mes "[シズノ]";
					mes "簡単に言えば、ファルコンが自発的に";
					mes "モンスターを攻撃する確率が";
					mes "上がるのです。分かりましたか？";
					if(QUE_1ARCHER == 1)
						set QUE_1ARCHER,2;
					continue;
				case 7:
					mes "[シズノ]";
					mes "知りたいことは特にないのですか？";
					break;
				}
				break;
			}
			continue;
		case 3:
			mes "[シズノ]";
			mes "優れたアーチャーは、";
			mes "千里の距離からでも、";
			mes "標的を正確に射抜くといいます。";
			mes "そのようになるには、いつも";
			mes "冷静であることが必要だとか……";
			next;
			mes "[シズノ]";
			mes "……私も、いつかそのような";
			mes "アーチャーになりたいです。";
			mes "いつか、いつかきっと……";
			close;
		}
	}
}
pay_arche.gat,76,135,5	script	#ArcherTarget	111,{}

mjolnir_11.gat,27,223,3	script	アコライト	95,{
	switch(QUE_1ARCHER) {
	case 14:
		if(gettime(3) < 18 || gettime(3) >= 22)
			break;
		mes "[マープ]";
		mes "……あ、あの、こんにちは！";
		mes "あのあの、レイデン様が";
		mes "送られた方ですか？";
		next;
		mes "[マープ]";
		mes "私は、あのあの、アコライトの";
		mes "マープと言います！";
		mes "あ、あの、あの、以前、";
		mes "レイデン様に窮地に陥ったところを";
		mes "助けていただいて……";
		next;
		emotion 19;
		mes "[マープ]";
		mes "それで、えっと、あの、あの……";
		next;
		mes "[マープ]";
		mes "あ、あの！　それで！";
		mes "その時から、レイデン様の";
		mes "お役に立ちたくて！";
		mes "だから、あの……助けて差し上げます。";
		next;
		mes "[マープ]";
		mes "レイデン様は、あんなに";
		mes "立派になられたのに、";
		mes "私はまだ未熟で……";
		mes "お荷物になるだけではないか、";
		mes "迷惑ではないかと心配で……";
		next;
		mes "[マープ]";
		mes "あ、あの、あの！";
		mes "こんな私ですが、少しでもレイデン様の";
		mes "お役に立ちたいんです！";
		mes "ですから、どうかあなたの";
		mes "お手伝いをさせてください！";
		next;
		switch(select("いいですよ","嫌です","レイデン様は私のもの！")) {
		case 1:
			mes "[マープ]";
			mes "ああああ、あのあの！";
			mes "ありがとうございます！";
			mes "あの、頑張ります！";
			set QUE_1ARCHER,15;
			close;
		case 2:
			emotion 28;
			mes "[マープ]";
			mes "……そ、そんなぁ……";
			mes "…………………………";
			mes "……私の助けが必要ないなら、";
			mes "仕方ないですね……";
			close;
		case 3:
			mes "[マープ]";
			mes "え……ええ？";
			mes "まさか、レイデン様と";
			mes "あ、あんなことや、こ、こんなことを？";
			next;
			if(Sex) {
				mes "[マープ]";
				mes "ちょ、ちょっと待ってください！";
				mes "あなた、男じゃないですか！";
				mes "か、神さまが許しません！";
				mes "天罰です、天罰！";
				next;
				mes "[マープ]";
				mes "い、いいえ……";
				mes "レイデン様が決めた事を";
				mes "私がとやかく言うのは……";
				mes "ああ、ご、ごめんなさい……";
				mes "レイデン様……しくしく……";
			}
			else {
				mes "[マープ]";
				mes "そ、そんな……そんな……";
				mes "……あの方は、今はアーチャーを";
				mes "導いていらっしゃると、";
				mes "欠かさず来ているお手紙には……";
				next;
				mes "[マープ]";
				mes "しくしく……か、悲しいですが……";
				mes "レイデン様が幸せなら！";
				mes "私、心からお手伝いさせて";
				mes "いただきます！";
			}
			set QUE_1ARCHER,15;
			close;
		}
	case 15:
		if(gettime(3) >= 18 && gettime(3) < 22)
			break;
		mes "[マープ]";
		mes "は～い、で、ではお手伝いします！";
		mes "そ、そ～れ!!";
		switch(rand(3)) {
			case 0: set '@heal,532; break; //Lv3
			case 1: set '@heal,9999; break; //Lv10
			case 2: set '@heal,1292; break; //Lv8
		}
		npcskillsupport 28,'@heal;
		heal '@heal,0;
		npcskillsupport 29,0;
		if(rand(2))
			sc_start 12,240000,10;//Lv10
		else
			sc_start 12,140000,5; //Lv5
		npcskillsupport 34,0;
		if(rand(2))
			sc_start 10,240000,10; //Lv10
		else
			sc_start 10,140000,5; //Lv5
		close;
	default:
		misceffect 197;
		mes "[マープ]";
		mes "………………";
		mes "……ぐー……zzz";
		mes "ウニャ……どうして、歩いてるだけで";
		mes "眠くなるかな……グー……zzzzz";
		close;
	}
	//睡眠時
	misceffect 197;
	mes "[マープ]";
	mes "Zzzz……";
	mes "フニャムニャ……";
	mes "どなたですか……";
	next;
	mes "[マープ]";
	mes "……レーダー……コルク……？";
	mes "フアアア……誰だっけ……ムニャ……";
	mes "聞いたこと……あるような……";
	mes "ないような……グー……zzz";
	next;
	mes "[マープ]";
	mes "ンニャアアア、うるさいーーっ!!";
	mes "……ある……あの……グー……";
	mes "友達が……送ると……グーグー……";
	switch(rand(3)) {
		case 0: set '@heal,532; break; //Lv3
		case 1: set '@heal,(QUE_1ARCHER == 14)? 1444: 9999; break; //Lv9or10
		case 2: set '@heal,1292; break; //Lv8
	}
	npcskillsupport 28,'@heal;
	heal '@heal,0;
	npcskillsupport 29,0;
	switch(rand(3)) {
		case 0: break; //Lv0
		case 1: sc_start 12,140000,5; break; //Lv5
		case 2: sc_start 12,240000,10; break; //Lv10
	}
	npcskillsupport 34,0;
	switch(rand(3)) {
		case 0: break; //Lv0
		case 1: sc_start 10,140000,5; break; //Lv5
		case 2: sc_start 10,240000,10; break; //Lv10
	}
	close;
}

pay_arche.gat,130,113,3	script	錬金術師ギルドメンバー	740,{
	if(QUE_2ARCHER < 1) {
		mes "[錬金術師ギルドメンバー]";
		mes "ああ、早く来ないかな……";
		close;
	}
	if(countitem(905) < 1 && countitem(1032) < 1) {
		emotion 28;
		mes "[錬金術師ギルドメンバー]";
		mes "カバックに聞いたかどうか知りませんが";
		mes "最近、泥棒が当方のフローラ畑を";
		mes "完全に駄目にしてしまいました！";
		next;
		mes "[錬金術師ギルドメンバー]";
		mes "討伐も考えましたが、まず、私どもは";
		mes "フローラ畑を再建するために";
		mes "粉骨砕身しています。";
		next;
		mes "[錬金術師ギルドメンバー]";
		mes "ここではフローラを様々な研究に";
		mes "使っているのです。";
		mes "どうか、錬金術師ギルドのため、";
		mes "^3131FF植物の茎^000000と^3131FF食人植物の花^000000を";
		mes "ご提供くださいませ。";
		mes "お礼はいたします！";
		close;
	}
	emotion 28;
	mes "[錬金術師ギルドメンバー]";
	mes "アアアアア！";
	mes "やっとイカロスから人が来たぁ！";
	next;
	mes "[錬金術師ギルドメンバー]";
	mes "錬金術師ギルドのため、^3131FF植物の茎^000000と";
	mes "^3131FF食人植物の花^000000を売ってくれませんか？";
	mes "^3131FF植物の茎^000000は^3131FF30zeny^000000、";
	mes "^3131FF食人植物の花^000000は^3131FF130zeny^000000で";
	mes "買い取りましょう。";
	next;
	if(select("持ってるのを全部売る","一個も売らない")==2) {
		emotion 28;
		mes "[錬金術師ギルドメンバー]";
		mes "ああ、どうかお願いします！";
		mes "もう在庫が尽きかけている";
		mes "私達のため、どうかお力添えを～";
		close;
	}
	mes "[錬金術師ギルドメンバー]";
	mes "ありがとうございます！";
	mes "ありがとうございます！";
	mes "助かりました！";
	set '@zeny,'@zeny+(countitem(905)*30);
	set '@zeny,'@zeny+(countitem(1032)*130);
	delitem 905,countitem(905);
	delitem 1032,countitem(1032);
	set Zeny,Zeny+'@zeny;
	close;
}

prontera.gat,126,335,5	script	アステル	51,{
	switch(QUE_2ARCHER) {
	case 0:
	case 1:
	case 2:
		mes "[アステル]";
		mes "…………";
		next;
		mes "[アステル]";
		mes "……風のアステル。";
		mes "誰のためにも歌わない。";
		next;
		mes "[アステル]";
		mes "私は、私のためだけに歌う";
		mes "吟遊詩人。";
		next;
		mes "[アステル]";
		mes "あなたのために歌う歌はない。";
		mes "だから、さようなら。";
		if(QUE_2ARCHER != 2)
			close;
		next;
		menu "マスターに言われて来ました",-;
		mes "[アステル]";
		mes "………………";
		mes "そう。";
		next;
		mes "[アステル]";
		mes "マスターに連絡しなければ";
		mes "いけないのだけど、";
		mes "長旅で少々疲れてしまった。";
		mes "ここは、あまりにも人が多い。";
		mes "みんながわいわいと、幾万もの感情が";
		mes "交差してる。私は、それが苦手だ。";
		next;
		mes "[アステル]";
		mes "どうして、私は彼らに";
		mes "近づけないのだろう。";
		mes "彼らに近づこうとすればするほど、";
		mes "心は逃げ出したい気持ちで";
		mes "いっぱいになってしまう。";
		next;
		mes "[アステル]";
		mes "この性格を直したくて、";
		mes "吟遊詩人になったけど……";
		mes "何も変わらない……";
		mes "歌は好きだけど……";
		next;
		mes "[アステル]";
		mes "……無駄な話を聞かせてしまったな。";
		next;
		mes "[アステル]";
		mes "マスターが、私に協力しなさいと？";
		mes "……では、一つ頼みがある。";
		next;
		mes "[アステル]";
		mes "ルーンミッドガッツ王国の";
		mes "首都プロンテラ。";
		mes "街の中央には噴水と広場があるらしい。";
		mes "きっと、大勢の人が";
		mes "集まっているのだろう……";
		next;
		mes "[アステル]";
		mes "実は、私は人が集まる場所が";
		mes "嫌なのではなく……怖い……";
		mes "だから、どうしてもプロンテラの";
		mes "中央に行けないでいる。";
		next;
		mes "[アステル]";
		mes "……吟遊詩人として、失格だろう。";
		next;
		mes "[アステル]";
		mes "私の代わりに広場へ行って、";
		mes "何か珍しい話がないか、";
		mes "調べてきてくれないか？";
		set QUE_2ARCHER,3;
		close;
	case 3:
		mes "[アステル]";
		mes "すまないが、";
		mes "私の代わりに広場へ行って、";
		mes "何か珍しい話がないか、";
		mes "調べてきてくれないか？";
		close;
	case 4:
		mes "[アステル]";
		mes "ああ、おかえり。";
		mes "新生ギルドマスターと";
		mes "おしゃべりなマジシャンか……";
		next;
		mes "[アステル]";
		mes "^3131FFエンペリウム^000000か……";
		mes "モロクにも、そういう人が";
		mes "いっぱいいた……";
		mes "私の故郷、フェイヨンにも……";
		next;
		mes "[アステル]";
		mes "^3131FFこの世界の運命を変えられる者の前に";
		mes "現れ、運命を共にする^000000珍しい金属……";
		mes "果たして、多くの人が夢中になるほどの";
		mes "価値はあるのか？";
		next;
		emotion 20;
		mes "[アステル]";
		mes "私には、分からない……";
		next;
		mes "[アステル]";
		mes "ああ。頭がこんがらがってきたか。";
		mes "少し休め。あなたも、ここに座って";
		mes "一緒に水の音を聞かないか？";
		next;
		mes "[アステル]";
		mes "ここに長居するのは不愉快だが……";
		mes "こうして水の音を聞いていると";
		mes "故郷にいるようだ……";
		next;
		mes "[アステル]";
		mes "イカロスの近くにあった池は見たか？";
		mes "私は、あそこが一番好きだ……";
		next;
		mes "[アステル]";
		mes "久しぶりに、人と話したら……";
		mes "疲れた……";
		mes "少しだけ……休む……";
		next;
		mes "[アステル]";
		mes "………………";
		next;
		mes "-アステルは眠ってしまった-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "静か……だね……";
		next;
		mes "-水に足を浸し、そっと";
		mes "水の音に耳を傾けた-";
		mes "-足に触れる水が冷たくて";
		mes "気持ちがいい-";
		next;
		mes "（チャポン）";
		soundeffect "se_littlewaves02.wav",0;
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……ん、なんだ？";
		next;
		mes "[？？？]";
		mes "キャアアアアアアアッ!!!!!";
		misceffect "@emotion 23";
		soundeffect "se_scream_w01.wav",0;
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "な、何だ??!!";
		mes "城の中から悲鳴が!!";
		next;
		mes "-アステルは、深い眠りについている-";
		mes "-起きる気配はない-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "チェ、見過ごすわけにはいかない。";
		mes "行ってくるか。";
		set QUE_2ARCHER,5;
		close;
	case 5:
	case 6:
		mes "[アステル]";
		mes "……z……Z……ZZ……";
		close;
	case 8:
		mes "[アステル]";
		mes "どこに行っていた？";
		mes "起きたら、いなくなっていたから、";
		mes "心配したじゃないか。";
		next;
		mes "[アステル]";
		mes "王宮から悲鳴？";
		mes "調べに行ったら、誰もが何もないと";
		mes "しらばっくれる？";
		mes "そうか、そんなことが……";
		next;
		mes "[アステル]";
		mes "さっきの話、覚えているか？";
		mes "エンペリウムは珍しい金属のはず。";
		mes "なのに、どうして我らはこんな手軽に";
		mes "エンペリウムを入手できる？";
		next;
		mes "[アステル]";
		mes "………………";
		next;
		mes "[アステル]";
		mes "もう少し、調査をしてみよう。";
		mes "私はここに残る。";
		mes "あなたはフェイヨンに戻って、";
		mes "マスターにこう伝えて欲しい。";
		mes "私は元気だと。";
		mes "ちゃんと、任務を遂行中だと。";
		next;
		mes "[アステル]";
		mes "もう、それ位にしろ！";
		mes "悩み過ぎるとハゲるぞ！";
		mes "あとは、私に任せておけ！";
		next;
		mes "[アステル]";
		mes "……いつか……";
		mes "あなたのためにも歌を歌ってやるよ。";
		set QUE_2ARCHER,9;
		close;
	default:
		mes "[アステル]";
		mes "…………………";
		close;
	}
}

prontera.gat,167,281,3	script	新生ギルドマスター	753,{
	mes "[新生ギルドマスター]";
	mes "運命を共にする勇者求む！";
	mes "優れた知力、体力を";
	mes "兼ね備えた勇ましき者よ！";
	mes "ためらいを捨て、一緒に旅に出よう！";
	mes "運命を導く^3131FFエンペリウム^000000がある限り";
	mes "神は決して我々を見捨てぬだろう！";
	if(QUE_2ARCHER == 3)
		set QUE_2ARCHER,4;
	close;
}

prontera.gat,144,301,5	script	マジシャン	123,{
	mes "[マジシャン]";
	mes "あそこで、ギルドメンバーを";
	mes "募集してる人見た？";
	next;
	emotion 32;
	mes "[マジシャン]";
	mes "あれって、バカ？";
	mes "あんな所で、流行らないセリフを";
	mes "大声でさ。恥ずかしくないの？";
	mes "あぁ～、マトモなギルドって";
	mes "ないのかしら～。";
	next;
	mes "[マジシャン]";
	mes "私は、ウィザードになって、";
	mes "王国でも右に出るものがない";
	mes "大きなギルドに入るの。";
	mes "重厚に武装した騎士と";
	mes "麗しい聖職者の間で、";
	mes "優雅に魔法を唱えるのよ！";
	next;
	mes "[マジシャン]";
	mes "アアアアン～～～";
	mes "ス・テ・キ！";
	close;
}

prt_castle.gat,76,165,6	script	大臣	55,{
	mes "[大臣]";
	mes "国王陛下は、現在国政が立て込んでおり";
	mes "謁見はお受け出来ません。";
	if(QUE_2ARCHER == 5) {
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "悲鳴が聞こえました！";
		mes "王宮で何か事件でもあったんですか？";
		next;
		mes "[大臣]";
		mes "…………";
		next;
		mes "[大臣]";
		mes "聞き間違えでしょう。";
		mes "何も起きていません。";
		mes "最近、猫がよく喧嘩しているそうなので";
		mes "それを聞いたのではないでしょうか。";
		set QUE_2ARCHER,6;
		close;
	}
	if(QUE_2ARCHER == 7) {
		next;
		mes "-彼の表情から";
		mes "ただならぬものを感じる-";
		mes "-だが、いくら問いただしても";
		mes "無駄なようだ-";
		close;
	}
	if(QUE_ACOLYTE == 25) {
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "陛下に何か良くないことが";
		mes "起こったのでしょう。";
		mes "私にお手伝いできることは";
		mes "ありませんか？";
		next;
		mes "[大臣]";
		mes "…………";
		next;
		mes "[大臣]";
		mes "何かの勘違いではありませんか。";
		mes "ルーンミッドガッツ王国は平和です。";
		mes "陛下は民を愛しておりますが、";
		mes "現在、多忙であられるため、";
		mes "謁見はお断りしております。";
		next;
		mes "[大臣]";
		mes "王宮で仕事をするより、街で";
		mes "人々のために奉仕することこそ";
		mes "大事なのではないですか。";
		mes "きっと、アコライト様を";
		mes "必要とされる方がいるでしょう。";
		close;
	}
	close;
}

prt_castle.gat,94,150,0	script	#sound_tu	139,10,10,{
	if(QUE_2ARCHER != 6)
		end;
	mes "[大臣]";
	mes "プロンテラ大聖堂に連絡を！";
	mes "早く！";
	set QUE_2ARCHER,7;
	close;
}

monk_in.gat,19,43,1	script	マギンス司教	60,{
	if(QUE_2ARCHER != 7) {
		mes "[マギンス司教]";
		mes "……ただいま、立て込んでおりますので";
		mes "しばらくしてからお越しください。";
		close;
	}
	mes "[マギンス司教]";
	mes "こんにちは。";
	mes "まさか、転職にいらしたわけでも";
	mes "ないでしょうし……";
	mes "何かご用でしょうか？";
	next;
	mes "[マギンス司教]";
	mes "王宮関係の業務？";
	mes "はい、私がその任についておりますが。";
	mes "何か？";
	next;
	if(select("王宮で何が起こったのですか？","何でもありません")==1) {
		mes "[マギンス司教]";
		mes "…………!!";
		next;
		mes "[マギンス司教]";
		mes "……………………";
		next;
		mes "[マギンス司教]";
		mes "……何も起こっていませんよ。";
		mes "王宮とは常に書簡を交換していますが、";
		mes "何かあったという連絡は";
		mes "受けておりません。";
		mes "君は心配せず、フェイヨンに";
		mes "帰るとよいでしょう。";
		next;
		set QUE_2ARCHER,8;
	}
	mes "[マギンス司教]";
	mes "あなたの未来にいつも";
	mes "幸運がありますよう。";
	npcskillsupport 29,0;
	sc_start 12,240000,10;
	npcskillsupport 34,0;
	sc_start 10,240000,10;
	close;
}

//============================================================
// マジシャンクエストNPC
//- Registry -------------------------------------------------
// QUE_MAGICIAN -> 0～28
//------------------------------------------------------------
geffen.gat,61,174,0	script	立て札	111,{
	mes "-魔法学校-";
	close;
}

geffen.gat,67,180,4	script	初級マジシャン担当官	102,{
	if(Job == Job_Novice) {
		mes "[マナ]";
		mes "まだ時ではありません。";
		mes "もう少し成長してから";
		mes "いらしてください。";
		close;
	}
	if(Job != Job_Magician) {
		mes "[マナ]";
		mes "すでに職業についていても、他の";
		mes "職業が羨ましくなる時があるのは";
		mes "わかります。でも、もうちょっと";
		mes "自分を見直してみたらいかがですか？";
		mes "そんな時こそ、自分への理解を";
		mes "深められるかもしれませんよ。";
		close;
	}
	switch(QUE_MAGICIAN) {
	case 0:
		mes "[マナ]";
		mes "こんにちは。";
		mes "初級マジシャン担当官の";
		mes "マナと申します。";
		mes "年は28歳、恋人は……";
		mes "ホホ、どうなんでしょう。";
		next;
		mes "[マナ]";
		mes "マジシャンに転職したばかりの";
		mes "方の教育を担当しております。";
		mes "かく言う私も新米なのですが、";
		mes "よろしくお願いいたしますね。";
		next;
		if(select("私こそ","忙しいので、また……")==2) {
			mes "[マナ]";
			mes "え……そうですか……";
			mes "残念ですが、次の機会を";
			mes "期待するとしましょう。";
			close;
		}
		mes "[マナ]";
		mes "そんなに固くならなくて良いのですよ。";
		mes "誰でも初心者の時はあるものです。";
		mes "そして、誰でも成長するものと";
		mes "決まっているのですから。";
		next;
		mes "[マナ]";
		mes "それでは、まず基礎から";
		mes "始めましょうか。";
		next;
		mes "[マナ]";
		mes "マジシャンとは、肉体的な力とは違う";
		mes "元素の力を扱う存在。すなわち、";
		mes "^FF0000火^000000、^5C4033地^000000、^93DB70風^000000、^0000FF水^000000の";
		mes "4大元素を扱う者です。";
		next;
		mes "[マナ]";
		mes "他に^CFB53B念^000000の力も扱います。";
		mes "あまりピンと来ないかもしれませんが、";
		mes "^CFB53B念^000000も元素の一部なのです。";
		next;
		mes "[マナ]";
		mes "元素同士には、相性があります。";
		mes "^FF0000火^000000は^5C4033地^000000に強く、";
		mes "^5C4033地^000000は^93DB70風^000000に強く、";
		mes "^93DB70風^000000は^0000FF水^000000に強く、";
		mes "^0000FF水^000000は^FF0000火^000000に強いのです。";
		next;
		mes "[マナ]";
		mes "もちろん、その逆も然り。";
		mes "^FF0000火^000000は^0000FF水^000000に弱く、";
		mes "^0000FF水^000000は^93DB70風^000000に弱く、";
		mes "^93DB70風^000000は^5C4033地^000000に弱く、";
		mes "^5C4033地^000000は^FF0000火^000000に弱いです。";
		mes "そして^CFB53B念^000000は^CFB53B念^000000に弱いのです。";
		next;
		mes "[マナ]";
		mes "少し話が長かったですか？";
		mes "では休憩をはさみましょう。";
		mes "私もまだ慣れないせいか、";
		mes "少々疲れました。";
		set QUE_MAGICIAN,1;
		if(checkre())
			getexp BaseLevel*30/10,BaseLevel*15/10;
		else
			getexp BaseLevel*30,BaseLevel*15;
		misceffect 4,"";
		close;
	case 1:
		mes "[マナ]";
		mes "それでは、先程の話の続きと";
		mes "参りましょう。";
		mes "属性の関係について";
		mes "説明しましたね。";
		next;
		mes "[マナ]";
		mes "属性を熟知せず、モンスターと";
		mes "戦うのは危険を伴います。";
		mes "モンスターは属性を持っていて、";
		mes "その属性にはレベルがあります。";
		next;
		mes "[マナ]";
		mes "つまり、同じ属性の中でも、";
		mes "それぞれの特徴を考慮する必要が";
		mes "あるということです。";
		mes "それでは、それぞれ属性別の";
		mes "特徴について説明しましょう。";
		while(1) {
			next;
			switch(select("^FF0000火^000000","^5C4033地^000000","^93DB70風^000000","^0000FF水^000000","^CFB53B念^000000","やめる")) {
			case 1:
				mes "[マナ]";
				mes "一般的に^FF0000火^000000属性のモンスターは";
				mes "攻撃力が高いのです。";
				mes "ですから、体力の低いマジシャンは、";
				mes "火属性の敵とすれ違うだけでも";
				mes "とても危険なのだと";
				mes "覚えておいてください。";
				next;
				mes "[マナ]";
				mes "^FF0000火^000000属性のモンスターと";
				mes "1対1で相対する場合は、";
				mes "フロストダイバーという魔法で";
				mes "凍らせるのが効果的です。";
				next;
				mes "[マナ]";
				mes "^FF0000火^000000属性のモンスターに";
				mes "^FF0000火^000000属性の魔法で攻撃しても";
				mes "大してダメージを与えることは";
				mes "できません。";
				next;
				mes "[マナ]";
				mes "マジシャンの魔法で^FF0000火^000000属性の";
				mes "魔法は、サイト、ファイアーボルト、";
				mes "ファイアーウォール、ファイアーボール";
				mes "です。";
				next;
				mes "[マナ]";
				mes "^FF0000火^000000属性魔法で特徴のある魔法は、";
				mes "ファイアーウォールですね。";
				mes "ファイアーウォールは、";
				mes "3つまで地面に設置することが";
				mes "できます。";
				next;
				mes "[マナ]";
				mes "ファイアーウォールを設置すると、";
				mes "火の柱が設置場所に現われます。";
				mes "ファイアーウォールにぶつかる";
				mes "モンスターにダメージを与えると同時に";
				mes "進行方向とは反対にはね返します。";
				next;
				mes "[マナ]";
				mes "しかし、アンデッド系モンスターは";
				mes "はね返らずに、ファイアーウォールを";
				mes "突き抜けてくるので、気をつけて";
				mes "ください。";
				set '@result,'@result|0x01;
				break;
			case 2:
				mes "[マナ]";
				mes "^5C4033地^000000属性のモンスターは";
				mes "高い命中率を持っています。";
				mes "素早さの高いマジシャンでも";
				mes "避けるのは非常に困難でしょう。";
				next;
				mes "[マナ]";
				mes "^5C4033地^000000属性のモンスターと戦う";
				mes "時は、火の魔法を使うのがよろしい";
				mes "でしょう。";
				next;
				mes "[マナ]";
				mes "^5C4033地^000000属性は^FF0000火^000000属性に";
				mes "弱いので、ファイアーウォーで";
				mes "モンスターの前進を阻みつつ、";
				mes "ダメージを与えると効果的です。";
				next;
				mes "[マナ]";
				mes "^FF0000火^000000属性魔法の";
				mes "ファイアーボールや、";
				mes "ファイアーボルトも、地属性の";
				mes "モンスターに大きなダメージを";
				mes "与えることができます。";
				next;
				mes "[マナ]";
				mes "^5C4033地^000000属性の魔法には";
				mes "ストーンカースがあります。";
				mes "^5C4033地^000000属性というには曖昧かも";
				mes "しれませんが、^5C4033地^000000の分類に";
				mes "属することになります。";
				next;
				mes "[マナ]";
				mes "そして、ストーンカースでモンスターを";
				mes "石化した場合、そのモンスターは";
				mes "^5C4033地^000000属性になります。";
				mes "この特徴を利用し、モンスターに";
				mes "大きなダメージを与えることも";
				mes "可能です。";
				set '@result,'@result|0x02;
				break;
			case 3:
				mes "[マナ]";
				mes "一般的に^93DB70風^000000属性の";
				mes "モンスターは高い回避力を";
				mes "持っています。";
				next;
				mes "[マナ]";
				mes "しかし、マジシャンの場合、打撃に";
				mes "よる直接的な攻撃をすることは";
				mes "ほとんどありませんので、あまり気に";
				mes "することはないでしょう。";
				next;
				mes "[マナ]";
				mes "しかし、^93DB70風^000000属性の";
				mes "モンスターは、移動速度も高いので";
				mes "こちらには気をつけなければ";
				mes "なりません。";
				next;
				mes "[マナ]";
				mes "^93DB70風^000000属性の魔法には";
				mes "ライトニングボルトと";
				mes "サンダーストームがあります。";
				next;
				mes "[マナ]";
				mes "^93DB70風^000000属性のモンスターと戦う";
				mes "時は、^5C4033地^000000属性の魔法を使うと";
				mes "効果的なのですが、マジシャンは";
				mes "敵にダメージを与えることのできる";
				mes "^5C4033地^000000属性魔法を習得できません。";
				next;
				mes "[マナ]";
				mes "^93DB70風^000000属性や^0000FF水^000000属性の魔法では";
				mes "^93DB70風^000000属性のモンスターにほとんど";
				mes "ダメージを与えることが出来ないので";
				mes "^FF0000火^000000属性の魔法を使うと良いでしょう。";
				set '@result,'@result|0x04;
				break;
			case 4:
				mes "[マナ]";
				mes "^0000FF水^000000属性のモンスターは";
				mes "高い体力を持っています。";
				mes "ですので、水属性のモンスターは他の";
				mes "属性のモンスターに比べて、倒す時間が";
				mes "長くかかってしまいます。";
				next;
				mes "[マナ]";
				mes "しかし、^0000FF水^000000属性のモンスターは";
				mes "他の属性のモンスターに比べ、属性";
				mes "レベルの影響をたくさん受けます。";
				next;
				mes "[マナ]";
				mes "^93DB70風^000000属性Lv1のモンスターを";
				mes "^5C4033地^000000属性魔法で攻撃し、";
				mes "150のダメージが出たとしましょう。";
				mes "^0000FF水^000000属性Lv1のモンスターを";
				mes "^93DB70風^000000属性魔法で攻撃した";
				mes "場合、175のダメージが出ます。";
				next;
				mes "[マナ]";
				mes "この特徴を上手く利用すれば、";
				mes "^0000FF水^000000属性モンスターも素早く";
				mes "倒すことが可能です。";
				next;
				mes "[マナ]";
				mes "^0000FF水^000000属性の魔法には、";
				mes "コールドボルトとフロストダイバーが";
				mes "あります。^FF0000火^000000属性の";
				mes "モンスターに大きなダメージを与える";
				mes "ことが可能です。";
				next;
				mes "[マナ]";
				mes "特に、フロストダイバーはモンスターを";
				mes "ある確率で凍らせることができます。";
				mes "凍ったモンスターは、凍っている間";
				mes "^0000FF水^000000属性となります。";
				next;
				mes "[マナ]";
				mes "この特徴を利用し、倒し辛い";
				mes "モンスターでも簡単に倒すことが";
				mes "できるんですよ。";
				set '@result,'@result|0x08;
				break;
			case 5:
				mes "[マナ]";
				mes "少し珍しい^CFB53B念^000000属性について";
				mes "説明しましょう。";
				mes "^CFB53B念^000000属性のモンスターはあまり";
				mes "多く存在しませんが、倒すのは少々";
				mes "難しいです。";
				next;
				mes "[マナ]";
				mes "^CFB53B念^000000属性の魔法には";
				mes "ナパームビート、ソウルストライク、";
				mes "そしてセイフティウォールが";
				mes "あります。";
				next;
				mes "[マナ]";
				mes "ナパームビートとソウルストライクは";
				mes "^CFB53B念^000000属性モンスターを倒す時に";
				mes "とても有効ですが、無属性モンスターに";
				mes "ほとんどダメージを与えることが";
				mes "できません。なので、使う時は";
				mes "気をつけましょう。";
				next;
				mes "[マナ]";
				mes "そして、セイフティウォールですが";
				mes "これは少々珍しい魔法で、1人用の";
				mes "近接物理攻撃を完全に防いでくれる";
				mes "魔法の壁を設置できる魔法なんです。";
				next;
				mes "[マナ]";
				mes "しかし、矢のように遠くからの攻撃や";
				mes "魔法などは防ぐことができません。";
				set '@result,'@result|0x10;
				break;
			case 6:
				mes "[マナ]";
				mes "本当に良いのですか？";
				mes "私も忙しい身なので、そう何回も";
				mes "説明する時間はありません。";
				mes "説明を聞くなら、今しかありませんよ。";
				next;
				if(select("それでは説明を……","大丈夫です")==1)
					break;
				mes "[マナ]";
				mes "そうですか。";
				mes "わかりました。";
				set QUE_MAGICIAN,2;
				for(set '@i,1; '@i <= 16; set '@i,'@i<<1) {
					if('@result&'@i) {
						if(checkre())
							getexp 15,7;
						else
							getexp 150,70;
					}
				}
				misceffect 4,"";
				close;
			}
		}
	case 2:
		mes "[マナ]";
		mes "属性については、わかりましたか？";
		mes "説明だけではわからないところも、";
		mes "実践を重ねるうちに理解度が深まるので";
		mes "あまり深刻にならないでくださいね。";
		mes "それでは、次は魔法について";
		mes "説明しましょう。";
		next;
		misceffect 22;
		next;
		mes "[マナ]";
		mes "まず最初は、基本的な魔法について";
		mes "説明します。";
		mes "ファイアーボルト、コールドボルト、";
		mes "ライトニングボルト、ナパームビートの";
		mes "4つです。";
		next;
		misceffect 29;
		next;
		mes "[マナ]";
		mes "ファイアーボルトは^FF0000火^000000属性、";
		mes "コールドボルトは^0000FF水^000000属性、";
		mes "ライトニングボルトは^93DB70風^000000属性、";
		mes "そしてナパームビートは^CFB53B念^000000属性です。";
		next;
		misceffect 23;
		next;
		mes "[マナ]";
		mes "これらは修練を重ねると威力が";
		mes "向上します。";
		mes "他にも基本魔法として、サイト、";
		mes "ストーンカース、SP回復力向上という";
		mes "魔法があります。";
		next;
		mes "[マナ]";
		mes "サイトは、隠れている敵を探し出す";
		mes "ことができます。";
		mes "しかし、効果範囲はあまり広くないので";
		mes "気をつけてください。";
		next;
		mes "[マナ]";
		mes "ストーンカースは、前にも説明した";
		mes "ように、敵1体を一定の確率で";
		mes "石化させることが出来ます。";
		mes "ここで一つ注意。この魔法を";
		mes "使うにはレッドジェムストーンが";
		mes "触媒として必要です。";
		next;
		mes "[マナ]";
		mes "ストーンカースで石化した敵は";
		mes "^5C4033地^000000属性になります。";
		mes "そして、石化した敵は動くことが";
		mes "出来ません。";
		next;
		mes "[マナ]";
		mes "SP回復力向上は、厳密には";
		mes "魔法とは言えないかもしれません。";
		mes "このスキルは、座ったり";
		mes "休憩している時の、SP回復量を";
		mes "増やしてくれる効果があります。";
		next;
		mes "[マナ]";
		mes "休憩時間を減らしてくれるだけで";
		mes "直接戦闘に役立つわけではありません。";
		mes "それでも、SPを多く消費する";
		mes "マジシャンにとっては大切なスキルと";
		mes "言えるでしょう。";
		next;
		mes "[マナ]";
		mes "うーん……";
		mes "基本魔法については、これくらいに";
		mes "しましょうか。";
		mes "次は上位の魔法についてですが、";
		mes "その前に課題を出しましょう。";
		next;
		mes "[マナ]";
		mes "ここゲフェンの北に、大きな橋が";
		mes "あります。その近辺に、プパという";
		mes "モンスターがいます。プパは動かない";
		mes "ので、反撃をしてきません。";
		next;
		mes "[マナ]";
		mes "プパを倒して、さなぎの皮を10個";
		mes "集めてきなさい。";
		mes "プパは、たまにクリーミーという";
		mes "蝶に羽化しますから、";
		mes "気をつけてください。";
		set QUE_MAGICIAN,3;
		if(checkre())
			getexp 40,20;
		else
			getexp 400,200;
		misceffect 4,"";
		close;
	case 3:
	case 4:
		mes "[マナ]";
		mes "課題の進み具合はどうですか。";
		next;
		if(countitem(915) < 10) {
			if(QUE_MAGICIAN == 3) {
				mes "[マナ]";
				mes "まだ数が足りませんね。";
				mes "これで頑張ってください。";
				set QUE_MAGICIAN,4;
				percentheal 100,100;
				close;
			}
			mes "[マナ]";
			mes "まだ数が足りませんね。";
			mes "いいですか、";
			mes "^FF0000さなぎの皮^00000010個ですよ。";
			close;
		}
		mes "[マナ]";
		mes "集め終わったようですね。";
		mes "魔法の使い方には慣れましたか？";
		mes "もう少し修練すれば、魔法を組み合わせ";
		mes "効果的にダメージを与える方法が";
		mes "分かるようになるでしょう。";
		next;
		mes "[マナ]";
		mes "さてと、少し休憩しましょうか。";
		mes "そうしたら、また魔法について";
		mes "説明するとします。";
		set QUE_MAGICIAN,5;
		if(checkre())
			getexp 40,20;
		else
			getexp 400,200;
		misceffect 4,"";
		close;
	case 5:
		mes "[マナ]";
		mes "それでは、少し上位の魔法について";
		mes "説明しましょう。";
		while(1) {
			next;
			switch(select("ソウルストライク","セイフティウォール","ファイアーボール","フロストダイバー","サンダーストーム","ファイアーウォール","エナジーコート","やめる")) {
			case 1:
				mes "[マナ]";
				mes "ソウルストライクは^CFB53B念^000000属性の";
				mes "魔法です。";
				mes "ナパームビートをある程度修練すれば";
				mes "習得できるようになります。";
				next;
				misceffect 15,"";
				next;
				mes "[マナ]";
				mes "修練を重ねると、";
				mes "ソウルストライクの威力が";
				mes "強まるのを実感できるでしょう。";
				set '@result,'@result|0x01;
				break;
			case 2:
				mes "[マナ]";
				mes "セイフティウォールは、";
				mes "ナパームビートとソウルストライクを";
				mes "ある程度修練すれば習得できるように";
				mes "なります。前にも説明したとおり、";
				mes "近接攻撃を防いでくれる魔法です。";
				next;
				misceffect 13,"";
				next;
				mes "[マナ]";
				mes "ただし、無制限に攻撃を防いでくれる";
				mes "訳ではありません。攻撃を防いでくれる";
				mes "回数は決まっています。もちろん、";
				mes "修練を重ねれば、より多くの攻撃を";
				mes "防げるようになります。";
				set '@result,'@result|0x02;
				break;
			case 3:
				mes "[マナ]";
				mes "ファイアーボールは、^FF0000火^000000属性の";
				mes "魔法で、ファイアーボルトをある程度";
				mes "修練すれば習得することができるように";
				mes "なります。";
				next;
				misceffect 24,"";
				next;
				mes "[マナ]";
				mes "ファイアーボルトは敵単体へ攻撃する";
				mes "魔法ですが、ファイアーボールは";
				mes "決まった範囲内にいる複数の敵を";
				mes "同時に攻撃できる魔法です。";
				set '@result,'@result|0x04;
				break;
			case 4:
				mes "[マナ]";
				mes "フロストダイバーは^0000FF水^000000属性の";
				mes "魔法で、コールドボルトをある程度";
				mes "修練すれば習得できるように";
				mes "なります。";
				mes "敵にダメージも与えますが、";
				mes "主には敵を凍らせるために使われます。";
				next;
				misceffect 27,"";
				misceffect 28,"";
				next;
				mes "[マナ]";
				mes "フロストダイバーは、ダメージを";
				mes "与えると同時に、ある一定の確率で";
				mes "敵を凍らせます。";
				next;
				mes "[マナ]";
				mes "凍った敵は、どのような敵でも";
				mes "^0000FF水^000000属性になります。";
				mes "凍る確率は、修練を重ねることにより";
				mes "上がります。";
				set '@result,'@result|0x08;
				break;
			case 5:
				mes "[マナ]";
				mes "サンダーストームは、^93DB70風^000000属性の";
				mes "魔法で、ライトニングボルトをある程度";
				mes "修練すれば習得できるようになります。";
				next;
				misceffect 30,"";
				next;
				mes "[マナ]";
				mes "ライトニングボルトが敵単体に";
				mes "攻撃する魔法ですが、";
				mes "サンダーストームは";
				mes "一定の範囲内にいる敵に同時に";
				mes "攻撃できる魔法です。";
				mes "ファイアーボールと少し似ていますね。";
				set '@result,'@result|0x10;
				break;
			case 6:
				mes "[マナ]";
				mes "ファイアーウォールは、^FF0000火^000000属性の";
				mes "魔法で、ファイアーボールをある程度";
				mes "修練し、サイトを習得していれば";
				mes "習得することができます。";
				next;
				misceffect 25,"";
				next;
				mes "[マナ]";
				mes "ファイアーウォールは、他の魔法とは";
				mes "少し違う方法で発動します。";
				mes "他の魔法は、攻撃したい敵に向けて";
				mes "発動しますが、ファイアーウォールは";
				mes "地面を指定して発動させます。";
				next;
				mes "[マナ]";
				mes "そうですね……";
				mes "　　　　敵";
				mes "　　　＊＊＊";
				mes "　　　　私";
				mes "こんな感じでしょうか。";
				next;
				mes "[マナ]";
				mes "敵と自分の中間に発動させるのが";
				mes "一般的です。";
				mes "このように設置すると、";
				mes "敵が自分に向かってくる進路を";
				mes "ファイアーウォールで邪魔する";
				mes "ことができます。";
				next;
				mes "[マナ]";
				mes "その間、自分は安全な位置から";
				mes "相手に別の魔法を使うこともできます。";
				mes "ファイアーウォールをどう使うかで";
				mes "自分の力をどう活かせるかに";
				mes "つながりますよ。";
				set '@result,'@result|0x20;
				break;
			case 7:
				mes "[マナ]";
				mes "エナジーコートは……";
				mes "ちょっと珍しい魔法で、一般的な";
				mes "方法では習得することができません。";
				mes "この魔法学校にいらっしゃる";
				mes "大魔導師ブリザードリス様だけが";
				mes "伝授する方法を知っています。";
				next;
				misceffect 169,"";
				next;
				mes "[マナ]";
				mes "詳しい説明はブリザードリス様に";
				mes "聞いてください。";
				set '@result,'@result|0x40;
				break;
			case 8:
				mes "[マナ]";
				mes "説明は、これでいいかしら。";
				mes "うーん……あとは実技でしょうか。";
				mes "そうですね、ちょっと任せられそうな";
				mes "ものを探してみましょう。";
				next;
				mes "[マナ]";
				mes "まず、これは私からの";
				mes "プレゼントです。";
				mes "これからもマジシャンとして";
				mes "頑張ってくださいね。";
				set QUE_MAGICIAN,6;
				getitem 1604,1;
				for(set '@i,1; '@i <= 64; set '@i,'@i<<1) {
					if('@result&'@i) {
						if(checkre())
							getexp 30,10;
						else
							getexp 300,100;
					}
				}
				misceffect 4,"";
				close;
			}
		}
	case 6:
		mes "[マナ]";
		mes "いいところへ！";
		next;
		mes "[マナ]";
		mes "モロクで、ある問題が発生しました。";
		mes "シーフギルドから要請があったのですが";
		mes "ちょうど外部支援で人が出払っていて";
		mes "人手が足りないところだったのです。";
		next;
		mes "[マナ]";
		mes "よろしければ、モロクへ行って";
		mes "もらえませんか？";
		mes "任務を果たしていただければ、";
		mes "それ相応のお礼を差し上げます。";
		mes "お願いできませんでしょうか？";
		next;
		if(select("了解です","面倒です")==2) {
			mes "[マナ]";
			mes "うーん、仕方がないですね。";
			mes "後で、もし気が変わったら";
			mes "お願いできませんか？";
			close;
		}
		mes "[マナ]";
		mes "ありがとうございます。";
		mes "それでは、すぐにモロクへ";
		mes "送ってさしあげますので";
		mes "ピラミッド前にいるイルヒさんに";
		mes "会ってください。";
		mes "それではお願いします。";
		next;
		emotion 18;
		mes "[マナ]";
		mes "任務が終わったら、";
		mes "またこちらに戻ってきてください。";
		mes "では。";
		set QUE_MAGICIAN,7;
		close2;
		warp "morocc.gat",182,286;
		end;
	case 7:
		mes "[マナ]";
		mes "任務の内容については";
		mes "知りませんけど、";
		mes "頑張ってきてください。";
		close;
	default:
		mes "[マナ]";
		mes "今、ルーンミッドガッツ王国でも";
		mes "変な事件が色々起こっています。";
		mes "その影響は、ここにも及んでいます。";
		next;
		mes "[マナ]";
		mes "引き続き、任務の方、";
		mes "頑張ってください。";
		mes "あ、えっとそれから……";
		mes "イルヒさんにヨロシク……";
		close;
	case 27:
		mes "[マナ]";
		mes "任務の方、無事に遂行できたと";
		mes "イルヒさんから連絡をいただきました。";
		next;
		mes "[マナ]";
		mes "最近、秘密裏に暗躍している、";
		mes "2つの集団が関わっているらしいとの";
		mes "ことです。";
		next;
		mes "[マナ]";
		mes "最初、この2つの集団はまったく";
		mes "関係ないと思われていたのですが、";
		mes "どうやら、どこかで繋がっているかも";
		mes "しれないと……これ以上は上の方で";
		mes "引き受けるそうです。";
		next;
		mes "[マナ]";
		mes "お疲れさまでした。";
		mes "これは任務の報酬です。";
		set QUE_MAGICIAN,28;
		getitem 2321,1;
		set Zeny,Zeny+3000;
		if(checkre())
			getexp 300,100;
		else
			getexp 3000,1000;
		close;
	case 28:
		mes "[マナ]";
		mes "もうこれ以上私から説明できる";
		mes "ことはありません。これからは";
		mes "自分なりの修練を積んでください。";
		close;
	}
}

//============================================================
// シーフクエストNPC
//- Registry -------------------------------------------------
// QUE_THIEF -> 0～27
//------------------------------------------------------------
moc_ruins.gat,66,164,4	script	新米シーフ担当官	84,{
	if(Job == Job_Novice) {
		mes "[イルヒ]";
		mes "おう、なんだ。";
		mes "ノービスじゃねぇか。";
		mes "せいぜい頑張りな。";
		close;
	}
	if((Job == Job_Thief && Upper == UPPER_HIGH) || getbaseclass(Class,2) == CLASS_AS || getbaseclass(Class,2) == CLASS_RG) {
		if(QUE_THIEF < 8) {
			mes "[イルヒ]";
			mes "おまえは、もうシーフを";
			mes "極めちまってるじゃねぇか。";
			mes "これ以上、俺が教えることはないね。";
			mes "とっととデッカイ世の中を自力で";
			mes "渡ってきやがれってんだ！";
			mes "がーはっは！";
			close;
		}
	}
	else if(getbaseclass(Class) == CLASS_MG) {
		switch(QUE_MAGICIAN) {
		case 0:
		case 1:
		case 2:
		case 3:
		case 4:
		case 5:
		case 6:
			mes "[イルヒ]";
			mes "俺はシーフの担当だ。";
			mes "お前、シーフじゃないだろ。";
			mes "俺の話を聞きたいなら、";
			mes "シーフになってきやがれってんだ。";
			close;
		case 7:
			mes "[イルヒ]";
			mes "あーん、なんか用か？";
			next;
			menu "マナさんの依頼で来ました",-;
			mes "[イルヒ]";
			mes "ああ、そうか。";
			mes "頼んでたのがやっと来たか。";
			next;
			mes "[イルヒ]";
			mes "よく来てくれたな！";
			mes "実はな、この間モロクの南で、";
			mes "ちょっと困ったもんが見つかってな……";
			next;
			mes "[イルヒ]";
			mes "困ったもんってのはな、";
			mes "どうも、争いの跡らしいんだ。";
			mes "ちょっと気になるんで調査したいんだが";
			mes "ギルドの連中があらかた出払っててよ。";
			next;
			mes "[イルヒ]";
			mes "まーそれで、マナと親しいってのも";
			mes "あって、魔法学校に協力を";
			mes "頼んでみたってわけだ。";
			next;
			mes "[イルヒ]";
			mes "すぐに、モロクの南を調査してくれ。";
			mes "南門を出たら、けっこう簡単に";
			mes "その跡が見つかると思うぜ。";
			set QUE_MAGICIAN,8;
			close;
		default:
			mes "[イルヒ]";
			mes "俺の友達が、行方不明なんだ。";
			mes "任務完了の連絡はあったが、その後の";
			mes "消息が知れねぇ……";
			next;
			mes "[イルヒ]";
			mes "お前も気ぃ付けろよ。";
			close;
		case 26:
			mes "[イルヒ]";
			mes "よお、調査の方は進んでるか？";
			next;
			switch(select("まだ調査中です","まだ確かじゃなくて……","調査終了しました")) {
			case 1:
				mes "[イルヒ]";
				mes "そっか……";
				mes "まー諦めずに頑張れや。";
				close;
			case 2:
				mes "[イルヒ]";
				mes "そっか……";
				mes "まー諦めずに頑張れや……";
				close;
			}
			mes "[イルヒ]";
			mes "お、そうか？";
			mes "どれ、話してみろ。";
			next;
			mes "-あなたは追跡の結果と、";
			mes "追跡中に手に入れた布切れについて";
			mes "話した-";
			next;
			mes "[イルヒ]";
			mes "……そうか。";
			mes "その布切れ、ちょっと貸しな。";
			next;
			mes "-あなたは布切れをイルヒに渡した-";
			next;
			mes "[イルヒ]";
			mes "……これは……";
			mes "うん、頑張ったな。";
			mes "これは貴重なモンだ。";
			next;
			mes "[イルヒ]";
			mes "この布に書かれている文字は";
			mes "アサシンギルド特有の暗号だ。";
			mes "それも、上級幹部だけが使う……";
			next;
			mes "[イルヒ]";
			mes "これだけで、お前がどれだけ";
			mes "苦労してきたかわかるよ。";
			mes "……お疲れ。";
			next;
			mes "[イルヒ]";
			mes "これは、感謝の証だ。";
			mes "マナには、こっちから連絡しておく。";
			mes "それじゃあな、元気でな。";
			set QUE_MAGICIAN,27;
			set Zeny,Zeny+5000;
			if(checkre())
				getexp 500,200;
			else
				getexp 5000,2000;
			close;
		case 27:
		case 28:
			mes "[イルヒ]";
			mes "やはり、これは一つだけじゃねぇ……";
			mes "少なくとも、二つの陰謀が関わって";
			mes "やがる……";
			mes "チッ、これから面倒が増えそうだぜ……";
			close;
		}
	}
	else if(Job != Job_Thief) {
		mes "[イルヒ]";
		mes "砂嵐は砂漠の浪漫だ！";
		mes "がーっはっはっは！";
		close;
	}
	switch(QUE_THIEF) {
	case 0:
		mes "[イルヒ]";
		mes "おう！";
		mes "俺が新米担当のイルヒだ！";
		mes "シーフに転職したはいいが、";
		mes "シーフって何すればいいの？って奴の";
		mes "教育を任されてる。";
		next;
		if(select("よろしくお願いします","えっと、さようなら")==2) {
			mes "[イルヒ]";
			mes "なんか準備でもあるのか？";
			mes "準備できたら、また来いよ。";
			close;
		}
		mes "[イルヒ]";
		mes "そう緊張するな！";
		mes "立派なシーフになる秘訣を";
		mes "教えてやっからよ。";
		next;
		mes "[イルヒ]";
		mes "シーフに転職しちまったら、";
		mes "その後の道は決まってらぁな。";
		mes "アサシンになるか、ローグになるかだ。";
		next;
		mes "[イルヒ]";
		mes "まーそれは置いておいて……";
		mes "シーフってのは、敵とガチンコする";
		mes "ことが多いな。";
		mes "たまに弓を使うやつらもいるが、";
		mes "普通は接近戦だな。";
		next;
		mes "[イルヒ]";
		mes "こういう時に必要な能力はなんだ？";
		mes "初心者修練場は通ってきたよな？";
		next;
		mes "[イルヒ]";
		mes "短剣で戦う場合、敵により多くの";
		mes "ダメージを与えられるようになる";
		mes "能力はなんだ？";
		mes "ほれほれ、さっさと答えな。";
		next;
		switch(select("^6B8E23INT^000000","^2F4F2FSTR^000000","^23238EDEX^000000")) {
		case 1:
			mes "[イルヒ]";
			mes "初心者修練場で何学んできたんだ？";
			mes "^6B8E23INT^000000は基本的に魔法";
			mes "ダメージと特定のスキルに必要な";
			mes "能力だろ。短剣のダメージを上げるには";
			mes "^2F4F2FSTR^000000だろうが、^2F4F2FSTR^000000！";
			break;
		case 2:
			mes "[イルヒ]";
			mes "おおお、けっこう早く答えたな。";
			mes "敵へのダメージを増やすには";
			mes "^2F4F2FSTR^000000が必要だ。^2F4F2FSTR^000000は";
			mes "攻撃力を上げるだけじゃなく、自分の";
			mes "所持重量も上げてくれる。";
			next;
			mes "[イルヒ]";
			mes "もちろん、^2F4F2FSTR^000000だけが攻撃力に";
			mes "影響するわけじゃない。^23238EDEXやLUK^000000も";
			mes "攻撃力に影響するが、それはSTRに";
			mes "比べたら微々たるもんだ。";
			set QUE_THIEF,1;
			if(checkre())
				getexp 40,20;
			else
				getexp 400,200;
			misceffect 4,"";
			close;
		case 3:
			mes "[イルヒ]";
			mes "初心者修練場で何学んできたんだ？";
			mes "^23238EDEX^000000は基本的に命中率を";
			mes "あげるもんだろうが。";
			mes "弓の場合、DEXで攻撃力が上がるが、";
			mes "それ以外は命中率と最小ダメージの";
			mes "アップだ。";
			next;
			mes "[イルヒ]";
			mes "命中率が上がれば、その分、";
			mes "攻撃が当たる。";
			mes "結果、総合的なダメージは";
			mes "増えるかもしれねぇ。";
			next;
			mes "[イルヒ]";
			mes "だがな、俺の質問は、";
			mes "短剣でダメージを増やすために";
			mes "必要な能力だ。";
			mes "DEXそのものは、短剣の攻撃力に";
			mes "大して影響しねぇ。";
			next;
			mes "[イルヒ]";
			mes "短剣の攻撃力を上げるには";
			mes "^2F4F2FSTR^000000を上げないとダメだ。";
			mes "いいか、^2F4F2FSTR^000000だ。";
			break;
		}
		next;
		mes "[イルヒ]";
		mes "いいか。敵に攻撃したのに、ダメージが";
		mes "低いなら、^2F4F2FSTR^000000を上げれば";
		mes "ダメージも上がる。";
		mes "自分の強さくらい、";
		mes "自分で決めなくて、どうする？";
		set QUE_THIEF,1;
		if(checkre())
			getexp 20,10;
		else
			getexp 200,100;
		misceffect 4,"";
		close;
	case 1:
		mes "[イルヒ]";
		mes "能力についてはこれくらいにするか。";
		mes "それじゃあ、スキルについて説明";
		mes "するとするかな……";
		mes "あ～、熱心に説明したら、";
		mes "喉が渇いちまった。";
		mes "ちょっと水でも飲むか。";
		next;
		mes "[イルヒ]";
		mes "ゴクゴク、ゴクゴクゴク";
		next;
		mes "[イルヒ]";
		mes "ゴクゴク、ゴクゴクゴク";
		mes "ゴクゴク、ゴクゴクゴク";
		next;
		mes "[イルヒ]";
		mes "ゴクゴク、ゴクゴクゴク";
		mes "ゴクゴク、ゴクゴクゴク";
		mes "ゴクゴク、ゴクゴクゴク";
		next;
		mes "[イルヒ]";
		mes "ぷふ～";
		mes "あ、そうだ。";
		mes "説明する前に、スキルの腕でも";
		mes "上げてこいや。";
		mes "ちったぁ得意になったスキルから";
		mes "重点的に説明してやる。";
		set QUE_THIEF,2;
		close;
	case 2:
		mes "[イルヒ]";
		mes "おーし、何を覚えてきた？";
		mes "どんなスキルを習練するかで";
		mes "自分の方向性が決まる。";
		mes "スキルってのは、能力値に負けず劣らず";
		mes "重要なんだぜ。";
		next;
		if(getskilllv(48) == 0 && getskilllv(49) == 0 && getskilllv(50) == 0 && getskilllv(51) == 0 && getskilllv(52) == 0 && getskilllv(53) == 0) {
			mes "[イルヒ]";
			mes "おいおいおいおいおい、";
			mes "スキルをなんも覚えて";
			mes "ねぇじゃねぇか。";
			close;
		}
		if(getskilllv(48)) {
			mes "[イルヒ]";
			mes "ダブルアタックを" +getskilllv(48)+ "レベル上げたのか。";
			mes "んじゃ、ダブルアタックについて";
			mes "説明しよう！　ダブルアタックは、";
			mes "攻撃に影響するスキルで、敵に";
			mes "よりたくさんのダメージを与える";
			mes "スキルだ。";
			next;
			mes "[イルヒ]";
			mes "つまり……";
			mes "名前の通り、2回連続で攻撃できる";
			mes "スキルだ。短い時間で、より多くの";
			mes "ダメージを敵に与えられるって";
			mes "ことだな！";
			next;
		}
		if(getskilllv(49)) {
			mes "[イルヒ]";
			mes "回避率増加を" +getskilllv(49)+ "レベル上げたのか。";
			mes "んじゃ、回避率増加について";
			mes "説明しよう！";
			mes "このスキルは敵の攻撃を";
			mes "避ける能力をアップしてくれるんだ！";
			next;
			mes "[イルヒ]";
			mes "ダブルアタックと同じで、";
			mes "覚えただけで自動的に効果を発揮する";
			mes "パッシブスキルだ。";
			next;
		}
		if(getskilllv(50)) {
			mes "[イルヒ]";
			mes "スティールを" +getskilllv(50)+ "レベル上げたのか。";
			mes "スティールは敵の持ち物を盗む……";
			mes "いや、借りるスキルだ。";
			mes "もちろん、借りるのに許可をもらうとか";
			mes "返済期間があるわけじゃねぇが……";
			mes "ごほん、ごほん。";
			next;
		}
		if(getskilllv(51)) {
			mes "[イルヒ]";
			mes "ハイディングを" +getskilllv(51)+ "レベル上げたのか。";
			mes "ハイディングはスティールをある程度";
			mes "修練すると覚えられるようになる。";
			mes "地中に身を隠して敵をやり過ごす";
			mes "スキルだ。";
			next;
			mes "[イルヒ]";
			mes "一つ気を付けなきゃいけないのは、";
			mes "いくつかのモンスターは、";
			mes "ハイディング状態を見破れるって";
			mes "ことだ。";
			mes "そういうモンスターに遭ったら";
			mes "気を付けろよ。";
			next;
		}
		if(getskilllv(52)) {
			mes "[イルヒ]";
			mes "インベナムを" +getskilllv(52)+ "レベル上げたのか。";
			mes "インベナムは敵に毒をかけるスキルだ。";
			mes "もちろん、100%決まるわけじゃねぇが";
			mes "もし決まれば、相手は徐々に";
			mes "弱ってくってわけだ。";
			next;
			mes "[イルヒ]";
			mes "毒にかかると、まず防御力が落ちる。";
			mes "結果的に、与えるダメージが増える。";
			mes "だがな、強い敵には毒をかけ辛い。";
			mes "気を付けるんだな。";
			next;
		}
		if(getskilllv(53)) {
			mes "[イルヒ]";
			mes "解毒を" +getskilllv(53)+ "レベル上げたのか。";
			mes "解毒はインベナムをある程度取ると";
			mes "覚えられるようになる。";
			mes "まー、効果は簡単さ。毒にかかっている";
			mes "状態を解く。自分だけじゃなくて、";
			mes "他人にも使うことができるぜ。";
			next;
		}
		mes "[イルヒ]";
		mes "他のスキルも説明してやろう。";
		set QUE_THIEF,3;
		if(checkre())
			getexp BaseLevel*30/10,BaseLevel*15/10;
		else
			getexp BaseLevel*30,BaseLevel*15;
		misceffect 4,"";
		close;
	case 3:
		mes "[イルヒ]";
		mes "どのスキルについて知りたい？";
		mes "簡単に説明してやっからよ。";
		while(1) {
			next;
			switch(select("ダブルアタック","回避率増加","スティール","インベナム","ハイディング","解毒","やめる")) {
			case 1:
				mes "[イルヒ]";
				mes "ダブルアタックは、";
				mes "攻撃に影響するスキルで、敵に";
				mes "よりたくさんのダメージを与える";
				mes "スキルだ。";
				next;
				mes "[イルヒ]";
				mes "つまり……";
				mes "名前の通り、2回連続で攻撃できる";
				mes "スキルだ。短い時間で、より多くの";
				mes "ダメージを敵に与えられるって";
				mes "ことだな！";
				set '@result,'@result|0x01;
				break;
			case 2:
				mes "[イルヒ]";
				mes "回避率増加は敵の攻撃を避ける";
				mes "能力をアップしてくれるんだ！";
				mes "ダブルアタックと同じで、";
				mes "覚えただけで自動的に効果を発揮する";
				mes "パッシブスキルだ。";
				set '@result,'@result|0x02;
				break;
			case 3:
				mes "[イルヒ]";
				mes "スティールは敵の持ち物を盗む……";
				mes "いや、借りるスキルだ。";
				mes "もちろん、借りるのに許可をもらうとか";
				mes "返済期間があるわけじゃねぇが……";
				mes "ごほん、ごほん。";
				set '@result,'@result|0x04;
				break;
			case 4:
				mes "[イルヒ]";
				mes "インベナムは敵に毒をかけるスキルだ。";
				mes "もちろん、100%決まるわけじゃねぇが";
				mes "もし決まれば、相手は徐々に";
				mes "弱ってくってわけだ。";
				next;
				mes "[イルヒ]";
				mes "毒にかかると、まず防御力が落ちる。";
				mes "結果的に、与えるダメージが増える。";
				mes "だがな、強い敵には毒をかけ辛い。";
				mes "気を付けるんだな。";
				set '@result,'@result|0x08;
				break;
			case 5:
				mes "[イルヒ]";
				mes "ハイディングはスティールをある程度";
				mes "修練すると覚えられるようになる。";
				mes "地中に身を隠して敵をやり過ごす";
				mes "スキルだ。";
				next;
				mes "[イルヒ]";
				mes "一つ気を付けなきゃいけないのは、";
				mes "いくつかのモンスターは、";
				mes "ハイディング状態を見破れるって";
				mes "ことだ。";
				mes "そういうモンスターに遭ったら";
				mes "気を付けろよ。";
				set '@result,'@result|0x10;
				break;
			case 6:
				mes "[イルヒ]";
				mes "解毒はインベナムをある程度取ると";
				mes "覚えられるようになる。";
				mes "まー、効果は簡単さ。毒にかかっている";
				mes "状態を解く。自分だけじゃなくて、";
				mes "他人にも使うことができるぜ。";
				set '@result,'@result|0x20;
				next;
				misceffect 21,"";
				break;
			case 7:
				mes "[イルヒ]";
				mes "説明はいらねぇか。";
				mes "じゃ、次に進むとすっか。";
				mes "その前に、少し今のを参考に";
				mes "スキルの腕でも上げてこいや。";
				next;
				mes "[イルヒ]";
				mes "いいか、どのスキルを覚えるか";
				mes "ちゃんと悩めよ。いいな。";
				set QUE_THIEF,4;
				misceffect 4,"";
				for(set '@i,1; '@i <= 32; set '@i,'@i<<1) {
					if('@result&'@i) {
						if(checkre())
							getexp 30,10;
						else
							getexp 300,100;
					}
				}
				close;
			}
		}
	case 4:
		mes "[イルヒ]";
		mes "覚えたスキルは使いこなせてっか？";
		mes "俺の説明を無駄にするんじゃないぜ。";
		next;
		mes "[イルヒ]";
		mes "だがな、もっと重要なのは経験だ。";
		mes "いくらスキルの性能が良くたって、";
		mes "無茶な場所で使ったりしちまったら";
		mes "そのスキルは活かしきれねぇ。";
		next;
		mes "[イルヒ]";
		mes "ってなわけで、これから実戦を";
		mes "やってもらう。これからモロクの南に";
		mes "行って、ピッキから^FF0000鳥の羽毛^00000010個";
		mes "集めて来い。どうだ、簡単だろ。";
		next;
		mes "[イルヒ]";
		mes "集め終わったら、これで帰ってこい。";
		mes "んで、まーなんだ。あの場所も最近";
		mes "物騒だからな……まー気をつけろや。";
		mes "じゃ、がんばれよー。";
		set QUE_THIEF,5;
		savepoint "moc_ruins.gat",80,164;
		getitem 602,1;
		if(checkre())
			getexp 10,5;
		else
			getexp 100,50;
		misceffect 4,"";
		close2;
		warp "moc_fild12.gat",158,373;
		end;
	case 5:
	case 6:
		if(countitem(916) < 10) {
			mes "[イルヒ]";
			mes "^FF0000鳥の羽毛^00000010個だ。";
			mes "ちゃんと集めてこいよ。";
			close2;
			warp "moc_fild07.gat",203,38;
			end;
		}
		mes "[イルヒ]";
		mes "おしおし、ちゃんと集めてきたな。";
		mes "エライ！";
		mes "この羽毛が、お前の成長の証だと";
		mes "思えよ。";
		next;
		mes "[イルヒ]";
		mes "これからも頑張れ！";
		mes "んで、何か質問とかあるか？";
		next;
		if(QUE_THIEF == 6) set '@str1$,"モロク南で争いの跡を見ました……";
		else set '@str2$,"これからもよろしくお願いします";
		switch(select('@str1$,'@str2$,"ありません")) {
		case 1:
			mes "[イルヒ]";
			mes "…………";
			mes "お前もあれを見たのか……";
			mes "…………";
			mes "転職したてのお前には、まだ難しいかも";
			mes "しれないが……";
			next;
			mes "[イルヒ]";
			mes "この間、街の南でけっこう大きな";
			mes "争いがあったらしくてな。";
			mes "真夜中だったんだが、ちょうどその時";
			mes "集会があって、早めに発覚した。";
			next;
			mes "[イルヒ]";
			mes "その場所を調査したが、";
			mes "どうやら点々と場所を移動している";
			mes "らしく、まだ調査が終わってねぇ。";
			next;
			mes "[イルヒ]";
			mes "あちこちに";
			mes "毒を使った形跡がある所から見て、";
			mes "アサシンが関係していることだけは";
			mes "確かだ。";
			next;
			mes "[イルヒ]";
			mes "まー興味があるんなら、独自に調べて";
			mes "みてもいいだろう。";
			mes "だが、毒には近付き過ぎるなよ。";
			set QUE_THIEF,8;
			getitem 1207,1;
			if(checkre())
				getexp 100,50;
			else
				getexp 1000,500;
			misceffect 4,"";
			close;
		case 2:
			mes "[イルヒ]";
			mes "がーはっは！";
			mes "せいぜい頑張れ！";
			mes "あんまり頑張りすぎて、";
			mes "胃に穴開けんじゃねぇぞ。";
			break;
		case 3:
			mes "[イルヒ]";
			mes "そうか？";
			mes "じゃあ、次に会うまでに、";
			mes "もうちっと強くなってろよ！";
			mes "がっはっはー！";
			break;
		}
		next;
		mes "[イルヒ]";
		mes "おし。これをやる。";
		mes "頑張れよ。";
		set QUE_THIEF,7;
		getitem 1207,1;
		if(checkre())
			getexp 50,20;
		else
			getexp 500,200;
		misceffect 4,"";
		close;
	case 7:
		mes "[イルヒ]";
		mes "そういえばこの間、";
		mes "街の南でけっこう大きな";
		mes "争いがあったらしくてな。";
		mes "真夜中だったんだが、ちょうどその時";
		mes "集会があって、すぐに発覚した。";
		next;
		mes "[イルヒ]";
		mes "その場所を調査したが、";
		mes "どうやら点々と場所を移動している";
		mes "らしく、まだ調査が終わってねぇ。";
		next;
		mes "[イルヒ]";
		mes "あちこちに毒を使った形跡がある所から";
		mes "見て、アサシンが関係していること";
		mes "だけは確かだ。";
		next;
		mes "[イルヒ]";
		mes "まー興味があるんなら、独自に調べて";
		mes "みてもいいだろう。";
		mes "だが、毒には近付き過ぎるなよ。";
		next;
		mes "[イルヒ]";
		mes "そうだな、念のため緑ハーブか";
		mes "緑ポーションでも持っていくと";
		mes "いいかもな。二つとも解毒作用がある。";
		next;
		mes "[イルヒ]";
		mes "それと、誰かがレッドジェムストーンを";
		mes "取り出したら注意だ。";
		mes "レッドジェムストーンは毒系スキルの";
		mes "触媒として使われることがあるからな。";
		set QUE_THIEF,8;
		if(checkre())
			getexp 20,10;
		else
			getexp 200,100;
		misceffect 4,"";
		close;
	case 8:
		mes "[イルヒ]";
		mes "おう、どうだ？　うまくやってっか？";
		mes "敵との戦いは、どんな時だって危険な";
		mes "もんだ。特に最近は色んな勢力が";
		mes "あちこちにのさばってるしな。";
		next;
		mes "[イルヒ]";
		mes "モンスターだけじゃねぇ。";
		mes "いつ何が敵になるかわからねぇ。";
		mes "危険ってのは、案外すぐ隣にあったり";
		mes "するもんさ。";
		close;
	default:
		mes "[イルヒ]";
		mes "俺の友達が、行方不明なんだ。";
		mes "任務完了の連絡はあったが、その後の";
		mes "消息が知れねぇ……";
		next;
		mes "[イルヒ]";
		mes "お前も気ぃ付けろよ。";
		close;
	case 26:
		mes "[イルヒ]";
		mes "よお、調査の方は進んでるか？";
		next;
		switch(select("まだ調査中です","まだ確かじゃなくて……","調査終了しました")) {
		case 1:
			mes "[イルヒ]";
			mes "そっか……";
			mes "まー諦めずに頑張れや。";
			close;
		case 2:
			mes "[イルヒ]";
			mes "そっか……";
			mes "まー諦めずに頑張れや……";
			close;
		}
		mes "[イルヒ]";
		mes "お、そうか？";
		mes "どれ、話してみろ。";
		next;
		mes "-あなたは追跡の結果と、";
		mes "追跡中に手に入れた布切れについて";
		mes "話した-";
		next;
		mes "[イルヒ]";
		mes "……そうか。";
		mes "その布切れ、ちょっと貸しな。";
		next;
		mes "-あなたは布切れをイルヒに渡した-";
		next;
		mes "[イルヒ]";
		mes "……これは……";
		mes "うん、頑張ったな。";
		mes "これは貴重なモンだ。";
		next;
		mes "[イルヒ]";
		mes "この布に書かれている文字は";
		mes "アサシンギルド特有の暗号だ。";
		mes "それも、上級幹部だけが使う……";
		next;
		mes "[イルヒ]";
		mes "これだけで、お前がどれだけ";
		mes "苦労してきたかわかるよ。";
		mes "……お疲れ。";
		next;
		mes "[イルヒ]";
		mes "後は、上級ギルド員に任せておけ。";
		mes "お前は、もっと修練して、ギルドに";
		mes "必要不可欠な人間になるこった。";
		mes "そうしたら、もっと重要な任務なんかも";
		mes "任せられるようになるさ。";
		next;
		mes "[イルヒ]";
		mes "これは、俺からの報酬だ。";
		mes "ここまでやってくれたんだ。";
		mes "これくらい当然ってやつだ。";
		set QUE_THIEF,27;
		getitem 2307,1;
		set Zeny,Zeny+5000;
		if(checkre())
			getexp 800,300;
		else
			getexp 8000,3000;
		next;
		mes "[イルヒ]";
		mes "それじゃあな、元気でな。";
		mes "がーはっは。";
		close;
	case 27:
		mes "[イルヒ]";
		mes "夢を持って暮らすこった。";
		mes "夢を持たないで暮らす奴は";
		mes "人生半分以上捨ててやがるぜ。";
		close;
	}
}

moc_fild12.gat,166,369,0	script	争った跡#1	844,{
	if(getbaseclass(Class) == CLASS_TF) {
		if(QUE_THIEF < 5 || QUE_THIEF == 7) {
			mes "-争った跡がある-";
			mes "-毒を使った形跡もある-";
			mes "-うかつに近付かないほうが";
			mes "良さそうだ-";
			close;
		}
		if(QUE_THIEF == 5 || QUE_THIEF == 6) {
			mes "-争った跡がある-";
			mes "-ちょっと近付いてみたら";
			mes "少し頭がクラクラする-";
			set QUE_THIEF,6;
			misceffect 171;
			sc_start3 SC_POISON,0,0,0,0,60000,10;
			close;
		}
		if(QUE_THIEF == 8) {
			mes "-大勢の人が誰かを追跡した跡が";
			mes "南へ伸びている-";
			set QUE_THIEF,9;
			close;
		}
		mes "-争った跡がある-";
		mes "-異臭がする-";
		mes "-どうやら毒が使われたようだ-";
		close;
	}
	if(getbaseclass(Class) == CLASS_MG) {
		if(QUE_MAGICIAN < 8) {
			mes "-争った跡がある-";
			mes "-毒を使った形跡もある-";
			mes "-うかつに近付かないほうが";
			mes "良さそうだ-";
			misceffect 171;
			close;
		}
		if(QUE_MAGICIAN == 8) {
			mes "-大勢の人が誰かを追跡した跡が";
			mes "南へ伸びている-";
			set QUE_MAGICIAN,9;
			close;
		}
		mes "-争った跡がある-";
		mes "-異臭がする-";
		mes "-どうやら毒が使われたようだ-";
		close;
	}
	mes "-何かの跡が残っている-";
	mes "-なんの跡だろう-";
	close;
}

moc_fild12.gat,173,215,0	script	争った跡#2	844,{
	if(getbaseclass(Class) == CLASS_TF) {
		if(QUE_THIEF < 9) {
			mes "-大勢の人が通った跡がある-";
			close;
		}
		if(QUE_THIEF == 9) {
			mes "-たくさんの足跡が東へ向かっている-";
			mes "-その中に一つだけ目立つ足跡がある-";
			mes "-これが追われている人物みたいだ-";
			set QUE_THIEF,10;
			close;
		}
		mes "-東へ向かった跡がある-";
		close;
	}
	if(getbaseclass(Class) == CLASS_MG) {
		if(QUE_MAGICIAN < 9) {
			mes "-大勢の人が通った跡がある-";
			close;
		}
		if(QUE_MAGICIAN == 9) {
			mes "-たくさんの足跡が東へ向かっている-";
			mes "-その中に一つだけ目立つ足跡がある-";
			mes "-これが追われている人物みたいだ-";
			set QUE_MAGICIAN,10;
			close;
		}
		mes "-東へ向かった跡がある-";
		close;
	}
	mes "-何かの跡が残っている-";
	mes "-なんの跡だろう-";
	close;
}

moc_fild12.gat,276,165,0	script	争った跡#3	844,{
	if(getbaseclass(Class) == CLASS_TF) {
		if(QUE_THIEF < 10) {
			mes "-大勢の人が通った跡がある-";
			close;
		}
		if(QUE_THIEF == 10) {
			mes "-追われている人の足跡が目立つ-";
			mes "-なんだか、わざと足跡を";
			mes "残しているような感じをうける-";
			set QUE_THIEF,11;
			close;
		}
		mes "-追われている人の足跡が";
		mes "やたら目立っている-";
		close;
	}
	if(getbaseclass(Class) == CLASS_MG) {
		if(QUE_MAGICIAN < 10) {
			mes "-大勢の人が通った跡がある-";
			close;
		}
		if(QUE_MAGICIAN == 10) {
			mes "-追われている人の足跡が目立つ-";
			mes "-なんだか、わざと足跡を";
			mes "残しているような感じをうける-";
			set QUE_MAGICIAN,11;
			close;
		}
		mes "-追われている人の足跡が";
		mes "やたら目立っている-";
		close;
	}
	mes "-何かの跡が残っている-";
	mes "-なんの跡だろう-";
	close;
}

moc_fild11.gat,39,163,0	script	争った跡#4	844,{
	if(getbaseclass(Class) == CLASS_TF) {
		if(QUE_THIEF < 11) {
			mes "-大勢の人が通った跡がある-";
			close;
		}
		if(QUE_THIEF == 11) {
			mes "-足跡が1つ増えている-";
			mes "-他の足跡と違い、大きさが";
			mes "小さくて鮮明だ-";
			mes "-どうやら、合流した人物が";
			mes "いるらしい-";
			set QUE_THIEF,12;
			close;
		}
		mes "-新しい足跡がある-";
		close;
	}
	if(getbaseclass(Class) == CLASS_MG) {
		if(QUE_MAGICIAN < 11) {
			mes "-大勢の人が通った跡がある-";
			close;
		}
		if(QUE_MAGICIAN == 11) {
			mes "-足跡が1つ増えている-";
			mes "-他の足跡と違い、大きさが";
			mes "小さくて鮮明だ-";
			mes "-どうやら、合流した人物が";
			mes "いるらしい-";
			set QUE_MAGICIAN,12;
			close;
		}
		mes "-新しい足跡がある-";
		close;
	}
	mes "-何かの跡が残っている-";
	mes "-なんの跡だろう-";
	close;
}

moc_fild11.gat,205,52,0	script	争った跡#5	844,{
	if(getbaseclass(Class) == CLASS_TF) {
		 if(QUE_THIEF < 12) {
			mes "-大勢の人が通った跡がある-";
			close;
		}
		if(QUE_THIEF == 12) {
			mes "-足跡が南と北に分かれている-";
			mes "-強い毒がここで使われたみたいで";
			mes "近付けそうにない-";
			if(countitem(506) < 1)
				close;
			mes "-持っている緑ポーションを使えば";
			mes "毒を中和できるかもしれない-";
			next;
			if(select("緑ポーションを使う","緑ポーションを使わない")==2){
				mes "-ここを調べるより、足跡を";
				mes "追跡することにしよう-";
				close;
			}
			mes "-緑ポーションを使ってから数分後-";
			mes "-毒が一番濃かった場所を調べると";
			mes "何かが見えた-";
			next;
			if(select("調査しない","調査する")==1){
				mes "-気にするような物ではなさそうだ-";
				close;
			}
			mes "-血のついた布切れを見つけた-";
			set QUE_THIEF,13;
			next;
			mes "-布切れには見たことのない";
			mes "文字が書かれている-";
			mes "-何かの手掛かりになりそうだ-";
			close;
		}
		mes "-これ以上の収穫はなさそうだ-";
		mes "-足跡は二手に分かれている-";
		close;
	}
	if(getbaseclass(Class) == CLASS_MG) {
		 if(QUE_MAGICIAN < 12) {
			mes "-大勢の人が通った跡がある-";
			close;
		}
		if(QUE_MAGICIAN == 12) {
			mes "-足跡が南と北に分かれている-";
			mes "-強い毒がここで使われたみたいで";
			mes "近付けそうにない-";
			if(countitem(506) < 1)
				close;
			mes "-持っている緑ポーションを使えば";
			mes "毒を中和できるかもしれない-";
			next;
			if(select("緑ポーションを使う","緑ポーションを使わない")==2){
				mes "-ここを調べるより、足跡を";
				mes "追跡することにしよう-";
				close;
			}
			mes "-緑ポーションを使ってから数分後-";
			mes "-毒が一番濃かった場所を調べると";
			mes "何かが見えた-";
			next;
			if(select("調査しない","調査する")==1){
				mes "-気にするような物ではなさそうだ-";
				close;
			}
			mes "-血のついた布切れを見つけた-";
			set QUE_MAGICIAN,13;
			next;
			mes "-布切れには見たことのない";
			mes "文字が書かれている-";
			mes "-何かの手掛かりになりそうだ-";
			close;
		}
		mes "-これ以上の収穫はなさそうだ-";
		mes "-足跡は二手に分かれている-";
		close;
	}
	mes "-何かの跡が残っている-";
	mes "-なんの跡だろう-";
	close;
}

moc_fild11.gat,226,235,0	script	争った跡#6	844,{
	if(getbaseclass(Class) == CLASS_TF) {
		 if(QUE_THIEF < 13) {
			mes "-大勢の人が通った跡がある-";
			close;
		}
		mes "-足跡が続いている-";
		mes "-だが、もうかなり薄くなっていて";
		mes "追跡は難しそうだ-";
		close;
	}
	if(getbaseclass(Class) == CLASS_MG) {
		 if(QUE_MAGICIAN < 13) {
			mes "-大勢の人が通った跡がある-";
			close;
		}
		mes "-足跡が続いている-";
		mes "-だが、もうかなり薄くなっていて";
		mes "追跡は難しそうだ-";
		close;
	}
	mes "-何かの跡が残っている-";
	mes "-なんの跡だろう-";
	close;
}

moc_fild11.gat,184,342,0	script	争った跡#7	844,{
	if(getbaseclass(Class) == CLASS_TF) {
		 if(QUE_THIEF < 13) {
			mes "-大勢の人が通った跡がある-";
			close;
		}
		mes "-かなりの人数がここを";
		mes "通ったらしい-";
		mes "-かなり手間取ったような跡が";
		mes "北へ向かっている-";
		close;
	}
	if(getbaseclass(Class) == CLASS_MG) {
		 if(QUE_MAGICIAN < 13) {
			mes "-大勢の人が通った跡がある-";
			close;
		}
		mes "-かなりの人数がここを";
		mes "通ったらしい-";
		mes "-かなり手間取ったような跡が";
		mes "北へ向かっている-";
		close;
	}
	mes "-何かの跡が残っている-";
	mes "-なんの跡だろう-";
	close;
}

moc_fild17.gat,213,358,0	script	争った跡#8	844,{
	if(getbaseclass(Class) == CLASS_TF) {
		 if(QUE_THIEF < 13) {
			mes "-足跡が二人分ある-";
			close;
		}
		if(QUE_THIEF == 13) {
			mes "-あんなにあった追跡者の足跡が";
			mes "まったくない-";
			mes "-二人分の足跡だけが続いている-";
			set QUE_THIEF,14;
			close;
		}
		mes "-数人の足跡がある-";
		close;
	}
	if(getbaseclass(Class) == CLASS_MG) {
		 if(QUE_MAGICIAN < 13) {
			mes "-足跡が二人分ある-";
			close;
		}
		if(QUE_MAGICIAN == 13) {
			mes "-あんなにあった追跡者の足跡が";
			mes "まったくない-";
			mes "-二人分の足跡だけが続いている-";
			set QUE_MAGICIAN,14;
			close;
		}
		mes "-数人の足跡がある-";
		close;
	}
	mes "-何かの跡が残っている-";
	mes "-なんの跡だろう-";
	close;
}

moc_fild17.gat,228,274,0	script	争った跡#9	844,{
	if(getbaseclass(Class) == CLASS_TF) {
		 if(QUE_THIEF < 14) {
			mes "-少し争った跡がある-";
			close;
		}
		if(QUE_THIEF == 14) {
			mes "-少し争った跡がある-";
			mes "-北からの跡と、東南からの跡が";
			mes "入り混じっている-";
			next;
			mes "-良く見ると、足跡は西へと";
			mes "向かったようだが、争いが";
			mes "あったのだから、何か残されて";
			mes "いないだろうか……-";
			set QUE_THIEF,15;
			close;
		}
		if(QUE_THIEF == 15) {
			if(rand(10)) {
				mes "-もう少し調査してみよう-";
				mes "-何か見つかるかもしれない-";
				close;
			}
			mes "-前にも見付けたような";
			mes "血のついた布切れを見つけた-";
			next;
			mes "-血のついた服の切れ端を見つけた-";
			set QUE_THIEF,16;
			close;
		}
		mes "-これ以上は何もなさそうだ-";
		mes "-足跡は西へと向かっている-";
		close;
	}
	if(getbaseclass(Class) == CLASS_MG) {
		 if(QUE_MAGICIAN < 14) {
			mes "-少し争った跡がある-";
			close;
		}
		if(QUE_MAGICIAN == 14) {
			mes "-少し争った跡がある-";
			mes "-北からの跡と、東南からの跡が";
			mes "入り混じっている-";
			next;
			mes "-良く見ると、足跡は西へと";
			mes "向かったようだが、争いが";
			mes "あったのだから、何か残されて";
			mes "いないだろうか……-";
			set QUE_MAGICIAN,15;
			close;
		}
		if(QUE_MAGICIAN == 15) {
			if(rand(10)) {
				mes "-もう少し調査してみよう-";
				mes "-何か見つかるかもしれない-";
				close;
			}
			mes "-前にも見付けたような";
			mes "血のついた布切れを見つけた-";
			next;
			mes "-血のついた服の切れ端を見つけた-";
			set QUE_MAGICIAN,16;
			close;
		}
		mes "-これ以上は何もなさそうだ-";
		mes "-足跡は西へと向かっている-";
		close;
	}
	mes "-何かの跡が残っている-";
	mes "-なんの跡だろう-";
	close;
}

moc_fild17.gat,34,292,0	script	争った跡#10	844,{
	if(getbaseclass(Class) == CLASS_TF) {
		if(QUE_THIEF < 16) {
			mes "-大勢の人が通った跡がある-";
			close;
		}
		if(QUE_THIEF == 16) {
			mes "-東から足跡が続いている-";
			mes "-逃亡者と追跡者の足跡が";
			mes "似ている気がする-";
			mes "-二人の距離が縮まったようだ-";
			set QUE_THIEF,17;
			close;
		}
		mes "-西に向かった跡がある-";
		close;
	}
	if(getbaseclass(Class) == CLASS_MG) {
		if(QUE_MAGICIAN < 16) {
			mes "-大勢の人が通った跡がある-";
			close;
		}
		if(QUE_MAGICIAN == 16) {
			mes "-東から足跡が続いている-";
			mes "-逃亡者と追跡者の足跡が";
			mes "似ている気がする-";
			mes "-二人の距離が縮まったようだ-";
			set QUE_MAGICIAN,17;
			close;
		}
		mes "-西に向かった跡がある-";
		close;
	}
	mes "-何かの跡が残っている-";
	mes "-なんの跡だろう-";
	close;
}

moc_fild18.gat,346,296,0	script	争った跡#11	844,{
	if(getbaseclass(Class) == CLASS_TF) {
		if(QUE_THIEF < 17) {
			mes "-大勢の人が通った跡がある-";
			close;
		}
		if(QUE_THIEF == 17) {
			mes "-血痕がある-";
			mes "-血痕の量からみて、誰かが";
			mes "かなりの大怪我をしたようだ-";
			set QUE_THIEF,18;
			close;
		}
		mes "-血痕の跡を追ってみよう-";
		close;
	}
	if(getbaseclass(Class) == CLASS_MG) {
		if(QUE_MAGICIAN < 17) {
			mes "-大勢の人が通った跡がある-";
			close;
		}
		if(QUE_MAGICIAN == 17) {
			mes "-血痕がある-";
			mes "-血痕の量からみて、誰かが";
			mes "かなりの大怪我をしたようだ-";
			set QUE_MAGICIAN,18;
			close;
		}
		mes "-血痕の跡を追ってみよう-";
		close;
	}
	mes "-何かの跡が残っている-";
	mes "-なんの跡だろう-";
	close;
}

moc_fild18.gat,309,257,0	script	争った跡#12	844,{
	if(getbaseclass(Class) == CLASS_TF) {
		if(QUE_THIEF < 18) {
			mes "-大勢の人が通った跡がある-";
			close;
		}
		if(QUE_THIEF == 18) {
			mes "-足跡が北へ向かっている-";
			mes "-明らかに追跡者と逃亡者の";
			mes "距離が短くなっている-";
			set QUE_THIEF,19;
			close;
		}
		mes "-北へ向かった跡がある-";
		close;
	}
	if(getbaseclass(Class) == CLASS_MG) {
		if(QUE_MAGICIAN < 18) {
			mes "-大勢の人が通った跡がある-";
			close;
		}
		if(QUE_MAGICIAN == 18) {
			mes "-足跡が北へ向かっている-";
			mes "-明らかに追跡者と逃亡者の";
			mes "距離が短くなっている-";
			set QUE_MAGICIAN,19;
			close;
		}
		mes "-北へ向かった跡がある-";
		close;
	}
	mes "-何かの跡が残っている-";
	mes "-なんの跡だろう-";
	close;
}

moc_fild18.gat,177,333,0	script	争った跡#13	844,{
	if(getbaseclass(Class) == CLASS_TF) {
		if(QUE_THIEF < 19) {
			mes "-大勢の人が通った跡がある-";
			close;
		}
		if(QUE_THIEF == 19) {
			mes "-北へ向かうかと思っていた足跡が";
			mes "南西へ方向転換している-";
			mes "-新しい追跡者の跡もある-";
			mes "-新しい追跡者と前からの追跡者の間で";
			mes "軽くもめたような跡がある-";
			set QUE_THIEF,20;
			close;
		}
		mes "-南西へ向かった跡がある-";
		close;
	}
	if(getbaseclass(Class) == CLASS_MG) {
		if(QUE_MAGICIAN < 19) {
			mes "-大勢の人が通った跡がある-";
			close;
		}
		if(QUE_MAGICIAN == 19) {
			mes "-北へ向かうかと思っていた足跡が";
			mes "南西へ方向転換している-";
			mes "-新しい追跡者の跡もある-";
			mes "-新しい追跡者と前からの追跡者の間で";
			mes "軽くもめたような跡がある-";
			set QUE_MAGICIAN,20;
			close;
		}
		mes "-南西へ向かった跡がある-";
		close;
	}
	mes "-何かの跡が残っている-";
	mes "-なんの跡だろう-";
	close;
}

moc_fild18.gat,111,303,0	script	争った跡#14	844,{
	if(getbaseclass(Class) == CLASS_TF) {
		if(QUE_THIEF < 20) {
			mes "-大勢の人が通った跡がある-";
			close;
		}
		if(QUE_THIEF == 20) {
			mes "-足跡が南へ向かっている-";
			mes "-追跡者の跡がかなり鮮明だ-";
			set QUE_THIEF,21;
			close;
		}
		mes "-南へ向かった跡がある-";
		close;
	}
	if(getbaseclass(Class) == CLASS_MG) {
		if(QUE_MAGICIAN < 20) {
			mes "-大勢の人が通った跡がある-";
			close;
		}
		if(QUE_MAGICIAN == 20) {
			mes "-足跡が南へ向かっている-";
			mes "-追跡者の跡がかなり鮮明だ-";
			set QUE_MAGICIAN,21;
			close;
		}
		mes "-南へ向かった跡がある-";
		close;
	}
	mes "-何かの跡が残っている-";
	mes "-なんの跡だろう-";
	close;
}

moc_fild18.gat,109,197,0	script	争った跡#15	844,{
	if(getbaseclass(Class) == CLASS_TF) {
		if(QUE_THIEF < 21) {
			mes "-大勢の人が通った跡がある-";
			close;
		}
		if(QUE_THIEF == 21) {
			mes "-熾烈な戦いがあったようだ-";
			mes "-あちこちに毒を使った跡が";
			mes "残っている-";
			next;
			if(select("追跡を続けよう","ちょっと調べてみよう")==1){
				mes "-追跡をしようにも、なにも";
				mes "手掛かりが見つからない-";
				close;
			}
			mes "-毒のトラップがいくつか見える-";
			mes "-作動済みのトラップに混ざって";
			mes "まだ作動していないトラップも";
			mes "ありそうだ-";
			set QUE_THIEF,22;
			close;
		}
		if(QUE_THIEF == 22) {
			if(rand(3)) {
				mes "-間違ってトラップに";
				mes "触れてしまった！-";
				misceffect 171;
				sc_start3 SC_POISON,0,0,0,0,60000,10;
				percentheal -30,0;
				close;
			}
			mes "-ちょっと変わったトラップがある-";
			mes "-緑ポーションを使ってみようか-";
			next;
			if(select("緑ポーションをまいてみる","別のことをしてみる")==2){
				mes "-もう少し辺りを調べてみよう-";
				close;
			}
			if(countitem(506) < 1) {
				mes "……………";
				mes "-緑ポーションがない……-";
				close;
			}
			mes "-緑ポーションをまいてみたが";
			mes "特に何も起こらない-";
			mes "-違うアイテムを試したほうが";
			mes "良さそうだ-";
			delitem 506,1;
			set QUE_THIEF,23;
			close;
		}
		if(QUE_THIEF == 23) {
			if(countitem(511) < 1 && countitem(716) < 1) {
				mes "-何か触媒が必要なようだ-";
				close;
			}
			if(countitem(716) < 1) {
				mes "-緑ハーブを粉にしてまいてみたが";
				mes "特に何も起こらない-";
				mes "-違うアイテムを試したほうが";
				mes "良さそうだ-";
				close;
			}
			if(countitem(511) < 1) {
				mes "-レッドジェムストーンを粉にして";
				mes "まいてみたが、特に何も起こらない-";
				mes "-違うアイテムを試したほうが";
				mes "良さそうだ-";
				close;
			}
			mes "-緑ハーブを粉にしてまいた後";
			mes "レッドジェムストーンをトラップの上に";
			mes "置くと、レッドジェムストーンが赤く";
			mes "光り、消えた-";
			mes "-すると、トラップが解除された-";
			delitem 511,1;
			delitem 716,1;
			set QUE_THIEF,24;
			close;
		}
		if(QUE_THIEF == 24) {
			mes "-解除されたトラップに";
			mes "布切れがついている-";
			next;
			mes "-血のついた布切れを手に入れた-";
			set QUE_THIEF,25;
			close;
		}
		mes "-他に残っているトラップは";
		mes "なさそうだ-";
		mes "-足跡は南へ向かっている-";
		close;
	}
	if(getbaseclass(Class) == CLASS_MG) {
		if(QUE_MAGICIAN < 21) {
			mes "-大勢の人が通った跡がある-";
			close;
		}
		if(QUE_MAGICIAN == 21) {
			mes "-熾烈な戦いがあったようだ-";
			mes "-あちこちに毒を使った跡が";
			mes "残っている-";
			next;
			if(select("追跡を続けよう","ちょっと調べてみよう")==1){
				mes "-追跡をしようにも、なにも";
				mes "手掛かりが見つからない-";
				close;
			}
			mes "-毒のトラップがいくつか見える-";
			mes "-作動済みのトラップに混ざって";
			mes "まだ作動していないトラップも";
			mes "ありそうだ-";
			set QUE_MAGICIAN,22;
			close;
		}
		if(QUE_MAGICIAN == 22) {
			if(rand(3)) {
				mes "-間違ってトラップに";
				mes "触れてしまった！-";
				misceffect 171;
				sc_start3 SC_POISON,0,0,0,0,60000,10;
				percentheal -30,0;
				close;
			}
			mes "-ちょっと変わったトラップがある-";
			mes "-緑ポーションを使ってみようか-";
			next;
			if(select("緑ポーションをまいてみる","別のことをしてみる")==2){
				mes "-もう少し辺りを調べてみよう-";
				close;
			}
			if(countitem(506) < 1) {
				mes "……………";
				mes "-緑ポーションがない……-";
				close;
			}
			mes "-緑ポーションをまいてみたが";
			mes "特に何も起こらない-";
			mes "-違うアイテムを試したほうが";
			mes "良さそうだ-";
			delitem 506,1;
			set QUE_MAGICIAN,23;
			close;
		}
		if(QUE_MAGICIAN == 23) {
			if(countitem(511) < 1 && countitem(716) < 1) {
				mes "-何か触媒が必要なようだ-";
				close;
			}
			if(countitem(716) < 1) {
				mes "-緑ハーブを粉にしてまいてみたが";
				mes "特に何も起こらない-";
				mes "-違うアイテムを試したほうが";
				mes "良さそうだ-";
				close;
			}
			if(countitem(511) < 1) {
				mes "-レッドジェムストーンを粉にして";
				mes "まいてみたが、特に何も起こらない-";
				mes "-違うアイテムを試したほうが";
				mes "良さそうだ-";
				close;
			}
			mes "-緑ハーブを粉にしてまいた後";
			mes "レッドジェムストーンをトラップの上に";
			mes "置くと、レッドジェムストーンが赤く";
			mes "光り、消えた-";
			mes "-すると、トラップが解除された-";
			delitem 511,1;
			delitem 716,1;
			set QUE_MAGICIAN,24;
			close;
		}
		if(QUE_MAGICIAN == 24) {
			mes "-解除されたトラップに";
			mes "布切れがついている-";
			next;
			mes "-血のついた布切れを手に入れた-";
			set QUE_MAGICIAN,25;
			close;
		}
		mes "-他に残っているトラップは";
		mes "なさそうだ-";
		mes "-足跡は南へ向かっている-";
		close;
	}
	mes "-何かの跡が残っている-";
	mes "-なんの跡だろう-";
	close;
}

moc_fild18.gat,156,96,0	script	争った跡#16	844,{
	if(getbaseclass(Class) == CLASS_TF) {
		if(QUE_THIEF < 25) {
			mes "-大勢の人が通った跡がある-";
			close;
		}
		if(QUE_THIEF == 25) {
			mes "-足跡が絶壁へ向かっている-";
			mes "-これ以上の追跡は無理だ-";
			next;
			mes "…………………………";
			next;
			mes "-逃亡者達は、絶壁から下に";
			mes "落ちたのだろうか-";
			mes "-追跡者達の跡は散らばっていて";
			mes "うまく判別できない-";
			next;
			mes "-見つけた布切れを持って帰ろう-";
			set QUE_THIEF,26;
			close;
		}
		mes "-絶壁へと向かった跡がある……-";
		close;
	}
	if(getbaseclass(Class) == CLASS_MG) {
		if(QUE_MAGICIAN < 25) {
			mes "-大勢の人が通った跡がある-";
			close;
		}
		if(QUE_MAGICIAN == 25) {
			mes "-足跡が絶壁へ向かっている-";
			mes "-これ以上の追跡は無理だ-";
			next;
			mes "…………………………";
			next;
			mes "-逃亡者達は、絶壁から下に";
			mes "落ちたのだろうか-";
			mes "-追跡者達の跡は散らばっていて";
			mes "うまく判別できない-";
			next;
			mes "-見つけた布切れを持って帰ろう-";
			set QUE_MAGICIAN,26;
			close;
		}
		mes "-絶壁へと向かった跡がある……-";
		close;
	}
	mes "-何かの跡が残っている-";
	mes "-なんの跡だろう-";
	close;
}

//============================================================
// マーチャントクエストNPC
//- Registry -------------------------------------------------
// QUE_MERCHANT -> 0～17
//------------------------------------------------------------
alberta_in.gat,70,51,5	script	ガーニン	98,{
	if(Job != Job_Merchant) {
		mes "[ガーニン]";
		mes "マーチャントでもない奴が、";
		mes "ここに何の用だ？";
		mes "マーチャントでもない奴に";
		mes "商売魂が何たるかを";
		mes "教えるわけないだろう！";
		next;
		mes "[ガーニン]";
		mes "どうしても知りたきゃ、";
		mes "マーチャントになってきな！";
		mes "あとな、転生しちまったマーチャントも";
		mes "却下だ。自力で転生するくらいなら";
		mes "俺が教えることなんて、";
		mes "何もないはずだからな。";
		close;
	}
	switch(QUE_MERCHANT) {
	case 0:
		mes "[ガーニン]";
		mes "お、新米マーチャントか？";
		mes "よく来たな。";
		mes "商売の達人であるこのガーニンが";
		mes "お前に商売の基本を教えてあげよう！";
		next;
		if(select("受講する","受講しない")==2) {
			mes "[ガーニン]";
			mes "根性のない奴に用はない。";
			mes "まあでも、考えが変わったら";
			mes "また来なさい！";
			close;
		}
		if(getskilllv(36) >= 4) {
			mes "[ガーニン]";
			mes "おお、^FF0000所持限界量増加^000000を";
			mes "既にLv4以上習得しているじゃないか！";
			mes "うん、偉い！";
			break;
		}
		set QUE_MERCHANT,1;
		mes "[ガーニン]";
		mes "よしよし、ではまず……";
		mes "うーん、お前はまだマーチャントの";
		mes "基本ができていないようだな。";
		next;
		mes "[ガーニン]";
		mes "まずは^FF0000所持限界量増加^000000だ！";
		mes "マーチャントは、";
		mes "たくさんの品物を持ち歩き、";
		mes "客にできるだけ多くの品を売って、";
		mes "多くの利益を得る！";
		mes "それが基本だろう！";
		next;
		mes "[ガーニン]";
		mes "所持限界量増加は、その名のごとく、";
		mes "自分の所持可能重量が増加する";
		mes "パッシブスキルだ。";
		mes "スキルレベルが高いほど";
		mes "所持可能重量の限界が増えるぞ。";
		next;
		mes "[ガーニン]";
		mes "じゃあ、そういうことで、";
		mes "所持限界量増加をLv4まで";
		mes "習得してくるように。";
		close;
	case 1:
		mes "[ガーニン]";
		mes "所持限界量増加を";
		mes "Lv4まで上げてきたか？";
		mes "きちんと覚えてこないと、";
		mes "次の講義はやってやらないぞ。";
		next;
		if(getskilllv(36) < 4) {
			mes "[ガーニン]";
			mes "マーチャントを目指すなら、";
			mes "基本をしっかり覚えなくてはな。";
			close;
		}
		mes "[ガーニン]";
		mes "よしよし、";
		mes "^FF0000所持限界量増加^000000を";
		mes "Lv4以上にしてきたな。";
		mes "うん、結構！　気に入ったぞ。";
		break;
	case 2:
		mes "[ガーニン]";
		mes "おうおう、また講義を受けにきたか。";
		mes "偉い！　ハッハッハッ!!";
		next;
		mes "[ガーニン]";
		mes "次の講義は、メマーナイトだったな。";
		mes "メマーナイトは、俺がもっとも";
		mes "親しんでいるスキルだ。";
		mes "まぁ、そんなに、";
		mes "説明するほどのこともないが……";
		next;
		mes "[ガーニン]";
		mes "^FF0000メマーナイト^000000。";
		mes "これは、金を使って、";
		mes "敵にダメージを与えるスキルだ。";
		mes "金で相手を殴っていると思えば、";
		mes "イメージしやすいんじゃないか。";
		next;
		mes "[ガーニン]";
		mes "ダメージは多いが、消費SPは少ない。";
		mes "やっぱり、世の中^FF0000金^000000だ！";
		mes "^FF0000金^000000！　^FF0000金^000000！　^FF0000金^000000！";
		mes "^FF0000金^000000は最高だ!!";
		next;
		mes "[ガーニン]";
		mes "こんな無敵な^FF0000金^000000の力を使う";
		mes "メマーナイトにも弱点がある。";
		mes "それは、メマーナイトを使うたびに";
		mes "^FF0000金^000000も消費されるということだ！";
		next;
		mes "[ガーニン]";
		mes "使いすぎると、気がつけば";
		mes "財布がすっからかんだったりな。";
		mes "懐具合を見て、";
		mes "使える時にだけ使うのがよい。";
		mes "いや、本当は使わない方がいい！";
		mes "^FF0000金^000000が減る!!";
		next;
		mes "[ガーニン]";
		mes "^FF0000スキルレベルが上がれば、";
		mes "攻撃力も増加する。^000000";
		mes "但し、金の消費量も増えるから、";
		mes "そこはくれぐれも気をつけるように。";
		next;
		if(getskilllv(42) > 3) {
			mes "[ガーニン]";
			mes "なんだ、既にこのスキルを";
			mes "使ったことがあるんじゃないか。";
			mes "俺が説明するまでもなかったな。";
			mes "……一体、いくら使ったんだ。";
			next;
			mes "[ガーニン]";
			mes "金もお前もかわいそうだしな。";
			mes "少しだが、プレゼントをやろう。";
			mes "受け取れ！";
			set QUE_MERCHANT,3;
			if(checkre())
				getexp 70,5;
			else
				getexp 700,58;
			next;
		}
		mes "[ガーニン]";
		mes "メマーナイトはこれくらいにして……";
		mes "次は、^FF0000ディスカウント^000000について";
		mes "講義しよう。お楽しみに！";
		set QUE_MERCHANT,3;
		close;
	case 3:
		mes "[ガーニン]";
		mes "よし、約束通り、";
		mes "ディスカウントについてだ。";
		mes "重要なスキルだから、";
		mes "耳かっぽじって聞けよ。";
		next;
		mes "[ガーニン]";
		mes "^FF0000ディスカウント^000000を簡単に言えば、";
		mes "品物を定価以下で買えるスキルだ。";
		mes "露店では使えないがな。";
		mes "商店なんかで、定価より少し安い価格で";
		mes "購入できるようになる。";
		next;
		mes "[ガーニン]";
		mes "^FF0000パッシブスキル^000000だから";
		mes "一度覚えちまえば、死ぬまで使える。";
		mes "^FF0000Lv10まで習得できて";
		mes "スキルレベルが上がるほど、";
		mes "割引効果が高くなる。^000000";
		next;
		if(getskilllv(37) < 4) {
			mes "[ガーニン]";
			mes "そこで！　ディスカウントをLv4まで";
			mes "あげてくるように！";
			mes "Lv10までマスターしてこいと";
			mes "言いたいが、講義内容も多いし、";
			mes "ちんたらしてもいられないから、";
			mes "Lv4でいいや。";
			next;
			mes "[ガーニン]";
			mes "仕入れ値を削る！";
			mes "これこそ商売魂!!";
			mes "ルーンミッドガッツの商人魂！";
			set QUE_MERCHANT,4;
			close;
		}
		mes "[ガーニン]";
		mes "そこで！";
		mes "ディスカウントをLv4まで";
		mes "……っと思ったら、";
		if(getskilllv(37) >= 10) {
			mes "もうLv10じゃないか！";
			mes "うんうん、すごい！";
			mes "プレゼントをあげよう！";
			if(checkre())
				getexp 97,18;
			else
				getexp 970,180;
		}
		else {
			mes "もうLv4以上になってるんだな。";
			mes "うん、立派立派！";
			mes "プレゼントをあげよう！";
			if(checkre())
				getexp 83,11;
			else
				getexp 830,116;
		}
		set QUE_MERCHANT,5;
		next;
		mes "[ガーニン]";
		mes "そうだな。";
		mes "次はちょっと試験でもするか。";
		mes "簡単なものにしておくから安心しろ。";
		mes "準備ができたら、";
		mes "また話しかけてくれ。";
		close;
	case 4:
		mes "[ガーニン]";
		mes "ディスカウントを覚えてきたか？";
		mes "仕入れ値を削る！";
		mes "これこそ商売魂!!";
		next;
		if(getskilllv(37) < 4) {
			mes "[ガーニン]";
			mes "おいおい、ディスカウントを";
			mes "Lv4以上と言っただろう。";
			mes "さぼってるんじゃない！";
			mes "時は金なり!!";
			close;
		}
		if(getskilllv(37) >= 10) {
			mes "[ガーニン]";
			mes "よしよしよ～し、Lv4どころか、";
			mes "Lv10までマスターしてくるとはな！";
			mes "ベリグー!!　ナイスナイス!!";
			mes "ナイスな奴には、これをやろう！";
			if(checkre())
				getexp 97,18;
			else
				getexp 970,180;
		}
		else {
			mes "[ガーニン]";
			mes "よしよし、ちゃんと";
			mes "Lv4以上覚えてきたな。";
			mes "上等上等。";
			mes "これを受け取れ！";
			if(checkre())
				getexp 83,11;
			else
				getexp 830,116;
		}
		set QUE_MERCHANT,5;
		next;
		mes "[ガーニン]";
		mes "そうだな。";
		mes "次はちょっと試験でもするか。";
		mes "簡単なものにしておくから安心しろ。";
		mes "準備ができたら、";
		mes "また話しかけてくれ。";
		close;
	case 5:
		mes "[ガーニン]";
		mes "試験だが、うーん……";
		mes "そうだな、プロンテラに行き……";
		mes "うーん……うーん……";
		mes "そうだ、赤ポーションを10個！";
		mes "定価じゃなくて、一番安く売っている";
		mes "人を探し、そこで買ってくるように。";
		next;
		mes "[ガーニン]";
		mes "よく探せよ。";
		mes "市場はちゃんと自力で調べること。";
		mes "また、詐欺師がいるかもしれないから、";
		mes "くれぐれも気をつけるように。";
		mes "安すぎるなら、疑うのも商売の知恵だ。";
		next;
		mes "[ガーニン]";
		mes "当たり前だが、露店で買うなよ。";
		mes "探せば、赤ポーションを";
		mes "10個売っている奴がいるはずだ。";
		next;
		mes "[ガーニン]";
		mes "お、そうだ。";
		mes "プロンテラまで行くのは大変だろう。";
		mes "俺がそこまで送ってやろう。";
		mes "ハッハッハッ！";
		mes "よし、行ってこい！";
		next;
		set QUE_MERCHANT,rand(6,8);
		warp "prontera.gat",155,46;
		end;
	default:
		mes "[ガーニン]";
		mes "プロンテラで、赤ポーションを";
		mes "売っている人が数人いる。";
		mes "その中で一番安く売っている人から、";
		mes "赤ポーションを10個買ってくるように！";
		next;
		mes "[ガーニン]";
		mes "ちゃんと市場調査をして、";
		mes "詐欺師には気をつけるんだぞ。";
		close;
	case 9:
		mes "[ガーニン]";
		mes "ムムム、一番安く買ってこいと";
		mes "言ったよな？";
		mes "それは、一番安い物ではない。";
		mes "やり直し！";
		mes "ちゃんと市場調査をするべし！";
		set QUE_MERCHANT,rand(6,8);
		close;
	case 10:
		mes "[ガーニン]";
		mes "よし、偉いぞ。";
		mes "完璧に市場調査をこなし、";
		mes "一番安値で買ってきたようだな。";
		mes "あっぱれ！";
		mes "これを受け取れ！";
		set QUE_MERCHANT,11;
		if(checkre())
			getexp 112,22;
		else
			getexp 1120,220;
		next;
		mes "[ガーニン]";
		mes "次は、ディスカウントの反対効果をもつ";
		mes "^FF0000オーバーチャージ^000000について";
		mes "講義しよう。";
		mes "期待するがいい！";
		close;
	case 11:
		mes "[ガーニン]";
		mes "とっとと進もう。";
		mes "^FF0000オーバーチャージは、";
		mes "ディスカウントのように";
		mes "パッシブスキルで、";
		mes "Lv10まで習得できる。^000000";
		next;
		mes "[ガーニン]";
		mes "ディスカウントは、";
		mes "商店で物を買う時に、";
		mes "定価より安く買えるスキルだったな。";
		mes "^FF0000オーバーチャージはその逆で、";
		mes "商店に物を高値で売れるようになる。^000000";
		next;
		mes "[ガーニン]";
		mes "当然、^FF0000パッシブスキルだ。";
		mes "1回覚えちまえば、死ぬまで使えるし";
		mes "スキルレベルが高いほど、";
		mes "物を高く売ることができる。^000000";
		next;
		if(getskilllv(38) < 4) {
			mes "[ガーニン]";
			mes "重要なスキルだから、ある程度";
			mes "しっかりと覚えないとな……うーん。";
			mes "本当はLv10と言いたいところだが、";
			mes "Lv4まで習得してこい。";
			mes "それくらいならできるだろう。";
			next;
			mes "[ガーニン]";
			mes "次の講義は、";
			mes "この課題をこなしてからだ。";
			mes "じゃあ、頑張ってこいよ。";
			set QUE_MERCHANT,12;
			close;
		}
		mes "[ガーニン]";
		mes "そこで！　オーバーチャージを";
		mes "Lv4以上にしてこい！";
		mes "……と言おうと思ったが、";
		mes "もう習得しちまってるじゃないか。";
		if(getskilllv(38) >= 10) {
			mes "しかもLv10だし！　準備がいいな、";
			mes "このやろう。よし、これを受け取れ！";
			if(checkre())
				getexp 142,33;
			else
				getexp 1420,336;
		}
		else {
			mes "準備がいいな、このやろう。";
			mes "よし、これを受け取れ！";
			if(checkre())
				getexp 126,27;
			else
				getexp 1260,272;
		}
		set QUE_MERCHANT,13;
		next;
		mes "[ガーニン]";
		mes "次はプッシュカートについて";
		mes "講義してやろう。";
		mes "これも重要なスキルだから";
		mes "準備を怠るなよ！";
		mes "と言っても、重要じゃない";
		mes "スキルなんてないか……";
		close;
	case 12:
		mes "[ガーニン]";
		mes "どうだ。";
		mes "オーバーチャージを";
		mes "覚えてきたか？";
		next;
		if(getskilllv(38) < 4) {
			mes "[ガーニン]";
			mes "Lv4まで上げろと言ったのに、";
			mes "上げてないじゃないか！";
			mes "早く上げて来い!!";
			mes "言い訳は聞かないからな！";
			close;
		}
		if(getskilllv(38) >= 10) {
			mes "[ガーニン]";
			mes "うおっ!!";
			mes "オーバーチャージを";
			mes "Lv10までマスターしたのか!!";
			mes "よーしよしよしよし、";
			mes "マスターして損はないスキルだ。";
			mes "よし、これを受け取れ！";
			if(checkre())
				getexp 142,33;
			else
				getexp 1420,336;
		}
		else {
			mes "[ガーニン]";
			mes "よーしよし。";
			mes "オーバーチャージを";
			mes "Lv4以上にしてきたな。";
			mes "よくやった！　これを受け取れ！";
			if(checkre())
				getexp 126,27;
			else
				getexp 1260,272;
		}
		set QUE_MERCHANT,13;
		next;
		mes "[ガーニン]";
		mes "次はプッシュカートについて";
		mes "講義してやろう。";
		mes "これも重要なスキルだから";
		mes "準備を怠るなよ！";
		mes "と言っても、重要じゃない";
		mes "スキルなんてないか……";
		close;
	case 13:
		mes "[ガーニン]";
		mes "これから教えるスキル、";
		mes "^FF0000プッシュカート^000000は、";
		mes "所持限界量増加スキルをLv5まで";
		mes "習得すると覚えられるようになる。";
		next;
		mes "[ガーニン]";
		mes "これは、カートを装着して歩くことが";
		mes "できるようになるスキルで、";
		mes "Lv10まで修練することができる。";
		mes "カートには、アイテムを100種類まで、";
		mes "重量8000まで入れることができる。";
		next;
		mes "[ガーニン]";
		mes "カートは、街にいる^FF0000カプラ職員から、";
		mes "決まった金額でレンタルできる。^000000";
		mes "特にレンタル期間とかはないから、";
		mes "あんまり心配するな。";
		next;
		mes "[ガーニン]";
		mes "但し、このプッシュカートには、";
		mes "凄まじい短所がある。";
		mes "それは……^FF0000カートを装着していると";
		mes "移動速度が半分近くに";
		mes "落ちてしまうんだ!!^000000";
		next;
		mes "[ガーニン]";
		mes "ただ、^FF0000スキルレベルを上げれば、";
		mes "少しずつ移動速度は上がる。";
		mes "Lv10まで上げれば、";
		mes "元の移動速度に戻る。^000000";
		mes "だから、Lv10まで上げるのが、";
		mes "ほぼ必須のスキルだな。";
		next;
		if(getskilllv(39) < 4) {
			mes "[ガーニン]";
			mes "そこで課題だ！";
			mes "プッシュカートを";
			mes "完璧にマスターしてこい！";
			mes "……ってのはさすがに酷だから";
			mes "Lv4くらいでいいか。";
			mes "プッシュカートをLv4以上にしてこい！";
			set QUE_MERCHANT,14;
			close;
		}
		if(getskilllv(39) >= 10) {
			mes "[ガーニン]";
			mes "もう何も言うことないな。";
			mes "Lv10までマスターしてるじゃないか！";
			mes "よし、これを受け取れ！";
			if(checkre())
				getexp 186,60;
			else
				getexp 1860,602;
		}
		else {
			mes "[ガーニン]";
			mes "ほお、もうプッシュカートを";
			mes "習得してるじゃないか。";
			mes "それくらいだと、まだ移動速度に";
			mes "不満があるだろうが、";
			mes "まあ何とかなるだろう。";
			mes "よし、これを受け取れ！";
			if(checkre())
				getexp 162,52;
			else
				getexp 1620,520;
		}
		set QUE_MERCHANT,15;
		next;
		mes "[ガーニン]";
		mes "次は、露店開設スキルについて";
		mes "講義しよう。準備ができたら、";
		mes "話しかけてくれ。";
		close;
	case 14:
		mes "[ガーニン]";
		mes "プッシュカートをLv4まで";
		mes "覚えてきたか？";
		next;
		if(getskilllv(39) < 4) {
			mes "[ガーニン]";
			mes "おいおい、何してたんだ？";
			mes "ちっとも上がってないじゃないか。";
			mes "いいか、プッシュカートLv4で";
			mes "いいんだからな。";
			mes "よし、さっさと行ってこい！";
			close;
		}
		if(getskilllv(39) >= 10) {
			mes "[ガーニン]";
			mes "Lv4までって言ったのに、";
			mes "マスターしてきちまったのか！";
			mes "くぅ～～～！";
			mes "感無量とはこのことだね!!";
			mes "上等上等！";
			if(checkre())
				getexp 142,33;
			else
				getexp 1420,336;
		}
		else {
			mes "[ガーニン]";
			mes "よしよし、よくやった。";
			mes "飲み込みも実行も早いのはいいことだ。";
			mes "これを受け取れ！";
			if(checkre())
				getexp 126,27;
			else
				getexp 1260,272;
		}
		set QUE_MERCHANT,15;
		next;
		mes "[ガーニン]";
		mes "次は、露店開設スキルについて";
		mes "講義しよう。準備ができたら、";
		mes "話しかけてくれ。";
		close;
	case 15:
		mes "[ガーニン]";
		mes "これで、最後のマーチャント講義だ。";
		mes "だがな、これが終わっても、";
		mes "マーチャントの全てが";
		mes "解るわけじゃない。";
		mes "マーチャントは理論だけで済む";
		mes "職業じゃないんだ。";
		next;
		mes "[ガーニン]";
		mes "経験を積み、商品の流通を理解してこそ";
		mes "真のマーチャントだ。";
		mes "いいか、マーチャントは";
		mes "理論のみにあらずだ。";
		next;
		mes "[ガーニン]";
		mes "でも、理論を知っておいて損はない。";
		mes "露店開設について教えるから";
		mes "ちゃんと聞けよ。";
		next;
		mes "[ガーニン]";
		mes "このスキルはその名のごとく、";
		mes "露店を開設できるようになる";
		mes "アクティブスキルだ。";
		next;
		mes "[ガーニン]";
		mes "そこら辺でボケっとつっ立ってる";
		mes "商人どもとは違うぞ。";
		mes "自ら店を構え、己の経験と";
		mes "商売感覚が物を言う、";
		mes "これぞ真の商売だ！";
		next;
		mes "[ガーニン]";
		mes "但し、露店を開くには、";
		mes "露店開設スキルだけじゃ駄目だ。";
		mes "商品を入れておくカートが必要だ。";
		mes "ああ、一応言っとくが、";
		mes "カートに入ってるものしか、";
		mes "客は見ないぞ。";
		next;
		mes "[ガーニン]";
		mes "つまり、カートが必須ってことは、";
		mes "プッシュカートも必要なわけだ。";
		mes "まあ、ある程度、";
		mes "プッシュカートを修練しないと";
		mes "露店開設は覚えられないしな。";
		next;
		mes "[ガーニン]";
		mes "さて、露店で物を売る際の";
		mes "値段設定だが、上限は";
		mes "99,990,000zeny。";
		mes "それ以上は無理だ。覚えとけ！";
		next;
		mes "[ガーニン]";
		mes "じゃあ、話を戻すが、";
		mes "露店開設はLv10まで修練が可能だ。";
		mes "そして、スキルレベルを上げる度に";
		mes "露店で販売できる品数が増える。";
		next;
		mes "[ガーニン]";
		mes "覚えたては3種類しか";
		mes "売ることができない。";
		mes "だが、そこから一つずつ増やせるから";
		mes "必要な分だけレベルを";
		mes "上げるといいだろう。";
		next;
		if(getskilllv(41) < 4) {
			mes "[ガーニン]";
			mes "それじゃあ、最後の課題だ。";
			mes "露店開設スキルを";
			mes "Lv4以上にしてこい。";
			mes "プレゼントも用意してやるから";
			mes "真面目にやってこいよ。";
			set QUE_MERCHANT,16;
			close;
		}
		mes "[ガーニン]";
		mes "おおお?!";
		if(getskilllv(41) >= 10) {
			mes "お前、もう露店開設を";
			mes "完璧にマスターしてるじゃないか！";
			mes "感心、感心、感心！　ワハハッ!!";
			mes "これを受け取れ！";
			if(checkre())
				getexp 199,69;
			else
				getexp 1990,699;
		}
		else {
			mes "お前、もう露店開設をけっこう";
			mes "習得してるじゃないか。";
			mes "感心、感心！";
			mes "これを受け取れ！";
			if(checkre())
				getexp 186,60;
			else
				getexp 1860,604;
		}
		set QUE_MERCHANT,17;
		next;
		mes "[ガーニン]";
		mes "これで、マーチャントの";
		mes "理論講義は終了だ。";
		mes "前にも言ったが、";
		mes "マーチャントは理論だけじゃない。";
		mes "自分の足で稼がなきゃならないことが";
		mes "たくさんある。";
		next;
		mes "[ガーニン]";
		mes "いつでも、客の心情ってやつを見て";
		mes "必要とされている品を、";
		mes "リーズナブルな価格で提供する。";
		mes "そして忘れちゃいけないのが、金だ！";
		mes "^FF0000金！　金！　金が全て！^000000";
		mes "絶対に忘れるな！";
		next;
		mes "[ガーニン]";
		mes "いいか、これからはお前の時代だ。";
		mes "じゃんじゃん稼げ！";
		next;
		mes "[ガーニン]";
		mes "また何か教えることでもできたら、";
		mes "講義してやるかもしれないな。";
		mes "それじゃあ、頑張れよ～！";
		close;
	case 16:
		mes "[ガーニン]";
		mes "おうよ。";
		mes "露店開設を、";
		mes "どれくらい覚えてきた？";
		next;
		if(getskilllv(41) < 4) {
			mes "[ガーニン]";
			mes "まだまだだな。";
			mes "さっさと終わらせて、";
			mes "俺に最後の褒め言葉を言わせてくれや。";
			close;
		}
		mes "[ガーニン]";
		mes "おう、頑張ったな。";
		if(getskilllv(41) >= 10) {
			mes "こんなに頑張っちまったら、";
			mes "文句のつけようがないじゃないか。";
			mes "ここまで、よくやった。";
			mes "これは、約束のもんだ。";
			if(checkre())
				getexp 199,69;
			else
				getexp 1990,699;
		}
		else {
			mes "ここまで、よくやった。";
			mes "これは、最後のプレゼントだ。";
			if(checkre())
				getexp 186,60;
			else
				getexp 1860,604;
		}
		set QUE_MERCHANT,17;
		next;
		mes "[ガーニン]";
		mes "これで、マーチャントの";
		mes "理論講義は終了だ。";
		mes "前にも言ったが、";
		mes "マーチャントは理論だけじゃない。";
		mes "自分の足で稼がなきゃならないことが";
		mes "たくさんある。";
		next;
		mes "[ガーニン]";
		mes "いつでも、客の心情ってやつを見て";
		mes "必要とされている品を、";
		mes "リーズナブルな価格で提供する。";
		mes "そして忘れちゃいけないのが、金だ！";
		mes "^FF0000金！　金！　金が全て！^000000";
		mes "絶対に忘れるな！";
		next;
		mes "[ガーニン]";
		mes "いいか、これからはお前の時代だ。";
		mes "じゃんじゃん稼げ！";
		next;
		mes "[ガーニン]";
		mes "また何か教えることでもできたら、";
		mes "講義してやるかもしれないな。";
		mes "それじゃあ、頑張れよ～！";
		close;
	case 17:
		mes "[ガーニン]";
		mes "いいか、この広い大陸にいる";
		mes "誰もがお客様だ。";
		mes "だがな、その客とどう付き合うかは";
		mes "お前次第だってこと、忘れんなよ。";
		close;
	}
	//所持限界量増加続き
	next;
	mes "[ガーニン]";
	mes "よし、所持限界量増加が";
	mes "Lv3以上だから、スキルウィンドウに";
	mes "^FF0000ディスカウント^000000という";
	mes "スキルがあるだろう。";
	mes "確認してみろ。";
	next;
	mes "[ガーニン]";
	mes "このスキルについての講義は、";
	mes "ちょっと後にして……";
	mes "所持限界量増加以外の";
	mes "初期段階から習得可能な";
	mes "スキルについて説明するとしよう。";
	next;
	mes "[ガーニン]";
	mes "まず、^FF0000アイテム鑑定^000000だ。";
	mes "これは、マーチャントになると";
	mes "すぐにでも覚えられる基本スキルだ。";
	mes "このスキルを覚えると、";
	mes "^FF0000未鑑定アイテムの";
	mes "正体を調べられるようになる。^000000";
	next;
	mes "[ガーニン]";
	mes "^FF0000拡大鏡^000000ってアイテムが";
	mes "あるじゃないか。まさしくそれ！";
	mes "拡大鏡を買う手間と金が惜しいなら、";
	mes "このスキルはかなり重宝するだろう！";
	mes "^FF0000それに、Lv1だけで完璧に";
	mes "マスター^000000できる。何て便利なんだ！";
	next;
	if(getskilllv(40)) {
		mes "[ガーニン]";
		mes "がーん。もうアイテム鑑定を";
		mes "習得してるじゃないか。";
		mes "うん、その姿勢はよい！";
		mes "せっかくだからプレゼントだ。";
		mes "受け取れ！";
		set QUE_MERCHANT,2;
		if(checkre())
			getexp 58,4;
		else
			getexp 585,43;
		getitem 1351,1;
		next;
	}
	mes "[ガーニン]";
	mes "次はメマーナイトについて講義しよう。";
	mes "それまで、ちょっと休憩！";
	mes "お前も、お茶でも飲んでこい。";
	next;
	mes "[ガーニン]";
	mes "何？　ディスカウントについては、";
	mes "いつ教えてもらえるかって？";
	mes "そう急ぐな！";
	mes "まずはメマーナイトからだ。";
	set QUE_MERCHANT,2;
	close;
}

prontera.gat,66,111,3	script	セイジ	82,{
	switch(QUE_MERCHANT) {
	case 6:
		set '@price,390;
		break;
	case 7:
		set '@price,410;
		break;
	case 8:
		set '@price,420;
		break;
	default:
		mes "[セイジ]";
		mes "最近、キレイなお姉さん達を雇ってる";
		mes "カプ……何だっけ？　まあ、いいや。";
		mes "その会社のライバル会社が";
		mes "大きくなってきてて、";
		mes "カプ何とかが、かなり";
		mes "心配しているらしいんだ。";
		next;
		mes "[セイジ]";
		mes "でも、僕達みたいなのが";
		mes "気にする必要はないか。";
		mes "特に何か変わるわけじゃないし。";
		close;
	}
	mes "[セイジ]";
	mes "そこの方！";
	mes "赤ポーションはいかが？";
	mes "旅の必需品！";
	mes "これなしの旅行は危険だよ！";
	mes "他色のポーションもあるけど";
	mes "基本はこれだよね！";
	next;
	mes "[セイジ]";
	mes "10個、^FF0000" +'@price+ "zeny^000000だよ。";
	mes "どうだい、安いだろう。";
	mes "悩むまでもないね！";
	next;
	if(select("買う","買わない")==2) {
		mes "[セイジ]";
		mes "お買い得だよ？";
		mes "理解できないな～。";
		close;
	}
	mes "[セイジ]";
	mes "よっ、お客さん、見る目があるね！";
	mes "はい、赤ポーション10個。";
	mes "大事に使ってね。";
	if(Zeny < '@price) {
		next;
		mes "[セイジ]";
		mes "待った！　お金が足りないよ。";
		mes "ちゃんとお金を用意してから";
		mes "来て欲しいな。";
		close;
	}
	if(checkweight(501,10) == 0) {
		next;
		mes "[セイジ]";
		mes "……と言おうと思ったけど、";
		mes "荷物持ちすぎだよ。";
		mes "少し荷物を減らしてきてくれるかい？";
		close;
	}
	set Zeny,Zeny-'@price;
	set QUE_MERCHANT,('@price == 390)? 10: 9;
	getitem 501,10;
	close;
}

prontera.gat,93,330,3	script	ケリーゼ	97,{
	switch(QUE_MERCHANT) {
	case 6:
		set '@price,400;
		break;
	case 7:
		set '@price,390;
		break;
	case 8:
		set '@price,340;
		break;
	default:
		mes "[ケリーゼ]";
		mes "そういえば、最近王宮で何か";
		mes "起こっているらしいです。";
		mes "誰かがしきりに叫んでいるとか？";
		mes "私も詳しくは知らないのですが。";
		mes "何か起こっているのは確かです。";
		close;
	}
	mes "[ケリーゼ]";
	mes "私は赤ポーションを10個ずつ";
	mes "売っています。";
	mes "えーと、" +'@price+ "zenyなんですが。";
	mes "買いますか？";
	next;
	if(select("買う","買わない")==2) {
		mes "[ケリーゼ]";
		mes "そうですか。";
		mes "それは残念です。";
		close;
	}
	mes "[ケリーゼ]";
	mes "よい買い物をしましたね。";
	if(Zeny < '@price) {
		next;
		mes "[ケリーゼ]";
		mes "おや、お金が足りませんよ。";
		mes "お金がない方に、大事な商品を";
		mes "売ることはできません。";
		close;
	}
	if(checkweight(('@price == 340)? 569: 501,10) == 0) {
		next;
		mes "[ケリーゼ]";
		mes "おや、荷物が重そうですね。";
		mes "それでは、これ以上の荷物を";
		mes "持つことができないでしょう。";
		mes "少し荷物を減らしてきてください。";
		close;
	}
	set Zeny,Zeny-'@price;
	set QUE_MERCHANT,('@price == 390)? 10: 9;
	getitem ('@price == 340)? 569: 501,10;
	close;
}

prt_in.gat,169,11,3	script	アダ	92,{
	switch(QUE_MERCHANT) {
	case 6:
		set '@price,340;
		break;
	case 7:
		set '@price,420;
		break;
	case 8:
		set '@price,390;
		break;
	default:
		mes "[アダ]";
		mes "いつも変わらず頼れるのは";
		mes "お金だけです。";
		mes "いつも裏切らないのはお金です。";
		mes "それが現実です。";
		close;
	}
	mes "[アダ]";
	mes "こんにちは。";
	mes "私はあるやんごとなき事情で、";
	mes "赤ポーションを売っております。";
	mes "赤ポーション10個で" +'@price+ "zenyです。";
	mes "買ってくれませんか？";
	next;
	if(select("買う","買わない")==2) {
		mes "[アダ]";
		mes "そうですか、仕方がないですね……";
		mes "さようなら。";
		close;
	}
	mes "[アダ]";
	mes "感謝します。";
	mes "本当に……";
	if(Zeny < '@price) {
		next;
		mes "[アダ]";
		mes "お金が足りないようですよ。";
		mes "私にも事情がありますので、";
		mes "ただで商品を差し上げるわけには";
		mes "いかないのです。お金を準備してから";
		mes "再度いらしてください。";
		close;
	}
	if(checkweight(('@price == 340)? 569: 501,10) == 0) {
		next;
		mes "[アダ]";
		mes "荷物を持ちすぎですわ。";
		mes "それでは、私の赤ポーションを";
		mes "持つこともままならないかと。";
		mes "荷物を減らしてきていただけませんか。";
		close;
	}
	set Zeny,Zeny-'@price;
	set QUE_MERCHANT,('@price == 390)? 10: 9;
	getitem ('@price == 340)? 569: 501,10;
	close;
}

prontera.gat,247,129,3	script	ゼイオン	85,{
	switch(QUE_MERCHANT) {
	case 6:
	case 8:
		set '@price,410;
		break;
	case 7:
		set '@price,400;
		break;
	default:
		mes "[ゼイオン]";
		mes "ジュノーは、こことはかなり";
		mes "雰囲気の異なる場所らしいですね。";
		mes "観光には向いてなさそうですが、";
		mes "一度行ってみる価値は";
		mes "あると思いますよ。";
		close;
	}
	mes "[ゼイオン]";
	mes "市場を調べれば、";
	mes "答えはおのずと明らかです。";
	mes "赤ポーション10個で" +'@price+ "zeny！";
	next;
	if(select("買う","買わない")==2) {
		mes "[ゼイオン]";
		mes "残念です。";
		close;
	}
	mes "[ゼイオン]";
	mes "あの世に行っても、安く買ったと";
	mes "胸を張れるお買い物ですよ。";
	if(Zeny < '@price) {
		next;
		mes "[ゼイオン]";
		mes "駄目ですよ。";
		mes "お金が不足しています。";
		mes "ビタ一文まけられませんからね。";
		close;
	}
	if(checkweight(501,10) == 0) {
		next;
		mes "[ゼイオン]";
		mes "荷物を持ちすぎです。";
		mes "少し荷物を減らしてこないと";
		mes "売ることはできませんね。";
		close;
	}
	set Zeny,Zeny-'@price;
	set QUE_MERCHANT,9;
	getitem 501,10;
	close;
}

prt_in.gat,251,129,3	script	マオス	709,{
	switch(QUE_MERCHANT) {
	case 6:
		set '@price,400;
		break;
	case 7:
		set '@price,340;
		break;
	case 8:
		set '@price,420;
		break;
	default:
		mes "[マオス]";
		mes "はぁ～、生活が苦しいよ……";
		mes "あいつ、あの世にお金を";
		mes "持っていけないからって、";
		mes "今、あんなにお金を";
		mes "使うことないじゃないか……";
		close;
	}
	mes "[マオス]";
	mes "何も言わないでください。";
	mes "赤ポーション10個必要なのでしょう！";
	mes "ふふ、全て分かっています。";
	mes "どうです、赤ポーション10個で";
	mes '@price+ "zeny！　さぁ！";
	next;
	if(select("買う","買わない")==2) {
		mes "[マオス]";
		mes "もったいない！";
		mes "しかし、強要もできませんね。";
		mes "仕方ありません。";
		close;
	}
	mes "[マオス]";
	mes "賢明な選択です！";
	if(Zeny < '@price) {
		next;
		mes "[マオス]";
		mes "しかーし！";
		mes "お金が足りません。";
		mes "お金がないなら売ることは";
		mes "できませんね。";
		close;
	}
	if(checkweight(('@price == 340)? 569: 501,10) == 0) {
		next;
		mes "[マオス]";
		mes "しかーし！";
		mes "荷物を持ちすぎです。";
		mes "荷物を減らさなければ、";
		mes "それ以上、物は持てないでしょう。";
		close;
	}
	set Zeny,Zeny-'@price;
	set QUE_MERCHANT,9;
	getitem ('@price == 340)? 569: 501,10;
	close;
}
