//= Auriga Script ==============================================================
// Ragnarok Online Artifacts of Gods Script by refis
//= Registry ===================================================================
// $GodSleipnir     -> 1次クエ通過人数
// $GodMagingiorde  -> 2次クエ通過人数
// $GodBrysinggamen -> 3次クエ通過人数
// $GodMjolnir      -> 4次クエ通過人数
//==============================================================================

//============================================================
// warp
//------------------------------------------------------------
yuno.gat,218,180,0		warp	quegod1001	1,1,que_god01.gat,99,84
que_god01.gat,99,81,0	warp	quegod1002	1,1,yuno.gat,218,177
que_god01.gat,63,88,0	warp	quegod1003	1,1,que_god01.gat,87,92
que_god01.gat,62,116,0	warp	quegod1004	1,1,que_god01.gat,46,94
que_god01.gat,12,116,0	warp	quegod1005	1,1,que_god01.gat,16,94
que_god01.gat,12,55,0	warp	quegod1006	1,1,que_god01.gat,17,83
que_god01.gat,50,55,0	warp	quegod1007	1,1,que_god01.gat,47,83

//============================================================
// 神器1次 スレイプニールの封印クエスト
//- Registry -------------------------------------------------
// GOD_1QUE -> 0～51
//------------------------------------------------------------
yuno.gat,164,200,4	script	住民	101,{
	if($GodSleipnir >= 100 || BaseLevel < 70) {
		mes "[ノイ]";
		mes "防具と一口に言っても二種類あります。";
		mes "一つは街の商人から購入できる物、";
		mes "もう一つはモンスターを倒して得られる物です。";
		next;
		mes "[ノイ]";
		mes "これらに性能の差は基本的に";
		mes "ありません。でもスロットの数に";
		mes "差があります。";
		next;
		mes "[ノイ]";
		mes "スロットですか？";
		mes "スロットは「カード」を挿す場所の";
		mes "ことです。ちなみにカードを挿した";
		mes "防具は特殊な効果を持ちます。";
		next;
		mes "[ノイ]";
		mes "しかし、スロット数が通常より多い";
		mes "防具とカードは、いずれもモンスター";
		mes "からしか入手することができません。";
		mes "だから、この二つを組み合わせての";
		mes "使用となると、けっこう難しいですね。";
		close;
	}
	mes "[ノイ]";
	mes "そうそう、前から気になっている場所が";
	mes "あります。そこは研究所のようですが、";
	mes "何を研究しているかは判りません。";
	next;
	mes "[ノイ]";
	mes "最近、そこを通りがかったのですが";
	mes "何かドタバタと騒がしかったです。";
	mes "本当に不思議な所です。";
	mes "何をしているのでしょうね？";
	if(GOD_1QUE == 0)
		set GOD_1QUE,1;
	close;
}

que_god01.gat,98,98,4	script	管理人	69,{
	if(checkitemblank() == 0) {
		mes "- 所持アイテムの種類数が -";
		mes "- 多いため、アイテムを受けとる -";
		mes "- ことができません。 -";
		mes "- 所持アイテムを減らしてから -";
		mes "- 再度話しかけてください。 -";
		close;
	}
	if(MaxWeight - Weight < 5000) {
		mes "- 所持重量が多いため、アイテムを -";
		mes "- 受けとることができません。 -";
		mes "- 所持アイテムを減らしてから -";
		mes "- 再度話しかけてください。 -";
		close;
	}
	cutin "god_kukur01",2;
	if($GodSleipnir >= 100) {		// 定員割れ
		if(GOD_1QUE == 0) {
			cutin "god_kukur03",2;
			mes "[ククル]";
			mes "あ～、最近、何でこんなに";
			mes "忙しいのかしら……";
			mes "デートする暇さえないわ。";
			mes "はぁ～……";
			next;
			mes "[ククル]";
			mes "最後にデートしたのはいつだっけ？";
			mes "うーん……";
			mes "はっ……あれをやんなきゃ！";
			mes "あ～、忙しい忙しい～！";
			emotion 19;
		}
		else if(GOD_1QUE < 51) {
			cutin "god_kukur03",2;
			mes "[ククル]";
			mes "あら、こんにちは。";
			mes "手伝ってくださって";
			mes "ありがとうございます。";
			mes "他のお手伝いの方も頑張ってくださる";
			mes "ので、たまっていた仕事が大分";
			mes "片付きました。";
			next;
			mes "[ククル]";
			mes "おかげさまで研究も着々と";
			mes "進んでいます。引き続きよろしく";
			mes "お願いします。";
		}
		else {
			cutin "god_kukur02",2;
			mes "[ククル]";
			mes "手伝ってくださったおかげで";
			mes "基本研究は無事に終了しました。";
			mes "今は次の研究の準備中なので";
			mes "そんなに忙しくはありません。";
			mes "おかげさまでデートも……";
			mes "ほほほっ……";
		}
		close2;
		cutin "god_kukur01",255;
		end;
	}
	// 受付中
	if(GOD_1QUE == 0 || BaseLevel < 70) {
		cutin "god_kukur03",2;
		mes "[ククル]";
		mes "あ～、最近、何でこんなに";
		mes "忙しいのかしら……";
		mes "デートする暇さえないわ。";
		mes "はぁ～……";
		next;
		mes "[ククル]";
		mes "最後にデートしたのはいつだっけ？";
		mes "うーん……";
		mes "はっ……あれをやんなきゃ！";
		mes "あ～、忙しい忙しい～！";
		emotion 19;
		close2;
		cutin "god_kukur01",255;
		end;
	}
	switch(GOD_1QUE) {
	case 1:
		mes "[ククル]";
		mes "当研究所は、はるか昔の神々";
		mes "について研究しています。";
		mes "もう少し具体的に言いますと";
		mes "神の力、道具についての研究です。";
		next;
		mes "[ククル]";
		mes "ところが最近、一般研究員の";
		mes "ほとんどが、個人的事情で";
		mes "欠勤や退職してしまって……";
		mes "急に人手不足になってしまったのです。";
		next;
		mes "[ククル]";
		mes "研究は今、一番忙しい時期に";
		mes "さしかかっています。";
		mes "でも、このままでは大部分の研究を";
		mes "中止にせざるを得ません……";
		next;
		mes "[ククル]";
		mes "もしお時間がありましたら";
		mes "当研究所の仕事を手伝って";
		mes "いただけませんか？";
		mes "もちろんお礼ははずみます。";
		mes "ぜひ、よろしくお願いします。";
		next;
		if(select("ちょっと用事がありますので……","いいですよ、手伝います") == 1) {
			mes "[ククル]";
			mes "あ……そうですか……";
			mes "用事があるなら仕方ないですね……";
			mes "もしお知り合いでお手すきの方が";
			mes "いらっしゃったら、私どもに紹介して";
			mes "いただけません？";
			next;
			mes "[ククル]";
			mes "人手が足りないのはどうにも";
			mes "ならなくて……ぜひお願いします！";
			close2;
			cutin "god_kukur01",255;
			end;
		}
		cutin "god_kukur02",2;
		mes "[ククル]";
		mes "わぁ～！　本当ですか？";
		mes "助かります～。";
		mes "これで大分楽になります。";
		mes "それではよろしくお願いします。";
		next;
		mes "[ククル]";
		mes "研究員はこの中にいます。";
		mes "直接行って、お手伝いをしてください。";
		next;
		mes "[ククル]";
		mes "それから……";
		mes "これが研究所臨時職員証です。";
		mes "頑張ってくださいね。";
		next;
		mes "- ^ff0000研究所臨時職員証^000000 -";
		mes "- をもらいました。 -";
		set GOD_1QUE,2;
		close2;
		cutin "god_kukur01",255;
		end;
	case 50:
		cutin "god_kukur02",2;
		mes "[ククル]";
		mes "わぁ～、本当に助かりました～。";
		mes "一時はどうなることかと思いましたが";
		mes "おかげさまで何とかなりそうです。";
		next;
		mes "[ククル]";
		mes "多分、お気づきになったでしょうが";
		mes "私どもの研究対象は「スレイプニール」";
		mes "です。この様な「神器アイテム」を";
		mes "果たして人間の手で作り出すことが";
		mes "できるのか？　それが当研究の";
		mes "目的です。";
		next;
		mes "[ククル]";
		mes "しかし……現段階では";
		mes "「神器アイテム」の製造は";
		mes "かなり困難との結論です。";
		mes "はぁ～……";
		next;
		mes "[ククル]";
		mes "それでも、引き続き「スレイプニール」";
		mes "の様な「神器アイテム」の製造方法を";
		mes "研究し続けようと思います。";
		mes "可能性がゼロではありませんしね。";
		next;
		mes "[ククル]";
		mes "手伝ってくださったおかげで";
		mes "基本研究は無事に終了しました。";
		mes "今は次の研究の準備中なので";
		mes "そんなに忙しくはありません。";
		next;
		mes "[ククル]";
		mes "あ、お礼をしなければなりませんね。";
		mes "少々お待ちください……";
		next;
		mes "[ククル]";
		mes "こちらになります。";
		mes "大したものじゃありませんが、";
		mes "お礼として受け取ってください。";
		mes "それではよいご旅行を。";
		if($GodSleipnir < 100) {		// 受付中
			set $GodSleipnir,$GodSleipnir+1;
			if($GodSleipnir == 50) {
				announce "◆◆大陸に[スレイプニール]の封印が姿を現しました。◆◆",0;
			}
			else if($GodSleipnir == 100) {
				if($GodSleipnir == 100 && $GodMagingiorde == 100 && $GodBrysinggamen == 100 && $GodMjolnir == 100)
					announce "◆◆[スレイプニール]の封印が解けたことにより全ての封印が解け、神器の作成ができるようになりました。◆◆",0;
				else
					announce "◆◆[スレイプニール]の封印が解けました。◆◆",0;
			}
		}
		set GOD_1QUE,51;
		set '@val1,rand(1,900);
		set '@val2,rand(1,1000);
		if('@val1 < 101) {
			if('@val2 < 210)
				getitem 2102,1;	// sガード
			else if('@val2 < 420)
				getitem 2104,1;	// sバックラー
			else if('@val2 < 630)
				getitem 2106,1;	// sシールド
			else if('@val2 < 840)
				getitem 2108,1;	// sミラーシールド
			else
				getitem 2109,1;	// メモライズブック
		}
		else if('@val1 < 201) {
			if('@val2 < 48)
				getitem 2207,1;	// 装飾用花
			else if('@val2 < 96)
				getitem 2210,1;	// ヘアバンド
			else if('@val2 < 150)
				getitem 2213,1;	// 猫耳のヘアバンド
			else if('@val2 < 190)
				getitem 2215,1;	// 花のヘアバンド
			else if('@val2 < 238)
				getitem 2217,1;	// sビレタ
			else if('@val2 < 290)
				getitem 2223,1;	// s丸いぼうし
			else if('@val2 < 340)
				getitem 2227,1;	// sキャップ
			else if('@val2 < 348)
				getitem 2229,1;	// sヘルム
			else if('@val2 < 400)
				getitem 2231,1;	// sジュエルヘルム
			else if('@val2 < 448)
				getitem 2233,1;	// sサークレット
			else if('@val2 < 496)
				getitem 2236,1;	// サンタのぼうし
			else if('@val2 < 544)
				getitem 2244,1;	// 大きなリボン
			else if('@val2 < 592)
				getitem 2245,1;	// スイートジェントル
			else if('@val2 < 640)
				getitem 2247,1;	// オールドスターロマンス
			else if('@val2 < 688)
				getitem 2248,1;	// ウェスタングレイス
			else if('@val2 < 736)
				getitem 2250,1;	// リボンのヘアバンド
			else if('@val2 < 784)
				getitem 2251,1;	// 聖職者の帽子
			else if('@val2 < 832)
				getitem 2252,1;	// ウィザードハット
			else if('@val2 < 880)
				getitem 2253,1;	// 装飾用ひまわり
			else if('@val2 < 940)
				getitem 2257,1;	// 真っ白いツノ
			else
				getitem 2259,1;	// プロペラ
		}
		else if('@val1 < 301) {
			if('@val2 < 160)
				getitem 2267,1;	// タバコ
			else if('@val2 < 320)
				getitem 2262,1;	// ピエロの鼻
			else if('@val2 < 480)
				getitem 2263,1;	// 義賊の眼帯
			else if('@val2 < 540)
				getitem 2265,1;	// デモ用のマスク
			else if('@val2 < 700)
				getitem 2266,1;	// アイアンケイン
			else if('@val2 < 800)
				getitem 2260,1;	// ミニグラス
			else if('@val2 < 900)
				getitem 2269,1;	// 花びら
			else
				getitem 2270,1;	// 草の葉
		}
		else if('@val1 < 401) {
			if('@val2 < 70)
				getitem 2298,1;	// 緑の觸角
			else if('@val2 < 140)
				getitem 2275,1;	// バンダナ
			else if('@val2 < 210)
				getitem 2276,1;	// 睨む目
			else if('@val2 < 280)
				getitem 2277,1;	// 看護帽
			else if('@val2 < 350)
				getitem 2279,1;	// 導火線
			else if('@val2 < 420)
				getitem 2282,1;	// 魂のリング
			else if('@val2 < 490)
				getitem 2299,1;	// オーク族のヘルム
			else if('@val2 < 560)
				getitem 2287,1;	// 海賊の頭巾
			else if('@val2 < 630)
				getitem 2289,1;	// あれ
			else if('@val2 < 700)
				getitem 2290,1;	// 葬式用の帽子
			else if('@val2 < 770)
				getitem 2291,1;	// 蝶の仮面
			else if('@val2 < 840)
				getitem 2294,1;	// スターダスト
			else if('@val2 < 900)
				getitem 2295,1;	// 目隠し
			else if('@val2 < 950)
				getitem 2271,1;	// 頭眼鏡
			else
				getitem 2285,1;	// 名射手のりんご
		}
		else if('@val1 < 501) {
			if('@val2 < 80)
				getitem 2306,1;	// sアドベンチャースーツ
			else if('@val2 < 160)
				getitem 2308,1;	// sメントル
			else if('@val2 < 240)
				getitem 2310,1;	// sロングコート
			else if('@val2 < 320)
				getitem 2311,1;	// ミンクのコート
			else if('@val2 < 400)
				getitem 2313,1;	// sアーマー
			else if('@val2 < 480)
				getitem 2315,1;	// sメイル
			else if('@val2 < 560)
				getitem 2329,1;	// sウドゥンメイル
			else if('@val2 < 630)
				getitem 2320,1;	// フォーマルスーツ
			else if('@val2 < 700)
				getitem 2322,1;	// sシルクローブ
			else if('@val2 < 760)
				getitem 2324,1;	// sスケーピューラ
			else if('@val2 < 810)
				getitem 2326,1;	// sセイントローブ
			else if('@val2 < 850)
				getitem 2317,1;	// sプレート
			else if('@val2 < 900)
				getitem 2331,1;	// sタイツ
			else if('@val2 < 950)
				getitem 2333,1;	// sシルバーローブ
			else
				getitem 2336,1;	// sシーフクロース
		}
		else if('@val1 < 601) {
			if('@val2 < 200)
				getitem 2402,1;	// sサンダル
			else if('@val2 < 400)
				getitem 2404,1;	// sシューズ
			else if('@val2 < 600)
				getitem 2406,1;	// sブーツ
			else if('@val2 < 800)
				getitem 2407,1;	// ガラスの靴
			else
				getitem 2409,1;	// ハイヒール
		}
		else if('@val1 < 701) {
			if('@val2 < 300)
				getitem 2502,1;	// sフード
			else if('@val2 < 550)
				getitem 2504,1;	// sマフラー
			else if('@val2 < 750)
				getitem 2506,1;	// sマント
			else
				getitem 2508,1;	// ぼろマント
		}
		else if('@val1 < 801) {
			if('@val2 < 110)
				getitem 2601,1;	// リング
			else if('@val2 < 220)
				getitem 2602,1;	// イヤリング
			else if('@val2 < 330)
				getitem 2603,1;	// ネックレス
			else if('@val2 < 440)
				getitem 2604,1;	// グローブ
			else if('@val2 < 550)
				getitem 2605,1;	// ブローチ
			else if('@val2 < 660)
				getitem 2607,1;	// クリップ
			else if('@val2 < 770)
				getitem 2608,1;	// ロザリー
			else if('@val2 < 880)
				getitem 2617,1;	// 神官の手袋
			else
				getitem 2618,1;	// マーターの首輪
		}
		else {
			if('@val2 < 150)
				getitem 2288,1;	// スクラッチマスク
			else if('@val2 < 260)
				getitem 2297,1;	// ゴブリン族の仮面
			else if('@val2 < 370)
				getitem 5087,1;	// ゴブリン四男の仮面
			else if('@val2 < 480)
				getitem 5088,1;	// ゴブリン三男の仮面
			else if('@val2 < 590)
				getitem 5089,1;	// ゴブリン五男の仮面
			else if('@val2 < 700)
				getitem 5090,1;	// ゴブリンリーダーの仮面
			else if('@val2 < 810)
				getitem 5046,1;	// ボンゴン帽
			else if('@val2 < 920)
				getitem 2264,1;	// ムナック帽
			else
				getitem 2225,1;	// sゴーグル
		}
		next;
		mes "[ククル]";
		mes "あ……";
		mes "臨時職員証は回収させて頂きますね。";
		mes "それでは。";
		close2;
		cutin "god_kukur01",255;
		end;
	default:
		if(GOD_1QUE < 10) {
			cutin "god_kukur03",2;
			mes "[ククル]";
			mes "研究所を運営するのはとても大変な";
			mes "ことです。他の研究所がうちの研究員を";
			mes "引き抜くために妨害してきたりと";
			mes "色々ありますからね……そのせいで";
			mes "私はデートすらできません。";
			mes "はぁ～……";
			next;
			cutin "god_kukur02",2;
			mes "[ククル]";
			mes "はっ……私、何を話して……";
			mes "い、今のは単なる独り言なので";
			mes "忘れてくださいね。";
			mes "ほほほっ……";
		}
		else if(GOD_1QUE < 50) {
			mes "[ククル]";
			mes "お手伝いありがとうございます。";
			mes "引き続きよろしくお願いします。";
			mes "研究員たちは皆忙しいので";
			mes "多少、きつい言い方をしてしまうかも";
			mes "しれません。でも、根はいい人ばかり";
			mes "なので、あまり気にしないでください。";
		}
		else {
			cutin "god_kukur02",2;
			mes "[ククル]";
			mes "手伝ってくださったおかげで";
			mes "基本研究は無事に終了しました。";
			mes "今は次の研究の準備中なので";
			mes "そんなに忙しくはありません。";
			mes "おかげさまでデートも……";
			mes "ほほほっ……";
		}
		close2;
		cutin "god_kukur01",255;
		end;
	}
}

que_god01.gat,84,95,0	script	スィッチ#1-1	111,{
	if(GOD_1QUE <= 1 || GOD_1QUE >= 51) {
		mes "- ドアに鍵がかかっている。 -";
		mes "- 周囲を見ると、ドアの右側に -";
		mes "- 何かの装置がある。その装置に -";
		mes "- 何かを触れさせれば、ドアが -";
		mes "- 開くだろう。 -";
		close;
	}
	set '@n,substr(strnpcinfo(2),0,1);
	mes "- ドアに鍵がかかっている。 -";
	mes "- 周囲を見ると、ドアの右側に -";
	mes "- 何かの装置がある。その装置に -";
	mes "- 臨時職員証を触れさせた。";
	mes "- ……ドアがあいた。 -";
	next;
	switch('@n) {
	case 1:
		warp "que_god01.gat",60,88;
		end;
	case 2:
		warp "que_god01.gat",62,119;
		end;
	case 3:
		warp "que_god01.gat",12,119;
		end;
	case 4:
		warp "que_god01.gat",12,52;
		end;
	case 5:
		warp "que_god01.gat",50,52;
		end;
	}
}
que_god01.gat,84,92,0	duplicate(スィッチ#1-1)	スィッチ#1-2	45,1,1
que_god01.gat,49,97,0	duplicate(スィッチ#1-1)	スィッチ#2-1	111
que_god01.gat,46,97,0	duplicate(スィッチ#1-1)	スィッチ#2-2	45,1,1
que_god01.gat,19,97,0	duplicate(スィッチ#1-1)	スィッチ#3-1	111
que_god01.gat,16,97,0	duplicate(スィッチ#1-1)	スィッチ#3-2	45,1,1
que_god01.gat,14,80,0	duplicate(スィッチ#1-1)	スィッチ#4-1	111
que_god01.gat,17,80,0	duplicate(スィッチ#1-1)	スィッチ#4-2	45,1,1
que_god01.gat,44,80,0	duplicate(スィッチ#1-1)	スィッチ#5-1	111
que_god01.gat,47,80,0	duplicate(スィッチ#1-1)	スィッチ#5-2	45,1,1

// メトの研究妨害クエスト
que_god01.gat,66,125,6	script	研究員	89,{
	if($GodSleipnir >= 100) {		// 定員割れ
		mes "[ハランドット]";
		mes "うん……";
		mes "そこはそうだから……";
		mes "ふうー……やはり一人だと大変だ。";
		mes "手伝ってくれる人がいると";
		mes "いいんだが……";
		next;
		mes "[ハランドット]";
		mes "仕事内容はその時々で変化する。";
		mes "だからその時ごとに必要な人材も";
		mes "変化する。";
		next;
		mes "[ハランドット]";
		mes "一つ例を挙げよう。";
		mes "「材料収集」をする時は";
		mes "体力派の手伝いが必要だ。";
		mes "しかし「データ分析」をする時は";
		mes "頭脳派の手伝いが必要になる。";
		next;
		mes "[ハランドット]";
		mes "つまり、全ての事に万能な人材もいいが";
		mes "仕事の特性に応じた人材を得ることも";
		mes "大事ってことだ。";
		close;
	}
	// 受付中
	if(GOD_1QUE == 2)
		set GOD_1QUE,11;
	if(GOD_1QUE == 11 || GOD_1QUE == 22 || GOD_1QUE == 33 || GOD_1QUE == 44) {
		switch(GOD_1QUE_SUB) {
		case 0:
			mes "[ハランドット]";
			mes "おや、君。";
			mes "ククルさんに頼まれた人か？";
			mes "ほう、仕事を手伝ってくれると。";
			mes "ふむ……";
			next;
			mes "[ハランドット]";
			mes "実のところ、研究に関しては専門知識が";
			mes "ない奴はいらない。だが、メイン";
			mes "研究員の支援など、細々とした雑用を";
			mes "こなす奴はいる。";
			next;
			mes "[ハランドット]";
			mes "何か仕事はあったかな……";
			mes "確かあったはずだが……";
			mes "うーん……あっ！";
			next;
			mes "[ハランドット]";
			mes "そうだ……";
			mes "^ff0000メト^000000に会ってきてくれないか？";
			mes "彼がどうしているか、ちょっと様子を";
			mes "見てきて欲しい。";
			next;
			mes "[ハランドット]";
			mes "彼と俺の研究分野はけっこう近いんだ。";
			mes "だから彼に余裕があったら、俺の研究を";
			mes "手伝ってもらえるかもしれない。";
			mes "確かジュノーにいるはず……";
			mes "行けばわかると思うよ。";
			set GOD_1QUE_SUB,1;
			close;
		case 1:
			if(YUNO_2QUE == 0) {	// メトの研究妨害クエスト
				mes "[ハランドット]";
				mes "まだ彼に会えないようだね……";
				mes "まあ、彼は少々気難しいし、いつも";
				mes "忙しいからね。でも俺とは気が合うし";
				mes "研究分野も近いから、よく話を";
				mes "していたんだ。これでもかなり";
				mes "親しいんだよ。";
				next;
				mes "[ハランドット]";
				mes "しばらく会っていないが、";
				mes "どうしているんだろうな。";
				mes "研究の状況や彼自身の様子など";
				mes "近況がちょっと知りたいんだ。";
				mes "それでは頼む。";
				close;
			}
			else if(YUNO_2QUE < 9) {
				mes "[ハランドット]";
				mes "うん……";
				mes "そうなのか……";
				mes "ちょっと動向が気になるな。";
				mes "悪い、もうちょっと彼と話してきて";
				mes "くれないか？";
				close;
			}
			else {
				mes "[ハランドット]";
				mes "うん？";
				mes "…………";
				mes "そんなことになるとは……";
				mes "そっか……";
				mes "ちょっと思いもしなかったな。";
				emotion 20;
				next;
				mes "[ハランドット]";
				mes "仕方ないよな……";
				mes "とにかくありがとう。";
				mes "少しの間、待つことにするよ。";
				mes "彼も色々あるだろうし。";
				emotion 9;
				set GOD_1QUE_SUB,2;
				close;
			}
		case 2:
			if(rand(10) != 7) {
				mes "[ハランドット]";
				mes "ああ、少し待ってくれ。";
				mes "ちょっと手が離せないんだ。";
				mes "うん……";
				mes "そこはそうで……";
				mes "ブツブツ……";
				close;
			}
			mes "[ハランドット]";
			mes "お……来たか……";
			mes "そうだな……";
			mes "わざわざ手伝ってくれたし";
			mes "俺の研究について少し話してやるか。";
			next;
			mes "[ハランドット]";
			mes "俺の研究分野は、";
			mes "「^ff0000スレイプニール^000000」の部品の一つ";
			mes "「^ff0000未知の歯車^000000」模様だ。";
			mes "見た目は普通の歯車と似ている。だが";
			mes "よく見てみると、仕組みが複雑すぎて";
			mes "その構造は……正直わからん。";
			next;
			mes "[ハランドット]";
			mes "「未知の歯車」模様は";
			mes "その名のごとくノコギリ型の輪だ。";
			mes "その模様自体も不思議なんだが";
			mes "一番不思議なのはその材質だ。";
			next;
			mes "[ハランドット]";
			mes "見た目からすると鋼鉄のようだが";
			mes "いくら高熱を加えても、全然変形";
			mes "しない。むろん逆に冷やしてもだ。";
			next;
			mes "[ハランドット]";
			mes "またどんな衝撃にも耐えるんだ。";
			mes "いくら強い衝撃を与えても";
			mes "全然破損した様子がない。";
			mes "小さな傷さえ見当たらない。";
			next;
			mes "[ハランドット]";
			mes "ところが他の物体と時たま";
			mes "共鳴することがある。しかし";
			mes "それは一定しないんだ。";
			next;
			mes "[ハランドット]";
			mes "一度共鳴した物体でも、再度反応を";
			mes "確認しようとすると、共鳴しない";
			mes "ことがある。うん……何か";
			mes "条件があるかもしれないがな。";
			next;
			mes "[ハランドット]";
			mes "ああ……";
			mes "あまり役に立たない話をしてしまった";
			mes "かな。いや、気を使わなくていい。";
			mes "とにかく手伝ってくれてありがとう。";
			mes "じゃあ他の研究員の手伝いを";
			mes "してやってくれ。";
			next;
			mes "[ハランドット]";
			mes "みんなかなり忙しそうだからな。";
			mes "うん……";
			set GOD_1QUE_SUB,0;
			if(GOD_1QUE == 11)
				set GOD_1QUE,12;
			if(GOD_1QUE == 22)
				set GOD_1QUE,23;
			if(GOD_1QUE == 33)
				set GOD_1QUE,34;
			if(GOD_1QUE == 44)
				set GOD_1QUE,50;
			close;
		}
	}
	mes "[ハランドット]";
	mes "うん……";
	mes "そこはそうだから……";
	mes "ふうー……やはり一人だと大変だ。";
	mes "手伝ってくれる人がいると";
	mes "いいんだが……";
	next;
	mes "[ハランドット]";
	mes "仕事内容はその時々で変化する。";
	mes "だからその時ごとに必要な人材も";
	mes "変化する。";
	next;
	mes "[ハランドット]";
	mes "一つ例を挙げよう。";
	mes "「材料収集」をする時は";
	mes "体力派の手伝いが必要だ。";
	mes "しかし「データ分析」をする時は";
	mes "頭脳派の手伝いが必要になる。";
	next;
	mes "[ハランドット]";
	mes "つまり、全ての事に万能な人材もいいが";
	mes "仕事の特性に応じた人材を得ることも";
	mes "大事ってことだ。";
	close;
}

// 石版クエスト
que_god01.gat,14,47,3	script	研究員	69,{
	if($GodSleipnir >= 100) {		// 定員割れ
		mes "[パベル]";
		mes "ふーむ……";
		mes "魂とは果してどんな形態で定義";
		mes "できるのか？　実のところこの問題";
		mes "はあまり重要ではない。むしろ魂の";
		mes "存在自体の証明の方が重要な問題";
		mes "である。";
		close;
	}
	// 受付中
	if(GOD_1QUE == 2)
		set GOD_1QUE,41;
	if(GOD_1QUE == 41 || GOD_1QUE == 12 || GOD_1QUE == 23 || GOD_1QUE == 34) {
		switch(GOD_1QUE_SUB) {
		case 0:
			mes "[パベル]";
			mes "ゴホンゴホン……";
			mes "ハックション……";
			mes "ん？";
			mes "君は……？";
			mes "…………";
			next;
			mes "[パベル]";
			mes "ああ、そうか。";
			mes "今度来ると言ってた……ゴホン";
			mes "ふむふむ……すまんな。";
			mes "今、風邪をひいてて……";
			mes "ゴホンゴホン……";
			next;
			mes "[パベル]";
			mes "ふーむ……";
			mes "手伝いにきてくれたのはいいが……";
			mes "はて、何を頼めばいいのやら……";
			next;
			mes "[パベル]";
			mes "ふーむ……ヘック……";
			mes "そうだあれを、ハックション";
			mes "見てきなさい……ゴホン";
			mes "机の上にあるから……ハックション！";
			set GOD_1QUE_SUB,1;
			close;
		case 1:
			mes "[パベル]";
			mes "机の上の物を見て報告";
			mes "ヘックション……してくれと";
			mes "ハックション……言っただろ。";
			mes "ゴホンゴホン……";
			close;
		case 2:
			mes "[パベル]";
			mes "ゴホンゴホン……";
			mes "見てきたのかね？";
			mes "ふむふむ……その様子だと";
			mes "何なのか解らなかったようだね。";
			next;
			mes "[パベル]";
			mes "ハックション……";
			mes "その石板……いや石……";
			mes "ハックション……のような物に";
			mes "書かれている字は……ゴホン";
			mes "……今は使われていない。";
			mes "そう古代、ゴホン……文字だな。";
			next;
			mes "[パベル]";
			mes "この古代文字には何かからくりが";
			mes "あるはずだ。ハックション……";
			mes "それはきっと……";
			next;
			mes "[パベル]";
			mes "見た目から、ハックション……";
			mes "想像するに……多分、石板自体が";
			mes "ハックションハックション……";
			mes "ある種の装置になっているはずだ。";
			mes "ズルズル……";
			next;
			mes "[パベル]";
			mes "ハックション……ふむふむ……";
			mes "よく見てみると薄暗い箇所がある";
			mes "だろう。そこは単なる色の違いではなく";
			mes "ゴホンゴホン、別の字の上にその字が";
			mes "重なっている可能性がある……";
			mes "ハックション!!";
			next;
			mes "[パベル]";
			mes "その装置を……ゴホンゴホン……";
			mes "解除できれば判ると思うんだが、";
			mes "それが今の私の状態では";
			mes "できなくてね……";
			next;
			mes "[パベル]";
			mes "ふむふむ……そこを手伝ってくれると";
			mes "ありがたい。ゴホンゴホン！";
			mes "ハックショーン!!　それではもう一度";
			mes "見てきて欲しい。頼む。";
			mes "……ヘックショーン!!";
			set GOD_1QUE_SUB,3;
			close;
		case 3:
			mes "[パベル]";
			mes "ヘ、ヘ、ヘックショーン!!";
			mes "ううむ……";
			mes "……そう、そうだから……ハ、ハ";
			mes "ハックショーン!!";
			close;
		case 4:
			mes "[パベル]";
			mes "ズルズル……";
			mes "……うん？";
			mes "ハ、ハックショーン!!";
			mes "そうだね……";
			mes "ふむふむ……";
			next;
			mes "[パベル]";
			mes "やはりそんな部分……ヘックション!!";
			mes "があったのか……咳がひどくて";
			mes "じっくり見れなかったから……";
			mes "ゴホンゴホン……気づかなかったな。";
			next;
			mes "[パベル]";
			mes "ハックション……ヒック……";
			mes "かなり助けられたよ。";
			mes "ハ、ハ、ハックション……";
			mes "ふむふむ……ありがとう。";
			mes "ゴホンゴホン。";
			set GOD_1QUE_SUB,0;
			if(GOD_1QUE == 41)
				set GOD_1QUE,42;
			if(GOD_1QUE == 12)
				set GOD_1QUE,13;
			if(GOD_1QUE == 23)
				set GOD_1QUE,24;
			if(GOD_1QUE == 34)
				set GOD_1QUE,50;
			close;
		}
	}
	mes "[パベル]";
	mes "ふーむ……";
	mes "魂とは果してどんな形態で定義";
	mes "できるのか？　実のところこの問題";
	mes "はあまり重要ではない。むしろ魂の";
	mes "存在自体の証明の方が重要な問題";
	mes "である。";
	close;
}

que_god01.gat,20,49,4	script	石版	111,{
	if($GodSleipnir >= 100) {		// 定員割れ
		mes "- 変な文字が書かれた石板がある。 -";
		mes "- 読もうとしたが、何の文字か -";
		mes "- 判らなかった。 -";
		close;
	}
	// 受付中
	if(GOD_1QUE == 41 || GOD_1QUE == 12 || GOD_1QUE == 23 || GOD_1QUE == 34) {
		if(GOD_1QUE_SUB == 1 || GOD_1QUE_SUB == 2) {
			mes "……チョハン、^ff00ffヤックウィ^000000、ノン";
			mes "ザックオン、ゾハンゾンス……オンゾ";
			mes "ハン、ザヨンウィグィ……ゾノンゴール";
			mes "サウ、ウブノン、ドンオ……ザヨン";
			mes "^ff00ffハンサム^000000ギョルウィ、ヨゴルリゴノン";
			next;
			mes "ザックオンゾゾ……ザックオンゾハンノ";
			mes "ロザックオン、ゾハンザ、ザック……";
			mes "^ff00ffホンザム^000000、ハン……リョノン……";
			set GOD_1QUE_SUB,2;
			next;
			mes "- 石板には知らない文字が -";
			mes "- 刻まれている。古代文字の -";
			mes "- ようだ。あちこち欠けていて -";
			mes "- 読めない箇所が多い。手を -";
			mes "- 触れてみると温かかった。 -";
			mes "- 単なる石ではないようだ。 -";
			close;
		}
		else if(GOD_1QUE_SUB == 3) {
			mes "……チョハン、^ff00ffヤックウィ^000000、ノン";
			mes "ザックオン、ゾハンゾンス……オンゾ";
			mes "ハン、ザヨンウィグィ……ゾノンゴール";
			mes "サウ、ウブノン、ドンオ……ザヨン";
			mes "^ff00ffハンサム^000000ギョルウィ、ヨゴルリゴノン";
			next;
			mes "ザックオンゾゾ……ザックオンゾハンノ";
			mes "ロザックオン、ゾハンザ、ザック……";
			mes "^ff00ffホンザム^000000、ハン……リョノン……";
			next;
			mes "- よく見ると、何か跡がある -";
			mes "- 文字もある。文字自体に仕組みが -";
			mes "- あるようだ。 -";
			set '@num,0;
			setarray '@answer$,"ヤックウィ","ハンサム","ホンザム";
			while(1) {
				next;
				mes "……チョハン、^ff00ffヤックウィ^000000、ノン";
				mes "ザックオン、ゾハンゾンス……オンゾ";
				mes "ハン、ザヨンウィグィ……ゾノンゴール";
				mes "サウ、ウブノン、ドンオ……ザヨン";
				mes "^ff00ffハンサム^000000ギョルウィ、ヨゴルリゴノン";
				next;
				mes "ザックオンゾゾ……ザックオンゾハンノ";
				mes "ロザックオン、ゾハンザ、ザック……";
				mes "^ff00ffホンザム^000000、ハン……リョノン……";
				next;
				if('@num < 3) {
					input '@str$;
					if('@answer$['@num] != '@str$) {
						mes "- ^ff0000" +'@str$+ "^000000という文字に -";
						mes "- 触れてみたが何も変化がない。 -";
						mes "- 他の方法を考えよう。 -";
						close;
					}
					mes "- ピキッ!! -";
					mes "- ^ff0000" +'@str$+ "^000000という文字を -";
					mes "- 押してみると、石板から変な -";
					mes "- 音がした。しかし他に変化は -";
					mes "- なさそうだ。他の文字に触れて -";
					mes "- みよう。 -";
					set '@num,'@num+1;
					continue;
				}
				mes "- ギギギィィーッ -";
				mes "- 三つの文字を順に押した。 -";
				mes "- すると変な音と共に石板が -";
				mes "- 震動し始めた。……それまで -";
				mes "- 表示されていた文字が消え、 -";
				mes "- 代わりに別の文字が現れた。 -";
				next;
				mes "ザックオンゾハンヤックウィノンザック";
				mes "オンゾハンゾンスザックオンゾハン";
				mes "イングフンオンザックオンゾハンザヨン";
				mes "ウィグィソルオヨッノンゾノンゴ－ル";
				mes "サウブノンゴドンオザヨンハンサム";
				next;
				mes "ギョルウィヨゴルリゴノンザックオンゾ";
				mes "ハンサムリョザックオンゾハンノ";
				mes "ロザックオンゾハンザヨンザックオンゾ";
				mes "イングフンホンザムハンサムスリョノン";
				mes "ミングハンマグィ";
				next;
				mes "- ………… -";
				mes "- やはりどんな意味なのか -";
				mes "- 解らない………… -";
				set GOD_1QUE_SUB,4;
				next;
				mes "- しばらくすると、現われていた -";
				mes "- 文字が消えた。装置が作動した後 -";
				mes "- 一定時間が経過すると消える -";
				mes "- ようだ。 -";
				close;
			}
		}
		else {
			mes "……チョハンヤックウィノン";
			mes "ザックオンゾハンゾンス……オンゾ";
			mes "ハンザヨンウィグィ……ゾノンゴール";
			mes "サウウブノンドンオ……ザヨン";
			mes "ハンサムギョルウィヨゴルリゴノン";
			next;
			mes "ザックオンゾゾ……ザックオンゾハンノ";
			mes "ロザックオン、ゾハンザ、ザック……";
			mes "ホンザムハン……リョノン……";
			next;
			mes "- 石板のあちこち欠けていて -";
			mes "- 読めない箇所が多い。手を -";
			mes "- 触れてみると温かかった。 -";
			mes "- 単なる石ではないようだ。 -";
			mes "- ……気にしないでおこう。 -";
			close;
		}
	}
	mes "……チョハンヤックウィノン";
	mes "ザックオンゾハンゾンス……オンゾ";
	mes "ハンザヨンウィグィ……ゾノンゴール";
	mes "サウウブノンドンオ……ザヨン";
	mes "ハンサムギョルウィヨゴルリゴノン";
	next;
	mes "ザックオンゾゾ……ザックオンゾハンノ";
	mes "ロザックオン、ゾハンザ、ザック……";
	mes "ホンザムハン……リョノン……";
	next;
	mes "- 石板のあちこち欠けていて -";
	mes "- 読めない箇所が多い。手を -";
	mes "- 触れてみると温かかった。 -";
	mes "- 単なる石ではないようだ。 -";
	close;
}

// 魚類アイテム収集クエスト
que_god01.gat,55,47,3	script	研究員	803,{
	if($GodSleipnir >= 100) {		// 定員割れ
		mes "[クルト]";
		mes "研究において必要なのは";
		mes "資本と人手だけではなく、";
		mes "研究そのものに対する意欲と熱意！";
		next;
		mes "[クルト]";
		mes "一部の資本家たちは金と人さえあれば";
		mes "研究が進むと思ってるけど……いくら";
		mes "資本が豊かで優れた人材があっても、";
		mes "その人に動機か意欲を与えられなければ";
		mes "その研究は失敗するよ。";
		close;
	}
	// 受付中
	if(GOD_1QUE == 2)
		set GOD_1QUE,31;
	if(GOD_1QUE == 31 || GOD_1QUE == 42 || GOD_1QUE == 13 || GOD_1QUE == 24) {
		switch(GOD_1QUE_SUB) {
		case 0:
			mes "[クルト]";
			mes "へぇ～";
			mes "今度入ってきた臨時の人って";
			mes "あんたかい？　話は聞いてるよ。";
			mes "ふ～ん。";
			next;
			mes "[クルト]";
			mes "ホントはもうちょっと専門知識がある人";
			mes "が欲しかったけど……状況的に無理か。";
			mes "ま、専門知識がなくても、かなりの";
			mes "働きをみせる人もたまにいるし。";
			mes "あんたに期待してるよ。";
			next;
			mes "[クルト]";
			mes "実はあたいの研究も、ちょうど追いこみ";
			mes "段階でね。そんなに多くの人手は";
			mes "いらないけど、あたい一人だとちょいと";
			mes "荷が重くてね。それで外部の人に";
			mes "任せようと思ったんだけど……";
			next;
			mes "[クルト]";
			mes "ふ～ん……あんた、大分強そうだね。";
			mes "よし、あんたに任せてみるか。";
			mes "実は今、「魚の魂」を複製するための";
			mes "材料を集めているんだ。";
			next;
			mes "[クルト]";
			mes "ん？　何を使うのかって？";
			mes "まあ、そこは何でも試してみるって";
			mes "ことさ。";
			next;
			mes "[クルト]";
			mes "そこであんたには、魚に関する物を";
			mes "集めてきてもらいたい。";
			mes "例えば鱗や尻尾とかさ。";
			mes "そうだね、数十個位あればいいや。";
			next;
			mes "[クルト]";
			mes "じゃあ、よろしく！";
			mes "あんたならこれくらい平気だよね。";
			mes "ということで、頑張ってこい。";
			set GOD_1QUE_SUB,1;
			close;
		case 1:
			mes "[クルト]";
			mes "おお、集めてきたな～";
			mes "よし、見せてみ。";
			mes "ふ～ん……";
			next;
			mes "[クルト]";
			mes "うん……";
			mes "これと……";
			mes "これと……";
			mes "あれと……";
			mes "ふむ……";
			if(countitem(918) > 8)		// べとべと水かき
				set '@count,'@count+1;
			if(countitem(950) > 8)		// 人魚の心臓
				set '@count,'@count+1;
			if(countitem(951) > 8)		// 背びれ
				set '@count,'@count+1;
			if(countitem(956) > 8)		// トゲがついているエラ
				set '@count,'@count+1;
			if(countitem(959) > 8)		// くさった鱗
				set '@count,'@count+1;
			if(countitem(960) > 8)		// かにニッパ
				set '@count,'@count+1;
			if(countitem(961) > 8)		// 貝
				set '@count,'@count+1;
			if(countitem(962) > 8)		// 触手
				set '@count,'@count+1;
			if(countitem(963) > 8)		// 鋭い鱗
				set '@count,'@count+1;
			if(countitem(964) > 8)		// かにのこうら
				set '@count,'@count+1;
			if(countitem(965) > 8)		// 貝殻
				set '@count,'@count+1;
			if(countitem(966) > 8)		// 貝のむきみ
				set '@count,'@count+1;
			if(countitem(7013) > 8)		// サンゴ
				set '@count,'@count+1;
			if(countitem(1054) > 8)		// 古代魚の唇
				set '@count,'@count+1;
			if(countitem(1053) > 8)		// 古代魚の歯
				set '@count,'@count+1;
			if(countitem(1052) > 8)		// 単細胞
				set '@count,'@count+1;
			if(countitem(1051) > 8)		// 雷管
				set '@count,'@count+1;
			if(countitem(1050) > 8)		// 血管
				set '@count,'@count+1;
			if(countitem(1024) > 8)		// 墨汁
				set '@count,'@count+1;
			if(countitem(1023) > 8)		// 魚の尻尾
				set '@count,'@count+1;
			next;
			if('@count < 15) {
				mes "[クルト]";
				mes "う～ん……";
				mes "ちょ～っと足りないね。";
				mes "もう少し集めてきてちょうだい。";
				close;
			}
			mes "[クルト]";
			mes "おお～";
			mes "よく集めてきたな～。";
			mes "お疲れ～！";
			mes "これだけあれば、十分に";
			mes "研究できるよ。";
			next;
			mes "[クルト]";
			mes "いや～、こんなに集めてきてくれるとは";
			mes "思わなかったよ～。";
			mes "本当によくこれだけ集めたよな。";
			mes "ははははっ。";
			mes "それじゃ、有効に使わせてもらうね。";
			if(countitem(918) > 8)
				delitem 918,9;
			if(countitem(950) > 8)
				delitem 950,9;
			if(countitem(951) > 8)
				delitem 951,9;
			if(countitem(956) > 8)
				delitem 956,9;
			if(countitem(959) > 8)
				delitem 959,9;
			if(countitem(960) > 8)
				delitem 960,9;
			if(countitem(961) > 8)
				delitem 961,9;
			if(countitem(962) > 8)
				delitem 962,9;
			if(countitem(963) > 8)
				delitem 963,9;
			if(countitem(964) > 8)
				delitem 964,9;
			if(countitem(965) > 8)
				delitem 965,9;
			if(countitem(966) > 8)
				delitem 966,9;
			if(countitem(1023) > 8)
				delitem 1023,9;
			if(countitem(1024) > 8)
				delitem 1024,9;
			if(countitem(1050) > 8)
				delitem 1050,9;
			if(countitem(1051) > 8)
				delitem 1051,9;
			if(countitem(1052) > 8)
				delitem 1052,9;
			if(countitem(1053) > 8)
				delitem 1053,9;
			if(countitem(1054) > 8)
				delitem 1054,9;
			if(countitem(7013) > 8)
				delitem 7013,9;
			set GOD_1QUE_SUB,0;
			if(GOD_1QUE == 31)
				set GOD_1QUE,32;
			if(GOD_1QUE == 42)
				set GOD_1QUE,43;
			if(GOD_1QUE == 13)
				set GOD_1QUE,14;
			if(GOD_1QUE == 24)
				set GOD_1QUE,50;
			close;
		}
	}
	mes "[クルト]";
	mes "研究において必要なのは";
	mes "資本と人手だけではなく、";
	mes "研究そのものに対する意欲と熱意！";
	next;
	mes "[クルト]";
	mes "一部の資本家たちは金と人さえあれば";
	mes "研究が進むと思ってるけど……いくら";
	mes "資本が豊かで優れた人材があっても、";
	mes "その人に動機か意欲を与えられなければ";
	mes "その研究は失敗するよ。";
	close;
}

// 神話クエスト
que_god01.gat,11,136,6	script	研究員	742,{
	if($GodSleipnir >= 100) {		// 定員割れ
		mes "[アディン]";
		mes "ふむふむ……";
		mes "伝説や神話には、時々矛盾した二つの";
		mes "話が同時に存在する場合があります。";
		next;
		mes "[アディン]";
		mes "そういった二つの話が生じる原因は";
		mes "その話の起源を調べると、案外";
		mes "簡単に見当がつくものです。";
		close;
	}
	// 受付中
	if(GOD_1QUE == 2)
		set GOD_1QUE,21;
	if(GOD_1QUE == 21 || GOD_1QUE == 32 || GOD_1QUE == 43 || GOD_1QUE == 14) {
		switch(GOD_1QUE_SUB) {
		case 0:
			mes "[アディン]";
			mes "ほうほう……";
			mes "う～ん？";
			mes "ふむふむ……";
			next;
			mes "[アディン]";
			mes "……ほほう～。";
			mes "臨時で入って来た方でしょう？";
			mes "ちょうどいい所に来ました。";
			mes "今、かなり忙しいんですよ。";
			next;
			mes "[アディン]";
			mes "ふむふむ……";
			mes "まず私の研究を教えてあげましょう。";
			mes "私の研究は「スレイプニール」の材料と";
			mes "される「天使の羽毛」です。";
			next;
			mes "[アディン]";
			mes "特に注目していることは……";
			mes "「天使の羽毛」が何故";
			mes "「スレイプニール」の材料となるのか、";
			mes "その素材は何なのか、ということです。";
			next;
			mes "[アディン]";
			mes "最近、これにまつわる伝説を知る人が";
			mes "「フェイヨン」にいることが";
			mes "判りました。";
			next;
			mes "[アディン]";
			mes "けれども、今はこの場を離れられない";
			mes "状態です。本当は、直接話を聞きに";
			mes "行かなければならないのですが……";
			next;
			mes "[アディン]";
			mes "でも、ここを留守にしてまで";
			mes "フェイヨンへ行くのはさすがに";
			mes "厳しいです。";
			next;
			mes "[アディン]";
			mes "私が抱えている悩みは大体こんな";
			mes "感じです。そこであなたにお願いが";
			mes "あります。私の代わりにフェイヨンへ";
			mes "行って、その人の話を聞いてきて";
			mes "もらえませんか？";
			next;
			mes "[アディン]";
			mes "そんなに難しいことではないと";
			mes "思います。でも、教わった内容は";
			mes "正確に憶えてきちんと報告して";
			mes "ください。";
			next;
			mes "[アディン]";
			mes "それではお願いします。";
			mes "そしてできれば、できる限り早く";
			mes "教えてください。それでは。";
			set GOD_1QUE_SUB,1;
			close;
		case 1:
			mes "[アディン]";
			mes "まだ行ってないようですね。";
			mes "私は他にやることがあるので、";
			mes "残念ながら行くことはできません。";
			mes "だから、私の代わりにできるだけ";
			mes "早く報告をお願いします。";
			mes "それでは。";
			close;
		case 2:
			mes "[アディン]";
			mes "話はきちんと聞いてきましたね？";
			mes "……本来、その様な話は書物など";
			mes "紙形式で伝えるべきですが……";
			mes "でも、彼らには口だけで伝え";
			mes "なければならない理由がある";
			mes "のでしょう。";
			next;
			mes "[アディン]";
			mes "それでは話を聞きましょう。";
			mes "期待してますよ。";
			mes "…………";
			next;
			mes "[アディン]";
			mes "……";
			next;
			mes "[アディン]";
			mes "……";
			mes "…………";
			next;
			mes "[アディン]";
			mes "……";
			mes "…………";
			mes "………………";
			next;
			mes "[アディン]";
			mes "……";
			mes "…………";
			mes "………………";
			mes "……………………";
			next;
			mes "[アディン]";
			mes "……";
			mes "…………";
			mes "………………";
			mes "……………………";
			mes "…………………………";
			next;
			mes "[アディン]";
			mes "……";
			mes "…………";
			mes "………………";
			mes "……………………";
			mes "…………………………";
			mes "……………………………………";
			next;
			mes "[アディン]";
			mes "……";
			mes "…………";
			mes "………………";
			mes "……………………";
			mes "…………………………";
			mes "………………………………";
			next;
			mes "[アディン]";
			mes "う～ん…………？";
			mes "ふむふむ……";
			mes "大体わかりました。";
			mes "でも……";
			next;
			mes "[アディン]";
			mes "所々、抜けている部分があるようです。";
			mes "申し訳ありませんが、もう一度行って";
			mes "聞いてきてもらえませんか？";
			mes "もう少し、正確に知りたいです。";
			set GOD_1QUE_SUB,3;
			close;
		case 3:
			mes "[アディン]";
			mes "まだ行っていないようですね。";
			mes "早く残りの部分の話を聞きたいと";
			mes "思います。お願いします。";
			close;
		case 4:
			mes "[アディン]";
			mes "それでは話を聞きましょう。";
			mes "期待してますよ。";
			mes "…………";
			next;
			mes "[アディン]";
			mes "……";
			next;
			mes "[アディン]";
			mes "……";
			mes "…………";
			next;
			mes "[アディン]";
			mes "……";
			mes "…………";
			mes "………………";
			next;
			mes "[アディン]";
			mes "……";
			mes "…………";
			mes "………………";
			mes "……………………";
			next;
			mes "[アディン]";
			mes "……";
			mes "…………";
			mes "………………";
			mes "……………………";
			mes "…………………………";
			next;
			mes "[アディン]";
			mes "……";
			mes "…………";
			mes "………………";
			mes "……………………";
			mes "…………………………";
			mes "……………………………………";
			next;
			mes "[アディン]";
			mes "……";
			mes "…………";
			mes "………………";
			mes "……………………";
			mes "…………………………";
			mes "………………………………";
			next;
			mes "[アディン]";
			mes "ほうほう……なるほど。";
			mes "やっと解りました。";
			mes "知っている情報と一部食い違いは";
			mes "ありますが……まあ、それは";
			mes "口伝えだから仕方ないでしょう。";
			next;
			mes "[アディン]";
			mes "一応、疑問点がいくつか解決しました。";
			mes "まあその分、新たな疑問も";
			mes "生じましたがね。ふむふむ……";
			mes "やはり容易なことではなさそうですね。";
			mes "あ……ありがとうございました。";
			set GOD_1QUE_SUB,0;
			if(GOD_1QUE == 21)
				set GOD_1QUE,22;
			if(GOD_1QUE == 32)
				set GOD_1QUE,33;
			if(GOD_1QUE == 43)
				set GOD_1QUE,44;
			if(GOD_1QUE == 14)
				set GOD_1QUE,50;
			close;
		}
	}
	mes "[アディン]";
	mes "ふむふむ……";
	mes "伝説や神話には、時々矛盾した二つの";
	mes "話が同時に存在する場合があります。";
	next;
	mes "[アディン]";
	mes "そういった二つの話が生じる原因は";
	mes "その話の起源を調べると、案外";
	mes "簡単に見当がつくものです。";
	close;
}

payon.gat,79,171,4	script	修道士	95,{
	if($GodSleipnir < 100) {		// 受付中
		if(GOD_1QUE == 21 || GOD_1QUE == 32 || GOD_1QUE == 43 || GOD_1QUE == 14) {
			switch(GOD_1QUE_SUB) {
			case 1:
			case 3:
				mes "[ラカ]";
				mes "昔話や神話には、今の自分に";
				mes "役立つことがあります。";
				mes "いくら世の中が変わって発展しても";
				mes "人の営み自体は、あまり変化して";
				mes "いませんからね。";
				next;
				if(select("うーん……","そうですね") == 2) {
					mes "[ラカ]";
					mes "また、悩みなど壁にぶつかった時は";
					mes "一度自分の過去を振り返ってください。";
					mes "神話や伝説と同じく、自分の過去も";
					mes "現在の自分に役立つはずです。";
					mes "まさに歴史は繰り返す……ですからね。";
					close;
				}
				mes "[ラカ]";
				mes "あら？　何かお悩みのようですね。";
				mes "私でお役に立てるのでしたら";
				mes "喜んでお手伝いしましょう。";
				next;
				mes "[ラカ]";
				mes "手伝える能力があるのに";
				mes "その能力を使わないのは、";
				mes "能力が無いのと等しいですからね。";
				next;
				if(select("既に解決しているので、大丈夫です","実は……") == 1) {
					mes "[ラカ]";
					mes "あ、私の勘違いでしたか。";
					mes "でも助けが必要でしたら、";
					mes "いつでも遠慮なくお越し下さい。";
					mes "お役に立てるかわかりませんが、";
					mes "できる限りのお手伝いはしたいと";
					mes "思います。";
					next;
					mes "[ラカ]";
					mes "人助けも修練の一つですしね。";
					mes "いつも広き心を保てるよう願います……";
					close;
				}
				mes "[ラカ]";
				mes "うーん……？";
				mes "そうですね……";
				mes "何かお手伝いできるかもしれませんね。";
				mes "少々お待ちください……";
				mes "スレイプニール、スレイプニール……";
				next;
				mes "[ラカ]";
				mes "ちょっと記憶を探ってみます……";
				mes "うーん……";
				mes "………………";
				mes "……………………";
				next;
				mes "[ラカ]";
				mes "ああ……";
				mes "思い出しました……";
				mes "そう、「スレイプニール」";
				mes "主神オーディンの愛馬ですね。";
				next;
				mes "[ラカ]";
				mes "神々の世界には三匹の";
				mes "有名な馬がいます。";
				mes "^ff0000スレイプニール……滑るように走るもの";
				mes "スヴァディルファリ……不運なる旅人";
				mes "グルファクシ……金のたてがみ^000000";
				next;
				mes "[ラカ]";
				mes "「グルファクシ」は巨人王";
				mes "フルングニールの馬です。";
				mes "一方「スヴァディルファリ」は";
				mes "ヨトゥンヘイムの馬ですね。";
				mes "そして「スレイプニール」は";
				mes "スヴァディルファリの子供です。";
				next;
				mes "[ラカ]";
				mes "では「スレイプニール」の誕生に";
				mes "ついてお話しましょう。";
				mes "これは……神々の世界のお話です。";
				next;
				mes "[ラカ]";
				mes "神々が暮らすアスガルドには";
				mes "巨大な城壁がありました。";
				mes "しかしその城壁は、先の戦いにより";
				mes "壊れていました。けれども神々は、";
				mes "その巨大な城壁を直す気には";
				mes "なれませんでした。";
				next;
				mes "[ラカ]";
				mes "そんなある日、馬に乗った";
				mes "一人の男が現れました。";
				next;
				mes "[ラカ]";
				mes "その男は崩れた城壁の巡回をしていた";
				mes "ヘイムダルに話しかけました。";
				mes "城壁に関して話したいことがあるから";
				mes "オーディンに会いたい……と。";
				next;
				mes "[ラカ]";
				mes "そうでなくても城壁が気になったいた";
				mes "ヘイムダルは、直ちにオーディンの所へ";
				mes "彼を連れていきました。……その時";
				mes "オーディンは他の神々と一緒に";
				mes "ヴァルハラにいました。";
				next;
				mes "[ラカ]";
				mes "オーディンらに向ってその場違いな男は";
				mes "「18ヶ月の期間をもらえたら、";
				mes "アスガルドの城壁を完全に直せる。」";
				mes "と言いました。城壁の修復をすっかり";
				mes "あきらめていた神々は、とても";
				mes "驚きました。";
				next;
				mes "[ラカ]";
				mes "オーディンはその男を疑わしく";
				mes "思いましたが、ひとまず条件を";
				mes "聞いてみました。するとその男は";
				mes "「報酬として女神フレイヤと太陽と";
				mes "月を欲しい。」と言いました。";
				next;
				mes "[ラカ]";
				mes "…………";
				mes "退屈でしょうか？";
				mes "続きは次の機会にします？";
				next;
				if(select("はい、ではまた","いいえ、続けてください") == 1) {
					mes "[ラカ]";
					mes "分かりました。";
					mes "あまりお気に召さなかったようですね。";
					mes "次はもっと面白く感じてくださるよう";
					mes "努力します。では、また……";
					close;
				}
				mes "[ラカ]";
				mes "分かりました。";
				mes "では、話を続けましょう。";
				next;
				mes "[ラカ]";
				mes "神々は当然怒りました。";
				mes "太陽と月はもちろんですが、何よりも";
				mes "神々の宝と言える女神フレイヤを";
				mes "要求してきたのですからね。";
				next;
				mes "[ラカ]";
				mes "神々は怒りのあまり、開いた口が";
				mes "ふさがらない状態でした。しかし";
				mes "オーディンに近づく者がいました。";
				mes "それはロキでした。";
				next;
				mes "[ラカ]";
				mes "ロキはオーディンに";
				mes "「あの男を利用すれば城壁を直せる。";
				mes "だがフレイヤを渡すことには";
				mes "ならない。」と言いました。";
				mes "ロキの話を聞いたオーディンは";
				mes "じっと考えこみました。";
				next;
				mes "[ラカ]";
				mes "結局ロキの考えが大丈夫だと";
				mes "思ったのか、オーディンはその男に";
				mes "「18ヶ月ではなく、6ヶ月以内に";
				mes "城壁を修復することができたら";
				mes "条件を聞き入れる。」と言いました。";
				next;
				mes "[ラカ]";
				mes "…………";
				mes "退屈でしょうか？";
				mes "続きは次の機会にします？";
				next;
				switch(select("少しの間、話を整理したいです","はい、ではまた","いいえ、続けてください")) {
				case 1:
					mes "[ラカ]";
					mes "あ……";
					mes "話が少し長かったですね。";
					mes "分かりました。";
					mes "少しお時間を差し上げます。";
					next;
					mes "………………………………";
					mes "…………………………";
					mes "……………………";
					mes "………………";
					mes "…………";
					mes "……";
					next;
					mes "………………………………";
					mes "…………………………";
					mes "……………………";
					mes "………………";
					mes "…………";
					mes "……";
					next;
					mes "…………………………";
					mes "……………………";
					mes "………………";
					mes "…………";
					mes "……";
					next;
					mes "……………………";
					mes "………………";
					mes "…………";
					mes "……";
					next;
					mes "…………";
					mes "……";
					next;
					mes "……";
					next;
					mes "[ラカ]";
					mes "……話を続けてもよろしいでしょうか？";
					next;
					menu "大丈夫です、お願いします",-;
					mes "[ラカ]";
					mes "それでは話を続けましょう。";
					break;
				case 2:
					mes "[ラカ]";
					mes "分かりました。";
					mes "あまりお気に召さなかったようですね。";
					mes "次はもっと面白く感じてくださるよう";
					mes "努力します。では、また……";
					close;
				case 3:
					mes "[ラカ]";
					mes "分かりました。";
					mes "では、話を続けましょう。";
					break;
				}
				next;
				mes "[ラカ]";
				mes "するとその男は";
				mes "「自分の馬も作業に使わせてくれ。」";
				mes "と言いました。神々は、その位なら";
				mes "妥協しよう、ということでその条件を";
				mes "受け入れました。";
				next;
				mes "[ラカ]";
				mes "ところがその男は、すさまじい勢いで";
				mes "城壁を直し始めました。その男の";
				mes "人間離れした能力に加え、その馬の";
				mes "働きぶりが特にすごかったのです。";
				mes "……それもそのはず、その馬は";
				mes "あのスヴァディルファリでしたからね。";
				next;
				mes "[ラカ]";
				mes "時間が経つにつれて、神々は不安に";
				mes "なってきました。6ヶ月が経過する前に";
				mes "城壁が完成しそうだったからです。";
				mes "神々はロキに詰めよりました。";
				next;
				mes "[ラカ]";
				mes "しかしロキはそんな神々に対し";
				mes "「心配するな。自分に策がある。」";
				mes "と言い返してきました。神々は、";
				mes "ロキを頼りたくはないが";
				mes "何か考えがあるようなので、";
				mes "ロキの言葉を信じることにしました。";
				next;
				mes "[ラカ]";
				mes "その後、何が起こったのか急に";
				mes "城壁の復旧作業が進まなくなりました。";
				next;
				mes "[ラカ]";
				mes "…………";
				mes "退屈でしょうか？";
				mes "続きは次の機会にします？";
				next;
				if(select("はい、ではまた","いいえ、続けてください") == 1) {
					mes "[ラカ]";
					mes "分かりました。";
					mes "あまりお気に召さなかったようですね。";
					mes "次はもっと面白く感じてくださるよう";
					mes "努力します。では、また……";
					close;
				}
				mes "[ラカ]";
				mes "分かりました。";
				mes "では、話を続けましょう。";
				next;
				mes "[ラカ]";
				mes "原因は、スヴァディルファリが";
				mes "持ち場を離れ、全く仕事をしなくなった";
				mes "からでした。結局6ヶ月が経過した時、";
				mes "門だけ修復作業が終わっていません";
				mes "でした。";
				next;
				mes "[ラカ]";
				mes "神々はその男に";
				mes "「期間内に城壁を完成させることが";
				mes "できなかったから、条件を聞く必要は";
				mes "ない。」と言い渡しました。";
				next;
				mes "[ラカ]";
				mes "するとその男は";
				mes "「女神フレイヤと太陽と月を";
				mes "自分に渡したくないからって、神々は";
				mes "修復作業を妨害したじゃないか。」";
				mes "と怒り、その正体を現しました。";
				next;
				mes "[ラカ]";
				mes "なんと彼は「霜の巨人」と呼ばれる";
				mes "ヨトゥンヘイムの巨人だったのです。";
				mes "その巨人は怒り狂い、神々に";
				mes "襲いかかろうとしました。";
				next;
				mes "[ラカ]";
				mes "…………";
				mes "退屈でしょうか？";
				mes "続きは次の機会にします？";
				next;
				if(select("はい、ではまた","いいえ、続けてください") == 1) {
					mes "[ラカ]";
					mes "分かりました。";
					mes "あまりお気に召さなかったようですね。";
					mes "次はもっと面白く感じてくださるよう";
					mes "努力します。では、また……";
					close;
				}
				mes "[ラカ]";
				mes "分かりました。";
				mes "では、話を続けましょう。";
				next;
				mes "[ラカ]";
				mes "まさにヨトゥンモーズ……巨人の";
				mes "怒りですね。しかし神々は、その";
				mes "巨人の怒りをあまり恐れませんでした。";
				mes "何故なら、巨人狩人と呼ばれる";
				mes "「トール」がいたからです。";
				next;
				mes "[ラカ]";
				mes "トールは暴れている巨人の頭を";
				mes "「ミョルニール」で";
				mes "砕き、倒してしまいました。";
				next;
				mes "[ラカ]";
				mes "…………";
				mes "退屈でしょうか？";
				mes "続きは次の機会にします？";
				next;
				switch(select("少しの間、話を整理したいです","はい、ではまた","いいえ、続けてください")) {
				case 1:
					mes "[ラカ]";
					mes "あ……";
					mes "話が少し長かったですね。";
					mes "分かりました。";
					mes "少しお時間を差し上げます。";
					next;
					mes "………………………………";
					mes "…………………………";
					mes "……………………";
					mes "………………";
					mes "…………";
					mes "……";
					next;
					mes "………………………………";
					mes "…………………………";
					mes "……………………";
					mes "………………";
					mes "…………";
					mes "……";
					next;
					mes "…………………………";
					mes "……………………";
					mes "………………";
					mes "…………";
					mes "……";
					next;
					mes "……………………";
					mes "………………";
					mes "…………";
					mes "……";
					next;
					mes "…………";
					mes "……";
					next;
					mes "……";
					next;
					mes "[ラカ]";
					mes "そろそろ話を続けても";
					mes "よろしいでしょうか？";
					next;
					if(select("またの機会に……","大丈夫です、お願いします") == 1) {
						mes "[ラカ]";
						mes "話が少し難しかったようですね。";
						mes "続きは次の機会にしましょう。";
						mes "では、また……";
						close;
					}
					mes "[ラカ]";
					mes "それでは話を続けましょう。";
					break;
				case 2:
					mes "[ラカ]";
					mes "分かりました。";
					mes "あまりお気に召さなかったようですね。";
					mes "次はもっと面白く感じてくださるよう";
					mes "努力します。では、また……";
					close;
				case 3:
					mes "[ラカ]";
					mes "分かりました。";
					mes "では、話を続けましょう。";
					break;
				}
				next;
				mes "[ラカ]";
				mes "数日後、とてもやつれた青白い姿の";
				mes "ロキが、足を8本持つ不思議な仔馬を";
				mes "連れてきました。ロキはその仔馬";
				mes "「スレイプニール」をオーディンに";
				mes "紹介し、差し出しました。";
				next;
				mes "[ラカ]";
				mes "オーディンはありがたく受けとり、";
				mes "ロキを受け入れました。でも、他の";
				mes "神々は多少気まずかったのです。";
				mes "それは何故かと言いますと……";
				next;
				mes "[ラカ]";
				mes "ロキが馬に姿を変え";
				mes "スヴァディルファリを誘惑した結果";
				mes "生まれた子供、それがこの";
				mes "スレイプニールだったからです。";
				mes "以上がスレイプニールの誕生に";
				mes "まつわるお話です。";
				next;
				mes "[ラカ]";
				mes "これは、修道士の間で古くから口頭で";
				mes "伝えられてきた話です。そのため";
				mes "元の話とは部分的に多少のずれが";
				mes "生じているかもしれません。";
				mes "けれども、全体的な流れなどは";
				mes "あまり変わっていないと思います。";
				next;
				mes "[ラカ]";
				mes "私はまだ、修行中の身なので";
				mes "うまく伝えられたか判りません。";
				mes "でも、私の最善を尽くさせて";
				mes "いただきました。ご理解頂けたら";
				mes "嬉しく思います。";
				next;
				mes "[ラカ]";
				mes "もしまた聞きたくなりましたら";
				mes "いつでもお訪ねください。";
				mes "喜んでお応えします。";
				mes "それでは……";
				if(GOD_1QUE_SUB == 1)
					set GOD_1QUE_SUB,2;
				else if(GOD_1QUE_SUB == 3)
					set GOD_1QUE_SUB,4;
				close;
			default:
				mes "[ラカ]";
				mes "大事な話は全てしました。";
				mes "大したものではなかったかも";
				mes "しれませんが、少しでも";
				mes "お役に立てていたら幸いです。";
				close;
			}
		}
	}
	mes "[ラカ]";
	mes "修練とは、必ずしも精神と肉体の";
	mes "二つに分類されるとは限りません。";
	next;
	mes "[ラカ]";
	mes "ひとに会うことも含め人として生きて";
	mes "行くこと自体、そのすべてが修練と";
	mes "なります。もちろんその成果は";
	mes "人によって異なるでしょう。";
	close;
}

//============================================================
// 神器2次 メギンギョルドの封印クエスト
//- Registry -------------------------------------------------
// GOD_2QUE -> 0～28
// GOD_2QUE_SUB1 ～ GOD_2QUE_SUB6 -> 各隊員進行
//------------------------------------------------------------
prt_castle.gat,44,151,0	script	レベイレブ	56,{
	if(checkitemblank() == 0) {
		mes "- 所持アイテムの種類数が -";
		mes "- 多いため、アイテムを受けとる -";
		mes "- ことができません。 -";
		mes "- 所持アイテムを減らしてから -";
		mes "- 再度話しかけてください。 -";
		close;
	}
	if(MaxWeight - Weight < 5000) {
		mes "- 所持重量が多いため、アイテムを -";
		mes "- 受けとることができません。 -";
		mes "- 所持アイテムを減らしてから -";
		mes "- 再度話しかけてください。 -";
		close;
	}
	cutin "god_rebeireb",2;
	if(countitem(7080) > 3 && countitem(7081) > 4 && countitem(7082) > 3 && countitem(7084) > 2 && countitem(7085) > 2) {
		mes "[レベイレブ]";
		mes "おお！　これは！";
		mes "君!!　グレイプニールを作成する";
		mes "材料を持っているではないか！";
		mes "グレイプニールを作るか？";
		next;
		if(select("作りたい","いいえ") == 2) {
			close;
		}
		mes "[レベイレブ]";
		mes "神器を作ることができるのは";
		mes "ドワーフを除いて、";
		mes "神と神の近くにある";
		mes "我等くらいだろう。";
		next;
		delitem 7080,4;
		delitem 7081,5;
		delitem 7082,4;
		delitem 7084,3;
		delitem 7085,3;
		getitem 7058,1;
		mes "[レベイレブ]";
		mes "さぁ、受け取るが良い。";
		next;
		mes "[レベイレブ]";
		mes "この世には存在しないと";
		mes "言われており……";
		mes "かの有名な狼「フェンリル」";
		mes "にすら切ることが";
		mes "できなかったという伝説の";
		mes "グレイプニールが現れるとは……";
		close2;
		cutin "god_rebeireb",255;
		end;
	}
	if($GodSleipnir < 50) {
		mes "[レベイレブ]";
		mes "我等はクルセイダーだ。";
		mes "オーディンの意志に従い";
		mes "聖戦に備える者である。";
		mes "千年前にそうだったように……";
		mes "今一度魔族を討伐するその日が";
		mes "訪れるであろう……";
		next;
		mes "[レベイレブ]";
		mes "君、聖戦に備える我等について";
		mes "聞きたいことがあれば、";
		mes "私に聞いてみたまえ。";
		next;
		mes "[レベイレブ]";
		mes "このレベイレブは年を取り";
		mes "能力は衰えたが、私が生を";
		mes "まっとうする間に行ってゆく";
		mes "ことについて教えよう。";
		next;
		switch(select("ホーリークロスとは？","グランドクロスとは？","ディボーションとは？","グレイプニールとは？")) {
		case 1:
			mes "[レベイレブ]";
			mes "ホーリークロスとは、";
			mes "自らの神に対する信仰心を";
			mes "具現化したものであり、";
			mes "それが聖なる属性を持つ";
			mes "攻撃となっているのだ。";
			next;
			mes "[レベイレブ]";
			mes "聖なる物を苦手とする者等や、";
			mes "神に背く存在である……不死者";
			mes "のような者がその攻撃を受ければ";
			mes "直ちに視界を失い神による裁きを";
			mes "待つのみとなる。";
			next;
			mes "[レベイレブ]";
			mes "先人のクルセイダー達の";
			mes "報告によれば、通常攻撃の";
			mes "概ね4.5倍程の効果があると";
			mes "言われている。";
			close2;
			cutin "god_rebeireb",255;
			end;
		case 2:
			mes "[レベイレブ]";
			mes "グランドクロスか！";
			mes "それは神の怒り！";
			mes "そして神の審判！";
			mes "神に背く者が裁かれるのは";
			mes "当然のことである。";
			next;
			mes "[レベイレブ]";
			mes "我等は神の意志をこの身に";
			mes "移し、裁く力を賜っている。";
			mes "神に背く者を絶やそうと心で";
			mes "念じれば、微力ながら御力を";
			mes "具現化させることができるのだ。";
			next;
			mes "[レベイレブ]";
			mes "クルセイダーの身を中心に現れた";
			mes "巨大な十字の光は、触れた悪しき";
			mes "者に神罰をもたらす。";
			next;
			mes "[レベイレブ]";
			mes "しかし注意しなければならない";
			mes "こともある。";
			mes "この力は本来非常に強力な";
			mes "ものであり、我等の弱き身では";
			mes "制御しきれない程である。";
			next;
			mes "[レベイレブ]";
			mes "それ故に、グランドクロスを";
			mes "発動させた者の肉体にも";
			mes "ダメージを被る。";
			mes "それでも、我等の神に対する";
			mes "信仰により極限まで抑える";
			mes "ことができるのだ……";
			next;
			mes "[レベイレブ]";
			mes "それにしても……神の御力を前にして";
			mes "我等の肉体はなんと弱きことか……";
			close2;
			cutin "god_rebeireb",255;
			end;
		case 3:
			mes "[レベイレブ]";
			mes "我が身を献じ、信仰を貫き、";
			mes "いずれ来たる聖戦へ備えること……";
			mes "これらは我等クルセイダーに";
			mes "とって使命である。";
			next;
			mes "[レベイレブ]";
			mes "今述べた我が身を献じるということは、";
			mes "人々のために奉仕するという";
			mes "ことであり、神の意志に最も近い";
			mes "行いであると言えよう。";
			next;
			mes "[レベイレブ]";
			mes "クルセイダーには、我が身を";
			mes "自分が護りたいと思う者に捧げ、";
			mes "その者が受ける苦痛を己の";
			mes "肉体に移す能力がある。";
			next;
			mes "[レベイレブ]";
			mes "これこそがまさにディボーション";
			mes "なのである。";
			mes "そして神の意志に応える者が";
			mes "持つべき姿！";
			next;
			mes "[レベイレブ]";
			mes "ただし、離れた位置にいる者を";
			mes "護ることはできない。";
			mes "なぜなら、護りたい者の今の姿を";
			mes "心に浮かべ、護るという意志を";
			mes "増幅させなければならないからだ。";
			next;
			mes "[レベイレブ]";
			mes "己が護ろうとする者の";
			mes "息づかい、そのぬくもり、";
			mes "その者が受ける苦痛をも";
			mes "感じとり我が身に重ねる。";
			mes "それがディボーションである。";
			next;
			mes "[レベイレブ]";
			mes "己が愛し、また己を愛する全ての";
			mes "者を護ることができる力を授かった";
			mes "ことに感謝しなければならない。";
			close2;
			cutin "god_rebeireb",255;
			end;
		case 4:
			mes "[レベイレブ]";
			mes "「グレイプニール」とは、";
			mes "私が研究している";
			mes "「メギンギョルド」を作るために";
			mes "必要な材料であり……";
			next;
			mes "[レベイレブ]";
			mes "神器であるメギンギョルドを";
			mes "腰に巻くために必要な部品なのだ。";
			next;
			mes "[レベイレブ]";
			mes "もしも君が……";
			next;
			mes "[レベイレブ]";
			mes "^0000FF猫の足音 4個と ";
			mes "女人のひげ 5個、";
			mes "石の根 4個、";
			mes "鳥の唾 3個、";
			mes "熊の筋 3個^000000";
			next;
			mes "[レベイレブ]";
			mes "揃えることができたならば、";
			mes "すぐに作ることができるであろう……";
			close2;
			cutin "god_rebeireb",255;
			end;
		}
	}
	else if($GodSleipnir >= 50 && $GodMagingiorde < 100) {		//受付中
		if(BaseLevel < 60) {
			mes "[レベイレブ]";
			mes "君はまだ私と話せる水準を";
			mes "満たしてはいないな。";
			mes "いくら冒険をしている者だとは";
			mes "いっても、ある程度の知識と";
			mes "経験がなければ共通の話題";
			mes "など生じぬであろう？";
			close2;
			cutin "god_rebeireb",255;
			end;
		}
		switch(GOD_2QUE) {
		case 0:
			mes "[レベイレブ]";
			mes "……";
			next;
			mes "[レベイレブ]";
			mes "聖戦についていくら話そうとも";
			mes "理解できぬ者等が";
			mes "この聖なる地に何用で参った？";
			next;
			mes "[レベイレブ]";
			mes "無知な者等は、聖戦がいつ";
			mes "訪れてもおかしくないのだと";
			mes "いうことを理解していない。";
			next;
			mes "[レベイレブ]";
			mes "やはり一般人にくどくどと";
			mes "話すより昔のように信仰心";
			mes "ある者に教えを説くほうが";
			mes "良いな……";
			next;
			mes "[レベイレブ]";
			mes "皆今頃どうしているだろう……";
			next;
			mes "[レベイレブ]";
			mes "……";
			next;
			mes "[レベイレブ]";
			mes "君、冒険者よ、ここで";
			mes "私のたわ言を聞きながら";
			mes "ふらふらしているということは";
			mes "私の頼みを聞いてくれる時間が";
			mes "あるということか？";
			next;
			mes "[レベイレブ]";
			//mes "私の頼みを聞きく度に信仰心が";
			mes "私の頼みを聞く度に信仰心が";
			mes "生まれ、クルセイダーに対する";
			mes "理解が生まれるかもしれん……";
			mes "さて、どうか？";
			next;
			if(select("どんな頼みですか？","もううんざりです……") == 2) {
				mes "[レベイレブ]";
				mes "寂しいことを言う……";
				next;
				mes "[レベイレブ]";
				mes "君は冒険者……そして自由の身。";
				next;
				mes "[レベイレブ]";
				mes "君は行きたい所にその二本の足で";
				mes "歩いていくことができるが……";
				mes "私はここに居ることが定められている。";
				mes "捜索に行くこともかなわぬ";
				mes "身なのだ……";
				next;
				mes "[レベイレブ]";
				mes "本当に嫌なのであれば仕方ないが、";
				mes "そうでないのならあまり薄情なことを";
				mes "言うものではないぞ。";
				close2;
				cutin "god_rebeireb",255;
				end;
			}
			mes "[レベイレブ]";
			mes "他でもない、各地に赴いている";
			mes "クルセイダーの第3中隊、";
			mes "第1小隊、第3分隊を見つけて";
			mes "来て欲しい。";
			mes "一回りして消息と安否を";
			mes "調べてもらうだけでいい……";
			next;
			mes "[レベイレブ]";
			mes "どうだ？";
			next;
			if(select("わかりました、やりましょう","とてもできません……") == 2) {
				mes "[レベイレブ]";
				mes "寂しいことを言う……";
				next;
				mes "[レベイレブ]";
				mes "君は冒険者……そして自由の身。";
				next;
				mes "[レベイレブ]";
				mes "君は行きたい所にその二本の足で";
				mes "歩いていくことができるが……";
				mes "私はここに居ることが定められている。";
				mes "捜索に行くこともかなわぬ";
				mes "身なのだ……";
				next;
				mes "[レベイレブ]";
				mes "本当に嫌なのであれば仕方ないが、";
				mes "そうでないのならあまり薄情なことを";
				mes "言うものではないぞ。";
				close2;
				cutin "god_rebeireb",255;
				end;
			}
			mes "[レベイレブ]";
			mes "おお、よし！";
			mes "消息がつかめれば良いから";
			mes "それ以上は考えなくていい……";
			next;
			mes "[レベイレブ]";
			mes "ただ……問題なのは……";
			mes "皆がどこに行ったのかが";
			mes "全然わかっていないのが";
			mes "問題なのだ……";
			next;
			mes "[レベイレブ]";
			mes "図書館のどこかにある書類を";
			mes "調査して、転入と転出の資料";
			mes "を見ればわかるのだろうが……";
			mes "その資料はクルセイダー内でも";
			mes "閲覧が難しいものだから";
			mes "手がかりにはならんだろうな……";
			next;
			mes "[レベイレブ]";
			mes "それでは、頼んだぞ。";
			next;
			mes "[レベイレブ]";
			mes "今、無責任によくそんな頼み事を";
			mes "持ちかけるなと思わなかったか？";
			mes "それとも……また頼まれごとかと";
			mes "内心うんざりしていなかったか？";
			next;
			mes "[レベイレブ]";
			mes "私も投げ出して他の場所に";
			mes "行きたいのはやまやまなのだ……";
			mes "ここでよく尋ね事ばかりされるのも";
			mes "辛いものだ……";
			next;
			mes "[レベイレブ]";
			mes "いつも同じようなことを教え";
			mes "口が酸っぱくなるとはこのことだ。";
			mes "しかし、引き受けた任務であるから";
			mes "おろそかにもできない。";
			next;
			mes "[レベイレブ]";
			mes "君は行きたい所にその二本の足で";
			mes "歩いていくことができるが……";
			mes "私はここに居ることが定められている。";
			mes "捜索に行くこともかなわぬ";
			mes "身なのだ……";
			next;
			mes "[レベイレブ]";
			mes "さぁ、早くいって隊員たちの消息を";
			mes "聞かせてくれ。";
			mes "気になってしかたがないのだ……";
			set GOD_2QUE,1;
			close2;
			cutin "god_rebeireb",255;
			end;
		case 1:
		case 2:
		case 3:
			mes "[レベイレブ]";
			mes "今頃我等の分隊員はどうして";
			mes "いるだろうか……";
			mes "顔を見られなくなってからもう";
			mes "どれだけ経つだろうか……";
			next;
			mes "[レベイレブ]";
			mes "うん？　そこで何をしている？";
			next;
			if(rand(1,10) > 6 && GOD_2QUE == 2) {
				set '@str$,"なぜこんなことに？";
			}
			switch(select("あの……どこへ行けば……？","今発とうとしていたところです",'@str$)) {
			case 1:
				mes "[レベイレブ]";
				mes "そうだな……";
				mes "どこから探せば良いか";
				mes "見当もつかんだろうな……";
				mes "一番近づく可能性のある所といえば";
				mes "やはり先に話したように";
				next;
				mes "[レベイレブ]";
				mes "図書館にある書類の中で";
				mes "^0000FF第3中隊転入/転出資料^000000";
				mes "見るのが一番早いだろうな。";
				close2;
				cutin "god_rebeireb",255;
				end;
			case 2:
				mes "[レベイレブ]";
				mes "お、そうか。";
				mes "よろしくたのむ。";
				mes "^0000FF最後の任務^000000以後、解散して";
				mes "から皆がどこへ行ったのか";
				mes "全く分からぬ。是非頼んだぞ！";
				set GOD_2QUE,2;
				close2;
				cutin "god_rebeireb",255;
				end;
			case 3:
				mes "[レベイレブ]";
				mes "それは……我等クルセイダーの";
				mes "第1小隊第3分隊が解散された理由……";
				mes "やはりあの時のことを思い出さ";
				mes "ねばならぬのか……";
				next;
				mes "[レベイレブ]";
				mes "まず……";
				mes "我等はクルセイダーと言っても";
				mes "基本的には軍人。";
				mes "上官の命には絶対従わなければ";
				mes "ならない立場なのだ。";
				next;
				mes "[レベイレブ]";
				mes "……";
				mes "あの時、その事を本当に";
				mes "理解していたかどうか……";
				next;
				mes "[レベイレブ]";
				mes "……";
				next;
				mes "";
				mes "- しばらくして、";
				mes "彼は怒気を含んだ声で";
				mes "私に話した。 -";
				next;
				mes "[レベイレブ]";
				mes "もうこの話はやめにしよう。";
				mes "我等が解散した理由を知ったところで";
				mes "何ともならん。";
				next;
				mes "[レベイレブ]";
				mes "さぁ、図書館に行って";
				mes "^0000FF第3中隊転入/転出資料^000000を捜し出し";
				mes "分隊員の行方をつかんでくれ！";
				set GOD_2QUE,3;
				close2;
				cutin "god_rebeireb",255;
				end;
			}
		case 4:
		case 5:
		case 6:
		case 7:
		case 8:
		case 9:
		case 10:
		case 11:
		case 12:
		case 13:
		case 14:
		case 15:
		case 16:
		case 17:
			mes "[レベイレブ]";
			mes "うん？";
			mes "書類管理人に会ったが";
			mes "資料を閲覧させてくれないと？";
			mes "ふむ……それでもなお";
			mes "熱心に頼み誠意を見せれば";
			mes "見せてくれるのではないか？";
			next;
			mes "[レベイレブ]";
			mes "厳しい世ではあるが";
			mes "人の住む世界だ。";
			next;
			mes "[レベイレブ]";
			mes "とにかく我が分隊員が";
			mes "どうしているかだけでも";
			mes "知りたいのだ……";
			close2;
			cutin "god_rebeireb",255;
			end;
		case 18:
		case 19:
			if((GOD_2QUE_SUB1 > 0) || (GOD_2QUE_SUB2 > 0) || (GOD_2QUE_SUB3 > 0) || (GOD_2QUE_SUB4 > 0) || (GOD_2QUE_SUB5 > 0) || (GOD_2QUE_SUB6 > 0)) {
				mes "[レベイレブ]";
				mes "おお！";
				mes "会ってきたのか？";
				mes "元気そうであったか？";
				next;
				mes "- 頭痛がひどいということ、";
				mes "記憶喪失にかかっている";
				mes "ことさえ除けば元気そうだ";
				mes "と伝えた。 -";
				close2;
				cutin "god_rebeireb",255;
				end;
			}
			mes "- あなたは書類を調べた";
			mes "結果を話した。 -";
			next;
			mes "- 皆がどこで何をしているか";
			mes "について。 -";
			next;
			mes "[レベイレブ]";
			mes "ほう！　書類に記録があったのか！";
			mes "だが……書類が古いものであったら";
			mes "今どうしているかはわからんな……";
			next;
			mes "[レベイレブ]";
			mes "やはり君が分隊員たちに会って";
			mes "消息をつかんでくれることが一番だ。";
			mes "君の^0000FF目で直接^000000見てだ。";
			next;
			mes "[レベイレブ]";
			mes "是非頼んだぞ……";
			next;
			mes "[レベイレブ]";
			mes "古い書類の情報では";
			mes "いまいち信じることができぬ……";
			mes "年月が経っていればいるほどな……";
			close2;
			cutin "god_rebeireb",255;
			end;
		case 20:
		case 21:
		case 22:
			mes "[レベイレブ]";
			mes "おお、戻って来てくれたか……";
			mes "皆に会えたのだな？　ふむ……";
			mes "うん？　何か言いたそうな";
			mes "顔をしているな……";
			next;
			switch(select("これまでに感じた疑念について話す","まだその時ではない")) {
			case 1:
				mes "- あなたはこれまでのこと";
				mes "について整理して話そうと";
				mes "思ったが -";
				next;
				mes "- 分隊員に誰一人として";
				mes "まともな状態の者が";
				mes "居なかったこと― -";
				next;
				mes "- 共通して記憶喪失に";
				mes "かかっていたこと― -";
				next;
				mes "- ロイヤルミストの発言― -";
				next;
				mes "- そして皆の口から出た";
				mes "イグニゼムとは誰なのか― -";
				next;
				mes "- これら全てが頭の中で";
				mes "うずまき、整理しきれないまま";
				mes "分隊員たちのことを話していた。 -";
				next;
				mes "[レベイレブ]";
				mes "ふむ……";
				mes "はっはっは……おもしろい話だった。";
				next;
				mes "[レベイレブ]";
				mes "ふ……そう睨むなら";
				mes "他にも話を聞かせてくれぬか？";
				mes "これ以上話すことが無ければ";
				mes "終わりにしよう。";
				next;
				mes "[レベイレブ]";
				mes "分隊員の消息を知らせてくれた";
				mes "ことはありがたく思う。";
				mes "さて、私は国王の命で研究しなければ";
				mes "ならないことがあるから";
				mes "これで失礼する。";
				mes "ふふ……神のご加護あらんことを。";
				set GOD_2QUE,21;
				close2;
				cutin "god_rebeireb",255;
				end;
			case 2:
				mes "- あなたは疑いの眼差しを";
				mes "悟られないように -";
				next;
				mes "- これまでに会った";
				mes "クルセイダー第3中隊";
				mes "第1小隊 第3分隊達の";
				mes "消息について話した。 -";
				next;
				mes "- もちろん、書類に書かれ";
				mes "ていたことにほんの少しの";
				mes "現実を織り混ぜて -";
				next;
				mes "- 隠すべきことは";
				mes "隠したまま話をした。 -";
				next;
				mes "[レベイレブ]";
				mes "ふむ……";
				mes "そうか、皆うまくやっているのだな？";
				mes "ふふ……";
				next;
				mes "- 彼の私を見る目つきが微妙に";
				mes "変化した気がした。";
				mes "警戒されているのだろうか？ -";
				next;
				mes "[レベイレブ]";
				mes "分隊員の消息を伝えてくれたことは";
				mes "ありがたく思う。";
				mes "さて、私は国王の命で研究しなければ";
				mes "ならないことがあるから";
				mes "これで失礼する。";
				mes "ふふ……神のご加護あらんことを。";
				next;
				mes "- 彼の含み笑いには";
				mes "不愉快な印象を受ける。 -";
				close;
				set GOD_2QUE,22;
				close2;
				cutin "god_rebeireb",255;
				end;
			}
		case 23:
		case 24:
			mes "- あなたは";
			mes "イグニゼムに関することを";
			mes "出しながら、旅の途中で";
			mes "得た結論を話した。 -";
			next;
			mes "- 彼は……予想の範囲";
			mes "だったのかあまり動揺する";
			mes "気配を見せない。 -";
			next;
			mes "[レベイレブ]";
			mes "今になってそんな昔話が";
			mes "出てくるとはな……";
			mes "すべて知ってしまったのだな？";
			mes "だが、もう証拠はない。";
			mes "くっくっくっくっく……";
			next;
			mes "[レベイレブ]";
			mes "いくらジタバタしたところで";
			mes "結局、世の中は私のような";
			mes "エリートが支配するものなのだよ。";
			mes "くっくっく……";
			next;
			mes "[レベイレブ]";
			mes "憎いか？　この私が！";
			mes "それならこうすれば簡単だ。";
			next;
			mes "[レベイレブ]";
			mes "あの後ろにいる軍判事は、";
			mes "クルセイダー内部の犯罪等を";
			mes "調査して軍法裁判を行える";
			mes "権限を持つ者だ。";
			next;
			mes "[レベイレブ]";
			mes "君のような人が100人くらい";
			mes "集まれば多分裁判を開く";
			mes "ことはできるだろう。";
			mes "焼け石に水だろうがね……";
			mes "ははははは！";
			close2;
			cutin "god_rebeireb",255;
			end;
		case 25:
		case 26:
			mes "[レベイレブ]";
			mes "ふん……本当にするとはな。";
			mes "後で後悔することになるぞ……";
			mes "結局、この世界は私のような";
			mes "エリート、神に近い人間が支配";
			mes "するものなのだよ。";
			close2;
			cutin "god_rebeireb",255;
			end;
		default:
			mes "[レベイレブ]";
			mes "いくらジタバタしたところで";
			mes "結局、世の中は私のような";
			mes "エリートが支配するものなのだよ。";
			close2;
			cutin "god_rebeireb",255;
			end;
		}
	}
	mes "[レベイレブ]";
	mes "我等はクルセイダー。";
	mes "オーディンの意志に沿い";
	mes "聖戦に備える者等だ。";
	mes "千年前のように……";
	mes "今一度魔族を討伐する日が";
	mes "訪れるだろう。";
	close2;
	cutin "god_rebeireb",255;
	end;
}

prt_castle.gat,48,164,0	script	クルセイダー#mepan	734,{
	if($GodSleipnir >= 50 && $GodMagingiorde < 100) {
		if(GOD_2QUE >= 23 && GOD_2QUE <= 24) {
			mes "[マックス=フォン=シドー]";
			mes "よく来た！";
			mes "ここは聖戦に備え準備する場所である。";
			mes "我等に賛同する者はいつでも歓迎だ。";
			mes "そして私は、軍法裁判の判事も";
			mes "担当している";
			mes "マックス=フォン=シドーという。";
			next;
			mes "[マックス=フォン=シドー]";
			mes "君、私に何か用かね？";
			next;
			mes "- あなたは何も言わず";
			mes "書類が入ったファイルを";
			mes "突き出した。 -";
			next;
			mes "- そのファイルには、";
			mes "レベイレブを裁く嘆願書とともに、";
			mes "イグニゼムとともに導き出した結論が";
			mes "理路整然と書き連ねられた";
			mes "書類が入っている。 -";
			next;
			mes "[マックス=フォン=シドー]";
			mes "君の思い、しかと受け取った。";
			mes "このような思いが集まり、";
			mes "世を変えていくものと信じている。";
			mes "この書類は、我等を正しい道へと";
			mes "導く道しるべとなるであろう。";
			if($GodMagingiorde < 100) {		// 受付中
				set $GodMagingiorde,$GodMagingiorde+1;
				if($GodMagingiorde == 50) {
					announce "◆◆大陸に[メギンギョルド]の封印が姿を現しました。◆◆",0;
				}
				else if($GodMagingiorde == 100) {
					if($GodSleipnir == 100 && $GodMagingiorde == 100 && $GodBrysinggamen == 100 && $GodMjolnir == 100)
						announce "◆◆[メギンギョルド]の封印が解けたことにより全ての封印が解け、神器の作成ができるようになりました。◆◆",0;
					else
						announce "◆◆[メギンギョルド]の封印が解けました。◆◆",0;
				}
			}
			if(GOD_2QUE == 23)
				set GOD_2QUE,25;
			else if(GOD_2QUE == 24)
				set GOD_2QUE,26;
			close;
		}
		else if(GOD_2QUE >= 27) {
			mes "[マックス=フォン=シドー]";
			mes "悲しい知らせを伝えなければ";
			mes "ならないのは残念だな。";
			mes "君が提出した資料が受諾される";
			mes "かはわからんという判決が出ている。";
			next;
			mes "[マックス=フォン=シドー]";
			mes "どうなるかは私にもわからんが、";
			mes "あきらめずに頑張りたまえ。";
			close;
		}
		else {
			mes "[マックス=フォン=シドー]";
			mes "よく来た！";
			mes "ここは聖戦に備える場所、";
			mes "マスタークルセイダーの部屋だ。";
			mes "聖戦に備えるという大業に賛同";
			mes "する者はいつでも歓迎するぞ！";
			close;
		}
	}
	mes "[マックス=フォン=シドー]";
	mes "よく来た！";
	mes "ここは聖戦に備える場所、";
	mes "マスタークルセイダーの部屋だ。";
	mes "聖戦に備えるという大業に賛同";
	mes "する者はいつでも歓迎するぞ！";
	close;
}

prt_in.gat,172,109,0	script	書類ファイル#prtbook	111,{
	if(GOD_2QUE == 12) {
		mes "^0000FF- クルセイダー第3中隊転入^000000";
		mes "^0000FF/転出書類 -^000000";
		mes "をついに見つけた!!!";
		close;
	}
	else if(GOD_2QUE >= 7 && GOD_2QUE <= 11) {
		mes "目の前に書類ファイルが";
		mes "ぎっしりつまっている。";
		mes "ゆっくりと捜索を始めた。";
		if(rand(1,10) > 6 && GOD_2QUE >= 7)
			set GOD_2QUE,GOD_2QUE+1;
		close;
	}
	mes "[書類管理人 ゼガン]";
	mes "その書類に触れてはなりません！";
	next;
	mes "- あなたは";
	mes "おとなしく下がった。 -";
	close;
}

prt_in.gat,170,109,0	duplicate(書類ファイル#prtbook)	書類ファイル	111
prt_in.gat,168,109,0	duplicate(書類ファイル#prtbook)	書類ファイル	111
prt_in.gat,169,109,0	duplicate(書類ファイル#prtbook)	書類ファイル	111
prt_in.gat,166,109,0	duplicate(書類ファイル#prtbook)	書類ファイル	111

prt_in.gat,172,106,0	script	書類管理人	833,{
	if($GodSleipnir >= 50 && $GodMagingiorde < 100) {
		if(GOD_2QUE >= 3 && GOD_2QUE <= 6) {
			mes "[書類管理人 ゼガン]";
			mes "あ、そちらの書類ファイルのある";
			mes "方は触らないでくださいね。";
			mes "プロンテラの軍事関連の書類が";
			mes "たくさん入っていますから。";
			next;
			mes "[書類管理人 ゼガン]";
			mes "全て閲覧は禁止されています。";
			mes "いいですね？";
			mes "早く書類を整理してプロンテラ軍";
			mes "まで提出しなければ……";
			next;
			mes "[書類管理人 ゼガン]";
			mes "ああ！　あの書類はどこへ行った？";
			mes "暗くて探しにくい……くそっ！";
			mes "目が悪くなってしかたない……";
			next;
			mes "[書類管理人 ゼガン]";
			mes "あなたは何ですか？";
			mes "さっきからそこに立って……";
			mes "何か探し物なら、あっちに行って";
			mes "探してください！";
			mes "見つかったらすぐ帰ってくださいね！";
			while(1) {
				next;
				switch(select("目の具合がよくないのですか？","ある書類を捜しているんです","書類を探すのを手伝いましょう","何の書類が無いのですか？")) {
				case 1:
					mes "[書類管理人 ゼガン]";
					mes "こんな暗い所で書類ばかり";
					mes "探していたら、この頃急激に";
					mes "視力が低下してしまって……";
					mes "^0000FFまともな明かりも無くて^000000どうやって";
					mes "仕事をしろというのか……";
					mes "^0000FF近くの物すら^000000よく見えない……";
					if(GOD_2QUE == 5 && (countitem(611) > 0 || countitem(1041) > 0)) {
						next;
						mes "[書類管理人 ゼガン]";
						mes "ん？　あなた、良い物を";
						mes "お持ちですね！";
						mes "それ……使わせていただいても";
						mes "よろしいですか？";
						mes "探し物をするのにちょうどいい！";
						next;
						if(select("だめです","どうぞ使ってください") == 1) {
							mes "[書類管理人 ゼガン]";
							mes "そうですか……";
							mes "では頑張って探しましょう……";
							close;
						}
						mes "[書類管理人 ゼガン]";
						mes "おお、本当ですか！";
						mes "先ほどの書類を探すお手伝いを";
						mes "してくださるという話は本当だった";
						mes "んですね！";
						if(countitem(1041))
							delitem 1041,countitem(1041);
						if(countitem(611))
							delitem 611,1;
						set GOD_2QUE,6;
						next;
						mes "[書類管理人 ゼガン]";
						mes "ありがとうございます、";
						mes "ありがとうございます～";
						mes "おかげ様でもう少し楽に";
						mes "探すことができそうです。";
						mes "ああ、どうせなら一緒に";
						mes "書類探しをしましょう。";
					}
					else if(GOD_2QUE > 5) {
						mes "[書類管理人 ゼガン]";
						mes "でも、おかげ様でもう少し楽に";
						mes "探すことができそうです。";
					}
					continue;
				case 2:
					if(GOD_2QUE != 6) {
						mes "[書類管理人 ゼガン]";
						mes "こらぁぁぁ！";
						mes "さっき注意したでしょう！";
						next;
						mes "[書類管理人 ゼガン]";
						mes "ここにある書類は閲覧が";
						mes "禁止されていると!";
						mes "まったく分からない人ですね";
						mes "あなたは！";
						mes "何度言ったらわかるんですか！";
						close;
					}
					mes "[書類管理人 ゼガン]";
					mes "まだ見つかりませんね……";
					mes "向こうの書棚にある書類の山";
					mes "をよく探してみてください。";
					mes "私もそっちの書類を見たいんです。";
					set GOD_2QUE,7;
					close;
				case 3:
					if(GOD_2QUE == 4) {
						mes "[書類管理人 ゼガン]";
						mes "ふーむ……";
						mes "どんな書類なのかを知っているなら";
						mes "重要さも分かっているでしょう？";
						mes "一般の方には閲覧することが";
						mes "できないことを知っていて";
						mes "来たのですか？";
						next;
						mes "[書類管理人 ゼガン]";
						mes "その書類がいったいなぜここに";
						mes "保管されていて、重要な物なのかは";
						mes "わかりませんが、とにかく閲覧が";
						mes "禁止されているということなんです。";
						mes "しかも、クルセイダーでも";
						mes "それは変わらないと……";
						next;
						mes "[書類管理人 ゼガン]";
						mes "ざっと聞いてみた感じでは";
						mes "たいして重要なものでも";
						mes "なさそうなんですけどねぇ……";
						mes "はぁ……たしかに私の仕事は";
						mes "そんなに大変なものでもありませんが";
						mes "これは国家予算の無駄遣いでしょう……";
						set GOD_2QUE,5;
						continue;
					}
					else if(GOD_2QUE > 4) {
						mes "[書類管理人 ゼガン]";
						mes "目が疲れて疲れて……";
						mes "うん？";
						mes "こっちを手伝ってくれるんですか？";
						continue;
					}
					else {
						mes "[書類管理人 ゼガン]";
						mes "うん？　あなたは私が探している";
						mes "書類がどんなものなのかわかって";
						mes "いて探すというんですか？";
						mes "書類の内容も知らずに探すと？";
						mes "それでは話になりません！";
						mes "あっちに行っていてください！";
						close;
					}
				case 4:
					mes "[書類管理人 ゼガン]";
					mes "ええっと……";
					mes "それは教えることはできない";
					mes "決まりになっています……";
					next;
					mes "["+strcharinfo(0)+"]";
					mes "その書類とはもしかして";
					input '@answer$;
					set '@what1$,"第3中隊";
					set '@what2$,"分隊";
					set '@what3$,"転入";
					set '@what4$,"転出";
					set '@temp_a,strstr('@answer$,'@what1$);
					set '@temp_b,strstr('@answer$,'@what2$);
					set '@temp_c,strstr('@answer$,'@what3$);
					set '@temp_d,strstr('@answer$,'@what4$);
					mes "["+strcharinfo(0)+"]";
					mes "^0000FF" +'@answer$+ "^000000";
					mes "関連の書類ではありませんか？";
					next;
					if('@temp_a == 1 && '@temp_b == 1 && '@temp_c == 1 && '@temp_d == 1) {
						mes "[書類管理人 ゼガン]";
						mes "そ、その通りです……";
						mes "なぜあなたがそれを知って";
						mes "いるんですか!?";
						set GOD_2QUE,4;
						continue;
					}
					mes "[書類管理人 ゼガン]";
					mes "いいえ、違いますよ？";
					continue;
				}
			}	// end while
		}
		else if(GOD_2QUE == 2) {
			mes "[書類管理人 ゼガン]";
			mes "あ、そちらの書類ファイルのある";
			mes "方は触らないでくださいね。";
			mes "プロンテラの軍事関連の書類が";
			mes "たくさん入っていますから。";
			next;
			mes "[書類管理人 ゼガン]";
			mes "全て閲覧は禁止されています。";
			mes "いいですね？";
			mes "早く書類を整理してプロンテラ軍";
			mes "まで提出しなければ……";
			next;
			mes "[書類管理人 ゼガン]";
			mes "ああ！　あの書類はどこへ行った？";
			mes "暗くて探しにくい……くそっ！";
			mes "目が悪くなってしかたない……";
			next;
			mes "[書類管理人 ゼガン]";
			mes "あなたは何ですか？";
			mes "さっきからそこに立って……";
			mes "何か探し物なら、あっちに行って";
			mes "探してください！";
			mes "見つかったらすぐ帰ってくださいね！";
			next;
			switch(select("見たい書類があるんです","目の具合がよくないのですか？","書類を探すのを手伝いましょう","何の書類が無いのですか？")) {
			case 1:
				mes "[書類管理人 ゼガン]";
				mes "さっき言ったでしょう！";
				mes "キイイイイイ!!";
				mes "ここにある書類は";
				mes "閲覧が禁止されていると！";
				mes "まったくもうわからない人ですね！";
				mes "何回言えばわかってくれるんですか？";
				close;
			case 2:
				mes "[書類管理人 ゼガン]";
				mes "こんな暗い所で書類ばかり";
				mes "探していたら、この頃急激に";
				mes "視力が低下してしまって……";
				mes "まともな明かりも無くてどうやって";
				mes "仕事をしろというのか……";
				mes "近くの物すらよく見えない……";
				close;
			case 3:
				mes "[書類管理人 ゼガン]";
				mes "うん？　あなたは私が探している";
				mes "書類がどんなものなのかわかって";
				mes "いて探すというんですか？";
				mes "書類の内容も知らずに探すと？";
				mes "それでは話になりません！";
				mes "あっちに行っていてください！";
				close;
			case 4:
				mes "[書類管理人 ゼガン]";
				mes "ええっと……";
				mes "それは教えることはできない";
				mes "決まりになっています……";
				next;
				mes "["+strcharinfo(0)+"]";
				mes "その書類とはもしかして";
				input '@str$;
				mes "["+strcharinfo(0)+"]";
				mes "^0000FF" + '@str$ + "^000000";
				mes "関連の書類ではありませんか？";
				next;
				mes "[書類管理人 ゼガン]";
				mes "いいえ？";
				close;
			}
		}
		else if(GOD_2QUE >= 7 && GOD_2QUE <= 11) {
			mes "[書類管理人 ゼガン]";
			mes "うーん……書類は見つかり";
			mes "ましたか？";
			mes "こっちもずっと探しているのですが";
			mes "なかなか見つかりませんねぇ……";
			if(rand(1,10) > 4) {
				mes "私は右側を探すので、あなたは";
				mes "左側をもう少し探してみてください。";
				close;
			}
			else {
				mes "今私が探している右側を一緒に";
				mes "探すか、真ん中を探してみませんか？";
				close;
			}
		}
		else if(GOD_2QUE == 12) {
			mes "[書類管理人 ゼガン]";
			mes "おお！";
			mes "見つかった！　見つかった！";
			next;
			mes "ご苦労さま。";
			mes "今でもあなたのような良い";
			mes ((Sex)? "青年": "お嬢さん")+ "がいるとはね……";
			mes "何かお礼でもしてあげたい";
			mes "ところなのですが、私はこれを";
			mes "持ってすぐ報告しにいかねば……";
			next;
			menu "少し書類を見せてくれませんか？",-;
			mes "[書類管理人 ゼガン]";
			mes "うーん……そういえば、";
			mes "あなたはさっきも書類が見たいと";
			mes "言っていましたね……";
			mes "あまり重要そうな書類にも見えないし、";
			mes "良いかもしれませんね。";
			next;
			mes "[書類管理人 ゼガン]";
			mes "うん、これだけ手伝ってくれた";
			mes "のだから、閲覧するくらいいいか。";
			mes "でも、原本は私がこれから持って";
			mes "いかねばならないので、";
			mes "写本を作ってさしあげましょう。";
			next;
			mes "[書類管理人 ゼガン]";
			mes "これから写本を作るための材料を";
			mes "言います。";
			mes "写本には、検索魔法も原本と";
			mes "同じようにかけてあげますよ。";
			next;
			mes "[書類管理人 ゼガン]";
			mes "で、写本を作るのに必要なのは……";
			next;
			mes "[書類管理人 ゼガン]";
			mes "なめらかな紙 2枚";
			mes "油紙 1枚";
			mes "墨汁 3個";
			mes "鳥の羽毛 3本";
			mes "最後に、検索魔法をかけるための";
			mes "ブルージェムストーン 20個。";
			next;
			mes "[書類管理人 ゼガン]";
			mes "これだけ集めてくれたら、";
			mes "喜んで写本を作ってさしあげますよ。";
			mes "私が見た限り、そんなに重要な";
			mes "書類でもなさそうなので、";
			mes "これくらいで大丈夫でしょう。";
			next;
			mes "[書類管理人 ゼガン]";
			mes "ただし、書類はここに保管することに";
			mes "なるので、見たい場合はここまで";
			mes "見に来てくださいね。";
			next;
			mes "[書類管理人 ゼガン]";
			mes "それでは、できる限り急いでください。";
			set GOD_2QUE,13;
			close;
		}
		else if(GOD_2QUE == 13) {
			if(countitem(7111) < 2 || countitem(7151) < 1 || countitem(1024) < 3 || countitem(916) < 3 || countitem(717) < 20) {
				mes "[書類管理人 ゼガン]";
				mes "材料を忘れたのでしょうか？";
				mes "なめらかな紙 2枚";
				mes "油紙 1枚、墨汁 3個";
				mes "鳥の羽毛 3本";
				mes "ブルージェムストーン 20個。";
				mes "これらを集めてきてください。";
				close;
			}
			mes "[書類管理人 ゼガン]";
			mes "あらら、そんなにこの書類が";
			mes "見たいのですね……";
			mes "一体どんな内容なんだか……";
			next;
			mes "[書類管理人 ゼガン]";
			mes "あ、一応集めて来た材料は";
			mes "預かりましょう。";
			mes "全部読み終わった後に";
			mes "写してさしあげますよ。";
			delitem 7111,2;
			delitem 7151,1;
			delitem 1024,3;
			delitem 916,3;
			delitem 717,20;
			set GOD_2QUE,14;
			next;
			mes "[書類管理人 ゼガン]";
			mes "確かにいただきました。";
			mes "しばしお待ちを……";
			close;
		}
		else if(GOD_2QUE >= 14 && GOD_2QUE <= 15) {
			mes "[書類管理人 ゼガン]";
			mes "ちょっと待ってくださいと";
			mes "言ったはずです。";
			mes "私が目を通してから写しを";
			mes "作りますから……";
			if(rand(1,10) > 6)
				set GOD_2QUE,GOD_2QUE+1;
			close;
		}
		else if(GOD_2QUE == 16) {
			mes "[書類管理人 ゼガン]";
			mes "写本ができました。";
			mes "中身は同じものになっています。";
			mes "ただし、書類はここに保管します";
			mes "から、見たくなった場合はこちら";
			mes "まで来てくださいね。";
			next;
			mes "[書類管理人 ゼガン]";
			mes "検索魔法も原本のようにかけて";
			mes "おきましたから、書類を探した";
			mes "かったらいつでも来てください。";
			set GOD_2QUE,17;
			close;
		}
		else if(GOD_2QUE >= 17) {
			mes "[書類管理人 ゼガン]";
			mes "おお、今度は何をしに？";
			next;
			while(1) {
				switch(select("書類の内容を検索する","検索をやめる","話し合う")) {
				case 1:
					mes "- 書類検索魔法実行 -";
					mes "- 検索したい内容についての -";
					mes "- キーワードを入力してください。 -";
					next;
					input '@answer$;
					set '@what1$,"クルセイダー";
					set '@what2$,"第3中隊";
					set '@what3$,"第1小隊";
					set '@what4$,"第3分隊";
					set '@what5$,"最後の任務";
					set '@what6$,"レベイレブ";
					set '@what7$,"イグニゼム";
					set '@what8$,"ジャン・ファードック";
					set '@what9$,"クアーク・ドノン";
					set '@what10$,"ジャック・オー";
					set '@what11$,"エマ・シアース";
					set '@what12$,"ロイヤルミスト";
					set '@what13$,"ナインボール";
					set '@temp_a,strstr('@answer$,'@what1$);
					set '@temp_b,strstr('@answer$,'@what2$);
					set '@temp_c,strstr('@answer$,'@what3$);
					set '@temp_d,strstr('@answer$,'@what4$);
					set '@temp_e,strstr('@answer$,'@what5$);
					set '@temp_f,strstr('@answer$,'@what6$);
					set '@temp_g,strstr('@answer$,'@what7$);
					set '@temp_h,strstr('@answer$,'@what8$);
					set '@temp_i,strstr('@answer$,'@what9$);
					set '@temp_j,strstr('@answer$,'@what10$);
					set '@temp_k,strstr('@answer$,'@what11$);
					set '@temp_l,strstr('@answer$,'@what12$);
					set '@temp_m,strstr('@answer$,'@what13$);
					if('@temp_a == 1) {
						mes "- 検索ワード :";
						mes '@answer$+ "で検索 -";
						mes "クルセイダー :";
						mes "聖戦に備える者等で、";
						next;
						mes "ソードマンの中である水準以上の";
						mes "実力を持ち、信仰心ある者の";
						mes "中から選抜された者。";
						next;
						mes "現在の総兵数は軍事機密";
						mes "であるため記さない。";
						next;
						mes "本章ではクルセイダー";
						mes "第3中隊の転入/転出のみを";
						mes "扱う事とする。";
						close2;
						if('@temp_b == 1) {
							mes "- 検索ワード :";
							mes '@answer$+ "で検索 -";
							mes "第3中隊 :";
							mes "クルセイダー第3中隊。";
							next;
							mes "現存するクルセイダーの";
							mes "中でも最も優れた精鋭で";
							mes "構成されている。";
							next;
							mes "転入/転出に関する報告は";
							mes "創設以来報告はない。";
							next;
							mes "クルセイダー第3中隊";
							mes "第1小隊・第3分隊の場合は";
							mes "例外であり、現在該当する";
							mes "分隊員達は転出している";
							mes "とのことで、一般生活に";
							mes "戻った者もいる。";
							next;
							mes "より詳細な内容は、";
							mes "クルセイダー第3中隊";
							mes "第1小隊の部で取り扱う。";
							close2;
							if('@temp_c == 1) {
								mes "- 検索ワード :";
								mes '@answer$+ "で検索 -";
								mes "第1小隊 :";
								mes "クルセイダー第3中隊・第1小隊。";
								next;
								mes "各中隊は4つの小隊から";
								mes "成り立っており、その中で";
								mes "1番目の小隊を第1小隊と";
								mes "呼称している。";
								next;
								mes "本文書には第1小隊・第3分隊以外の";
								mes "記録はない。";
								close2;
								if('@temp_d == 1) {
									mes "- 検索ワード :";
									mes '@answer$+ "で検索 -";
									mes "第3分隊 :";
									mes "クルセイダー第3分隊。";
									next;
									mes "^0000FF最後の任務^000000にあたった";
									mes "クルセイダー第3中隊・第1小隊";
									mes "・第3分隊員の名を記す。";
									next;
									mes "^0000FF : レベイレブ";
									mes " : ジャック・オー";
									mes " : ジャン・ファードック";
									mes " : クアーク・ドノン";
									mes " : エマ・シアース";
									mes " : ロイヤルミスト";
									mes " : ナインボール^000000";
									if(GOD_2QUE == 17)
										set GOD_2QUE,18;
									close2;
									if('@temp_e == 1) {
										mes "- 検索ワード :";
										mes '@answer$+ "で検索 -";
										mes "この任務を最後に、";
										mes "最高精鋭部隊である";
										mes "第3分隊を解体することが";
										mes "上層部により決定された。";
										next;
										mes "任務の内容は、現世に残された";
										mes "^0000FF神器の手がかり^000000を";
										mes "王の命で秘密裏に";
										mes "捜索するというものであった。";
										next;
										mes "ところが、第3分隊の任務中に";
										mes "ある事件が発生した。";
										mes "分隊員の中の一人が、分隊長に";
										mes "作戦に対する不満を述べ、";
										mes "^0000FF分隊長の命令を無視して独断的な行動^000000";
										mes "をする。";
										next;
										mes "結果的に口論になり争いが生じ、";
										mes "「独断的な行動をした当事者」";
										mes "を除いた全ての分隊員との";
										mes "協議の末^0000FF命令不服従^000000という";
										mes "結論に落ち着いた。";
										next;
										mes "該当の1名には制裁が与えられ、";
										mes "傷を負って入院したとの";
										mes "報告がある。";
										next;
										mes "この事件の後、神器の手がかり";
										mes "に対する探索は「部分的」と称される";
										mes "程度の成功を収めたが、これによって";
										mes "第3分隊の指揮能力を疑った";
										mes "第3中隊長が、第1小隊長に";
										mes "責任を追及。";
										next;
										mes "第1小隊長は第3分隊長と";
										mes "面談の後、責任を取るために";
										mes "第3分隊解散を決意。";
										mes "そのまま第3分隊は解散される。";
										next;
										mes "解散後、分隊長以下分隊員は";
										mes "3ヶ月間軍規教育学校に";
										mes "入所後、他の場所に転出させられた。";
										next;
										mes "現在、第3分隊の探索任務";
										mes "による結果物は、当時の";
										mes "分隊長であるレベイレブを筆頭に";
										mes "活発な研究がされているという";
										mes "報告も付け加える。";
										next;
										mes "この研究は、ルーンミッドガッツ国王の";
										mes "命により行われている。以上。";
										close2;
										if(GOD_2QUE == 18)
											set GOD_2QUE,19;
									}
								}
								else {
									mes "- 検索ワード : ";
									mes '@answer$+ "で検索 -";
									mes "- 検索結果が見つかりません。 -";
									close2;
								}
							}
						}
						else if('@temp_c == 1) {
							mes "- 検索ワード : ";
							mes '@answer$+ "で検索 -";
							mes "第1小隊 : ";
							mes "クルセイダー第1小隊。";
							mes "各中隊は4つの小隊から";
							mes "成り立っており、その中の";
							mes "1番目の小隊を指す。";
							next;
							mes "つまり、クルセイダー第1中隊";
							mes "第1小隊、第2中隊第1小隊";
							mes "のように呼称され、上位項目";
							mes "にあたる「中隊」を検索する";
							mes "ことを勧める。";
							next;
							mes "詳細な内容は、兵力に関する";
							mes "情報流出の懸念があるため";
							mes "文書では取り扱わない。";
							close2;
						}
						else if('@temp_d == 1) {
							mes "- 検索ワード : ";
							mes '@answer$+ "で検索 -";
							mes "第3分隊 : ";
							mes "クルセイダー第3分隊。";
							mes "各小隊は4つの分隊で";
							mes "組織されており、その中の";
							mes "三番目の小隊をこう呼称する。";
							next;
							mes "つまり、クルセイダー第1中隊";
							mes "・第3小隊・第3分隊、";
							mes "クルセイダー第2中隊・第5小隊";
							mes "・第3分隊のように呼称され、";
							mes "上位項目にあたる「小隊」を";
							mes "検索することを勧める。";
							next;
							mes "また、1個分隊は通常8名で";
							mes "構成されていることも追記する。";
							mes "これ以上の詳細な内容は、";
							mes "兵力に関する情報流出の懸念が";
							mes "あるため文書では取り扱わない。";
							close2;
						}
						else if('@temp_e == 1) {
							mes "- 検索ワード : ";
							mes '@answer$+ "で検索 -";
							mes "- 検索ワードが不足しています。 -";
							mes "- どの部隊の最後の任務に";
							mes "ついてか、正確な情報を";
							mes "入力してください。 -";
							close2;
						}
						else {
							mes "- 検索ワード : ";
							mes '@answer$+ "で検索 -";
							mes "- 検索ワード : ";
							mes '@answer$+ "で検索 -";
							mes "- 検索ワード : ";
							mes '@answer$+ "で検索 -";
							mes "- 検索結果が見つかりません。 -";
							close2;
						}
					}
					else if('@temp_b == 1) {
						mes "- 検索ワード :";
						mes '@answer$+ "で検索 -";
						mes "第3中隊 :";
						mes "クルセイダー第3中隊。";
						next;
						mes "現存するクルセイダーの";
						mes "中でも最も優れた精鋭で";
						mes "構成されている。";
						next;
						mes "転入/転出に関する報告は";
						mes "創設以来報告はない。";
						next;
						mes "クルセイダー第3中隊";
						mes "第1小隊・第3分隊の場合は";
						mes "例外であり、現在該当する";
						mes "分隊員達は転出している";
						mes "とのことで、一般生活に";
						mes "戻った者もいる。";
						next;
						mes "より詳細な内容は、";
						mes "クルセイダー第3中隊";
						mes "第1小隊の部で取り扱う。";
						close2;
						if('@temp_c == 1) {
							mes "- 検索ワード :";
							mes '@answer$+ "で検索 -";
							mes "第1小隊 :";
							mes "クルセイダー第3中隊・第1小隊。";
							next;
							mes "各中隊は4つの小隊から";
							mes "成り立っており、その中で";
							mes "1番目の小隊を第1小隊と";
							mes "呼称している。";
							next;
							mes "本文書には第1小隊・第3分隊以外の";
							mes "記録はない。";
							close2;
							if('@temp_d == 1) {
								mes "- 検索ワード :";
								mes '@answer$+ "で検索 -";
								mes "第3分隊 :";
								mes "クルセイダー第3分隊。";
								next;
								mes "^0000FF最後の任務^000000にあたった";
								mes "クルセイダー第3中隊・第1小隊";
								mes "・第3分隊員の名を記す。";
								next;
								mes "^0000FF : レベイレブ";
								mes " : ジャック・オー";
								mes " : ジャン・ファードック";
								mes " : クアーク・ドノン";
								mes " : エマ・シアース";
								mes " : ロイヤルミスト";
								mes " : ナインボール^000000";
								if(GOD_2QUE == 17)
									set GOD_2QUE,18;
								close2;
								if('@temp_e == 1) {
									mes "- 検索ワード :";
									mes '@answer$+ "で検索 -";
									mes "この任務を最後に、";
									mes "最高精鋭部隊である";
									mes "第3分隊を解体することが";
									mes "上層部により決定された。";
									next;
									mes "任務の内容は、現世に残された";
									mes "^0000FF神器の手がかり^000000を";
									mes "王の命で秘密裏に";
									mes "捜索するというものであった。";
									next;
									mes "ところが、第3分隊の任務中に";
									mes "ある事件が発生した。";
									mes "分隊員の中の一人が、分隊長に";
									mes "作戦に対する不満を述べ、";
									mes "^0000FF分隊長の命令を無視して独断的な行動^000000";
									mes "をする。";
									next;
									mes "結果的に口論になり争いが生じ、";
									mes "「独断的な行動をした当事者」";
									mes "を除いた全ての分隊員との";
									mes "協議の末^0000FF命令不服従^000000という";
									mes "結論に落ち着いた。";
									next;
									mes "該当の1名には制裁が与えられ、";
									mes "傷を負って入院したとの";
									mes "報告がある。";
									next;
									mes "この事件の後、神器の手がかり";
									mes "に対する探索は「部分的」と称される";
									mes "程度の成功を収めたが、これによって";
									mes "第3分隊の指揮能力を疑った";
									mes "第3中隊長が、第1小隊長に";
									mes "責任を追及。";
									next;
									mes "第1小隊長は第3分隊長と";
									mes "面談の後、責任を取るために";
									mes "第3分隊解散を決意。";
									mes "そのまま第3分隊は解散される。";
									next;
									mes "解散後、分隊長以下分隊員は";
									mes "3ヶ月間軍規教育学校に";
									mes "入所後、他の場所に転出させられた。";
									next;
									mes "現在、第3分隊の探索任務";
									mes "による結果物は、当時の";
									mes "分隊長であるレベイレブを筆頭に";
									mes "活発な研究がされているという";
									mes "報告も付け加える。";
									next;
									mes "この研究は、ルーンミッドガッツ国王の";
									mes "命により行われている。以上。";
									close2;
									if(GOD_2QUE == 18)
										set GOD_2QUE,19;
								}
							}
							else {
								mes "- 検索ワード : ";
								mes '@answer$+ "で検索 -";
								mes "- 検索結果が見つかりません。 -";
								close2;
							}
						}
					}
					else if('@temp_c == 1) {
						mes "- 検索ワード : ";
						mes '@answer$+ "で検索 -";
						mes "第1小隊 : ";
						mes "- 検索結果が見つかりません。 -";
						mes "-上位項目から詳細検索を";
						mes "かける語句です。 -";
						close2;
					}
					else if('@temp_d == 1) {
						mes "- 検索ワード : ";
						mes '@answer$+ "で検索 -";
						mes "第3分隊 : ";
						mes "- 検索結果が見つかりません。 -";
						mes "-上位項目から詳細検索を";
						mes "かける語句です。 -";
						close2;
					}
					else if('@temp_e == 1 && GOD_2QUE > 17) {
						mes "- 検索ワード : ";
						mes '@answer$+ "で検索 -";
						mes "最後の任務 : ^0000FF最後の任務^000000";
						mes "- 検索ワードが不足しています -";
						mes "- どの部隊の最後の任務に";
						mes "ついてか、正確な情報を";
						mes "入力してください。 -";
						next;
						close2;
					}
					else if('@temp_f == 1) {
						mes "- 検索ワード : ";
						mes '@answer$+ "で検索 -";
						mes "元クルセイダー第3中隊";
						mes "・第1小隊・第3分隊分隊長。";
						mes "現在クルセイダー新兵教育";
						mes "学校で教官として活動中。";
						next;
						mes "教官としての活動と共に、";
						mes "王命による研究活動を行っている。";
						mes "勤務地はプローンテラ城内。";
						close2;
					}
					else if('@temp_g == 1) {
						mes "- 検索ワード : ";
						mes '@answer$+ "で検索 -";
						mes "- 検索結果が見つかりません。 -";
						mes "- 検索結果が見つかりません。 -";
						mes "- 検索結果が見つかりません。 -";
						mes "- 検索結果が見つかりません。 -";
						mes "^FF0000検索禁止ワードです^000000";
						close2;
					}
					else if('@temp_h == 1) {
						mes "- 検索ワード :";
						mes '@answer$+ "で検索 -";
						mes "元クルセイダー第3中隊";
						mes "・第1小隊・第3分隊分隊員。";
						mes "第3分隊解散後、現在ゲフェン";
						mes "地域で勤務中。";
						next;
						mes "担当の任務は武器補給品の確保。";
						mes "ブラックスミスギルド内で勤務中。";
						close2;
					}
					else if('@temp_i == 1) {
						mes "- 検索ワード :";
						mes '@answer$+ "で検索 -";
						mes "元クルセイダー第3中隊";
						mes "・第1小隊・第3分隊分隊員。";
						mes "第3分隊解散後、現役引退。";
						next;
						mes "引退後、故郷のモロクに帰る。";
						mes "旅館で雑務を行い生計を立てて";
						mes "いるという報告が入っている。";
						close2;
					}
					else if('@temp_j == 1) {
						mes "- 検索ワード :";
						mes '@answer$+ "で検索 -";
						mes "元クルセイダー第3中隊";
						mes "・第1小隊・第3分隊分隊員。";
						mes "第3分隊解散後、現在";
						mes "アルベルタで勤務中。";
						next;
						mes "担当の任務はアルベルタ";
						mes "地域の募兵官。";
						mes "アルベルタ港付近で勤務中。";
						close2;
					}
					else if('@temp_k == 1) {
						mes "- 検索ワード :";
						mes '@answer$+ "で検索 -";
						mes "元クルセイダー第3中隊";
						mes "・第1小隊・第3分隊分隊員。";
						mes "第3分隊解散後、現役引退。";
						next;
						mes "引退後、夢をつかむため";
						mes "アルデバランに行く。";
						mes "カプラサービスに履歴書を";
						mes "提出したとの報告が入っている。";
						close2;
					}
					else if('@temp_l == 1) {
						mes "- 検索ワード :";
						mes '@answer$+ "で検索 -";
						mes "元クルセイダー第3中隊";
						mes "・第1小隊・第3分隊分隊員。";
						mes "第3分隊解散後、コモドに赴任。";
						next;
						mes "現在の任務は不明。";
						mes "コモドのカジノ内で勤務中。";
						close2;
					}
					else if('@temp_m == 1) {
						mes "- 検索ワード :";
						mes '@answer$+ "で検索 -";
						mes "元クルセイダー第3中隊";
						mes "・第1小隊・第3分隊分隊員。";
						mes "第3分隊解散後、ジャワイに赴任。";
						next;
						mes "担当の任務はジャワイ島の";
						mes "治安維持。";
						mes "ジャワイのバーで勤務中。";
						close2;
					}
					else {
						mes "- 検索ワード : ";
						mes '@answer$+ "で検索 -";
						mes "- 検索ワード : ";
						mes '@answer$+ "で検索 -";
						mes "- 検索ワード : ";
						mes '@answer$+ "で検索 -";
						mes "- 検索結果が見つかりません。 -";
						close2;
					}
					continue;
				case 2:
					mes "- 書類検索魔法を";
					mes "中断しています。 -";
					next;
					mes "- 書類検索魔法から";
					mes "応答がありません。 -";
					mes "- このまま終了しますか？ -";
					next;
					mes "- このまま終了した場合 -";
					mes "- 保存していない資料が";
					mes "失われる危険性があります。 -";
					next;
					mes "- …… -";
					next;
					mes "- ………… -";
					next;
					mes "- ……終了します。 -";
					close;
				case 3:
					mes "[書類管理人 ゼガン]";
					mes "こんな仕事が国家予算の";
					mes "無駄使いだと言う前に……";
					mes "私のような人材がこんなところに";
					mes "押し込められていること自体が";
					mes "無駄使いですよ。まったく。";
					close;
				}
			}	// end while
		}
	}
	mes "[書類管理人 ゼガン]";
	mes "あ、そちらの書類ファイルの";
	mes "方はさわらないでください。";
	mes "たいしたものはありませんよ。";
	next;
	if(select("それでも書類ファイルを見る","おとなしく言うことを聞く") == 1) {
		mes "[書類管理人 ゼガン]";
		mes "さわるなと言ったでしょ!!!";
		close2;
		warp "prontera.gat",120,264;
		end;
	}
	mes "[書類管理人 ゼガン]";
	mes "はい、他の場所で";
	mes "資料を探してみてください。";
	mes "近頃本を読む人すら減って";
	mes "いるというのに、図書館まで";
	mes "来るとはなかなか熱心な人だ。";
	close;
}

geffen_in.gat,109,161,3	script	クルセイダー	751,{
	if($GodSleipnir >= 50 && $GodMagingiorde < 100) {
		if(GOD_2QUE_SUB1 > 2 || GOD_2QUE >= 20) {
			mes "- 頭がとても痛そうだ。";
			mes "頭をかきむしりながら";
			mes "同じ言葉を繰り返している。 -";
			next;
			mes "[ジャン・ファードック]";
			mes "3日目のあの日に俺達は";
			mes "見つけたんだ……";
			mes "神器の手がかりである";
			mes "^0000FF何かの破片^000000を。";
			next;
			mes "[ジャン・ファードック]";
			mes "それから3ヶ月……その間に";
			mes "何があったのか俺にもわからん……";
			mes "思い出せない…………";
			mes "いや、思い出したくないんだ……";
			close;
		}
		else if(GOD_2QUE > 17 && GOD_2QUE_SUB1 < 2) {
			mes "[ジャン・ファードック]";
			mes "ふう。これはこれで大変だよ。";
			mes "やっぱ、こんな雑務より前みたいに";
			mes "仲間と任務をこなしてたほうが";
			mes "良かったぜ。";
			mes "あっちのほうが気が楽だったからなぁ。";
			next;
			mes "[ジャン・ファードック]";
			mes "うーん？";
			mes "何か用か？";
			next;
			switch(select("第3分隊について聞く","近況を伺う","第3分隊の最後の任務について聞く")) {
			case 1:
				if(GOD_2QUE == 18) {
					mes "[ジャン・ファードック]";
					mes "第3分隊？";
					mes "おお、俺がいた部隊の話か。";
					next;
					mes "[ジャン・ファードック]";
					mes "本当にイイ奴ばかりだったなぁ。";
					mes "そういえば、分隊長は今";
					mes "何をしているんだろうな。";
					next;
					mes "- あなたは";
					mes "レベイレブが今居る所と -";
					mes "- 新兵教育学校で働いている";
					mes "という事実を話した。 -";
					mes "- 彼は少しの間遠い目をしながら";
					mes "過去に思いをめぐらした。 -";
					close;
				}
				else if(GOD_2QUE > 18) {
					mes "[ジャン・ファードック]";
					mes "第3分隊？";
					mes "おお、俺がいた部隊の話か。";
					next;
					mes "[ジャン・ファードック]";
					mes "本当にイイ奴ばかりだったなぁ。";
					mes "そういえば、分隊長は今";
					mes "何をしているんだろうな。";
					next;
					mes "レベイレブが今居る所と -";
					mes "- 新兵教育学校で働いている";
					mes "という事実を話した。 -";
					mes "- 彼は少しの間遠い目をしながら";
					mes "過去に思いをめぐらした。 -";
					next;
					mes "[ジャン・ファードック]";
					mes "そういえば、最後の任務に";
					mes "出る前までは分隊員の";
					mes "7人は本当に仲が良かったんだ。";
					mes "最後に^0000FFあいつ^000000が命令違反";
					mes "さえしなきゃ、今でもうまく";
					mes "いってただろうによ。";
					next;
					mes "[ジャン・ファードック]";
					mes "でも、あいつの名前が";
					mes "何だったか覚えてないんだよな。";
					mes "そうだ……名前が思い出せない";
					mes "んだよ……";
					mes "名前……あいつ……の……";
					next;
					mes "[ジャン・ファードック]";
					mes "名前が思い出せないのは……";
					mes "な……んで……";
					mes "なま……あいつ……";
					next;
					mes "[ジャン・ファードック]";
					mes "…………頭痛が……";
					next;
					mes "[ジャン・ファードック]";
					mes "- 呆然とした表情で正面を";
					mes "見つめたまま立っている。";
					mes "言葉をかけてみたが反応がない。 -";
					if(GOD_2QUE_SUB1 == 0)
						set GOD_2QUE_SUB1,1;
					close;
				}
			case 2:
				mes "[ジャン・ファードック]";
				mes "最近どうかって？";
				mes "今の任務のことか？";
				next;
				mes "[ジャン・ファードック]";
				mes "ゲフェンのブラックスミス";
				mes "ギルドで作られた武器の中から";
				mes "良い出来のものを選んで";
				mes "クルセイダーの本体に送る";
				mes "任務を遂行中だ。";
				next;
				mes "[ジャン・ファードック]";
				mes "たまに退屈だと感じるが";
				mes "後輩のひよっこどもの養成にゃ";
				mes "欠かせんからな。";
				mes "そう思ってなんとかやってるよ。";
				next;
				mes "[ジャン・ファードック]";
				mes "そういや最近俺に同じことを";
				mes "聞くやつが増えたな……";
				next;
				mes "[ジャン・ファードック]";
				mes "なんかずっと誰かに見られて";
				mes "いるような気がするんだよ……";
				close;
			case 3:
				if(GOD_2QUE == 18) {
					mes "[ジャン・ファードック]";
					mes "最後の任務だと？";
					next;
					mes "[ジャン・ファードック]";
					mes "そうだな……ちょっとでも";
					mes "記憶の手がかりがあれば";
					mes "思い出せそうなんだが……";
					mes "よく覚えていなくてね……";
					next;
					mes "- 彼は呆然とした顔で";
					mes "何か思い出さなければならない";
					mes "ことを必死に思い出そうとして";
					mes "いるような表情をしている。 -";
					close;
				}
				else if(GOD_2QUE > 18 && GOD_2QUE_SUB1 > 0) {
					mes "[ジャン・ファードック]";
					mes "最後の任務だと？";
					next;
					mes "[ジャン・ファードック]";
					mes "そうだな……ちょっとでも";
					mes "記憶の手がかりがあれば";
					mes "思い出せそうなんだが……";
					mes "よく覚えていなくてね……";
					next;
					mes "- 彼は呆然とした顔で";
					mes "何か思い出さなければならない";
					mes "ことを必死に思い出そうとして";
					mes "いるような表情をしている。 -";
					next;
					mes "- あなたは書類に書かれて";
					mes "いた内容を彼に伝え始めた。 -";
					next;
					mes "……";
					next;
					mes "この任務を最後に、";
					mes "最高精鋭部隊である";
					mes "第3分隊を解体することが";
					mes "上層部により決定された。";
					next;
					mes "任務の内容は、現世に残された";
					mes "^0000FF神器の手がかり^000000を";
					mes "王の命で秘密裏に";
					mes "捜索するというものであった。";
					next;
					mes "ところが、第3分隊の任務中に";
					mes "ある事件が発生した。";
					mes "分隊員の中の一人が、分隊長に";
					mes "作戦に対する不満を述べ、";
					mes "^0000FF分隊長の命令を無視して独断的な行動^000000";
					mes "をする。";
					next;
					mes "結果的に口論になり争いが生じ、";
					mes "「独断的な行動をした当事者」";
					mes "を除いた全ての分隊員との";
					mes "協議の末^0000FF命令不服従^000000という";
					mes "結論に落ち着いた。";
					next;
					mes "該当の1名には制裁が与えられ、";
					mes "傷を負って入院したとの";
					mes "報告がある。";
					next;
					mes "この事件の後、神器の手がかり";
					mes "に対する探索は「部分的」と称される";
					mes "程度の成功を収めたが、これによって";
					mes "第3分隊の指揮能力を疑った";
					mes "第3中隊長が、第1小隊長に";
					mes "責任を追求。";
					next;
					mes "第1小隊長は第3分隊長と";
					mes "面談の後、責任を取るために";
					mes "第3分隊解散を決意。";
					mes "そのまま第3分隊は解散される。";
					next;
					mes "解散後、分隊長以下分隊員は";
					mes "3ヶ月間軍規教育学校に";
					mes "入所後、他の場所に転出させられた。";
					next;
					mes "現在、第3分隊の探索任務";
					mes "による結果物は、当時の";
					mes "分隊長であるレベイレブを筆頭に";
					mes "活発な研究がされているという";
					mes "報告も付け加える。";
					next;
					mes "この研究は、ルーンミッドガッツ国王の";
					mes "命により行われている。以上。";
					next;
					mes "……………………";
					next;
					mes "…………";
					next;
					mes "……";
					next;
					mes "[ジャン・ファードック]";
					mes "思い出したぞ……";
					mes "その日、捜索を開始してから";
					mes "3日目に俺たちは見つけたんだ……";
					mes "神器の手がかりである";
					mes "^0000FF何かの破片^000000を!!!";
					next;
					mes "そして……";
					mes "そして…………";
					mes "…………………………";
					next;
					mes "[ジャン・ファードック]";
					mes "すまん……その後の記憶が";
					mes "すっぽり抜けちまったようだ。";
					mes "俺達が何を見つけたのかも";
					mes "思い出せん……";
					next;
					mes "- 彼は辛そうな顔をしている。 -";
					if(GOD_2QUE_SUB1 == 1)
						set GOD_2QUE_SUB1,2;
					close;
				}
				else {
					mes "[ジャン・ファードック]";
					mes "最後の任務だと？";
					next;
					mes "[ジャン・ファードック]";
					mes "そうだなぁ……";
					mes "何か思い出す手がかりでもあれば";
					mes "思い出せるかもしれないが……";
					mes "よく覚えていなくってね……";
					next;
					mes "- 彼は虚ろな眼差しで";
					mes "思い出せないことを";
					mes "なんとか思い出そうとしている。 -";
					close;
				}
			}
		}
		else if((GOD_2QUE_SUB1 > 1) && (GOD_2QUE_SUB1 < 3)) {
			mes "………………";
			next;
			mes "…………";
			next;
			mes "……";
			next;
			mes "[ジャン・ファードック]";
			mes "思い出した……";
			mes "その日、捜索に出てから3日目に";
			mes "俺達は見つけたんだ。";
			mes "神器の手がかりである";
			mes "^0000FF何かの破片^000000を!!!";
			next;
			mes "[ジャン・ファードック]";
			mes "そして……";
			mes "そして…………";
			mes "そして………………";
			next;
			mes "[ジャン・ファードック]";
			mes "すまん……それを見つけた後の";
			mes "記憶が無いな……";
			mes "俺達が見つけた物が何だったかも";
			mes "はっきりと覚えてない……";
			mes "^0000FFそれから3ヶ月^000000後からの記憶しか……";
			next;
			mes "- 彼は辛そうな顔をしている。 -";
			set GOD_2QUE_SUB1,3;
			close;
		}
		else {
			mes "[ジャン・ファードック]";
			mes "うん？　俺に何の用だ？";
			close;
		}
	}
	mes "[ジャン・ファードック]";
	mes "よう！";
	mes "君は物資補給の大切さを";
	mes "知っているか？";
	next;
	if(select("いいえ","もちろん！") == 2) {
		mes "[ジャン・ファードック]";
		mes "あ、そう……";
		next;
		mes "[ジャン・ファードック]";
		mes "じゃ、俺がここで知った事実を";
		mes "教えてやるか。";
		next;
		mes "[ジャン・ファードック]";
		mes "ブラックスミスの製造スキルは";
		mes "DEXとLUKが高いほど成功する";
		mes "確率が高くなり……";
		mes "アルケミストのファーマシーは";
		mes "DEXとLUK、INTが高いほど";
		mes "成功する確率が高くなるそうだ。";
		next;
		mes "[ジャン・ファードック]";
		mes "俺はクルセイダーだが、";
		mes "ブラックスミスギルドで";
		mes "彼らのことをもっと知ろうと";
		mes "がんばっているところだ。";
		close;
	}
	mes "[ジャン・ファードック]";
	mes "物資補給ってのはだな、";
	mes "色んな武器や消耗品を";
	mes "軍隊や各部隊に迅速に";
	mes "そして正確に届けることだ。";
	next;
	mes "[ジャン・ファードック]";
	mes "例えばだ。君が仲間達と旅を";
	mes "する時に、回復を担当するやつが";
	mes "いない状態で出かけたとする。";
	mes "それで傷を負った場合は薬を";
	mes "使って治療するだろう？";
	next;
	mes "[ジャン・ファードック]";
	mes "だが、一度に持てる物なんて";
	mes "限度があるから、誰かが街に";
	mes "戻って物資を補給する必要が";
	mes "あるだろう。";
	mes "まぁ、全員で戻ってもいいが。";
	next;
	mes "[ジャン・ファードック]";
	mes "こんな時に一番役に立つ職業が";
	mes "商人系だ。";
	mes "カートっていう便利な物を使って";
	mes "必要な物資を大量に目的地まで";
	mes "届けられる能力は";
	next;
	mes "[ジャン・ファードック]";
	mes "まさに商人系職業だけが持つ";
	mes "特権と言っても過言じゃない。";
	mes "俺がクルセイダーなのにも";
	mes "かかわらずここに居る訳の";
	mes "一つでもある。";
	next;
	mes "[ジャン・ファードック]";
	mes "クルセイダー達が消費する物資、";
	mes "武器や鎧などを、それを必要と";
	mes "しているところへ早く正確に";
	mes "届けるために俺が居るんだ。";
	mes "ふっふ～ん。";
	next;
	mes "[ジャン・ファードック]";
	mes "どうだ、君にも有用な知識だったか？";
	mes "旅の道中に回復スキルを";
	mes "使えるやつが居なかったら、";
	mes "商人系の職業を探してみるのも";
	mes "いいぞ。";
	next;
	mes "[ジャン・ファードック]";
	mes "彼らは、余分に物を持って";
	mes "歩いていることがあるからな。";
	mes "ああ、もちろん丁寧に尋ねる";
	mes "ことを忘れちゃならんぞ。";
	next;
	mes "[ジャン・ファードック]";
	mes "じゃぁまたな。";
	mes "オーディンの加護あらんことを。";
	close;
}

morocc_in.gat,146,179,0	script	従業員	66,{
	if($GodSleipnir >= 50 && $GodMagingiorde < 100) {
		if(GOD_2QUE_SUB2 > 0 || GOD_2QUE >= 20) {
			mes "[旅館従業員]";
			mes "お客様、ご用でしょうか？";
			next;
			mes "[旅館従業員]";
			mes "こちらは旅館です。";
			mes "旅館の入口では、PVPドアマンを通じて";
			mes "PVPに参加することが可能です。";
			next;
			mes "[旅館従業員]";
			mes "主要都市には、大抵旅館があり";
			mes "PVPが御座います。自分の強さを";
			mes "確かめたい方や、ただ余興として";
			mes "楽しみたい方は参加してみたら";
			mes "いかがでしょうか。";
			next;
			mes "- 何もなかったような顔で";
			mes "笑っている。 -";
			close;
		}
		else if(GOD_2QUE >= 18 && GOD_2QUE_SUB2 == 0) {
			mes "[旅館従業員]";
			mes "お客様、ご用でしょうか？";
			mes "- と聞く彼女の目は";
			mes "疑いの眼差しにあふれている。 -";
			next;
			mes "[旅館従業員]";
			mes "どのようなご用でしょうか？";
			next;
			input '@str$;
			if('@str$ == "クアーク・ドノン" || '@str$ == "クアーク" || '@str$ == "ドノン") {
				mes "["+strcharinfo(0)+"]";
				mes " " +'@str$;
				mes "をご存じですか？";
				if(GOD_2QUE == 18) {
					mes "[旅館従業員]";
					mes "どなたでしょうか？";
					mes "この間まで働いていた人の";
					mes "ことでしょうか？";
					close;
				}
				else if(GOD_2QUE > 18) {
					next;
					mes "- あなたがそう言うと、";
					mes "彼女は周りをチラチラと";
					mes "確認しながら近くに寄ってきて、";
					mes "低い声で話し始めた。 -";
					next;
					mes "[旅館従業員]";
					mes "お前は誰だ。";
					mes "- 胸にはひんやりとした";
					mes "感触がある。 -";
					next;
					mes "[恐ろしい旅館従業員]";
					mes "くだらないことをすると";
					mes "自分の心臓を自分の目で";
					mes "おがむことになるぞ。";
					next;
					mes "[恐ろしい旅館従業員様]";
					mes "お前も何かの噂を聞いて";
					mes "やって来たクチか？";
					mes "それとも、単なる好奇心で";
					mes "来たのか？";
					mes "どんな理由で来た？";
					next;
					switch(select("レベイレブが皆の消息を気にして……","彼が隠れている理由を知りたくて","単純な好奇心")) {
					case 1:
						if(rand(1,10) > 3) {
							mes "[恐ろしい旅館従業員様]";
							mes "はぁ……";
							mes "その話はもう飽きるほど聞いた。";
							mes "その爺さん、噂を恐れている";
							mes "ようだが……";
							mes "人をけしかけてここまでたどり";
							mes "着かせたのは認めるが……";
							next;
							mes "[恐ろしい旅館従業員様]";
							mes "だがな、私はこれっぽっちもあいつに";
							mes "会いたくない！";
							next;
							mes "- 彼女はナイフの力を緩めると同時に";
							mes "私の頚動脈の上を強く殴った。-";
							close2;
							percentheal -100,0;
							end;
						}
						else {
							mes "[恐ろしい旅館従業員様]";
							mes "はぁ……";
							mes "その話はもう飽きるほど聞いた。";
							mes "その爺さん、噂を恐れている";
							mes "ようだが……";
							mes "人をけしかけてここまでたどり";
							mes "着かせたのは認めるが……";
							next;
							mes "[恐ろしい旅館従業員様]";
							mes "ああ、ヒントくらいはやってもいい。";
							mes "ただ、一度しか言わないからな。";
							next;
							mes "- 彼女は低い声で、私の耳に";
							mes "ささやいた。-";
							mes "^0000FFアラガムは精錬用品を横領していない^000000";
							set GOD_2QUE_SUB2,1;
							close;
						}
					case 2:
						if(rand(1,10) > 4) {
							mes "[恐ろしい旅館従業員様]";
							mes "……ここまで訪ねてきたってことは、";
							mes "あいつが隠れている理由もわかって";
							mes "いるんだろう。";
							mes "でもね、そうやって訪ねてこられると";
							mes "迷惑だ！";
							next;
							mes "- 彼女はナイフの力を緩めると同時に";
							mes "私の頚動脈の上を強く殴った。 -";
							close2;
							percentheal -100,0;
							end;
						}
						else {
							mes "[恐ろしい旅館従業員様]";
							mes "……ここまで訪ねてきたってことは、";
							mes "あいつが隠れている理由もわかって";
							mes "いるんだろう。";
							next;
							mes "[恐ろしい旅館従業員様]";
							mes "……ヒントくらいはやってもいい。";
							mes "……悪い人間じゃなさそうだしな。";
							next;
							mes "- 彼女は低い声で、私の耳に";
							mes "ささやいた。-";
							mes "^0000FFアラガムは精錬用品を横領していない^000000";
							set GOD_2QUE_SUB2,1;
							close;
						}
					case 3:
						if(rand(1,10) > 3) {
							mes "[恐ろしい旅館従業員様]";
							mes "ふん、単なる好奇心で虎の穴に頭を";
							mes "突っ込むなんてね。";
							mes "肝が座ってるか、とてつもない馬鹿か。";
							next;
							mes "[恐ろしい旅館従業員様]";
							mes "私の一番嫌いな人間だね!!!!";
							next;
							mes "- 彼女はナイフの力を緩めると同時に";
							mes "私の頚動脈の上を強く殴った。 -";
							close2;
							percentheal -100,0;
							end;
						}
						else {
							mes "[恐ろしい旅館従業員様]";
							mes "ふん、単なる好奇心で虎の穴に頭を";
							mes "突っ込むなんてね。";
							mes "肝が座ってるか、とてつもない馬鹿か。";
							next;
							mes "[恐ろしい旅館従業員様]";
							mes "まぁ、そういう奴もたまにはいいか。";
							mes "1回しか言わないからな。";
							next;
							mes "- 彼女は低い声で、私の耳に";
							mes "ささやいた。-";
							mes "^0000FFアラガムは精錬用品を横領していない^000000";
							set GOD_2QUE_SUB2,1;
							close;
						}
					}
				}
			}
			else {
				mes "[旅館従業員]";
				mes "…………？";
				mes "何のお話でしょうか？";
				close;
			}
		}
		else {
			mes "[旅館従業員]";
			mes "お客様、ご用でしょうか？";
			next;
			mes "[旅館従業員]";
			mes "こちらは旅館です。";
			mes "旅館の入口では、PVPドアマンを通じて";
			mes "PVPに参加することが可能です。";
			next;
			mes "[旅館従業員]";
			mes "主要都市には、大抵旅館があり";
			mes "PVPが御座います。自分の強さを";
			mes "確かめたい方や、ただ余興として";
			mes "楽しみたい方は参加してみたら";
			mes "いかがでしょうか。";
			close;
		}
	}
	mes "[旅館従業員]";
	mes "お客様、ご用でしょうか？";
	next;
	mes "[旅館従業員]";
	mes "こちらは旅館です。";
	mes "旅館の入口では、PVPドアマンを通じて";
	mes "PVPに参加することが可能です。";
	next;
	mes "[旅館従業員]";
	mes "主要都市には、大抵旅館があり";
	mes "PVPが御座います。自分の強さを";
	mes "確かめたい方や、ただ余興として";
	mes "楽しみたい方は参加してみたら";
	mes "いかがでしょうか。";
	next;
	mes "[旅館従業員]";
	mes "あ、そしてこれは秘密なのですが……";
	mes "ここの主人が、なにか新しい事業を";
	mes "こっそり準備中らしいです。";
	next;
	mes "[旅館従業員]";
	mes "「ここを訪れるお客様を絶やさない";
	mes "プロジェクト」とか何とか……";
	next;
	mes "[旅館従業員]";
	mes "いいですか、これは秘密ですよ。";
	mes "絶対ですよー。";
	close;
}

in_rogue.gat,243,61,0	script	怪しい男	748,{
	if($GodSleipnir >= 50 && $GodMagingiorde < 100) {
		if(GOD_2QUE == 18) {
			mes "[クアーク・ドノン]";
			mes "な、何なんだお前！";
			mes "どうやってここに入って来た?!";
			mes "あ、あ、あっちに行け！行けったら!!";
			mes "う、ううう、うあぁあぁぁぁぁぁ!!!!";
			close;
		}
		else if(GOD_2QUE_SUB2 == 4 || GOD_2QUE >= 20) {
			mes "[クアーク・ドノン]";
			mes "そしてね……その夜、";
			mes "^0000FFその人と分隊長^000000がケンカしたの。";
			mes "僕は寝ずの番だったから、遠くで";
			mes "聞いてたの。";
			next;
			mes "[クアーク・ドノン]";
			mes "それで……思い出せないの……";
			next;
			mes "[クアーク・ドノン]";
			mes "眠い……ねぇ、もう休んでいい？";
			close;
		}
		else if(GOD_2QUE > 18) {
			if(GOD_2QUE_SUB2 > 0 && GOD_2QUE_SUB2 < 4) {
				mes "[クアーク・ドノン]";
				mes "な、何なんだお前！";
				mes "どうやってここに入って来た?!";
				mes "あ、あ、あっちに行け！行けったら!!";
				mes "う、ううう、うあぁあぁぁぁぁぁ!!!!";
				next;
				mes "- あなたは彼を静めようと、書類を";
				mes "読み始めた。-";
				next;
				if((countitem(740) > 0) || (countitem(741) > 0) || (countitem(742) > 0) || (countitem(743) > 0) || (countitem(750) > 0) || (countitem(751) > 0) || (countitem(752) > 0) || (countitem(753) > 0) || (countitem(754) > 0) || (countitem(7206) > 0) || (countitem(7212) > 0)) {
					mes "- あなたは人形を取り出して";
					mes "人形劇をしてみた。 -";
					next;
					mes "- 彼は子供のように指をくわえながら";
					mes "コクコクと首をふり、あなたの言葉を";
					mes "聞いていた。 -";
				}
				else {
					mes "任務 : 第3分隊^0000FF最後の任務^000000";
					mes "この任務を最後に、";
					mes "最高精鋭部隊である";
					mes "第3分隊を解体することが";
					mes "上層部により決定された。";
					next;
					mes "任務の内容は、現世に残された";
					mes "^0000FF神器の手がかり^000000を";
					mes "王の命で秘密裏に";
					mes "捜索するというものであった。";
					next;
					mes "ところが、第3分隊の任務中に";
					mes "ある事件が発生した。";
					mes "分隊員の中の一人が、分隊長に";
					mes "作戦に対する不満を述べ、";
					mes "^0000FF分隊長の命令を無視して独断的な行動^000000";
					mes "をする。";
					next;
					mes "結果的に口論になり争いが生じ、";
					mes "「独断的な行動をした当事者」";
					mes "を除いた全ての分隊員との";
					mes "協議の末^0000FF命令不服従^000000という";
					mes "結論に落ち着いた。";
					next;
					mes "該当の1名には制裁が与えられ、";
					mes "傷を負って入院したとの";
					mes "報告がある。";
					next;
					mes "この事件の後、神器の手がかり";
					mes "に対する探索は「部分的」と称される";
					mes "程度の成功を収めたが、これによって";
					mes "第3分隊の指揮能力を疑った";
					mes "第3中隊長が、第1小隊長に";
					mes "責任を追求。";
					next;
					mes "第1小隊長は第3分隊長と";
					mes "面談の後、責任を取るために";
					mes "第3分隊解散を決意。";
					mes "そのまま第3分隊は解散される。";
					next;
					mes "解散後、分隊長以下分隊員は";
					mes "3ヶ月間軍規教育学校に";
					mes "入所後、他の場所に転出させられた。";
					next;
					mes "現在、第3分隊の探索任務";
					mes "による結果物は、当時の";
					mes "分隊長であるレベイレブを筆頭に";
					mes "活発な研究がされているという";
					mes "報告も付け加える。";
					next;
					mes "この研究は、ルーンミッドガッツ国王の";
					mes "命により行われている。以上。";
					next;
					mes "- 彼は書類の話を聞いた途端、";
					mes "狂ったように頭をかきむしり、";
					mes "頭が痛いと叫び続けた。 -";
					next;
					mes "- 彼をなんとかして鎮めないと";
					mes "いけないようだ。 -";
					next;
					mes "- 子供のようにふるまっているので";
					mes "子供が喜びそうな事でも";
					mes "してみるか。 -";
					close;
				}
				next;
				mes "- だいぶ落ち着いたようだ。";
				mes "いくつか質問してみるか。 -";
				next;
				switch(select("旅館のお姉さんを知ってる？","最近どう？","第3分隊の最後の任務について教えて")) {
				case 1:
					mes "[クアーク・ドノン]";
					mes "ああ……それ、僕のお姉ちゃんなの。";
					mes "ローグギルドで活躍してて……";
					mes "僕が第3分隊になった時……";
					next;
					mes "[クアーク・ドノン]";
					mes "…………………………";
					next;
					mes "[クアーク・ドノン]";
					mes "僕は、幼いときから出世しなさいって";
					mes "家から押し付けられてきたんだ。";
					mes "そうする内に、クルセイダーになれて、";
					mes "給料も落ち着いて……それで、";
					mes "第3分隊ってところに入ったの。";
					next;
					mes "[クアーク・ドノン]";
					mes "でも、僕を見るとお姉ちゃんが怒るの。";
					mes "僕にはお姉ちゃんしかいないのに、";
					mes "お姉ちゃんが怒るの。";
					next;
					mes "[クアーク・ドノン]";
					mes "そして、旅館で働くようになったの。";
					mes "何もできないバカだって怒りながらも、";
					mes "働かせてくれたの。";
					next;
					mes "[クアーク・ドノン]";
					mes "それからね、僕を訪ねてくる人が";
					mes "増えたの。みんなして僕に質問するんだ";
					mes "けど、僕、頭がとっても痛いの。";
					next;
					mes "[クアーク・ドノン]";
					mes "僕、その人達がなんの話しをしているか";
					mes "わからないのに、いつも胸がぐるぐる";
					mes "して苦しくなっちゃうの。";
					next;
					mes "[クアーク・ドノン]";
					mes "だから、お姉ちゃんが僕をここに";
					mes "隠してくれたの。でもね、退屈なんだ。";
					mes "下にいる人も挨拶しかしてくれないし。";
					next;
					mes "[クアーク・ドノン]";
					mes "お姉ちゃんは、ここに来て僕と話しては";
					mes "怒るんだ。僕が何言ってるか、";
					mes "わからないって言いながら怒るんだ。";
					next;
					mes "[クアーク・ドノン]";
					mes "僕、きっとキオクソウシツなんだよね。";
					mes "でも、ここがいい。人が来ないから。";
					next;
					mes "[クアーク・ドノン]";
					mes "お姉ちゃんが来てくれれば、";
					mes "それでいいんだ。";
					next;
					mes "[クアーク・ドノン]";
					mes "僕のお姉ちゃんの悲しいお顔の";
					mes "お話でした。";
					if(GOD_2QUE_SUB2 == 2) {
						next;
						mes "[クアーク・ドノン]";
						mes "あとね、あとね。";
						mes "お姉ちゃんが言っちゃダメって";
						mes "言ったことがあるの……";
						next;
						mes "- 彼は私の耳に低い声でささやいた -";
						next;
						mes "[クアーク・ドノン]";
						mes "お姉ちゃんがね……ローグギルドの";
						mes "人にも言ったらだめって。";
						mes "あのね、助けてくれる人をみつけたら";
						mes "送ってくれるって。";
						next;
						mes "[クアーク・ドノン]";
						mes "それまで、ここが安全だから隠れて";
						mes "なさいって言ったの。いつでも";
						mes "逃げられるようにしなさいって";
						mes "言ったの。";
						set GOD_2QUE_SUB2,3;
					}
					close;
				case 2:
					mes "[クアーク・ドノン]";
					mes "最近？";
					mes "あのね、人がいっぱい来るから怖いの。";
					next;
					mes "[クアーク・ドノン]";
					mes "ローグギルドが守ってくれてるんだけど";
					mes "急にどっかから出てきたりしてビックリ";
					mes "するの。お姉ちゃんの話だとね、";
					mes "それって僕の上司のせいなんだって。";
					next;
					mes "[クアーク・ドノン]";
					mes "僕、よくわからないんだけど……";
					mes "その上司に僕がおかしくなったって";
					mes "お話しにいったんだって。";
					next;
					mes "[クアーク・ドノン]";
					mes "でも、会ってくれなかったから、";
					mes "お姉ちゃんがローグギルドと一緒に";
					mes "噂を広めるって言ってた……";
					mes "その上司のお手伝いをすると、";
					mes "悪いことが起こるんだよ～って……";
					next;
					mes "[クアーク・ドノン]";
					mes "そんなとこかな～。";
					if(GOD_2QUE_SUB2 == 1)
						set GOD_2QUE_SUB2,2;
					close;
				case 3:
					mes "[クアーク・ドノン]";
					mes "わかんない……思い出せないの……";
					if(GOD_2QUE_SUB2 == 3) {
						next;
						mes "[クアーク・ドノン]";
						mes "あ、ひとつだけ思い出した。";
						mes "^0000FFメギンギョルド^000000を見たの。";
						mes "なんかのカケラみたいにちょこっと";
						mes "だったけど、僕にはそれが";
						mes "メギンギョルドってわかったの。";
						next;
						if(rand(1,10) > 4) {
							set '@str$,"^FFFFFFメギンギョルド!!!!^000000";
						}
						switch(select("^FF0000メギンギョルド!!!!^000000",'@str$,"^FFFFFF静かに聞く^000000")) {
						default:
							mes "[クアーク・ドノン]";
							mes "ヒイイイイ!!";
							mes "恐い、恐いよー!!!!!!";
							set GOD_2QUE_SUB2,0;
							close;
						case 3:
							mes "[クアーク・ドノン]";
							mes "そしてね……その夜、";
							mes "^0000FFその人と分隊長^000000がケンカしたの。";
							mes "僕は寝ずの番だったから、遠くで";
							mes "聞いてたの。";
							next;
							mes "[クアーク・ドノン]";
							mes "それで……思い出せないの……";
							set GOD_2QUE_SUB2,4;
							close;
						}
					}
					close;
				}
			}
		}
	}
	mes "[クアーク・ドノン]";
	mes "な、何なんだお前！";
	mes "どうやってここに入って来た?!";
	mes "あ、あ、あっちに行け！行けったら!!";
	mes "う、ううう、うあぁあぁぁぁぁぁ!!!!";
	close;
}

alberta.gat,196,146,0	script	クルセイダー	751,{
	if($GodSleipnir >= 50 && $GodMagingiorde < 100) {
		if(GOD_2QUE == 18) {
			mes "[ジャック・オー]";
			mes "ふああああ……アルベルタは今日も良い";
			mes "天気だな～。仕事中だけど、昼寝したく";
			mes "なっちゃうよ。またどっかでノンビリと";
			mes "散歩でもしてこようかな～。";
			next;
			mes "[ジャック・オー]";
			mes "あれ、君は？";
			next;
			switch(select("レベイレブについて聞く","近況を聞く","第3分隊の最後の任務について聞く")) {
			case 1:
				mes "[ジャック・オー]";
				mes "ああ！　隊長だった人？";
				mes "あ～、そうだね～。";
				mes "隊が解散した後は会ってないよ。";
				close;
			case 2:
				mes "[ジャック・オー]";
				mes "ん？最近は募兵してるよ。";
				mes "軍はいつも人材不足だし。";
				mes "君もどう？";
				close;
			case 3:
				mes "[ジャック・オー]";
				mes "う～ん……";
				mes "良く覚えてないや～。";
				close;
			}
		}
		else if(GOD_2QUE_SUB3 == 2 || GOD_2QUE >= 20) {
			mes "[ジャック・オー]";
			mes "彼の信仰心は人一倍強かったんだ。";
			mes "良く、^0000ff私より信仰心が深い者など";
			mes "この世にいない^000000みたいなことを言って";
			mes "問題になってたよ。";
			next;
			mes "[ジャック・オー]";
			mes "そう言えば……";
			mes "『「独断的な行動をした当事者」";
			mes "を除いた全ての分隊員との";
			mes "協議の末^0000FF命令不服従^000000という";
			mes "結論に落ち着いた』ってのは";
			mes "確かに間違いさ。";
			next;
			mes "[ジャック・オー]";
			mes "あ、ちょっとゴメン。";
			mes "緑ハーブ、緑ハーブ……";
			mes "これ？　痛み止めなんだ。";
			next;
			mes "- 彼は緑ハーブを取り出すと、";
			mes "むしゃむしゃと食べた。 -";
			mes "- それが彼の鎮痛剤らしい。 -";
			close;
		}
		else if(GOD_2QUE > 18) {
			if(GOD_2QUE_SUB3 == 0 || GOD_2QUE_SUB3 == 1) {
				mes "[ジャック・オー]";
				mes "ふああああ……アルベルタは今日も良い";
				mes "天気だな～。仕事中だけど、昼寝したく";
				mes "なっちゃうよ。またどっかでノンビリと";
				mes "散歩でもしてこようかな～。";
				next;
				mes "[ジャック・オー]";
				mes "あれ、君は？";
				next;
				switch(select("レベイレブについて聞く","近況を聞く","第3分隊の最後の任務について聞く")) {
				case 1:
					if(GOD_2QUE_SUB3 == 1) {
						mes "[ジャック・オー]";
						mes "ああ。元隊長かい？";
						mes "彼の信仰心は人一倍強かったんだ。";
						mes "良く、^0000ff私より信仰心が深い者など";
						mes "この世にいない^000000みたいなことを言って";
						mes "問題になってたよ。";
						next;
						mes "[ジャック・オー]";
						mes "私も当時は、信仰心は誰にも";
						mes "負けないって思ってた。";
						mes "命をかける仕事をしていると、そんな";
						mes "自信でもないとやっていけなかったん";
						mes "だろうね。";
						next;
						mes "[ジャック・オー]";
						mes "そう言えば……";
						mes "『「独断的な行動をした当事者」";
						mes "を除いた全ての分隊員との";
						mes "協議の末^0000FF命令不服従^000000という";
						mes "結論に落ち着いた』ってのは";
						mes "確かに間違いさ。";
						next;
						mes "[ジャック・オー]";
						mes "3日目に我等の隊が拾った品物を";
						mes "持って…………";
						mes "誰と言い争ったんだったかな？";
						next;
						mes "[ジャック・オー]";
						mes "それで、言い争いの結果";
						mes "^0000FFその処罰を隊長の独断で決めた^000000んだ！";
						next;
						mes "[ジャック・オー]";
						mes "言い争ってた奴……顔が……";
						mes "……やっぱり思い出せないや。";
						next;
						mes "[ジャック・オー]";
						mes "軍隊に長くいたから、頭がどうか";
						mes "しちゃったのかな。";
						mes "とにかく、その言い争った奴だけど";
						mes "^0000FF絶対命令服従^000000に背いたってことだね。";
						next;
						mes "[ジャック・オー]";
						mes "その後は、全然思い出せないんだ。";
						mes "悪いね。";
						next;
						mes "[ジャック・オー]";
						mes "緑ハーブをまた補給しなきゃ。";
						mes "この頭痛、なんとかならないかな……";
						set GOD_2QUE_SUB3,2;
						close;
					}
					else {
						mes "[ジャック・オー]";
						mes "ああ！　隊長だった人？";
						mes "あ～、そうだね～。";
						mes "隊が解散した後は会ってないよ。";
						close;
					}
				case 2:
					mes "[ジャック・オー]";
					mes "ん？最近は募兵してるよ。";
					mes "軍はいつも人材不足だし。";
					mes "君もどう？";
					close;
				case 3:
					mes "[ジャック・オー]";
					mes "そんなこと聞いて、どうしようって";
					mes "言うの？";
					next;
					mes "- あなたは書類に書かれていた";
					mes "内容を教えた。 -";
					next;
					mes "任務 : 第3分隊^0000FF最後の任務^000000";
					mes "この任務を最後に、";
					mes "最高精鋭部隊である";
					mes "第3分隊を解体することが";
					mes "上層部により決定された。";
					next;
					mes "任務の内容は、現世に残された";
					mes "^0000FF神器の手がかり^000000を";
					mes "王の命で秘密裏に";
					mes "捜索するというものであった。";
					next;
					mes "ところが、第3分隊の任務中に";
					mes "ある事件が発生した。";
					mes "分隊員の中の一人が、分隊長に";
					mes "作戦に対する不満を述べ、";
					mes "^0000FF分隊長の命令を無視して独断的な行動^000000";
					mes "をする。";
					next;
					mes "結果的に口論になり争いが生じ、";
					mes "「独断的な行動をした当事者」";
					mes "を除いた全ての分隊員との";
					mes "協議の末^0000FF命令不服従^000000という";
					mes "結論に落ち着いた。";
					next;
					mes "該当の1名には制裁が与えられ、";
					mes "傷を負って入院したとの";
					mes "報告がある。";
					next;
					mes "この事件の後、神器の手がかり";
					mes "に対する探索は「部分的」と称される";
					mes "程度の成功を収めたが、これによって";
					mes "第3分隊の指揮能力を疑った";
					mes "第3中隊長が、第1小隊長に";
					mes "責任を追求。";
					next;
					mes "第1小隊長は第3分隊長と";
					mes "面談の後、責任を取るために";
					mes "第3分隊解散を決意。";
					mes "そのまま第3分隊は解散される。";
					next;
					mes "解散後、分隊長以下分隊員は";
					mes "3ヶ月間軍規教育学校に";
					mes "入所後、他の場所に転出させられた。";
					next;
					mes "現在、第3分隊の探索任務";
					mes "による結果物は、当時の";
					mes "分隊長であるレベイレブを筆頭に";
					mes "活発な研究がされているという";
					mes "報告も付け加える。";
					next;
					mes "この研究は、ルーンミッドガッツ国王の";
					mes "命により行われている。以上。";
					next;
					mes "- ^0000FFジャックは、何か気に食わなさ";
					mes "そうな顔をしている。^000000 -";
					next;
					mes "[ジャック・オー]";
					mes "う～ん、昔のことだから細かく思い";
					mes "出せないな。でも、その文の中の";
					mes "「独断的な行動をした当事者」と";
					mes "^0000FF命令不服従^000000の部分だけど";
					mes "何かひっかかるんだ……";
					if(GOD_2QUE_SUB3 == 0)
						set GOD_2QUE_SUB3,1;
					close;
				}
			}
		}
		else {
			mes "[ジャック・オー]";
			mes "そこの君！";
			mes "クルセイダーになってみないか？";
			close;
		}
	}
	if(Job == Job_Swordman) {
		mes "[ジャック・オー]";
		mes "そこの君！";
		mes "クルセイダーになってみないか？";
		next;
		mes "[ジャック・オー]";
		mes "聖典が基礎だけど、基本は軍行動さ。";
		mes "信仰心と剣の腕があれば、けっこう";
		mes "昇進できるよ。";
		next;
		mes "[ジャック・オー]";
		mes "どう？やってみないかい？";
		mes "いつでも待ってるよー！";
		close;
	}
	mes "[ジャック・オー]";
	mes "ふああああ……アルベルタは今日も良い";
	mes "天気だな～。仕事中だけど、昼寝したく";
	mes "なっちゃうよ。またどっかでノンビリと";
	mes "散歩でもしてこようかな～。";
	next;
	mes "[ジャック・オー]";
	mes "お、そこの人！";
	mes "どう、転職してみない？";
	next;
	mes "[ジャック・オー]";
	mes "あ～ぁ～、行っちゃった。";
	next;
	mes "[ジャック・オー]";
	mes "うん？";
	mes "君、ずっとこっちを見てるけど……";
	mes "ひょっとして興味ある？";
	next;
	mes "[ジャック・オー]";
	mes "ほら、子供ってさ、人形とか好きって";
	mes "言うだろう。私の知人がそう言って";
	mes "たんだ。試してみたら？";
	close;
}

aldebaran.gat,66,213,0	script	お嬢さん	69,{
	if(checkitemblank() == 0) {
		mes "- 所持アイテムの種類数が -";
		mes "- 多いため、アイテムを受けとる -";
		mes "- ことができません。 -";
		mes "- 所持アイテムを減らしてから -";
		mes "- 再度話しかけてください。 -";
		close;
	}
	if(MaxWeight - Weight < 5000) {
		mes "- 所持重量が多いため、アイテムを -";
		mes "- 受けとることができません。 -";
		mes "- 所持アイテムを減らしてから -";
		mes "- 再度話しかけてください。 -";
		close;
	}
	if($GodSleipnir >= 50 && $GodMagingiorde < 100) {
		if(GOD_2QUE == 18) {
			mes "[エマ・シアース]";
			mes "はぁ……もう何回も送ってるのに……";
			mes "一回も返事が来ない……";
			mes "カプラ職員になるのは、";
			mes "夢また夢かしら……";
			close;
		}
		else if((GOD_2QUE > 18) && (GOD_2QUE < 26)) {
			if(GOD_2QUE_SUB4 < 2) {
				mes "[エマ・シアース]";
				mes "はぁ……もう何回も送ってるのに……";
				mes "一回も返事が来ない……";
				mes "カプラ職員になるのは、";
				mes "夢また夢かしら……";
				next;
				mes "[エマ・シアース]";
				mes "私の話、聞いていただけますか？";
				mes "あまりにも苦しいものですから……";
				next;
				mes "[エマ・シアース]";
				mes "私の名前はエマ・シアース。";
				mes "カプラ職員志望です。";
				mes "昔は、クルセイダーをして";
				mes "おりました……";
				next;
				mes "[エマ・シアース]";
				mes "剣に憧れ、その道を目指しましたが……";
				mes "^0000FF部分記憶喪失症^000000による、過去証明不十分";
				mes "という理由で、こんな目にあうなんて…";
				next;
				mes "[エマ・シアース]";
				mes "カプラ社が、並みの巨大多国籍";
				mes "サービス業ではないというのは";
				mes "わかっています。それでも……";
				mes "バイトでいいから働きたかった……。";
				next;
				mes "[エマ・シアース]";
				mes "部分記憶喪失症が、そんなに重病";
				mes "なのですかって？";
				mes "あちらでは、顧客リストを忘れる";
				mes "可能性があると言って、ずっと";
				mes "受け付けてくれません。";
				next;
				mes "[エマ・シアース]";
				mes "私は、特定の記憶が思い出せないだけで";
				mes "他は全てちゃんと覚えてます。";
				mes "思い出せない記憶ですが、思い出そうと";
				mes "すると、いつも頭痛に悩まされます。";
				next;
				mes "[エマ・シアース]";
				mes "はぁ……";
				next;
				switch(select("なにがあったの？","どうしてカプラ職員になりたいの？","部分記憶喪失？")) {
				case 1:
					if(countitem(7015) < 1) {
						mes "[エマ・シアース]";
						mes "今更過去なんて……";
						mes "でも……心の中に";
						mes "^0000FF追憶のしおり^000000が";
						mes "あったなら、忘れてしまっていた";
						mes "大事なことを思い出せるのかも";
						mes "しれませんね……";
						close;
					}
					mes "- 彼女は落ち葉の香りを軽く";
					mes "吸い込んでから、話し始めた。 -";
					next;
					mes "[エマ・シアース]";
					mes "私は比較的裕福な家庭に生まれました。";
					mes "幼い頃から剣術、乗馬、音楽などの";
					mes "教育を受けてまいりました。";
					next;
					mes "[エマ・シアース]";
					mes "そして、15歳になった年……";
					mes "私の両親は、政略結婚を勧めました。";
					next;
					mes "[エマ・シアース]";
					mes "しかし、私は誰とも知らない相手と";
					mes "結婚するのに抵抗がありました。";
					mes "相手は、とても良い家庭の出身で、";
					mes "学歴も財産もある方だったそうです。";
					next;
					mes "[エマ・シアース]";
					mes "……その頃から、私はカプラ職員に";
					mes "憧れるようになりました。";
					mes "グラリスさんのような素敵な";
					mes "カプラ職員になって、大陸を回るのが";
					mes "夢だったんです。";
					next;
					mes "[エマ・シアース]";
					mes "しかし、両親は私の夢を理解して";
					mes "くれませんでした。サービス業に";
					mes "つかせるために育ててきたのではないと";
					mes "いい、結婚を早めました。";
					next;
					mes "[エマ・シアース]";
					mes "結局、結婚に反対する形で家を飛び";
					mes "出たのです。その時にクルセイダーの";
					mes "募集公告を見て、応募したのです。";
					mes "結果は合格でした。";
					next;
					mes "[エマ・シアース]";
					mes "当時、女性のクルセイダーは珍しいと";
					mes "いうことで、とても重宝されました。";
					mes "何より、私には家から逃げる場所が";
					mes "必要で、死に物狂いで訓練しました。";
					next;
					mes "[エマ・シアース]";
					mes "そう……初めて配置された隊で良い";
					mes "人達と会ったり、試験で良い成績を";
					mes "収めたり。その内、腕を認められ、";
					mes "重大な任務も担えるようになりました。";
					next;
					mes "[エマ・シアース]";
					mes "両親も、少しずつ私の戦果が聞こえる";
					mes "ようになると、喜んでいたそうです。";
					mes "結婚したくないと家を飛び出した娘が";
					mes "頑張っているとわかって嬉しかったの";
					mes "でしょう。";
					next;
					mes "[エマ・シアース]";
					mes "しかし…………";
					mes "あの日以来、すべてが壊れました。";
					mes "悲し過ぎる事件だったらしく、";
					mes "何も思い出せないのです。";
					set GOD_2QUE_SUB4,1;
					close;
				case 2:
					mes "[エマ・シアース]";
					mes "グラリスさんを、遠くから見ていて";
					mes "感じたのです……";
					mes "仕事をしながら、自信に満ちた顔で、";
					mes "とても輝いて見えたんです。";
					next;
					mes "[エマ・シアース]";
					mes "暑い日とか大変だと思うのに、";
					mes "いつも凛としたあの姿が……";
					next;
					mes "[エマ・シアース]";
					mes "男性の方が群がっても、顔色一つ変えず";
					mes "眼鏡を正し、よく手入れされた刀が";
					mes "竹を一刀両断するように、自分の";
					mes "やるべきことをやりとげる姿が……";
					next;
					mes "[エマ・シアース]";
					mes "世間に対して、1人で勇敢に立ち";
					mes "向かっているように見えたんです。";
					mes "この世の中は、グラリスさんのために";
					mes "存在しているように思え始めたんです。";
					next;
					mes "[エマ・シアース]";
					mes "それに、グラリスさんは世界各国に";
					mes "出張もしてお仕事しているそうで……";
					mes "人にいっぱい囲まれて……";
					mes "私もそうなりたかったんです。";
					next;
					mes "[エマ・シアース]";
					mes "とにかく……私はカプラ職員に";
					mes "なりたいんです、絶対！";
					mes "いえ、なりたかったと言い換えなければ";
					mes "ならないかもしれませんが……";
					close;
				case 3:
					if(countitem(511) > 0 && GOD_2QUE_SUB3 > 1) {
						mes "- 質問をすると、彼女は頭を抱えて";
						mes "苦しそうにしている。 -";
						next;
						mes "- 私はジャック・オーの行動を";
						mes "思いだし緑ハーブを渡した。-";
						next;
						mes "- エマは緑ハーブの香りをかいだら";
						mes "少し頭痛が治まったらしい。-";
						next;
						mes "[エマ・シアース]";
						mes "それは……";
						mes "わかりません……";
						mes "どこまでが正しい記憶で……";
						mes "何が思い出せないのか……";
						next;
						mes "[エマ・シアース]";
						mes "私が思い出せるのは、";
						mes "他の隊員の名前だけ……";
						next;
						mes "[エマ・シアース]";
						mes "^0000FFジャック・オー、ナインボール、^000000";
						mes "^0000FFジャン・ファードック、^000000";
						mes "^0000FFクアーク・ドノン、イグニゼム^000000……";
						set GOD_2QUE_SUB4,2;
						close;
					}
					else {
						mes "- 質問をすると、彼女は頭を抱えて";
						mes "苦しそうにしている。 -";
						next;
						mes "[エマ・シアース]";
						mes "それは……";
						mes "わかりません……";
						mes "どこまでが正しい記憶で……";
						mes "何が思い出せないのか……";
						close;
					}
				}
			}
			else if(GOD_2QUE_SUB4 > 1) {
				mes "[エマ・シアース]";
				mes "^0000FFジャック・オー、ナインボール、^000000";
				mes "^0000FFジャン・ファードック、^000000";
				mes "^0000FFクアーク・ドノン、イグニゼム^000000……";
				mes "今となっては、懐かしい名前ばかり……";
				close;
			}
		}
		else if(GOD_2QUE == 25) {
			mes "[エマ・シアース]";
			mes "^0000FFジャック・オー、ナインボール、^000000";
			mes "^0000FFジャン・ファードック、^000000";
			mes "^0000FFクアーク・ドノン、イグニゼム^000000……";
			mes "今となっては、懐かしい名前ばかり……";
			close;
		}
		else if((GOD_2QUE == 26) || (GOD_2QUE == 27)) {
			mes "[エマ・シアース]";
			mes "イグニゼム……";
			mes "とても悲しい………";
			mes "何も思い出せない…………";
			next;
			mes "- 彼女の頬に一筋涙が流れた。 -";
			next;
			mes "[エマ・シアース]";
			mes "正確に思い出せませんが……";
			mes "^0000FF私の過去の、とても大切な記憶^000000の";
			mes "一部に関わる言葉のようですね……";
			next;
			mes "[エマ・シアース]";
			mes "わざわざ知らせてくれて、";
			mes "ありがとうございます。";
			mes "これはほんの気持ちです……";
			mes "お受け取りください……";
			set GOD_2QUE,28;
			getitem 603,1;
			if(checkre()) {
				if(BaseLevel < 56)
					getexp 2700,0;
				else if((BaseLevel > 55) && (BaseLevel < 61))
					getexp 3000,0;
				else if((BaseLevel > 60) && (BaseLevel < 66))
					getexp 5605,0;
				else if((BaseLevel > 65) && (BaseLevel < 71))
					getexp 8223,0;
				else if((BaseLevel > 70) && (BaseLevel < 76))
					getexp 21227,0;
				else if((BaseLevel > 75) && (BaseLevel < 81))
					getexp 39073,0;
				else if((BaseLevel > 80) && (BaseLevel < 86))
					getexp 45102,0;
				else if((BaseLevel > 85) && (BaseLevel < 91))
					getexp 54615,0;
				else if(BaseLevel > 90)
					getexp 122035,0;
			}
			else {
				if(BaseLevel < 56)
					getexp 27000,0;
				else if((BaseLevel > 55) && (BaseLevel < 61))
					getexp 30000,0;
				else if((BaseLevel > 60) && (BaseLevel < 66))
					getexp 56052,0;
				else if((BaseLevel > 65) && (BaseLevel < 71))
					getexp 82233,0;
				else if((BaseLevel > 70) && (BaseLevel < 76))
					getexp 212271,0;
				else if((BaseLevel > 75) && (BaseLevel < 81))
					getexp 390738,0;
				else if((BaseLevel > 80) && (BaseLevel < 86))
					getexp 451020,0;
				else if((BaseLevel > 85) && (BaseLevel < 91))
					getexp 546156,0;
				else if(BaseLevel > 90)
					getexp 1220358,0;
			}
			close;
		}
		else if(GOD_2QUE == 28) {
			mes "[エマ・シアース]";
			mes "イグニゼム……";
			mes "とても悲しい………";
			mes "何も思い出せない…………";
			next;
			mes "- 彼女の頬に一筋涙が流れた。 -";
			close;
		}
		else {
			mes "[エマ・シアース]";
			mes "はぁ……もう何回も送ってるのに……";
			mes "一回も返事が来ない……";
			mes "カプラ職員になるのは、";
			mes "夢また夢かしら……";
			close;
		}
	}
	mes "[エマ・シアース]";
	mes "グラリスさんは世界各国に";
	mes "出張もしてお仕事しているそうで……";
	mes "人にいっぱい囲まれて……";
	mes "私もそうなりたかったんです。";
	next;
	mes "[エマ・シアース]";
	mes "はぁ……もう何回も送ってるのに……";
	mes "一回も返事が来ない……";
	mes "カプラ職員になるのは、";
	mes "夢また夢かしら……";
	close;
}

cmd_in02.gat,190,94,3	script	青年	828,{
	if($GodSleipnir >= 50 && $GodMagingiorde < 100) {
		if(GOD_2QUE == 18) {
			mes "[ロイヤルミスト]";
			mes "なんだ、てめえは？";
			mes "用もないのに話しかけるんじゃねぇ！";
			mes "今度はどこに賭けっか……";
			mes "く～、悩むなぁ、こらぁ！";
			next;
			switch(select("レベイレブって知ってる？","第3分隊について聞きたい","賭博が好きなの？","趣味は？")) {
			case 1:
				mes "[ロイヤルミスト]";
				mes "なんだ、てめえ！";
				mes "あの野郎の手先かっ?!";
				mes "帰って伝えやがれ！";
				mes "もう誰も寄こすんじゃねぇってな！";
				close;
			case 2:
				mes "[ロイヤルミスト]";
				mes "ああ？　第3分隊？";
				mes "少しでも一緒だった仲間なら";
				mes "覚えてるぜ。";
				next;
				mes "[ロイヤルミスト]";
				mes "ジャン・ファードック、";
				mes "クアーク・ドノン、ジャック・オー、";
				mes "エマ・シアース、ロイヤルミストに、";
				mes "ナインボール！";
				mes "あいつら、今どうしてっかな……";
				close;
			case 3:
				mes "[ロイヤルミスト]";
				mes "おお、賭博！";
				mes "賭博こそ我が愛！";
				mes "一握りの金も、ここに消える運命さ。";
				mes "ククク…………";
				close;
			case 4:
				mes "[ロイヤルミスト]";
				mes "おう、趣味か？";
				mes "酒を飲むことだ!!";
				mes "グアッハッハッハッハ！";
				close;
			}
		}
		else if((GOD_2QUE > 18) && (GOD_2QUE < 21)) {
			if(GOD_2QUE_SUB6 == 0 && GOD_2QUE_SUB5 > 4 && GOD_2QUE_SUB4 > 1 && GOD_2QUE_SUB3 > 1 && GOD_2QUE_SUB2 > 3 && GOD_2QUE_SUB1 > 2) {
				mes "[ロイヤルミスト]";
				mes "なんだ、てめえは？";
				mes "用もないのに話しかけるんじゃねぇ！";
				mes "今度はどこに賭けっか……";
				mes "く～、悩むなぁ、こらぁ！";
			}
			else if(GOD_2QUE_SUB6 > 0) {
				mes "[ロイヤルミスト]";
				mes "なんだ、てめえは？";
			}
			else {
				mes "[ロイヤルミスト]";
				mes "なんだ、てめえは？";
				mes "用もないのに話しかけるんじゃねぇ！";
				mes "今度はどこに賭けっか……";
				mes "く～、悩むなぁ、こらぁ！";
				close;
			}
			next;
			if(GOD_2QUE_SUB6 < 16) {
				switch(select("レベイレブって知ってる？","第3分隊について聞きたい","賭博が好きなの？","趣味は？")) {
				case 1:
					if(GOD_2QUE_SUB6 == 0) {
						mes "[ロイヤルミスト]";
						mes "なんだ、てめえ！";
						mes "あの野郎の手先かっ?!";
						mes "帰って伝えやがれ！";
						mes "もう誰も寄こすんじゃねぇってな！";
						set GOD_2QUE_SUB6,1;
						close;
					}
					else if((GOD_2QUE_SUB6 > 0) && (GOD_2QUE_SUB6 < 15)) {
						mes "[ロイヤルミスト]";
						mes "うるせえ、うるせえ、うるせえ!!";
						mes "いい加減にしやがれ!!";
						mes "俺はあんな野郎と、もう関わりたく";
						mes "ねぇんだ!!!!　とっとと帰れ!!!!";
						close;
					}
					else if(GOD_2QUE_SUB6 > 14) {
						mes "[ロイヤルミスト]";
						mes "あの古狸め……";
						mes "おいパシリ野郎、^0000FFあの研究費用^000000、";
						mes "どれだけ出てるんだ？";
						mes "ケッ……";
						close;
					}
				case 2:
					if(GOD_2QUE_SUB6 < 15) {
						mes "[ロイヤルミスト]";
						mes "ああ？　第3分隊？";
						mes "少しでも一緒だった仲間なら";
						mes "覚えてるぜ。";
						next;
						mes "[ロイヤルミスト]";
						mes "ジャン・ファードック、";
						mes "クアーク・ドノン、ジャック・オー、";
						mes "エマ・シアース、ロイヤルミストに、";
						mes "ナインボール！";
						mes "あいつら、今どうしてっかな……";
						close;
					}
					else if(GOD_2QUE_SUB6 > 14) {
						mes "[ロイヤルミスト]";
						mes "イグニゼム？";
						mes "誰だ、そいつ？";
						mes "クルセイダー？";
						mes "……クックック、冗談じゃねぇ。";
						close;
					}
				case 3:
					if(GOD_2QUE_SUB6 < 15) {
						mes "[ロイヤルミスト]";
						mes "おお、賭博！";
						mes "賭博こそ我が愛！";
						mes "一握りの金も、ここに消える運命さ。";
						mes "ククク…………";
						close;
					}
					else if(GOD_2QUE_SUB6 > 14) {
						mes "[ロイヤルミスト]";
						mes "クックックック……";
						mes "人生最高の賭けに成功した野郎は……";
						mes "可哀相なだけだ……クックック……";
						next;
						mes "[ロイヤルミスト]";
						mes "悔しいまま死んだら……";
						mes "^0000FFニブルヘイム^000000で1人泣くっきゃねぇか？";
						mes "それともヴァルハラかな……";
						mes "クックック……";
						mes "^0000FFあいつ^000000だったら、ありえる話さ……";
						mes "クックックック……";
						set GOD_2QUE,20;
						set GOD_2QUE_SUB1,0;
						set GOD_2QUE_SUB2,0;
						set GOD_2QUE_SUB3,0;
						set GOD_2QUE_SUB4,0;
						set GOD_2QUE_SUB5,0;
						set GOD_2QUE_SUB6,0;
						close;
					}
				case 4:
					if(GOD_2QUE_SUB6 == 0) {
						mes "[ロイヤルミスト]";
						mes "おう、趣味か？";
						mes "酒を飲むことだ!!";
						mes "グアッハッハッハッハ！";
						close;
					}
					else if((GOD_2QUE_SUB6 > 0) && (GOD_2QUE_SUB6 < 15)) {
						if(countitem(970) < 1) {
							mes "[ロイヤルミスト]";
							mes "ん？　酒の好み？";
							mes "飲めりゃあなんでも!!!!";
							close;
						}
						mes "[ロイヤルミスト]";
						mes "おお！　酒持ってんじゃねぇか！";
						mes "はやく！　それを寄こせ!!";
						next;
						mes "- 彼はこちらが何か言える前に";
						mes "アルコールを取って";
						mes "飲んでしまった。 -";
						delitem 970,1;
						set GOD_2QUE_SUB6,GOD_2QUE_SUB6 + 2;
						close;
					}
					else if(GOD_2QUE_SUB6 > 14) {
						mes "[ロイヤルミスト]";
						mes "ヒック……";
						mes "あ～、いい気持ちだ～、ヒック！";
						mes "おう、お前も一杯どうだ？";
						close;
					}
				}
			}
		}
		else {
			mes "[ロイヤルミスト]";
			mes "クックックックック……";
			mes "今度こそ……";
			close;
		}
	}
	mes "[ロイヤルミスト]";
	mes "なんだ、てめえは？";
	mes "用もないのに話しかけるんじゃねぇ！";
	mes "今度はどこに賭けっか……";
	mes "く～、悩むなぁ、こらぁ！";
	close;
}

jawaii_in.gat,44,110,0	script	治安担当	734,{
	if($GodSleipnir >= 50 && $GodMagingiorde < 100) {
		if(GOD_2QUE > 18) {
			if(GOD_2QUE_SUB5 == 5 || GOD_2QUE >= 20) {
				mes "- 彼は痛々しいくらい明るい顔で";
				mes "同じ言葉を繰り返している。 -";
				mes "- この人から話を聞くのは";
				mes "無理そうだ……。 -";
				close;
			}
			else if(GOD_2QUE_SUB5 < 5) {
				mes "[ナインボール]";
				mes "最高の休養島！　ジャワイへようこそ！";
				mes "私は、ここの治安担当者で";
				mes "ナインボールと申します！";
				mes "最近、酔っ払いが増えているとの";
				mes "報告もありますし、なにかありましたら";
				mes "是非私にご一報を！";
				set GOD_2QUE_SUB5,GOD_2QUE_SUB5 + 1;
				close;
			}
		}
	}
	mes "[ナインボール]";
	mes "最高の休養島！　ジャワイへようこそ！";
	mes "私は、ここの治安担当者で";
	mes "ナインボールと申します！";
	mes "最近、酔っ払いが増えているとの";
	mes "報告もありますし、なにかありましたら";
	mes "是非私にご一報を！";
	close;
}

niflheim.gat,109,254,7	script	イグニゼム	796,{
	if($GodSleipnir >= 50 && $GodMagingiorde < 100) {
		if((GOD_2QUE > 19) && (GOD_2QUE < 25)) {
			if(GOD_2QUE > 22) {
				mes "[イグニゼム]";
				mes "また来たか……";
				mes "こんな寒い所へ……";
			}
			else {
				mes "[イグニゼム]";
				mes "……………………";
				mes "筋を通す者が必要なのだろう？";
				next;
				mes "- 全てをイグニゼムに話した。 -";
				mes "- 疑問点や知りたいことも";
				mes "含めて。 -";
			}
			next;
			if(select("真実が知りたい","愛が知りたい") == 2) {
				mes "[イグニゼム]";
				mes "……彼女……エマ・シアース……";
				next;
				mes "- 死体である彼の二つの目から……";
				mes "一筋の涙が…… -";
				mes "- 腐った身と目でも、";
				mes "涙は存在するのか…… -";
				next;
				mes "[イグニゼム]";
				mes "少し、話してもいいか……？";
				mes "お前に話したことで……";
				mes "私の悔恨も少し和らぐかも……";
				next;
				mes "[イグニゼム]";
				mes "…………………";
				mes "……彼女、エマ・シアースが";
				mes "再び自分の夢を追い始めたと";
				mes "教えてくれてありがとう。";
				next;
				mes "[イグニゼム]";
				mes "私は、ずいぶんと前から彼女を";
				mes "遠くから見守っていた……";
				mes "そう、彼女を初めて見た時から……";
				next;
				mes "[イグニゼム]";
				mes "勇気を出して、取った行動が……";
				mes "家を通じてプロポーズしたことだった。";
				mes "私の家は位も財産もあったから、";
				mes "そういう手段になってしまった……";
				next;
				mes "[イグニゼム]";
				mes "ただ、計算違いがあった。";
				mes "彼女は結婚を嫌がり、クルセイダーに";
				mes "なってしまった……";
				mes "私は落ち込んだ……";
				next;
				mes "[イグニゼム]";
				mes "それでも、私は最後の勇気を振り絞り、";
				mes "彼女が私の顔を知らないのを逆手に";
				mes "自分もクルセイダーになった……";
				next;
				mes "[イグニゼム]";
				mes "しかし、彼女はもう私のことを";
				mes "覚えていない……";
				mes "でも、彼女の消息がわかって嬉しい……";
				next;
				mes "[イグニゼム]";
				mes "………………";
				next;
				mes "[イグニゼム]";
				mes "クルセイダー本部に……全ての謎が";
				mes "暴かれる日が、いつか来るかも";
				mes "しれない……";
				mes "お前は、後悔することないよう、";
				mes "自分で自分の道を進むがいい……";
				close;
			}
			mes "[イグニゼム]";
			mes "そうか………………";
			mes "みんなが思い出せないことについて";
			mes "教えてやる…………";
			next;
			mes "[イグニゼム]";
			mes "君が知りたいのは、この8つだろう？";
			next;
			mes "[イグニゼム]";
			mes "1. 捜索に出て、3日目に発見した";
			mes "   ^0000FF何かの破片^000000について";
			mes "2. ^0000FFメギンギョルドらしい欠片";
			mes "   ^000000について";
			mes "3. その晩、^0000FF隊長と争った人^000000について";
			mes "4. 処罰を決めた^0000FF隊長の独断^000000について";
			next;
			mes "[イグニゼム]";
			mes "5.^0000FF 私より信仰心が深い者など";
			mes "　　この世にいない^000000という言葉の意味";
			mes "6. 書類にない隊員の名前、";
			mes "　　^0000FFイグニゼム^000000について";
			next;
			mes "[イグニゼム]";
			mes "7. みんなに共通している";
			mes "　　^0000FF部分記憶喪失症と頭痛^000000現象について";
			mes "8. どうして記録には任務結果が";
			mes "　^0000FF「部分的」^000000成功と書かれているか";
			next;
			mes "[イグニゼム]";
			mes "………………";
			next;
			mes "[イグニゼム]";
			mes "どうだ、何か見えた気がするか？";
			mes "書類内容と比べてみろ……";
			next;
			mes "- もう一度書類の内容を";
			mes "思い浮かべた -";
			next;
			mes "任務 : 第3分隊^0000FF最後の任務^000000";
			mes "この任務を最後に、";
			mes "最高精鋭部隊である";
			mes "第3分隊を解体することが";
			mes "上層部により決定された。";
			next;
			mes "任務の内容は、現世に残された";
			mes "^0000FF神器の手がかり^000000を";
			mes "王の命で秘密裏に";
			mes "捜索するというものであった。";
			next;
			mes "ところが、第3分隊の任務中に";
			mes "ある事件が発生した。";
			mes "分隊員の中の一人が、分隊長に";
			mes "作戦に対する不満を述べ、";
			mes "^0000FF分隊長の命令を無視して独断的な行動^000000";
			mes "をする。";
			next;
			mes "結果的に口論になり争いが生じ、";
			mes "「独断的な行動をした当事者」";
			mes "を除いた全ての分隊員との";
			mes "協議の末^0000FF命令不服従^000000という";
			mes "結論に落ち着いた。";
			next;
			mes "該当の1名には制裁が与えられ、";
			mes "傷を負って入院したとの";
			mes "報告がある。";
			next;
			mes "この事件の後、神器の手がかり";
			mes "に対する探索は「部分的」と称される";
			mes "程度の成功を収めたが、これによって";
			mes "第3分隊の指揮能力を疑った";
			mes "第3中隊長が、第1小隊長に";
			mes "責任を追求。";
			next;
			mes "第1小隊長は第3分隊長と";
			mes "面談の後、責任を取るために";
			mes "第3分隊解散を決意。";
			mes "そのまま第3分隊は解散される。";
			next;
			mes "解散後、分隊長以下分隊員は";
			mes "3ヶ月間軍規教育学校に";
			mes "入所後、他の場所に転出させられた。";
			next;
			mes "現在、第3分隊の探索任務";
			mes "による結果物は、当時の";
			mes "分隊長であるレベイレブを筆頭に";
			mes "活発な研究がされているという";
			mes "報告も付け加える。";
			next;
			mes "この研究は、ルーンミッドガッツ国王の";
			mes "命により行われている。以上。";
			next;
			mes "[イグニゼム]";
			mes "その書類には真実と偽りが";
			mes "共存している。";
			mes "1、2、3、4、6の疑問は複数が証言";
			mes "しているから、真実とみて問題ない。";
			mes "だから8番の「部分的」というのも";
			mes "嘘ではない。";
			next;
			mes "[イグニゼム]";
			mes "1. 3日目に発見した^0000FF何かの破片^000000";
			mes "2. ^0000FFメギンギョルドらしい欠片^000000";
			mes "3. ^0000FF隊長と争った人^000000";
			mes "4. 処罰を決めた^0000FF隊長の独断^000000";
			mes "6. 書類にない隊員、^0000FFイグニゼム^000000";
			next;
			mes "[イグニゼム]";
			mes "8番が真実という仮定で、該当部分を";
			mes "書類と照らし合わせてみよう。";
			next;
			mes "[イグニゼム]";
			mes "任務の内容は、現世に残された";
			mes "^0000FF神器の手がかり^000000を";
			mes "王の命で秘密裏に捜索するというもの";
			mes "であった。捜索に出てから3日目、";
			mes "^0000FFメギンギョルドの破片^000000を発見。";
			next;
			mes "[イグニゼム]";
			mes "発見当日の夜、^0000FFイグニゼムが隊長に^000000";
			mes "作戦遂行に対する不満を申し出て、";
			mes "言い争いとなる。";
			mes "結果、^0000FF隊長の独断^000000により、";
			mes "^0000FF制裁^000000がくだる。";
			next;
			mes "[イグニゼム]";
			mes "処罰と報告された制裁により、";
			mes "^0000FFイグニゼムは負傷し入院^000000したと";
			mes "されている。";
			mes "^0000FFメギンギョルドの破片^000000を発見したにも";
			mes "かかわらず、捜索の結果は";
			mes "^0000FF部分的^000000と報告。";
			next;
			mes "[イグニゼム]";
			mes "以後、第3分隊は^0000FF成果が得られ";
			mes "^0000FFなかったため^000000に解散。";
			mes "解散後、分隊長以下の隊員は";
			mes "3ヶ月間軍規教育学校に";
			mes "入所後、他の場所に転出させられた。";
			next;
			mes "[イグニゼム]";
			mes "以降、^0000FFイグニゼムの記録は抹消^000000される。";
			mes "現在、第3分隊の探索任務による";
			mes "結果物は、当時の分隊長である";
			mes "レベイレブを筆頭に、活発な研究が";
			mes "されている。";
			next;
			mes "[イグニゼム]";
			mes "この研究は、ルーンミッドガッツ国王の";
			mes "命により行われている。以上。";
			next;
			mes "[イグニゼム]";
			mes "おかしな部分がわかったか？";
			mes "私はいつ、どうして死んだのか……";
			next;
			mes "[イグニゼム]";
			mes "死んだのは、入院のため後方に";
			mes "運ばれている最中だった……";
			mes "その時点で既に、レベイレブは動き";
			mes "始めて居たのだろう……";
			next;
			mes "[イグニゼム]";
			mes "ここに、先程の5と7の疑問を";
			mes "付け加えてみよう。";
			mes "レベイレブに会ったならわかると";
			mes "思うが、彼の信仰心は並みじゃない。";
			next;
			mes "[イグニゼム]";
			mes "5.^0000FF 私より信仰心が深い者など";
			mes "　　この世にいない^000000という言葉の意味";
			mes "メギンギョルドは神のもの……";
			mes "レベイレブは、自分以外のものが";
			mes "神に近付くのを許容しなかったのだ。";
			next;
			mes "[イグニゼム]";
			mes "それがプロンテラ国王であっても。";
			next;
			mes "[イグニゼム]";
			mes "つまり……メギンギョルドを";
			mes "所有することで、神に近づけると";
			mes "思ったんだろう。";
			next;
			mes "[イグニゼム]";
			mes "メギンギョルドを切り、大部分を自分の";
			mes "懐に入れ、極一部を発見したと";
			mes "報告しようとしていたところを偶然";
			mes "見てしまい、忠告しようと思った……";
			next;
			mes "[イグニゼム]";
			mes "7. みんなに共通している";
			mes "　　^0000FF部分記憶喪失症と頭痛^000000現象について";
			mes "時期的に、3ヶ月間の軍規教育で";
			mes "何かがあったと推測するしかない。";
			next;
			mes "[イグニゼム]";
			mes "それが何かは私にもわからない……";
			mes "全員の記憶をそのような状態にして";
			mes "しまうとなると……かなり";
			mes "非人道的な方法ではないだろうか。";
			next;
			mes "[イグニゼム]";
			mes "もう一度整理してみるか。";
			next;
			mes "[イグニゼム]";
			mes "任務の内容は、現世に残された";
			mes "^0000FF神器の手がかり^000000を";
			mes "王の命で秘密裏に捜索するというもの";
			mes "であった。捜索に出てから3日目、";
			mes "^0000FFメギンギョルドの破片^000000を発見。";
			next;
			mes "[イグニゼム]";
			mes "発見当日の夜、^0000FFイグニゼムが隊長に^000000";
			mes "作戦遂行に対する不満を申し出て、";
			mes "言い争いとなる。";
			mes "結果、^0000FF隊長の独断^000000により、";
			mes "^0000FF制裁^000000がくだる。";
			next;
			mes "[イグニゼム]";
			mes "処罰と報告された制裁により、";
			mes "^0000FFイグニゼムは負傷し入院^000000したと";
			mes "されている。";
			mes "^0000FFメギンギョルドの破片^000000を発見したにも";
			mes "かかわらず、捜索の結果は";
			mes "^0000FF部分的^000000と報告。";
			next;
			mes "[イグニゼム]";
			mes "以後、第3分隊は^0000FF成果が得られ";
			mes "^0000FFなかったため^000000に解散。";
			mes "解散後、分隊長以下の隊員は";
			mes "3ヶ月間軍規教育学校に";
			mes "入所後、他の場所に転出させられた。";
			next;
			mes "[イグニゼム]";
			mes "以降、^0000FFイグニゼムの記録は抹消^000000される。";
			mes "現在、第3分隊の探索任務による";
			mes "結果物は、当時の分隊長である";
			mes "レベイレブを筆頭に、活発な研究が";
			mes "されている。";
			next;
			mes "[イグニゼム]";
			mes "この研究は、ルーンミッドガッツ国王の";
			mes "命により行われている。以上。";
			next;
			mes "[イグニゼム]";
			mes "頭が痛いか？";
			mes "しかし、まだ不審点は残っている。";
			next;
			mes "[イグニゼム]";
			mes "9. どうしてレベイレブを筆頭に";
			mes "　　研究チームが発足されたのか";
			mes "10. プロンテラ国王が何故研究を";
			mes "　　命じたのか";
			next;
			mes "[イグニゼム]";
			mes "………………";
			next;
			mes "[イグニゼム]";
			mes "この二つは、お前が考えろ……";
			mes "私は……もう疲れた…………";
			next;
			mes "[イグニゼム]";
			mes "私はもう誰にも覚えられていない存在。";
			mes "そういう存在は……寂しい……";
			mes "ここですら……";
			if(GOD_2QUE == 21)
				set GOD_2QUE,23;
			else if(GOD_2QUE == 22)
				set GOD_2QUE,24;
			close;
		}
		else if(GOD_2QUE == 25 || GOD_2QUE == 26) {
			mes "[イグニゼム]";
			mes "ありがとう……";
			mes "…………小さな変化が起ころうと";
			mes "している。";
			mes "世の中を変える、小さな封印の鍵……";
			next;
			mes "[イグニゼム]";
			mes "これは…………";
			mes "私に残っている^0000FF小さな生命力^000000を";
			mes "お前に……";
			next;
			mes "[イグニゼム]";
			mes "私には、これくらいしか";
			mes "出来ないから……";
			set GOD_2QUE,27;
			if(checkre()) {
				if(BaseLevel < 56)
					getexp 27000,0;
				else if((BaseLevel > 55) && (BaseLevel < 61))
					getexp 30000,0;
				else if((BaseLevel > 60) && (BaseLevel < 66))
					getexp 56052,0;
				else if((BaseLevel > 65) && (BaseLevel < 71))
					getexp 82233,0;
				else if((BaseLevel > 70) && (BaseLevel < 76))
					getexp 212271,0;
				else if((BaseLevel > 75) && (BaseLevel < 81))
					getexp 390738,0;
				else if((BaseLevel > 80) && (BaseLevel < 86))
					getexp 451020,0;
				else if((BaseLevel > 85) && (BaseLevel < 91))
					getexp 546156,0;
				else if(BaseLevel > 90)
					getexp 1220358,0;
			}
			else {
				if(BaseLevel < 56)
					getexp 2700,0;
				else if((BaseLevel > 55) && (BaseLevel < 61))
					getexp 3000,0;
				else if((BaseLevel > 60) && (BaseLevel < 66))
					getexp 5605,0;
				else if((BaseLevel > 65) && (BaseLevel < 71))
					getexp 8223,0;
				else if((BaseLevel > 70) && (BaseLevel < 76))
					getexp 21227,0;
				else if((BaseLevel > 75) && (BaseLevel < 81))
					getexp 39073,0;
				else if((BaseLevel > 80) && (BaseLevel < 86))
					getexp 45102,0;
				else if((BaseLevel > 85) && (BaseLevel < 91))
					getexp 54615,0;
				else if(BaseLevel > 90)
					getexp 122035,0;
			}
			close;
		}
		else if(GOD_2QUE >= 27) {
			mes "[イグニゼム]";
			mes "……彼女……エマ・シアース……";
			next;
			mes "- 死体である彼の二つの目から……";
			mes "一筋の涙が…… -";
			mes "- 腐った身と目でも、";
			mes "涙は存在するのか…… -";
			close;
		}
	}
	mes "[イグニゼム]";
	mes "クックックック……お前は死者か？";
	mes "お前も、運命に裏切られた者か？";
	mes "それとも……何か望むことがあるのか？";
	next;
	switch(select("街の地理を尋ねる","ミニマップの表示を全て消す","話をやめる")) {
	case 1:
		mes "[イグニゼム]";
		mes "クックックック……村だな。";
		mes "私が教えてあげよう……";
		next;
		switch(select("魔女の城","道具屋","武器屋","酒屋","取り消し")) {
		case 1:
			mes "[イグニゼム]";
			mes "ニブルヘイムの魔女……";
			mes "^FF3355＋^000000に魔女の住む城がある……";
			mes "クックックック……私は何ともないが";
			mes "他の奴等は彼女を恐れているようだ……";
			viewpoint 0,253,191,2,0xFF3355;
			close;
		case 2:
			mes "[イグニゼム]";
			mes "道具屋？";
			mes "^CE6300＋^000000にある。";
			mes "ニブルヘイムらしい店だ。";
			mes "行ってみるといい。";
			viewpoint 0,217,196,3,0xCE6300;
			close;
		case 3:
			mes "[イグニゼム]";
			mes "武器店の位置は^55FF33＋^000000だ。";
			mes "特に際立った品は置いてない……";
			viewpoint 0,216,171,4,0x55FF33;
			close;
		case 4:
			mes "[イグニゼム]";
			mes "酒屋は^3355FF＋^000000にある。";
			mes "腐った酒でも、酒屋は酒屋だ……";
			viewpoint 0,189,207,5,0x3355FF;
			close;
		case 5:
			mes "[イグニゼム]";
			mes "ミニマップの表示を消したければ";
			mes "「ミニマップの表示を全て消す」を";
			mes "選択すればいい……クックックック……";
			close;
		}
	case 2:
		viewpoint 2,253,191,2,0x00FF00;
		viewpoint 2,217,196,3,0x00FF00;
		viewpoint 2,216,171,4,0x00FF00;
		viewpoint 2,189,207,5,0x00FF00;
		mes "[イグニゼム]";
		mes "ミニマップの表示を消したければ";
		mes "「ミニマップの表示を全て消す」を";
		mes "選択すればいい……クックックック……";
		close;
	case 3:
		mes "[イグニゼム]";
		mes "自分で調べまわるのは嫌か？";
		mes "クックックック……そうだろう……";
		mes "誰も、自分の身が可愛いものな……";
		mes "クックックック……ここは暗黒が";
		mes "支配している場所だしな……クック……";
		close;
	}
}

//============================================================
// 神器3次 ブリーシンガメンの封印クエスト
//- Registry -------------------------------------------------
// GOD_3QUE -> 0～50
//------------------------------------------------------------
prt_fild08.gat,175,374,3	script	吟遊詩人	51,{
	cutin "god_nelluad01",2;
	if($GodMagingiorde >= 50 || $GodBrysinggamen < 100) {
		if(GOD_3QUE > 49) {
			mes "[ネリュオッド]";
			mes "お、見事やり遂げたようだね～。";
			mes "おや、他にもいいことがあったのかな？";
			mes "うん……最近、敏感になっているせいか";
			mes "たまに変な気を感じる……";
			next;
			mes "[ネリュオッド]";
			mes "うん……何か起きそうな感じだね……";
			mes "でも心配することはないよ。";
			mes "そうだ、君には特別に";
			mes "無料で演奏してあげよう～。";
			next;
			mes "[ネリュオッド]";
			mes "何をお望みかな？";
			next;
			switch(select("歌を聴きたい","噂話を聴きたい","いや、遠慮しとく")) {
			case 1:
				cutin "god_nelluad02",2;
				mes "[ネリュオッド]";
				mes "では、何を聴かせようか……";
				mes "好きなものを選んでくれ！";
				next;
				switch(select("ブラギの詩","永遠の混沌","夕陽のアサシンクロス","ニーベルングの指輪")) {
				case 1:
					mes "[ネリュオッド]";
					mes "ブラギの詩か。よし！";
					mes "詩人の心を聴かせてあげよう。";
					soundeffect "bragis_poem.wav",0,0;
					break;
				case 2:
					cutin "god_nelluad02",2;
					mes "[ネリュオッド]";
					mes "永遠の混沌……";
					mes "これは雄大な曲だ。";
					mes "ところでこの題目、";
					mes "混沌状態が永遠に続くのか、";
					mes "それとも永遠と混沌が同じものなのか、";
					mes "果たしてどっちの意味なんだろうね？";
					soundeffect "chaos_of_eternity.wav",0,0;
					break;
				case 3:
					cutin "god_nelluad02",2;
					mes "[ネリュオッド]";
					mes "夕陽のアサシンクロス！";
					mes "死の影に包まれたアサシンクロスが";
					mes "夕日を背にたたずむ……";
					mes "哀愁漂う素晴らしい光景だ。";
					mes "はははっ！";
					soundeffect "assassin_of_sunset.wav",0,0;
					break;
				case 4:
					cutin "god_nelluad02",2;
					mes "[ネリュオッド]";
					mes "ニーベルングの指輪？";
					mes "ああ、歌詞が面白いよね。";
					mes "そうだ、一曲弾いてみよう。";
					next;
					soundeffect "ring_of_nibelungen.wav",0,0;
					mes "[ネリュオッド]";
					mes "^4d4dff大いなる河の底に巨大な黄金ありき。";
					mes "愛を断つ者が、隠されし秘密を知り";
					mes "その黄金から指輪を鍛え上げし時、";
					mes "その者は全能な力を得る。";
					mes "それは神々さえ支配下におく";
					mes "全世界の王の指輪であった～。^000000";
					next;
					mes "[ネリュオッド]";
					mes "^4d4dffヴァルハラを築いた巨人たちが";
					mes "望むもの、それは美しき女神フレイヤ。";
					mes "姑息なロキの取り引きにより、";
					mes "かの女神は突如姿を消した。";
					next;
					mes "[ネリュオッド]";
					mes "女神の代わりとなれるもの";
					mes "それはアルベリヒの宝物。";
					mes "神々さえ支配するという";
					mes "あの指輪であった～。^000000";
					next;
					mes "[ネリュオッド]";
					mes "^4d4dff魔法の頭巾を持つアルベリヒ。";
					mes "何にでもなれる、無限に手に入る";
					mes "黄金で世の中を思いのままにできる。";
					mes "そんな喜びに浸っている彼に";
					mes "ロキはささやいた。";
					next;
					mes "[ネリュオッド]";
					mes "可哀相なアルベリヒは";
					mes "その言葉に惑わされ、その身を";
					mes "なんとひき蛙へと変えてしまい";
					mes "捕まってしまった。^000000";
					next;
					mes "[ネリュオッド]";
					mes "^4d4dffアルベリヒは呪った。";
					mes "自らの手を去った指輪、その主人と";
					mes "なる者は、災いをうけ、やがて死に";
					mes "至るようにと。指輪を受けとった";
					mes "巨人たち、彼らは互いの宝物を";
					mes "奪い合う。";
					next;
					mes "[ネリュオッド]";
					mes "結局、呪いを受けた弟は、";
					mes "兄を殴り殺してしまった。^000000";
					break;
				}
				break;
			case 2:
				mes "[ネリュオッド]";
				mes "噂話って……";
				mes "どの話を知りたいの？";
				next;
				switch(select("やっぱり首都プロンテラ！","港街の話を聞きたい","砂漠は相変らず暑いのかな？","国境付近が気になる")) {
				case 1:
					mes "[ネリュオッド]";
					mes "プロンテラ？";
					mes "すぐそこじゃないか。";
					mes "冒険するなら、人に聞く前に";
					mes "積極的に自ら挑戦するべきだよ。";
					next;
					mes "[ネリュオッド]";
					mes "ま、それはともかく";
					mes "面白い話が一つある。";
					mes "君はまだ独身か？";
					mes "もしそうなら、プロンテラの酒場へ";
					mes "行ってみろ。";
					next;
					cutin "god_nelluad04",2;
					mes "[ネリュオッド]";
					mes "よくそこで飲んでる男が";
					mes "ある場所へ送ってくれるらしい。";
					mes "ある場所……それはなんと「あそこ」の";
					mes "秘密酒場。独身では絶対に行けない";
					mes "と言われている「あそこ」にだ。";
					mes "驚きだろ？";
					break;
				case 2:
					mes "[ネリュオッド]";
					mes "港街ってことはやっぱりアルベルタか？";
					mes "アルベルタは海を眺められるのが";
					mes "いいね。";
					mes "海といえば南西に";
					mes "ココモビーチがあるね。";
					next;
					cutin "god_nelluad03",2;
					mes "[ネリュオッド]";
					mes "ココモビーチは砂浜が広く";
					mes "海産物が豊富で潮干狩りには";
					mes "もってこいだ。だが、そんな場所には";
					mes "危険も潜んでいる。そう、変な奴が";
					mes "現われるんだ。";
					next;
					cutin "god_nelluad04",2;
					mes "[ネリュオッド]";
					mes "真っ赤な髪を逆立てて";
					mes "とげとげしい雰囲気を漂わせている奴。";
					mes "そいつは何かをクチャクチャかみながら";
					mes "時たま、つばを吐き捨てる。僕は";
					mes "そいつに所持金を全て奪われたよ。";
					next;
					mes "[ネリュオッド]";
					mes "まあ、世間は僕の様なか弱い詩人が";
					mes "生き抜くには過酷だ。";
					mes "……でも、それに対しアルベルタは";
					mes "昔ののままだった。";
					next;
					mes "[ネリュオッド]";
					mes "かなり昔、海賊ホークが大暴れして";
					mes "いた跡は見受けられない。沈没船";
					mes "自体は沖にあるがね。";
					next;
					cutin "god_nelluad01",2;
					mes "[ネリュオッド]";
					mes "ジョンダだかゾンダだか、そんな";
					mes "名前の会社が、金稼ぎイベントを";
					mes "やってるそうだ。君も退屈しのぎに";
					mes "モンスター退治に行ってはどうかな？";
					break;
				case 3:
					mes "[ネリュオッド]";
					mes "うん、ものすご～く暑いね。";
					mes "やはり砂漠だからね。";
					mes "しかも、突然出現する巨大ミミズ!!";
					mes "砂の塊かと思っていたら、背後から";
					mes "襲いかかるサンドマン!!";
					mes "砂漠はとてもデンジャラスだ！";
					next;
					mes "[ネリュオッド]";
					mes "それでも……砂漠から見下ろす";
					mes "海は実にきれい。";
					mes "自然と詩が浮かんでくるよ。";
					mes "それから、砂漠で忘れては";
					mes "いけないのは、やはりあそこ!!";
					next;
					cutin "god_nelluad02",2;
					mes "[ネリュオッド]";
					mes "砂嵐の中に隠れているという";
					mes "噂のアサシンギルド!!";
					if(Job == Job_Assassin || Job == Job_Guillotine) {
						mes "なんだ～。君って";
						mes "アサシンギルド出身なんだね。";
						mes "今度、僕を連れてってくれないかい？";
					}
					else
						mes "君は行ったことがある？";
					break;
				case 4:
					mes "[ネリュオッド]";
					mes "国境……そこを抜けると隣国";
					mes "シュバルツルド!!　そしてしばらく";
					mes "進むと、やがてジュノーに辿り着く。";
					mes "ジュノーはシュバルツバルド共和国の";
					mes "首都であると同時に、";
					mes "賢者の都市とも言われている。";
					next;
					mes "[ネリュオッド]";
					mes "そのジュノーには、今かなりの";
					mes "問題人物がいるようだ。その人物は";
					mes "マッドサイエンティストと呼ばれている";
					mes "科学者らしい。実験だか研究だか";
					mes "判らないが、器物破損は基本、";
					mes "騒音もすごく、当人の性格も悪い……";
					next;
					cutin "god_nelluad03",2;
					mes "[ネリュオッド]";
					mes "そんな状態だから、当然人に";
					mes "嫌われていてさ。しかもせっぱつまった";
					mes "道具屋の主人が、通りがかる冒険者に";
					mes "彼の研究妨害を依頼しているそうだ。";
					next;
					mes "[ネリュオッド]";
					mes "でも、一科学者の研究を何もかも";
					mes "潰してしまうってのは、";
					mes "行き過ぎではないかな？";
					next;
					cutin "god_nelluad01",2;
					mes "[ネリュオッド]";
					mes "それから……ジュノーが";
					mes "空に浮かんでいるってことは";
					mes "君も知っているよね。";
					mes "それは太古の巨人ユミルの心臓の欠片が";
					mes "あるおかげと言われている。";
					next;
					mes "[ネリュオッド]";
					mes "また、セージキャッスルには";
					mes "ユミルの書がある。君も";
					mes "ヴァルキリーに会ってみたいなら";
					mes "その「ユミルの書」を必ず";
					mes "読まなければならないよ。";
					break;
				}
				break;
			case 3:
				mes "[ネリュオッド]";
				mes "そうか。じゃ、また今度話そう。";
				mes "君にブラギの加護があるように～。";
				break;
			}
		}
		else if(GOD_3QUE > 0 && GOD_3QUE < 50) {
			cutin "god_nelluad01",2;
			mes "[ネリュオッド]";
			mes "エンリコケーリには会ってみた？";
			mes "僕の勧めを無駄にしないでくれよ。";
			next;
			switch(select("うん。けど何か話を聴きたい","歌を聴きたい")) {
			case 1:
				cutin "god_nelluad02",2;
				mes "[ネリュオッド]";
				mes "そうだね……何の話をしようか？";
				mes "うーん、あれがいいかな。";
				mes "僕が旅行中に体験した冒険談だ。";
				next;
				mes "[ネリュオッド]";
				mes "それはすごく不思議な経験だった。";
				mes "モロクという南西の方の砂漠の都市。";
				mes "僕は砂漠というものを初めて見たんだ。";
				mes "そのモロクに行く途中、少し";
				mes "窪んだ場所で休憩していたら……";
				next;
				mes "[ネリュオッド]";
				mes "まさにその辺で噂だけ聞いていた";
				mes "蟻地獄だったとは……。";
				mes "蟻がなんで怖いかって？";
				mes "……もちろん、蟻は怖くはないよ。";
				mes "まぁ、群れを成すと怖いけどね。";
				next;
				cutin "god_nelluad03",2;
				mes "[ネリュオッド]";
				mes "僕の目の前に現れたのは、";
				mes "まるで……イチゴとメロンが";
				mes "合体したような……巨大な";
				mes "マシュマロのようにも見える";
				mes "フリオニだったんだよ！";
				next;
				mes "[ネリュオッド]";
				mes "それはまだ序の口だね。";
				mes "僕はふいにファロス燈台が";
				mes "見たくなってね……";
				mes "カプラサービスも使わずに";
				mes "旅人のロマンを味わいながら";
				mes "砂漠の横断に挑戦したのさ。";
				next;
				mes "[ネリュオッド]";
				mes "私はモロクの南でセルテロって";
				mes "人に会って、サンダルマン要塞の";
				mes "話を聞くことができたんだ。";
				mes "そして恐れる物などない！　と、";
				mes "そのまま進んでいったんだ。";
				mes "名前を聞くときれいな所に思えたから。";
				next;
				cutin "god_nelluad01",2;
				mes "[ネリュオッド]";
				mes "でも……僕はすぐに後悔した……";
				mes "そこはたしかにきれいな所では";
				mes "あった……";
				mes "砂丘と廃墟が見事に織り交ざった";
				mes "壮観な景色だったしね。";
				mes "でも……";
				next;
				mes "[ネリュオッド]";
				mes "そこはセルテロの言うとおり……";
				mes "人が近寄らなくなってから";
				mes "モンスターの天国になってたんだ。";
				mes "うぅ……今思い出すだけでも";
				mes "めまいがしそうなほど走ったよ。";
				mes "西へ西へと……";
				next;
				mes "[ネリュオッド]";
				mes "サンダルマン要塞の西の方は";
				mes "そんなに危険じゃなかった。";
				mes "人が住んでいそうな民家も";
				mes "見えたしね。";
				next;
				mes "[ネリュオッド]";
				mes "もう僕は迷わずその家の門を";
				mes "ドンドン叩いたよ。";
				mes "人が居たら休ませてもらおうと";
				mes "思ってね。";
				mes "そうしたら、中から声がしたんだ。";
				next;
				cutin "god_nelluad03",2;
				mes "[ネリュオッド]";
				mes "「誰だ!?　ここに何の用だ！」";
				mes "そりゃおどろいたよ……";
				mes "合言葉を言わなければ";
				mes "いけなかったなんて。";
				mes "そんなの僕が知ってるわけ";
				mes "ないじゃないか……";
				next;
				mes "[ネリュオッド]";
				mes "まさに九死に一生を得て";
				mes "ファロス燈台に着いてから";
				mes "わかったよ……";
				next;
				mes "[ネリュオッド]";
				mes "その辺一帯がローグギルドの";
				mes "隠れ場所だったってね。";
				mes "とにかくローグってのはすごい。";
				mes "彼らでなくて誰があんな";
				mes "モンスター天国に住むというんだ……";
				next;
				cutin "god_nelluad01",2;
				mes "[ネリュオッド]";
				mes "ふぅ……たくさんしゃべったから";
				mes "ちょっと疲れちゃったな……";
				mes "またすごい冒険をしたら";
				mes "話してあげるよ。";
				break;
			case 2:
				cutin "god_nelluad02",2;
				mes "[ネリュオッド]";
				mes "歌？　ああ。";
				mes "僕の歌を聞かせてあげるよ。";
				next;
				mes "名誉をつかもうとしたが";
				mes "残ったものは虚無";
				mes "幸せをつかもうとしたが";
				mes "残ったものは涙";
				next;
				mes "歳月は繰り返す";
				mes "アルデバランの水車のように";
				mes "またやりなおせる";
				mes "だから元気を出そう";
				next;
				mes "泣いているお嬢さんも";
				mes "肩をおとした少年も";
				mes "魚を取られた猫も";
				mes "ぐるぐると回る水車のように……";
				next;
				cutin "god_nelluad04",2;
				mes "[ネリュオッド]";
				mes "うん？";
				mes "感動したって？";
				mes "はは。";
				break;
			}
		}
		else {
			mes "[ネリュオッド]";
			mes "やあ！";
			mes "おや？　この間会ったよね？";
			mes "違う？　変だな……";
			mes "話を聞きたいって言っていた人は";
			mes "君じゃなかったか……";
			mes "ま、せっかくだから聞いていきなよ。";
			next;
			mes "[ネリュオッド]";
			mes "僕の話がためになるかどうかは";
			mes "君が判断すればいいさ……";
			mes "君はモンスター学会って知ってる？";
			mes "ジュノーにあるんだけどね。";
			mes "そのジュノーで聞いた話なんだけど";
			mes "どう？　聞く？";
			next;
			switch(select("教えて！","興味ないな")) {
			case 1:
				mes "[ネリュオッド]";
				mes "そのキラキラ輝やいた目、";
				mes "気に入った!!　よし！";
				mes "聞く気のある人にはこの僕が";
				mes "真心を込めて話してあげるよ。";
				mes "君も冒険家みたいだからね。";
				next;
				if(BaseLevel < 70) {
					cutin "god_nelluad03",2;
					mes "[ネリュオッド]";
					mes "おっと、でも君にはちょっと";
					mes "早い話かもしれないな。";
					mes "もうちょっと冒険を積んでから";
					mes "聞いた方がよさそうだ。";
					mes "またね～";
				}
				else {
					cutin "god_nelluad02",2;
					mes "[ネリュオッド]";
					mes "ふむ～";
					mes "君も結構色々な冒険を";
					mes "してきたみたいだね。";
					mes "うん、君になら話してもよさそうだ。";
					next;
					mes "[ネリュオッド]";
					mes "ジュノーを行き来する冒険家だったら";
					mes "誰しも一度は耳にするだろう";
					mes "モンスター学会がある。";
					mes "そこの学者の一人、エンリコさんの";
					mes "仕事の話だ。";
					next;
					cutin "god_nelluad01",2;
					mes "[ネリュオッド]";
					mes "ある日学会を訪ねてきた冒険家が";
					mes "エンリコさんにあげた物があるん";
					mes "だけど、それがとても普通の物";
					mes "ではなかったらしい……";
					mes "それで、エンリコさんはそれについて";
					mes "手伝ってくれる人を探していたんだ。";
					next;
					mes "[ネリュオッド]";
					mes "あ、国で研究していたものと";
					mes "その冒険家が持ってきた物には";
					mes "何らかの関連性があると言っていた。";
					mes "もしかして、究明ができていない";
					mes "古代の遺産の一部かもしれないとか。";
					next;
					mes "[ネリュオッド]";
					mes "どう、興味ある？";
					mes "詳しくはエンリコさんの話を";
					mes "聞いてみないとわからないけど、";
					mes "彼の仕事を手伝ってみたいと";
					mes "思ったら僕が推薦状くらいは";
					mes "書いてあげるよ。";
					next;
					switch(select("もちろん手伝うよ！","あまり興味がわかないね……")) {
					case 1:
						mes "[ネリュオッド]";
						mes "ほぅ～いいね。";
						mes "君の名前は？　うん？";
						mes strcharinfo(0)+ "か。";
						mes "よし、エンリコさんに連絡しよう。";
						next;
						mes "[ネリュオッド]";
						mes "学会はジュノーの広場から";
						mes "西の方にあるからね。";
						mes "それじゃ、がんばって！";
						set GOD_3QUE,1;
						break;
					case 2:
						cutin "god_nelluad02",2;
						mes "[ネリュオッド]";
						mes "そりゃー残念。";
						mes "君程の人なら手伝ってくれるかと";
						mes "思ったんだがね～。";
						mes "それじゃ、またね。";
						break;
					}
				}
				break;
			case 2:
				mes "[ネリュオッド]";
				mes "それじゃ、ちょっと冒険話でも";
				mes "しようか？";
				next;
				switch(select("うん、聞きたい","それよりも歌を聴かせて")) {
				case 1:
					cutin "god_nelluad02",2;
					mes "[ネリュオッド]";
					mes "そうだね……何の話をしようか？";
					mes "うーん、あれがいいかな。";
					mes "僕が旅行中に体験した冒険談だ。";
					next;
					mes "[ネリュオッド]";
					mes "それはすごく不思議な経験だった。";
					mes "モロクという南西の方の砂漠の都市。";
					mes "僕は砂漠というものを初めて見たんだ。";
					mes "そのモロクに行く途中、少し";
					mes "窪んだ場所で休憩していたら……";
					next;
					mes "[ネリュオッド]";
					mes "まさにその辺で噂だけ聞いていた";
					mes "蟻地獄だったとは……。";
					mes "蟻がなんで怖いかって？";
					mes "……もちろん、蟻は怖くはないよ。";
					mes "まぁ、群れを成すと怖いけどね。";
					next;
					cutin "god_nelluad03",2;
					mes "[ネリュオッド]";
					mes "僕の目の前に現れたのは、";
					mes "まるで……イチゴとメロンが";
					mes "合体したような……巨大な";
					mes "マシュマロのようにも見える";
					mes "フリオニだったんだよ！";
					next;
					mes "[ネリュオッド]";
					mes "それはまだ序の口だね。";
					mes "僕はふいにファロス燈台が";
					mes "見たくなってね……";
					mes "カプラサービスも使わずに";
					mes "旅人のロマンを味わいながら";
					mes "砂漠の横断に挑戦したのさ。";
					next;
					mes "[ネリュオッド]";
					mes "私はモロクの南でセルテロって";
					mes "人に会って、サンダルマン要塞の";
					mes "話を聞くことができたんだ。";
					mes "そして恐れる物などない！　と、";
					mes "そのまま進んでいったんだ。";
					mes "名前を聞くときれいな所に思えたから。";
					next;
					cutin "god_nelluad01",2;
					mes "[ネリュオッド]";
					mes "でも……僕はすぐに後悔した……";
					mes "そこはたしかにきれいな所では";
					mes "あった……";
					mes "砂丘と廃墟が見事に織り交ざった";
					mes "壮観な景色だったしね。";
					mes "でも……";
					next;
					mes "[ネリュオッド]";
					mes "そこはセルテロの言うとおり……";
					mes "人が近寄らなくなってから";
					mes "モンスターの天国になってたんだ。";
					mes "うぅ……今思い出すだけでも";
					mes "めまいがしそうなほど走ったよ。";
					mes "西へ西へと……";
					next;
					mes "[ネリュオッド]";
					mes "サンダルマン要塞の西の方は";
					mes "そんなに危険じゃなかった。";
					mes "人が住んでいそうな民家も";
					mes "見えたしね。";
					next;
					mes "[ネリュオッド]";
					mes "もう僕は迷わずその家の門を";
					mes "ドンドン叩いたよ。";
					mes "人が居たら休ませてもらおうと";
					mes "思ってね。";
					mes "そうしたら、中から声がしたんだ。";
					next;
					cutin "god_nelluad04",2;
					mes "[ネリュオッド]";
					mes "「誰だ!?　ここに何の用だ！」";
					mes "そりゃおどろいたよ……";
					mes "合言葉を言わなければ";
					mes "いけなかったなんて。";
					mes "そんなの僕が知ってるわけ";
					mes "ないじゃないか……";
					next;
					mes "[ネリュオッド]";
					mes "まさに九死に一生を得て";
					mes "ファロス燈台に着いてから";
					mes "わかったよ……";
					next;
					mes "[ネリュオッド]";
					mes "その辺一帯がローグギルドの";
					mes "隠れ場所だったってね。";
					mes "とにかくローグってのはすごい。";
					mes "彼らでなくて誰があんな";
					mes "モンスター天国に住むというんだ……";
					next;
					cutin "god_nelluad01",2;
					mes "[ネリュオッド]";
					mes "ふぅ……たくさんしゃべったから";
					mes "ちょっと疲れちゃったな……";
					mes "またすごい冒険をしたら";
					mes "話してあげるよ。";
					break;
				case 2:
					cutin "god_nelluad02",2;
					mes "[ネリュオッド]";
					mes "歌？　ああ。";
					mes "僕の歌を聞かせてあげるよ。";
					next;
					mes "名誉をつかもうとしたが";
					mes "残ったものは虚無";
					mes "幸せをつかもうとしたが";
					mes "残ったものは涙";
					next;
					mes "歳月は繰り返す";
					mes "アルデバランの水車のように";
					mes "またやりなおせる";
					mes "だから元気を出そう";
					next;
					mes "泣いているお嬢さんも";
					mes "肩をおとした少年も";
					mes "魚を取られた猫も";
					mes "ぐるぐると回る水車のように……";
					next;
					cutin "god_nelluad04",2;
					mes "[ネリュオッド]";
					mes "うん？";
					mes "感動したって？";
					mes "はは。";
					break;
				}
				break;
			}
		}
		close2;
		cutin "god_nelluad01",255;
		cutin "god_nelluad02",255;
		cutin "god_nelluad03",255;
		cutin "god_nelluad04",255;
		end;
	}
	mes "[ネリュオッド]";
	mes "よう！　いい天気だね。";
	mes "うん？　ああごめんごめん。";
	if(Sex) {
		mes "いや～僕は人の顔を";
		mes "覚えるのが苦手でね。";
	}
	else {
		mes "君みたいなきれいな女性は";
		mes "一度会ったら忘れるはずが";
		mes "ないからね。";
	}
	mes "ハッハッハ～！";
	next;
	cutin "god_nelluad01",2;
	mes "[ネリュオッド]";
	mes "僕に何か用かい？";
	mes "なんでも聞いてごらんよ。";
	mes "風に流れる雲のように";
	mes "旅をするのさ～";
	mes "夜空の星明かりと共に";
	mes "歌う君の友なのさ～";
	next;
	switch(select("あなたの正体って？","なんか面白い噂ない？","今、歌える？")) {
	case 1:
		mes "[ネリュオッド]";
		mes "僕は流されるまま流れゆく";
		mes "旅の吟遊詩人ネリュオッド。";
		mes "実は本名はエリュオッドだ。";
		mes "ところで……いつだったかな。";
		mes "その日もある村の旅館でのんびり";
		mes "していたんだけど……";
		next;
		cutin "god_nelluad03",2;
		mes "[ネリュオッド]";
		mes "いきなりチャラチャラした金髪の";
		mes "頭のやつが近くに寄ってきて";
		mes "いきなり名前を変えろって言うのさ。";
		mes "そりゃー大騒ぎしたよ。";
		mes "まるで自分の名前のことのように";
		mes "こだわってくるんだ……";
		next;
		cutin "god_nelluad04",2;
		mes "[ネリュオッド]";
		mes "結局……その席で名前を";
		mes "変えることになったんだよ。";
		mes "ネリュオッドってね。";
		mes "……";
		next;
		mes "[ネリュオッド]";
		mes "今、単に僕が弱くて";
		mes "肝っ玉の小さいやつだって";
		mes "思ったでしょ！";
		mes "これはどういたしまして！";
		mes "僕はただ暴力が嫌いなだけ。";
		mes "平和を愛する優しい吟遊詩人なのさ。";
		next;
		mes "- これ以上聞いていたら";
		mes "こちらまでおかしくなる。";
		mes "無視しよう -";
		next;
		cutin "god_nelluad03",2;
		mes "[ネリュオッド]";
		mes "うーん？　こらこら～";
		mes "無視するなんてひどいなぁ～";
		break;
	case 2:
		mes "[ネリュオッド]";
		mes "噂話って……";
		mes "どの話を知りたいの？";
		next;
		switch(select("やっぱり首都プロンテラ！","港街の話を聞きたい","砂漠は相変らず暑いのかな？","国境付近が気になる")) {
		case 1:
			mes "[ネリュオッド]";
			mes "プロンテラ？";
			mes "すぐそこじゃないか。";
			mes "冒険するなら、人に聞く前に";
			mes "積極的に自ら挑戦するべきだよ。";
			next;
			mes "[ネリュオッド]";
			mes "ま、それはともかく";
			mes "面白い話が一つある。";
			mes "君はまだ独身か？";
			mes "もしそうなら、プロンテラの酒場へ";
			mes "行ってみろ。";
			next;
			mes "[ネリュオッド]";
			mes "よくそこで飲んでる男が";
			mes "ある場所へ送ってくれるらしい。";
			mes "ある場所……それはなんと「あそこ」の";
			mes "秘密酒場。独身では絶対に行けない";
			mes "と言われている「あそこ」にだ。";
			mes "驚きだろ？";
			break;
		case 2:
			mes "[ネリュオッド]";
			mes "港街ってことはやっぱりアルベルタか？";
			mes "アルベルタは海を眺められるのが";
			mes "いいね。";
			mes "海といえば南西に";
			mes "ココモビーチがあるね。";
			next;
			mes "[ネリュオッド]";
			mes "ココモビーチは砂浜が広く";
			mes "海産物が豊富で潮干狩りには";
			mes "もってこいだ。だが、そんな場所には";
			mes "危険も潜んでいる。そう、変な奴が";
			mes "現われるんだ。";
			next;
			cutin "god_nelluad04",2;
			mes "[ネリュオッド]";
			mes "真っ赤な髪を逆立てて";
			mes "とげとげしい雰囲気を漂わせている奴。";
			mes "そいつは何かをクチャクチャかみながら";
			mes "時たま、つばを吐き捨てる。僕は";
			mes "そいつに所持金を全て奪われたよ。";
			next;
			mes "[ネリュオッド]";
			mes "まあ、世間は僕の様なか弱い詩人が";
			mes "生き抜くには過酷だ。";
			mes "……でも、それに対しアルベルタは";
			//mes "昔ののままだった。";
			mes "昔のままだった。";
			next;
			mes "[ネリュオッド]";
			mes "かなり昔、海賊ホークが大暴れして";
			mes "いた跡は見受けられない。沈没船";
			mes "自体は沖にあるがね。";
			next;
			cutin "god_nelluad01",2;
			mes "[ネリュオッド]";
			mes "ジョンダだかゾンダなのか、そんな";
			mes "名前の会社が、金稼ぎイベントを";
			mes "やってるそうだ。君も退屈しのぎに";
			mes "モンスター退治に行ってはどうかな？";
			break;
		case 3:
			mes "[ネリュオッド]";
			mes "うん、ものすご～く暑いね。";
			mes "やはり砂漠だからね。";
			mes "しかも、突然出現する巨大ミミズ!!";
			mes "砂の塊かと思っていたら、背後から";
			mes "襲いかかるサンドマン!!";
			mes "砂漠はとてもデンジャラスだ！";
			next;
			cutin "god_nelluad02",2;
			mes "[ネリュオッド]";
			mes "それでも……砂漠から見下ろす";
			mes "海は実にきれい。";
			mes "自然と詩が浮かんでくるよ。";
			mes "それから、砂漠で忘れては";
			mes "いけないのは、やはりあそこ!!";
			next;
			mes "[ネリュオッド]";
			mes "砂嵐の中に隠れているという";
			mes "噂のアサシンギルド!!";
			if(Job == Job_Assassin || Job == Job_Guillotine) {
				mes "なんだ～。君って";
				mes "アサシンギルド出身なんだね。";
				mes "今度、僕を連れてってくれないかい？";
			}
			else
				mes "君は行ったことがある？";
			break;
		case 4:
			mes "[ネリュオッド]";
			mes "国境……そこを抜けると隣国";
			mes "シュバルツルド!!　そしてしばらく";
			mes "進むと、やがてジュノーに辿り着く。";
			mes "ジュノーはシュバルツバルド共和国の";
			mes "首都であると同時に、";
			mes "賢者の都市とも言われている。";
			next;
			mes "[ネリュオッド]";
			mes "そのジュノーには、今かなりの";
			mes "問題人物がいるようだ。その人物は";
			mes "マッドサイエンティストと呼ばれている";
			mes "科学者らしい。実験だか研究だか";
			mes "判らないが、器物破損は基本、";
			mes "騒音もすごく、当人の性格も悪い……";
			next;
			cutin "god_nelluad03",2;
			mes "[ネリュオッド]";
			mes "そんな状態だから、当然人に";
			mes "嫌われていてさ。しかもせっぱつまった";
			mes "道具屋の主人が、通りがかる冒険者に";
			mes "彼の研究妨害を依頼しているそうだ。";
			next;
			mes "[ネリュオッド]";
			mes "でも、一科学者の研究を何もかも";
			mes "潰してしまうってのは、";
			mes "行き過ぎではないかな？";
			next;
			cutin "god_nelluad01",2;
			mes "[ネリュオッド]";
			mes "それから……ジュノーが";
			mes "空に浮かんでいるってことは";
			mes "君も知っているよね。";
			mes "それは太古の巨人ユミルの心臓の欠片が";
			mes "あるおかげと言われている。";
			next;
			mes "[ネリュオッド]";
			mes "また、セージキャッスルには";
			mes "ユミルの書がある。君も";
			mes "ヴァルキリーに会ってみたいなら";
			mes "その「ユミルの書」を必ず";
			mes "読まなければならないよ。";
			break;
		}
		break;
	case 3:
		mes "[ネリュオッド]";
		mes "では、何を聴かせようか……";
		mes "好きなものを選んでくれ！";
		next;
		switch(select("ブラギの詩","永遠の混沌","夕陽のアサシンクロス")) {
		case 1:
			if(Zeny < 500) {
				mes "[ネリュオッド]";
				mes "おや～、お金が少ないようだね。";
				mes "すまないが演奏な無しだ。";
			}
			else {
				cutin "god_nelluad02",2;
				mes "[ネリュオッド]";
				mes "よぅ、君は詩人の心をわかってるね！";
				mes "ブラギは僕らの神だ。";
				soundeffect "bragis_poem.wav",0;
				set Zeny,Zeny - 500;
			}
			break;
		case 2:
			if(Zeny < 500) {
				mes "[ネリュオッド]";
				mes "おや～、お金が少ないようだね。";
				mes "すまないが演奏な無しだ。";
			}
			else {
				cutin "god_nelluad02",2;
				mes "[ネリュオッド]";
				mes "君は雄大な曲がお好みか！";
				mes "ほら、永遠の混沌だ！";
				soundeffect "chaos_of_eternity.wav",0;
				set Zeny,Zeny - 500;
			}
			break;
		case 3:
			if(Zeny < 500) {
				mes "[ネリュオッド]";
				mes "おや～、お金が少ないようだね。";
				mes "すまないが演奏な無しだ。";
			}
			else {
				cutin "god_nelluad02",2;
				mes "[ネリュオッド]";
				mes "おお……渋いね……";
				mes "やはり赤い夕陽と似合うのは";
				mes "アサシンだねぇ……";
				soundeffect "assassin_of_sunset.wav",0;
				set Zeny,Zeny - 500;
			}
			break;
		}
		break;
	}
	close2;
	cutin "god_nelluad01",255;
	cutin "god_nelluad02",255;
	cutin "god_nelluad03",255;
	cutin "god_nelluad04",255;
	end;
}

yuno_in04.gat,47,113,1	script	研究中の学者	749,{
	if(checkitemblank() == 0) {
		mes "- 所持アイテムの種類数が -";
		mes "- 多いため、アイテムを受けとる -";
		mes "- ことができません。 -";
		mes "- 所持アイテムを減らしてから -";
		mes "- 再度話しかけてください。 -";
		close;
	}
	if(MaxWeight - Weight < 2000) {
		mes "- 所持重量が多いため、アイテムを -";
		mes "- 受けとることができません。 -";
		mes "- 所持アイテムを減らしてから -";
		mes "- 再度話しかけてください。 -";
		close;
	}
	if($GodBrysinggamen == 100) {
		mes "[研究中の学者]";
		mes "赤ポーションの製作には";
		mes "赤ハーブと水の濃度調節が";
		mes "とても重要だ。";
		mes "その微妙な調節によって";
		mes "最上の回復量を出せたら満足だ。";
		close;
	}
	if($GodMagingiorde >= 50) {
		if(GOD_3QUE == 50) {
			mes "[エンリコ・ケーリ]";
			mes "ああ" +strcharinfo(0)+ "君かね。";
			mes "最近新しい研究を始めてね。";
			mes "ブリーシンガメンも魅力的だが……";
			mes "ふふ……";
			mes "今取りかかっている研究は";
			mes "極秘だから教えるわけにいかんな。";
			next;
			mes "[エンリコ・ケーリ]";
			mes "また機会があったら一緒に";
			mes "研究しようか。";
			close;
		}
		else if(GOD_3QUE == 49) {
			mes "[エンリコ・ケーリ]";
			mes "よく来たね。";
			mes "ベーリングが居た所は";
			mes "静かな波が立つ……";
			mes "女神が流した涙に力が込められて";
			mes "いたんだろうね……";
			next;
			mes "[エンリコ・ケーリ]";
			mes "まったく……";
			mes "神器の力を持った品物だとは……";
			mes "ドキドキするよ。";
			mes "どうするかね……";
			mes "あ、まず国王陛下に報告を……";
			mes "ああ、何からしていいやら……";
			next;
			menu "まず報酬をください!!",-;
			mes "[エンリコ・ケーリ]";
			mes "あ……そうだったね。";
			mes "君も苦労しただろう。";
			mes "よかったら私の助手にならないか？";
			mes "ははは……冗談だ。";
			mes "それじゃ、約束したとおり……";
			next;
			mes "[エンリコ・ケーリ]";
			mes "私ののコレクションの中から";
			mes "一つあげよう。";
			mes "何が出るか、それはお楽しみだ。";
			next;
			set '@card,rand(1,1210);
			if('@card > 0 && '@card < 11)	// ポリンカード
				set '@gain,4001;
			else if('@card > 10 && '@card < 21)	// ファブルカード
				set '@gain,4002;
			else if('@card > 20 && '@card < 26)	// プパカード
				set '@gain,4003;
			else if('@card > 25 && '@card < 41)	// ドロップスカード
				set '@gain,4004;
			else if('@card > 40 && '@card < 51)	// ルナティックカード
				set '@gain,4006;
			else if('@card > 50 && '@card < 56)	// ペコペコの卵カード
				set '@gain,4007;
			else if('@card > 55 && '@card < 71)	// ピッキカード
				set '@gain,4008;
			else if('@card > 70 && '@card < 81)	// チョンチョンカード
				set '@gain,4009;
			else if('@card > 80 && '@card < 91)	// ウィローカード
				set '@gain,4010;
			else if('@card > 90 && '@card < 101)	// 盗蟲の卵カード
				set '@gain,4012;
			else if('@card > 100 && '@card < 111)	// アンドレの卵カード
				set '@gain,4013;
			else if('@card > 110 && '@card < 121)	// ロッダフロッグカード
				set '@gain,4014;
			else if('@card > 120 && '@card < 131)	// コンドルカード
				set '@gain,4015;
			else if('@card > 130 && '@card < 141)	// 盗蟲カード
				set '@gain,4016;
			else if('@card > 140 && '@card < 151)	// サベージベベカード
				set '@gain,4017;
			else if('@card > 150 && '@card < 171)	// ホーネットカード
				set '@gain,4019;
			else if('@card > 170 && '@card < 181)	// ファミリアーカード
				set '@gain,4020;
			else if('@card > 180 && '@card < 191)	// ロッカーカード
				set '@gain,4021;
			else if('@card > 190 && '@card < 201)	// スポアカード
				set '@gain,4022;
			else if('@card > 200 && '@card < 211)	// 子デザートウルフカード
				set '@gain,4023;
			else if('@card > 210 && '@card < 221)	// プランクトンカード
				set '@gain,4024;
			else if('@card > 220 && '@card < 231)	// スケルトンカード
				set '@gain,4025;
			else if('@card > 230 && '@card < 241)	// 雌盗蟲カード
				set '@gain,4026;
			else if('@card > 240 && '@card < 251)	// ククレカード
				set '@gain,4027;
			else if('@card > 250 && '@card < 261)	// タロウカード
				set '@gain,4028;
			else if('@card > 260 && '@card < 271)	// ウルフカード
				set '@gain,4029;
			else if('@card > 270 && '@card < 281)	// マンドラゴラカード
				set '@gain,4030;
			else if('@card > 280 && '@card < 291)	// ペコペコカード
				set '@gain,4031;
			else if('@card > 290 && '@card < 301)	// アンバーナイトカード
				set '@gain,4032;
			else if('@card > 300 && '@card < 311)	// ポポリンカード
				set '@gain,4033;
			else if('@card > 310 && '@card < 321)	// ワームテールカード
				set '@gain,4034;
			else if('@card > 320 && '@card < 326)	// ヒドラカード
				set '@gain,4035;
			else if('@card > 325 && '@card < 341)	// ムカーカード
				set '@gain,4036;
			else if('@card > 340 && '@card < 351)	// スネイクカード
				set '@gain,4037;
			else if('@card > 350 && '@card < 361)	// ゾンビカード
				set '@gain,4038;
			else if('@card > 360 && '@card < 371)	// スタイナーカード
				set '@gain,4039;
			else if('@card > 370 && '@card < 376)	// クリーミーカード
				set '@gain,4040;
			else if('@card > 375 && '@card < 391)	// コーコーカード
				set '@gain,4041;
			else if('@card > 390 && '@card < 401)	// スチールチョンチョンカード
				set '@gain,4042;
			else if('@card > 400 && '@card < 411)	// アンドレカード
				set '@gain,4043;
			else if('@card > 410 && '@card < 421)	// スモーキーカード
				set '@gain,4044;
			else if('@card > 420 && '@card < 431)	// ホルンカード
				set '@gain,4045;
			else if('@card > 430 && '@card < 441)	// マーティンカード
				set '@gain,4046;
			else if('@card > 440 && '@card < 451)	// ポイズンスポアカード
				set '@gain,4048;
			else if('@card > 450 && '@card < 461)	// バドンカード
				set '@gain,4049;
			else if('@card > 460 && '@card < 466)	// 雄盗蟲カード
				set '@gain,4050;
			else if('@card > 465 && '@card < 481)	// ヨーヨーカード
				set '@gain,4051;
			else if('@card > 480 && '@card < 491)	// エルダーウィローカード
				set '@gain,4052;
			else if('@card > 490 && '@card < 496)	// ビタタカード
				set '@gain,4053;
			else if('@card > 495 && '@card < 511)	// マリナカード
				set '@gain,4055;
			else if('@card > 510 && '@card < 521)	// ダスティネスカード
				set '@gain,4056;
			else if('@card > 520 && '@card < 536)	// メタルラカード
				set '@gain,4057;
			else if('@card > 535 && '@card < 541)	// タラフロッグカード
				set '@gain,4058;
			else if('@card > 540 && '@card < 551)	// ドロップスカード
				set '@gain,4004;
			else if('@card > 550 && '@card < 561)	// ゴブリンカード
				set '@gain,4060;
			else if('@card > 560 && '@card < 571)	// カナトウスカード
				set '@gain,4061;
			else if('@card > 570 && '@card < 581)	// アナコンダクカード
				set '@gain,4062;
			else if('@card > 580 && '@card < 596)	// キャラメルカード
				set '@gain,4063;
			else if('@card > 595 && '@card < 601)	// ゼロムカード
				set '@gain,4064;
			else if('@card > 600 && '@card < 606)	// カホカード
				set '@gain,4065;
			else if('@card > 605 && '@card < 621)	// オークウォリアーカード
				set '@gain,4066;
			else if('@card > 620 && '@card < 631)	// メガロドンカード
				set '@gain,4067;
			else if('@card > 630 && '@card < 641)	// スコーピオンカード
				set '@gain,4068;
			else if('@card > 640 && '@card < 651)	// ドレインリアーカード
				set '@gain,4069;
			else if('@card > 650 && '@card < 661)	// オークゾンビカード
				set '@gain,4071;
			else if('@card > 660 && '@card < 671)	// ゴーレムカード
				set '@gain,4072;
			else if('@card > 670 && '@card < 681)	// パイレーツスケルカード
				set '@gain,4073;
			else if('@card > 680 && '@card < 691)	// ビッグフットカード
				set '@gain,4074;
			else if('@card > 690 && '@card < 701)	// アルゴスカード
				set '@gain,4075;
			else if('@card > 700 && '@card < 716)	// 白蓮玉カード
				set '@gain,4076;
			else if('@card > 715 && '@card < 721)	// フェンカード
				set '@gain,4077;
			else if('@card > 720 && '@card < 726)	// マンティスカード
				set '@gain,4079;
			else if('@card > 725 && '@card < 741)	// フローラカード
				set '@gain,4080;
			else if('@card > 740 && '@card < 751)	// ホードカード
				set '@gain,4081;
			else if('@card > 750 && '@card < 761)	// デザートウルフカード
				set '@gain,4082;
			else if('@card > 760 && '@card < 766)	// ラフレシアカード
				set '@gain,4083;
			else if('@card > 765 && '@card < 781)	// マリンスフィアーカード
				set '@gain,4084;
			else if('@card > 780 && '@card < 791)	// オークスケルトンカード
				set '@gain,4085;
			else if('@card > 790 && '@card < 796)	// ソルジャースケルトンカード
				set '@gain,4086;
			else if('@card > 795 && '@card < 811)	// ガイアスカード
				set '@gain,4087;
			else if('@card > 810 && '@card < 816)	// フリルドラカード
				set '@gain,4088;
			else if('@card > 815 && '@card < 831)	// ソードフィッシュカード
				set '@gain,4089;
			else if('@card > 830 && '@card < 841)	// ムナックカード
				set '@gain,4090;
			else if('@card > 840 && '@card < 851)	// コボルドカード
				set '@gain,4091;
			else if('@card > 850 && '@card < 861)	// スケルワーカーカード
				set '@gain,4092;
			else if('@card > 860 && '@card < 871)	// オボンヌカード
				set '@gain,4093;
			else if('@card > 870 && '@card < 881)	// アーチャースケルトンカード
				set '@gain,4094;
			else if('@card > 880 && '@card < 891)	// マルスカード
				set '@gain,4095;
			else if('@card > 890 && '@card < 901)	// ゼノークカード
				set '@gain,4096;
			else if('@card > 900 && '@card < 906)	// マーターカード
				set '@gain,4097;
			else if('@card > 905 && '@card < 921)	// ドケビカード
				set '@gain,4098;
			else if('@card > 920 && '@card < 931)	// パサナカード
				set '@gain,4099;
			else if('@card > 930 && '@card < 941)	// ソヒーカード
				set '@gain,4100;
			else if('@card > 940 && '@card < 951)	// サンドマンカード
				set '@gain,4101;
			else if('@card > 950 && '@card < 956)	// ウィスパーカード
				set '@gain,4102;
			else if('@card > 965 && '@card < 971)	// ホロンカード
				set '@gain,4103;
			else if('@card > 970 && '@card < 981)	// レクイエムカード
				set '@gain,4104;
			else if('@card > 980 && '@card < 986)	// マルクカード
				set '@gain,4105;
			else if('@card > 985 && '@card < 991)	// マミーカード
				set '@gain,4106;
			else if('@card > 990 && '@card < 996)	// ベリットカード
				set '@gain,4107;
			else if('@card > 995 && '@card < 1001)	// ミストカード
				set '@gain,4108;
			else if('@card > 1000 && '@card < 1011)	// ジャックカード
				set '@gain,4109;
			else if('@card > 1010 && '@card < 1021)	// グールカード
				set '@gain,4110;
			else if('@card > 1020 && '@card < 1031)	// ストラウフカード
				set '@gain,4111;
			else if('@card > 1030 && '@card < 1041)	// マルドゥークカード
				set '@gain,4112;
			else if('@card > 1040 && '@card < 1051)	// マリオネットカード
				set '@gain,4113;
			else if('@card > 1050 && '@card < 1061)	// アルギオペカード
				set '@gain,4114;
			else if('@card > 1060 && '@card < 1071)	// ハンターフライカード
				set '@gain,4115;
			else if('@card > 1070 && '@card < 1081)	// イシスカード
				set '@gain,4116;
			else if('@card > 1080 && '@card < 1091)	// サイドワインダーカード
				set '@gain,4117;
			else if('@card > 1090 && '@card < 1101)	// グラウンドプティットカード
				set '@gain,4118;
			else if('@card > 1100 && '@card < 1111)	// バースリーカード
				set '@gain,4119;
			else if('@card > 1110 && '@card < 1121)	// スカイプティットカード
				set '@gain,4120;
			else if('@card > 1120 && '@card < 1131)	// デビルチカード
				set '@gain,4122;
			else if('@card > 1130 && '@card < 1141)	// メデューサカード
				set '@gain,4124;
			else if('@card > 1140 && '@card < 1151)	// デビアスカード
				set '@gain,4125;
			else if('@card > 1150 && '@card < 1161)	// ミノタウロスカード
				set '@gain,4126;
			else if('@card > 1160 && '@card < 1171)	// ナイトメアカード
				set '@gain,4127;
			else if('@card > 1170 && '@card < 1176)	// バフォメットジュニアカード
				set '@gain,4129;
			else if('@card > 1175 && '@card < 1181)	// レイドリックカード
				set '@gain,4133;
			else if('@card > 1180 && '@card < 1186)	// カーリッツバーグカード
				set '@gain,4136;
			else if('@card > 1185 && '@card < 1191)	// ジョーカーカード
				set '@gain,4139;
			else if('@card > 1190 && '@card < 1196)	// 深淵の騎士カード
				set '@gain,4140;
			else if('@card > 1195 && '@card < 1201)	// イビルドルイドカード
				set '@gain,4141;
			else if('@card > 1200 && '@card < 1206)	// サンタポリンカード
				set '@gain,4005;
			else
				set '@gain,4001;
			mes "[エンリコ・ケーリ]";
			mes getitemname('@gain)+ "だね。";
			mes "ご苦労様。";
			mes "私の研究を手伝ってくれて";
			mes "本当に助かったよ。";
			set GOD_3QUE,50;
			if($GodBrysinggamen < 100) {		// 受付中
				set $GodBrysinggamen,$GodBrysinggamen+1;
				if($GodBrysinggamen == 50) {
					announce "◆◆大陸に[ブリーシンガメン]の封印が姿を現しました。◆◆",0;
				}
				else if($GodBrysinggamen == 100) {
					if($GodSleipnir == 100 && $GodMagingiorde == 100 && $GodBrysinggamen == 100 && $GodMjolnir == 100)
						announce "◆◆[ブリーシンガメン]の封印が解けたことにより全ての封印が解け、神器の作成ができるようになりました。◆◆",0;
					else
						announce "◆◆[ブリーシンガメン]の封印が解けました。◆◆",0;
				}
			}
			getitem '@gain,1;
			next;
			mes "[エンリコ・ケーリ]";
			mes "私の大事なコレクションの";
			mes "一つだから、大切にしてくれ。";
			mes "ほら、持っていきなさい。";
			next;
			mes "[エンリコ・ケーリ]";
			mes "また機会があったら、";
			mes "君に頼みたいな。";
			mes "それでは元気でね。";
			close;
		}
		else if(GOD_3QUE == 48) {
			mes "[エンリコ・ケーリ]";
			mes "何をしているんだ？";
			mes "はやくしなさい……";
			mes "ブツブツ……";
			emotion 2;
			close;
		}
		else if(GOD_3QUE == 47) {
			mes "[エンリコ・ケーリ]";
			mes "ふむ……四つの封印が";
			mes "解けたのだな……";
			mes "それで本当にブリーシンガメンが";
			mes "作れるのか!?";
			mes "それでどうやって作るのかね？";
			next;
			mes "[エンリコ・ケーリ]";
			mes "君が収集した情報を元に";
			mes "私にわかったことはまず……";
			mes "フレイヤの涙が固まった物。";
			mes "フレイヤの宝石と……";
			next;
			mes "[エンリコ・ケーリ]";
			mes "アルフリッグが眠っていた所で";
			mes "発見された……雪の結晶。";
			mes "ドヴァリンが居た一本道に";
			mes "吹いていた風、すなわち";
			mes "流れる空気。";
			next;
			mes "[エンリコ・ケーリ]";
			mes "ベーリングが眠っていた";
			mes "女神の涙で作られた泉……";
			mes "ここから何が出たのかは";
			mes "よく分からんな……";
			next;
			mes "[エンリコ・ケーリ]";
			mes "そして、飾りにもなる派手な";
			mes "派手な銀の装飾……";
			mes "グレールが求めていたものだろう。";
			mes "これらがブリーシンガメンを";
			mes "構成する元になっているのでは";
			mes "ないだろうか……";
			next;
			mes "[エンリコ・ケーリ]";
			mes "君はどう考える？";
			next;
			switch(select("正直に言うと、分からないです……","それできっとできると思います")) {
			case 1:
				mes "["+strcharinfo(0)+"]";
				mes "でも……";
				mes "彼らに聞いてみればわかるでしょう。";
				mes "アルフリッグとか……";
				next;
				mes "[エンリコ・ケーリ]";
				mes "おお!!!!!!!";
				mes "君、賢いね！";
				mes "よし、それじゃぁ君、行ってきてくれ。";
				mes "待ってるよ!!!!";
				mes "私の研究の希望だ!!";
				next;
				emotion 9,"";
				mes "["+strcharinfo(0)+"]";
				mes "……そ、そう言われても……";
				next;
				mes "[エンリコ・ケーリ]";
				mes "何をしているんだ！";
				mes "早く行ってきたまえ！";
				set GOD_3QUE,48;
				close;
			case 2:
				mes "["+strcharinfo(0)+"]";
				mes "ある程度予測はつきます。";
				mes "やはり……彼、ベーリングの";
				mes "関係しているところに";
				mes "カギが隠されているのでは。";
				next;
				mes "[エンリコ・ケーリ]";
				mes "確かにそうだ。";
				mes "よし、それじゃぁ君、行ってきてくれ。";
				mes "その……誰だ……アルフリッグ。";
				mes "彼に会って来てくれ。";
				next;
				mes "[エンリコ・ケーリ]";
				mes "よしよし、それじゃぁ頼んだぞ！";
				set GOD_3QUE,48;
				close;
			}
		}
		else if(GOD_3QUE == 46) {
			mes "[エンリコ・ケーリ]";
			mes "いよいよ歌がつながってきたな……";
			mes "いや、待てよ……";
			mes "何故、グレールというドワーフが";
			mes "まともに話をしないか……";
			mes "……廃鉱にもモンスターがいるな。";
			next;
			mes "[エンリコ・ケーリ]";
			mes "大変だが、彼と会って話して";
			mes "少しでも情報を引き出すんだ。";
			mes "頼んだ。";
			close;
		}
		else if(GOD_3QUE == 45) {
			mes "[エンリコ・ケーリ]";
			mes "おいおい……";
			mes "歌詞を忘れたのかね？";
			next;
			mes "[エンリコ・ケーリ]";
			mes "ベーリングにまた聞いてみるしかない。";
			mes "メモの用意をしてな。";
			close;
		}
		else if(GOD_3QUE == 44) {
			mes "[エンリコ・ケーリ]";
			mes "ほう～、謎は解けたのかね？";
			mes "うん？　何か湿った空気が……";
			mes "それは女神の涙……か？";
			mes "それで四番目のグレールは";
			mes "何を知っているんだ……？";
			next;
			mes "[エンリコ・ケーリ]";
			mes "とにかく廃鉱に入らなければ";
			mes "ならないようだな……";
			mes "君にも苦労をさせる……";
			mes "だが、期待しているぞ！";
			next;
			mes "[エンリコ・ケーリ]";
			mes "君のおかげで、私は面白い";
			mes "事実が少しずつわかってきた。";
			mes "詳しいことは全てが終わった時";
			mes "話そう。";
			mes "それでは、廃鉱に向かってくれ。";
			next;
			mes "[エンリコ・ケーリ]";
			mes "モンスターには気をつけるように。";
			close;
		}
		else if(GOD_3QUE == 43) {
			mes "[エンリコ・ケーリ]";
			mes "やはり待ったかいがあったようだな。";
			mes "ドヴァリンが言ったその謎は";
			mes "恐らく、終わらない戦争のことを";
			mes "指しているんだろうな。";
			next;
			mes "[エンリコ・ケーリ]";
			mes "二人の王が居た。";
			mes "彼らが持つ20名の騎士たちは";
			mes "その命を尽くして戦った。";
			mes "生き返っては死に、また戦って";
			mes "死ぬという永遠を……";
			next;
			mes "[エンリコ・ケーリ]";
			mes "彼らがひとたび戦争を起こせば";
			mes "戦地で多くの戦士が死ぬ。";
			mes "ヴァルキリーは彼らを連れていき……";
			mes "そしてヴァルハラは戦士であふれた。";
			next;
			mes "[エンリコ・ケーリ]";
			mes "これはただの伝説で、誰でも";
			mes "知っていることだが……";
			mes "実際にあったことだというのだから";
			mes "面白い……";
			mes "ところで……";
			next;
			mes "[エンリコ・ケーリ]";
			mes "次はベーリングというドワーフか？";
			mes "プローンテラの西域に流れる";
			mes "川の支流がミョルニール廃鉱前";
			mes "に流れているらしい。";
			mes "ドヴァリンの言った場所というのは";
			mes "そこではないか？";
			next;
			mes "[エンリコ・ケーリ]";
			mes "本当に川なのか……？";
			mes "はっきりしないんだよな……";
			mes "その謎も調べてみないと。";
			mes "よし、行ってきてくれ！";
			close;
		}
		else if(GOD_3QUE == 42) {
			mes "[エンリコ・ケーリ]";
			mes "それは本当かね？";
			mes "私たちが研究していたものが本当に";
			mes "フレイヤの輝く首飾りだったとは……";
			mes "ブリーシンガメンとは存在する";
			mes "物だったんだな？";
			next;
			mes "[エンリコ・ケーリ]";
			mes "四人のドワーフが覚めれば……";
			mes "ブリーシンガメンも世に姿を現すと";
			mes "いうのか!!!!";
			mes "私は……君のような者に手伝って";
			mes "もらって本当に運がいい……";
			next;
			mes "[エンリコ・ケーリ]";
			mes "私の生が終わるまでに";
			mes "神の力を見られるとは……";
			mes "ああ……";
			mes "……とにかく、ドヴァリンが眠っている";
			mes "場所だから……";
			next;
			mes "[エンリコ・ケーリ]";
			mes "東の森の一本道と言ったか……";
			mes "モンクたちがいる修道院……";
			mes "……の近くではないか。";
			mes "ああ……私の推測にすぎないが……";
			mes "行ってみなければわかるまい。";
			next;
			mes "[エンリコ・ケーリ]";
			mes "君、ちょっと行ってきてくれないか。";
			mes "私はこのいくつもの兆候が何を";
			mes "意味しているのかを知りたい。";
			mes "何が起こるか知りたくないか？";
			mes "ふふふ……ははは！";
			next;
			mes "[エンリコ・ケーリ]";
			mes "それじゃぁ頼んだぞ。";
			mes "人間の手に入るのか……";
			mes "その強大な力が……";
			mes "はは……自らを破滅の道へ";
			mes "追い込まないだろうか？";
			mes "はははは……";
			close;
		}
		else if(GOD_3QUE == 41) {
			mes "[エンリコ・ケーリ]";
			mes "な、今、何て言ったんだ？";
			mes "アルフリッグに会ったのか！";
			mes "君は本当に選ばれた者なんだな！";
			mes "伝説のアルフリッグが実存したか……";
			next;
			mes "[エンリコ・ケーリ]";
			mes "アルフリッグは女神フレイヤに";
			mes "輝く首飾りを作って捧げた";
			mes "四人のドワーフの中の一人だ。";
			mes "もちろんドヴァリンもその中一人だ。";
			mes "これなら……";
			mes "ブリーシンガメンの再現も……";
			next;
			mes "[エンリコ・ケーリ]";
			mes "私と君は、どうやらすごい物を";
			mes "探していたようだね。";
			mes "ドヴァリン……";
			mes "どこに眠っているのか……";
			next;
			mes "[エンリコ・ケーリ]";
			mes "そういえば、君。";
			mes "そのアルフリッグに";
			mes "どうしてドヴァリンの居場所を";
			mes "聞いてこなかったんだ……";
			mes "くっ……";
			close;
		}
		else if(GOD_3QUE == 40) {
			mes "[エンリコ・ケーリ]";
			mes "ルティエへ行ってみるんだ。";
			mes "確かに女神の手がかりがあるはずだ。";
			mes "君はヴァルキリーには会っていないが";
			mes "探すことはできるだろう。";
			mes "そして……";
			next;
			mes "[エンリコ・ケーリ]";
			mes "^4d4dffすらりと伸びたその足に ";
			mes "麗しきその髪に";
			mes "輝くその瞳に";
			mes "我らは心、魂を捧げた^000000";
			mes "これが手がかりの歌だ。";
			next;
			mes "[エンリコ・ケーリ]";
			mes "意味はよく分からないが……";
			mes "私が知っているこの歌と";
			mes "実際のものが一致しているのかすら";
			mes "今となっては疑問だが……";
			mes "とにかく、私は他のことを調べてみる。";
			close;
		}
		else if(GOD_3QUE == 35) {
			mes "[エンリコ・ケーリ]";
			mes "苦労したようだね。";
			mes "こっちにきなさい。";
			mes "エールミットが何と？";
			next;
			mes "- あなたはエールミットの話を -";
			mes "- そのまま伝えた。 -";
			mes "- そしてヴァルキリーから -";
			mes "- 聞いた話も。 -";
			next;
			mes "[エンリコ・ケーリ]";
			mes "すごいな！";
			mes "そんなことがあったのか！";
			mes "やはり……これは私の推測通り";
			mes "神の力を持っていたのではないか。";
			next;
			mes "[エンリコ・ケーリ]";
			mes "王宮に調査願いを出して送って";
			mes "もらった物が役に立ったかもしれない。";
			mes "ちょっと近くに来てごらん。";
			next;
			mes "- エンリコは錠が下ろされた";
			mes "箱の中から";
			mes "世に本当にこのようなものが";
			mes "存在するのかと";
			mes "疑ってしまうほどに美しい";
			mes "宝石を出した。";
			next;
			mes "- まるで女神の涙のように";
			mes "輝いている。";
			mes "エンリコの言う通り近くに";
			mes "雪の結晶を置くと ";
			mes "互いに共鳴しだした。 -";
			next;
			mes "[エンリコ・ケーリ]";
			mes "どうだ？　驚いたろう？";
			mes "もしヴァルキリーの言ったとおりなら";
			mes "これは女神フレイヤの涙が";
			mes "固まってできた宝石だ。";
			mes "ふふ……";
			mes "神の力……か……";
			next;
			mes "[エンリコ・ケーリ]";
			mes "何故この時代にこんな";
			mes "現象が現れるのか……";
			mes "……とにかく、君の苦労には感謝する。";
			mes "私は君がヴァルキリーから聞いた";
			mes "短い詩について考えてみよう……";
			next;
			mes "[エンリコ・ケーリ]";
			mes "確かに、冷たい雪の道";
			mes "女神が渡った青い川";
			mes "一本道と四人のドワーフ……";
			next;
			mes "[エンリコ・ケーリ]";
			mes "ドワーフというのは、";
			mes "細工の技術がすぐれるという";
			mes "あのドワーフという種族のこと";
			mes "だろうし……";
			mes "川と……一本道は範囲が広すぎるな。";
			next;
			mes "[エンリコ・ケーリ]";
			mes "よし！　君がすべきことが";
			mes "決まったな！";
			next;
			switch(select("え!?　終わりじゃなかったのですか？","今度は何でしょう？")) {
			case 1:
				mes "[エンリコ・ケーリ]";
				mes "終わりなわけがあるか!!";
				mes "君がすべきなのは、私の研究を";
				mes "手伝うことだろう？";
				mes "一度始めたことなのだから";
				mes "最後まで手伝いなさい！";
				next;
				mes "[エンリコ・ケーリ]";
				mes "さぁ、君の行くところは決まった。";
				mes "ルティエだ。";
				mes "そこで何か手がかりを探してほしい。";
				mes "伝説によるとこうだ……";
				break;
			case 2:
				mes "[エンリコ・ケーリ]";
				mes "ほう～、物分りがよいのはいいことだ。";
				mes "さすがネリュオッドが紹介してくれた";
				mes "冒険家だ。";
				mes "とにかく、君がすべきことは";
				mes "私の研究を手伝うことだから";
				mes "最後まで頼んだぞ。";
				next;
				mes "[エンリコ・ケーリ]";
				mes "さぁ、君の行く場所は決まっているぞ。";
				mes "ルティエだ！";
				mes "そこで何らかの手がかりを捜してくれ。";
				mes "伝説によればこうだ……";
				break;
			}
			next;
			mes "[エンリコ・ケーリ]";
			mes "女神は僕の猫も退けて";
			mes "一人きりで冷たい雪の道を";
			mes "歩かなければならなかった。";
			mes "肉を刺す寒さに、女神の目から";
			mes "涙が落ちた。";
			next;
			mes "[エンリコ・ケーリ]";
			mes "実際、このフレイヤの宝石と";
			mes "呼ばれるこれが最初に発見";
			mes "されたのはルティエだからね。";
			mes "あの遠い昔の話はこんなにも";
			mes "我々の近くに残っていたんだな。";
			next;
			mes "[エンリコ・ケーリ]";
			mes "君はまずルティエに行って、";
			mes "ヴァルキリーの話通り";
			mes "女神の跡を探してくるように。";
			mes "女神が我々に残した遺物が";
			mes "何なのか。";
			mes "それを確認してきて欲しい。いいな？";
			set GOD_3QUE,40;
			close;
		}
		else if(GOD_3QUE > 9 && GOD_3QUE < 35) {
			mes "[エンリコ・ケーリ]";
			mes "そんなことがあったのか……";
			mes "ふむ……君には悪いが";
			mes "もう一度行ってきて欲しい。";
			mes "報酬ははずむ。";
			mes "そうだな……私のコレクションの";
			mes "中の一つを君にあげるよ。";
			next;
			mes "[エンリコ・ケーリ]";
			mes "うまく行くように祈っているぞ。";
			mes "君も気をつけてな。";
			close;
		}
		else if(GOD_3QUE > 3 && GOD_3QUE < 10) {
			mes "[エンリコ・ケーリ]";
			mes "エールミットに会ったのか？";
			mes "!?　彼がそんな条件を……";
			mes "君も大変だが、私からも頼む。";
			mes "彼の願いを聞いて、良い結果を";
			mes "出してくれることを祈る。";
			close;
		}
		else if(GOD_3QUE == 3) {
			mes "[エンリコ・ケーリ]";
			mes "うん？　エールミットかね？";
			mes "それに対する手がかり？";
			mes "う～ん……私の記憶では……";
			mes "何か影を持つ雰囲気の";
			mes "若い青年だったな……";
			next;
			mes "[エンリコ・ケーリ]";
			mes "そうだ、あの墓の前に居る";
			mes "お嬢さんに聞いて見なさい。";
			mes "刻まれたものから何か";
			mes "わかるかもしれないからね。";
			next;
			mes "[エンリコ・ケーリ]";
			mes "何？";
			mes "どうして直接探さなかったかって？";
			mes "そりゃ……私ももう老いたし……";
			mes "王室から依頼された研究もあって";
			mes "席を外すことができないからな。";
			next;
			mes "[エンリコ・ケーリ]";
			mes "だから君のような頼もしい助手を";
			mes "呼んだというわけさ。";
			next;
			mes "[エンリコ・ケーリ]";
			mes "あ、別に人を探すくらいで";
			mes "お金を使うのが嫌だったと";
			mes "いうわけじゃないぞ。";
			mes "とにかく、頼んだ。";
			close;
		}
		else if(GOD_3QUE == 2) {
			mes "[エンリコ・ケーリ]";
			mes "うん、考えてみたかい？";
			mes "まだ承諾してくれないのか……";
			mes "仕事をしてくれれば報酬は";
			mes "十分にあげるつもりだ。";
			mes "どうだ？";
			next;
			if(select("やはり嫌です","受けます") == 1) {
				mes "[エンリコ・ケーリ]";
				mes "う～む……。";
				mes "依頼すら聞いてくれんとは……";
				mes "しかたない、未練があるが";
				mes "また気が変わったら";
				mes "いつでも訪ねてきなさい。";
				close;
			}
			mes "[エンリコ・ケーリ]";
			mes "おお、それは本当かね！";
			mes "それでは早速だ。";
			mes "まずこれを見てくれ。";
			next;
			mes "- 年をとった学者は";
			mes "箱に入っている";
			mes "ある白くて小さな結晶を";
			mes "見せてくれた。";
			mes "それはまるで薄いレース編みの";
			mes "ようにも見え、とても冷たかった -";
			next;
			mes "[エンリコ・ケーリ]";
			mes "これは、雪の結晶だ。";
			mes "この模様はまさしくそれなのだ。";
			mes "この辺にしよう、解けるといけない。";
			next;
			mes "[エンリコ・ケーリ]";
			mes "何年か前に、ある冒険家の青年が";
			mes "不思議な物を拾ったと言って";
			mes "私にこれをくれたんだ。";
			mes "だが、これが何なのかが";
			mes "まったくわからなかった……";
			mes "私は知りたいんだ。これの正体を。";
			next;
			mes "[エンリコ・ケーリ]";
			mes "私が人を探していると言ったかな？";
			mes "そう、まさに私にこの結晶をくれた";
			mes "その青年のところに行って欲しい。";
			mes "名前は……そうだな……";
			mes "どこかに書かれていたはずだが……";
			mes "ここだ。エールミット・シャルルだ。";
			next;
			mes "[エンリコ・ケーリ]";
			mes "彼のところに着いたら、私からの";
			mes "書状を渡して欲しい。";
			mes "それを見て彼が私を訪ねてくれるか";
			mes "君を通してそれに対する答えを";
			mes "伝えてくれればいい。";
			mes "それでは、頼んだ。";
			next;
			mes "^4d4dff - エンリコ・ケーリは";
			mes "あなたに赤いろうそくで";
			mes "封をした書状を差し出した。";
			mes "書状には";
			mes "「エールミット・シャルルへ」と";
			mes "書かれている。 -^000000";
			set GOD_3QUE,3;
			close;
		}
		else if(GOD_3QUE == 1) {
			mes "[エンリコ・ケーリ]";
			mes "なんだ？　ああ！君か！";
			mes "名前は……";
			mes strcharinfo(0)+ "かね？";
			mes "ネリュオッドからは";
			mes "もう連絡をもらっているよ。";
			next;
			mes "[エンリコ・ケーリ]";
			mes "研究に役に立つ良い人物を";
			mes "紹介してくれるってね。";
			mes "ここまで来るのは大変だったろう……";
			next;
			mes "[エンリコ・ケーリ]";
			mes "ああ、君くらいの冒険家なら";
			mes "ジュノーに来るくらいたやすいか。";
			mes "そのカプラ……";
			mes "そう、カプラサービスでも";
			mes "あっという間に着くな！";
			mes "ハッハッハ！";
			next;
			mes "[エンリコ・ケーリ]";
			mes "私が君に頼みたいのは、";
			mes "私の研究を手伝うことだ。";
			mes "具体的に言うと、私の研究に";
			mes "必要なある人物を探してきて";
			mes "欲しいのだ。";
			next;
			mes "[エンリコ・ケーリ]";
			mes "君は冒険家の中でもかなり良い";
			mes "素質を持っているんじゃないか？";
			mes "ネリュオッドが君がかなり有能な";
			mes "冒険家だと言っていたんでね。";
			next;
			switch(select("人捜しはちょっと……","私が捜します!!")) {
			case 1:
				mes "[エンリコ・ケーリ]";
				mes "そうか……";
				mes "手伝ってくれると確信していたが";
				mes "嫌だったらしかたない……";
				mes "他の冒険家を探してみるか……";
				mes "私がもう少し若ければ自分で";
				mes "探すものを……";
				next;
				mes "[エンリコ・ケーリ]";
				mes "もしも気が変わったら";
				mes "いつでも訪ねてきなさい。";
				mes "遠くまで足を運ばせてすまなかった。";
				mes "それでは元気でな。";
				set GOD_3QUE,2;
				close;
			case 2:
				mes "[エンリコ・ケーリ]";
				mes "おお、それは本当かね！";
				mes "それでは早速だ。";
				mes "まずこれを見てくれ。";
				next;
				mes "- 年をとった学者は";
				mes "箱に入っている";
				mes "ある白くて小さな結晶を";
				mes "見せてくれた。";
				mes "それはまるで薄いレース編みの";
				mes "ようにも見え、とても冷たかった -";
				next;
				mes "[エンリコ・ケーリ]";
				mes "これは、雪の結晶だ。";
				mes "この模様はまさしくそれなのだ。";
				mes "この辺にしよう、解けるといけない。";
				next;
				mes "[エンリコ・ケーリ]";
				mes "何年か前に、ある冒険家の青年が";
				mes "不思議な物を拾ったと言って";
				mes "私にこれをくれたんだ。";
				mes "だが、これが何なのかが";
				mes "まったくわからなかった……";
				mes "私は知りたいんだ。これの正体を。";
				next;
				mes "[エンリコ・ケーリ]";
				mes "私が人を探していると言ったかな？";
				mes "そう、まさに私にこの結晶をくれた";
				mes "その青年のところに行って欲しい。";
				mes "名前は……そうだな……";
				mes "どこかに書かれていたはずだが……";
				mes "ここだ。エールミット・シャルルだ。";
				next;
				mes "[エンリコ・ケーリ]";
				mes "彼のところに着いたら、私からの";
				mes "書状を渡して欲しい。";
				mes "それを見て彼が私を訪ねてくれるか";
				mes "君を通してそれに対する答えを";
				mes "伝えてくれればいい。";
				mes "それでは、頼んだ。";
				next;
				mes "^4d4dff - エンリコ・ケーリは";
				mes "あなたに赤いろうそくで";
				mes "封をした書状を差し出した。";
				mes "書状には";
				mes "「エールミット・シャルルへ」と";
				mes "書かれている。 -^000000";
				set GOD_3QUE,3;
				close;
			}
		}
		mes "[エンリコ・ケーリ]";
		mes "何の用で来たのか知らんが";
		mes "今とても忙しいのだ。";
		mes "邪魔しないでくれたまえ。";
		close;
	}
	mes "[研究中の学者]";
	mes "赤ポーションはどうやって";
	mes "作られるか知っているかね？";
	mes "赤ハーブをすりおろし、";
	mes "適量を水の中でさっと振る。";
	next;
	mes "[研究中の学者]";
	mes "これも芸術の境地に至れば";
	mes "赤ポーションが新時代を";
	mes "築くはずなんだが……";
	close;
}

prt_church.gat,113,103,1	script	祈る青年	86,{
	if($GodMagingiorde < 50) {
		mes "[祈る青年]";
		mes "……ブツブツブツ……";
		mes "皆が幸せに暮らせますように……";
		mes "今月購入した古く青い箱が";
		mes "大当りしますように……";
		close;
	}
	if($GodBrysinggamen == 100) {
		mes "[祈る青年]";
		mes "日常を一度振り返り、自らの過去は";
		mes "どうだったのか、そして未来は";
		mes "どうなるのかを考える必要があります。";
		next;
		mes "[祈る青年]";
		mes "……今は立ち止まるべき時、";
		mes "一緒に祈りましょう。";
		close;
	}
	if(GOD_3QUE > 34) {
		mes "^4d4dff- 彼は目をつぶり胸に手をあて、";
		mes "祈りを捧げていた。何だか……";
		mes "悲しそうだ。 -^000000";
		close;
	}
	else if(GOD_3QUE == 34) {
		mes "[エールミット・シャルル]";
		mes "……は……ははは……";
		mes "何だ、ヴァルハラへ行ったのですか。";
		mes "それは祝わなくちゃいけないですね。";
		mes "ローウェン……ローウェン……";
		mes "……さすがにそれは";
		mes "考えもしなかったですね……";
		next;
		mes "[エールミット・シャルル]";
		mes "しかし一つ、判ったことがあります。";
		mes "彼女が2年間、彷徨ってしまったのは";
		mes "結局、僕が彼女を生かしたからですね。";
		mes "あそこから逃がしてしまったから……";
		mes "……あは、ははは……";
		next;
		mes "[エールミット・シャルル]";
		mes "なのにどうして、僕を恨むのではなく";
		mes "その全てをたった一人で背負うなんて。";
		mes "辛かっただろうに……";
		mes "なんで……僕のために……";
		next;
		mes "[エールミット・シャルル]";
		mes "……そして僕は、ただ彼女を";
		mes "慕う弟みたいなもの？";
		mes "最初からその程度にしか思って";
		mes "もらえなかったのですね……";
		next;
		mes "[エールミット・シャルル]";
		mes "はは……ははは……";
		mes "でも、すっきりしました。";
		mes "そうだあなた、何が必要と";
		mes "言っていましたか？";
		next;
		mes "[エールミット・シャルル]";
		mes "そうそう、エンリコに伝えてください。";
		mes "元々「それ」は国王陛下がギルド砦に";
		mes "与えるアイテムの一つだったと。";
		next;
		mes "[エールミット・シャルル]";
		mes "人間の能力では決して解析できない";
		mes "神秘のアイテム。それが何を意味するか";
		mes "知りませんが……学者が研究したり、";
		mes "その力を得られるごく一部の者が";
		mes "競って手に入れようとするなど……";
		mes "そんな風に扱われる物のようです。";
		next;
		mes "[エールミット・シャルル]";
		mes "……実は僕が盗んできたのですが";
		mes "見ていると恐ろしくなってきたので";
		mes "エンリコにあげました。";
		mes "……「それ」を持っていた1年間、";
		mes "胸がずっとドキドキしてたんですよ。";
		next;
		mes "[エールミット・シャルル]";
		mes "そしてそれに導かれ……";
		mes "辿り着いた先は、雪が降り続く";
		mes "雪の街ルティエでした。";
		mes "気がつくと頭の上にたくさんの";
		mes "雪が積もっていました。";
		next;
		mes "[エールミット・シャルル]";
		mes "西側の橋を渡り、雪で覆われた";
		mes "丘を登った時のことです。";
		next;
		mes "[エールミット・シャルル]";
		mes "僕は、急に訳が分からない恐怖に";
		mes "襲われ、体が震えだしたのです。";
		mes "それで僕は慌てて逃げました。";
		mes "話は以上です。";
		next;
		mes "[エールミット・シャルル]";
		mes "……解りましたよね？";
		mes "満足したら、もう行ってください。";
		mes "ふぅ～……";
		set GOD_3QUE,35;
		close;
	}
	else if(GOD_3QUE > 19 && GOD_3QUE < 34) {
		mes "[エールミット・シャルル]";
		mes "……待ちます。";
		mes "君を信じて待ちます。";
		mes "彼女の2年間の足跡を、失踪の原因を";
		mes "教えてくれると信じて待ちましょう。";
		close;
	}
	else if(GOD_3QUE == 12) {
		mes "[エールミット・シャルル]";
		mes "……ロエン・ペルシャ？";
		mes "誰でしょうか……その方は？";
		mes "僕の依頼した人はロエンではなく";
		mes "ローウェンです。";
		mes "ローウェン・エリナ！";
		next;
		mes "[エールミット・シャルル]";
		mes "大変かもしれませんがお願いします。";
		mes "……ではまた後ほど。";
		set GOD_3QUE,10;
		close;
	}
	else if(GOD_3QUE == 11) {
		mes "[エールミット・シャルル]";
		mes "嘘です……彼女が死んだなんて……";
		mes "そんな話があること位、僕も";
		mes "知っています。彼女の葬式を";
		mes "見ましたからね。しかし重要なのは";
		mes "それは必ずしも真実ではない";
		mes "ということです。";
		next;
		mes "[エールミット・シャルル]";
		mes "ゲフェンで消息を絶った後";
		mes "彼女がこの墓地に眠るまで";
		mes "2年の歳月がかかりました。";
		mes "僕の言いたいことが解りますか？";
		next;
		mes "[エールミット・シャルル]";
		mes "彼女の全てを知りたい……";
		mes "……特にその空白の2年間。";
		mes "彼女が死を急いだのはなぜか、";
		mes "それを知りたいんです。";
		next;
		mes "[エールミット・シャルル]";
		mes "どうして彼女がそうなって";
		mes "しまったのか……";
		mes "誰かが過ちを犯したのか……";
		mes "僕の気持ちが解りますか？";
		set GOD_3QUE,20;
		close;
	}
	else if(GOD_3QUE == 10) {
		mes "[エールミット・シャルル]";
		mes "……彼女に関する情報ですね。";
		mes "神に仕える騎士、聖戦に備えし者";
		mes "……そう、確か彼女は";
		mes "クルセイダーでした。";
		next;
		mes "[エールミット・シャルル]";
		mes "彼女はナイトを目指していたはず";
		mes "なのに、急にクルセイダーになって";
		mes "周囲を驚かせた事があります。";
		mes "……そして最後に見かけたのは";
		mes "ゲフェンタワーでした。";
		next;
		mes "[エールミット・シャルル]";
		mes "本当にお願いします!!";
		mes "彼女に関することなら何でもいいので";
		mes "手がかりを見つけてください!!";
		close;
	}
	else if(GOD_3QUE == 5) {
		if(rand(4)) {
			mes "[エールミット・シャルル]";
			mes "…………";
			mes "……うう……ごめんなさい";
			mes "ごめんなさい、ローウェン。";
			mes "僕が悪かった……";
			mes "……今日もあなたのために";
			mes "お祈りをするよ。";
			close;
		}
		mes "[エールミット・シャルル]";
		mes "まだ行かないんですか？";
		mes "それとも僕の話を真剣に";
		mes "聞く気にでもなったのですか？";
		next;
		switch(select("喜んで聞きます","遠慮します")) {
		case 1:
			mes "[エールミット・シャルル]";
			mes "ありがとうございます。";
			mes "たとえ通りすがりであっても";
			mes "話を聞いてくれる人は";
			mes "ありがたいです。";
			mes "……これは、古い話です。";
			next;
			mes "[エールミット・シャルル]";
			mes "昔、一人ぼっちの貧しい少年が";
			mes "いました。";
			next;
			mes "[エールミット・シャルル]";
			mes "その少年には両親がいない上、";
			mes "家もありませんでした。少年は";
			mes "シーフギルドやローグギルドで";
			mes "身につけたことを生かして";
			mes "生活しながらも、たった一人で";
			mes "いたずらに時を過ごしていました。";
			next;
			mes "[エールミット・シャルル]";
			mes "まだ幼かったので、少年はその日を";
			mes "生き抜くだけで精一杯だったのです。";
			mes "そんな少年にも、憧れの人はいました。";
			mes "……実際のところ、憧れなのか";
			mes "恋なのかは分かりませんでしたが。";
			next;
			mes "[エールミット・シャルル]";
			mes "少年が彼女を思っていたことを、";
			mes "その彼女は知りませんでした。";
			mes "神を信じ、清くまっすぐに歩んでいた";
			mes "自分とは違うきれいな彼女。";
			next;
			mes "[エールミット・シャルル]";
			mes "少年は遠くから彼女を見ているだけで";
			mes "とても幸せでした……";
			mes "そんなある日……過ちによって";
			mes "彼女は消えてしまったのです。";
			next;
			mes "[エールミット・シャルル]";
			mes "彼女は帰ってきませんでした。";
			mes "そして少年は、ずっとお祈りを";
			mes "しています。大人になった今も";
			mes "大聖堂の隅で彼女のために";
			mes "ずっと祈っています。";
			next;
			mes "[エールミット・シャルル]";
			mes "…………………………";
			mes "……………………";
			mes "…………";
			next;
			mes "[エールミット・シャルル]";
			mes "…………………………";
			mes "…………うう…………";
			mes "捜してください。";
			mes "……彼女を、ローウェンを……";
			mes "……シクシク……";
			next;
			mes "[エールミット・シャルル]";
			mes "君……";
			mes "エンリコに仕事を依頼されたのですか？";
			mes "なら、僕の情報が必要ですよね。";
			mes "………………";
			mes "違いますか？";
			next;
			mes "[エールミット・シャルル]";
			mes "……僕の頼みを聞いてくれれば、";
			mes "僕もそれ相応の情報を提供します。";
			mes "それであなたがどうするかは";
			mes "知りませんが……";
			next;
			mes "[エールミット・シャルル]";
			mes "僕の頼み事は簡単です。";
			mes "……彼女を、ローウェンを";
			mes "捜してください。彼女の品物、";
			mes "足跡、話……彼女に関することなら";
			mes "何でもいいです。";
			next;
			switch(select("う、うーん……","断ります","彼女を最後に見たのはどこです？")) {
			case 1:
				mes "[エールミット・シャルル]";
				mes "……君、話を聞いたついでに";
				mes "僕の頼みを聞いてくれませんか？";
				mes "もう一度考えてみて欲しい。";
				mes "君はローウェンを捜す、";
				mes "僕は君に情報を与える。";
				next;
				mes "[エールミット・シャルル]";
				mes "君がエンリコの仕事を終えたいのなら";
				mes "僕の情報が必要になるでしょう。";
				mes "ならば僕の頼みを聞くのが何よりも";
				mes "君自身のためになるでしょ？";
				next;
				mes "[エールミット・シャルル]";
				mes "……よく考えてください。";
				mes "君は強く熟練の冒険家みたいだから";
				mes "この程度のことは簡単でしょう？";
				mes "君に忘れることができない人がいれば";
				mes "僕の今の気持ちが分かりますね。";
				mes "彼女を、ローウェンを捜してください。";
				next;
				switch(select("……分かりました","やはり気が進みません")) {
				case 1:
					mes "["+strcharinfo(0)+"]";
					mes "いいでしょう。";
					mes "私のできる限りのことはしましょう。";
					mes "捜して欲しいと言うその、";
					mes "ローウェンという女性について";
					mes "もう少し詳しく教えてください。";
					next;
					mes "[エールミット・シャルル]";
					mes "彼女は神に仕える騎士……";
					mes "僕が彼女を最後に見たのは、";
					mes "奥深いあのゲフェンタワーです。";
					mes "ずいぶん前に聖騎士達は";
					mes "ゲフェンタワーのモンスターを";
					mes "討伐しに行きました。";
					next;
					mes "[エールミット・シャルル]";
					mes "それが……その時が、";
					mes "彼女の最後です。";
					mes "彼女の、彼女に関するあらゆるものを";
					mes "捜してください。お願いします!!";
					set GOD_3QUE,10;
					close;
				case 2:
					mes "[エールミット・シャルル]";
					mes "…………";
					mes "………………";
					mes "………………ふう～……";
					mes "それじゃ、仕方ありませんね。";
					mes "交渉は決裂です。";
					set GOD_3QUE,9;
					close;
				}
			case 2:
				mes "[エールミット・シャルル]";
				mes "やけにあっさりと断りますね。";
				mes "こっちはこんなに切実なのに……";
				mes "……自分で探さないのかって？";
				mes "…………それは……";
				mes "………………";
				mes "怖くてできません。";
				next;
				mes "[エールミット・シャルル]";
				mes "彼女は僕を覚えているのでしょうか？";
				mes "僕を憎むのではないでしょうか？";
				mes "恐ろしい、恐ろしいです。";
				mes "彼女が僕をどう思っているのか、";
				mes "何も分からない現実、";
				mes "未来は皆……恐ろしいです。";
				next;
				mes "[エールミット・シャルル]";
				mes "勇気がないと言うのですか。";
				mes "肝っ玉がないと言うのですか。";
				mes "そう、弱虫ですよ、僕は。";
				mes "……そんな僕に唯一できることは";
				mes "お祈り……ただ祈るだけです。";
				next;
				mes "[エールミット・シャルル]";
				mes "僕は弱くて弱くてすごく弱いです。";
				mes "…………";
				mes "彼女を見られないことがこんなに";
				mes "辛いとは思いませんでした。";
				mes "……祈りましょう。";
				mes "これが唯一、僕にできることですから。";
				set GOD_3QUE,9;
				close;
			case 3:
				mes "[エールミット・シャルル]";
				mes "彼女は神に仕える騎士……";
				mes "僕が彼女を最後に見たのは、";
				mes "奥深いあのゲフェンタワーです。";
				mes "ずいぶん前に、聖騎士達は";
				mes "ゲフェンタワーのモンスターを";
				mes "討伐しに行ったことがあります。";
				next;
				mes "[エールミット・シャルル]";
				mes "ゲフェンタワーの地下に隠されている";
				mes "迷宮、それはとても恐ろしかったです。";
				mes "それらも全て、元々は人間が作った";
				mes "ものでしょうが……見るも無惨でした。";
				next;
				mes "[エールミット・シャルル]";
				mes "だからこそ、それを人間の手で";
				mes "始末しなければならないと";
				mes "思ったのかもしれませんね。";
				mes "神の騎士達はそこへ進んでいきました。";
				next;
				mes "[エールミット・シャルル]";
				mes "それが……その時が、";
				mes "彼女の最後です。";
				mes "彼女の、彼女に関するあらゆるものを";
				mes "捜してください。お願いします!!";
				set GOD_3QUE,10;
				close;
			}
		case 2:
			mes "[エールミット・シャルル]";
			mes "……大抵の人はそうですよね。";
			mes "自分とは関係ない人の……";
			mes "しかも面白くない話なんて。";
			mes "……むしろそんな話を進んで";
			mes "聞く人の方が変に思われる、";
			mes "それが世間というものですよね。";
			next;
			mes "[エールミット・シャルル]";
			mes "もう無駄な話に時間を使うのは";
			mes "やめましょう。…………彼の";
			mes "そう、エンリコの封書は、私の";
			mes "話を真剣に聞く気がある方にでも";
			mes "渡してください。";
			set GOD_3QUE,5;
			close;
		}
	}
	else if(GOD_3QUE == 4) {
		mes "[エールミット・シャルル]";
		mes "僕に何か用でもあるんですか？";
		mes "ローグギルドから来たのですか？";
		mes "もうやめて欲しいと伝えてください。";
		mes "僕に構わないでください。";
		next;
		switch(select("しばらく放っておく","エンリコの封書を渡す")) {
		case 1:
			mes "- なぜかは判らないが、今は";
			mes "声をかけない方がよさそうだ。";
			mes "後でまた訪ねることにしよう。 -";
			set GOD_3QUE,4;
			close;
		case 2:
			mes "[エールミット・シャルル]";
			mes "……これ……この手紙は……";
			mes "ああ、分かりました。";
			mes "でも、それでどうしろと？";
			next;
			mes "- エールミットは一読した後";
			mes "封書を折って返してきた。 -";
			next;
			mes "[エールミット・シャルル]";
			mes "……………………";
			mes "……………………";
			mes "…………ふう～……";
			next;
			mes "[エールミット・シャルル]";
			mes "……………………";
			mes "……………………";
			mes "……君、よければ僕の話を";
			mes "ちょっと聞いてくれますか？";
			next;
			switch(select("喜んで聞きます","遠慮します")) {
			case 1:
				mes "[エールミット・シャルル]";
				mes "ありがとうございます。";
				mes "たとえ通りすがりであっても";
				mes "話を聞いてくれる人は";
				mes "ありがたいです。";
				mes "……これは、古い話です。";
				next;
				mes "[エールミット・シャルル]";
				mes "昔、一人ぼっちの貧しい少年が";
				mes "いました。";
				next;
				mes "[エールミット・シャルル]";
				mes "その少年には両親がいない上、";
				mes "家もありませんでした。少年は";
				mes "シーフギルドやローグギルドで";
				mes "身につけたことを生かして";
				mes "生活しながらも、たった一人で";
				mes "いたずらに時を過ごしていました。";
				next;
				mes "[エールミット・シャルル]";
				mes "まだ幼かったので、少年はその日を";
				mes "生き抜くだけで精一杯だったのです。";
				mes "そんな少年にも、憧れの人はいました。";
				mes "……実際のところ、憧れなのか";
				mes "恋なのかは分かりませんでしたが。";
				next;
				mes "[エールミット・シャルル]";
				mes "少年が彼女を思っていたことを、";
				mes "その彼女は知りませんでした。";
				mes "神を信じ、清くまっすぐに歩んでいた";
				mes "自分とは違うきれいな彼女。";
				next;
				mes "[エールミット・シャルル]";
				mes "少年は遠くから彼女を見ているだけで";
				mes "とても幸せでした……";
				mes "そんなある日……過ちによって";
				mes "彼女は消えてしまったのです。";
				next;
				mes "[エールミット・シャルル]";
				mes "彼女は帰ってきませんでした。";
				mes "そして少年は、ずっとお祈りを";
				mes "しています。大人になった今も";
				mes "大聖堂の隅で彼女のために";
				mes "ずっと祈っています。";
				next;
				mes "[エールミット・シャルル]";
				mes "…………………………";
				mes "……………………";
				mes "…………";
				next;
				mes "[エールミット・シャルル]";
				mes "…………………………";
				mes "…………うう…………";
				mes "捜してください。";
				mes "……彼女を、ローウェンを……";
				mes "……シクシク……";
				next;
				mes "[エールミット・シャルル]";
				mes "君……";
				mes "エンリコに仕事を依頼されたのですか？";
				mes "なら、僕の情報が必要ですよね。";
				mes "………………";
				mes "違いますか？";
				next;
				mes "[エールミット・シャルル]";
				mes "……僕の頼みを聞いてくれれば、";
				mes "僕もそれ相応の情報を提供します。";
				mes "それであなたがどうするかは";
				mes "知りませんが……";
				next;
				mes "[エールミット・シャルル]";
				mes "僕の頼み事は簡単です。";
				mes "……彼女を、ローウェンを";
				mes "捜してください。彼女の品物、";
				mes "足跡、話……彼女に関することなら";
				mes "何でもいいです。";
				next;
				switch(select("う、うーん……","断ります","彼女を最後に見たのはどこです？")) {
				case 1:
					mes "[エールミット・シャルル]";
					mes "……君、話を聞いたついでに";
					mes "僕の頼みを聞いてくれませんか？";
					mes "もう一度考えてみて欲しい。";
					mes "君はローウェンを捜す、";
					mes "僕は君に情報を与える。";
					next;
					mes "[エールミット・シャルル]";
					mes "君がエンリコの仕事を終えたいのなら";
					mes "僕の情報が必要になるでしょう。";
					mes "ならば僕の頼みを聞くのが何よりも";
					mes "君自身のためになるでしょ？";
					next;
					mes "[エールミット・シャルル]";
					mes "……よく考えてください。";
					mes "君は強く熟練の冒険家みたいだから";
					mes "この程度のことは簡単でしょう？";
					mes "君に忘れることができない人がいれば";
					mes "僕の今の気持ちが分かりますね。";
					mes "彼女を、ローウェンを捜してください。";
					next;
					switch(select("……分かりました","やはり気が進みません")) {
					case 1:
						mes "["+strcharinfo(0)+"]";
						mes "いいでしょう。";
						mes "私のできる限りのことはしましょう。";
						mes "捜して欲しいと言うその、";
						mes "ローウェンという女性について";
						mes "もう少し詳しく教えてください。";
						next;
						mes "[エールミット・シャルル]";
						mes "彼女は神に仕える騎士……";
						mes "僕が彼女を最後に見たのは、";
						mes "奥深いあのゲフェンタワーです。";
						mes "ずいぶん前に聖騎士達は";
						mes "ゲフェンタワーのモンスターを";
						mes "討伐しに行きました。";
						next;
						mes "[エールミット・シャルル]";
						mes "それが……その時が、";
						mes "彼女の最後です。";
						mes "彼女の、彼女に関するあらゆるものを";
						mes "捜してください。お願いします!!";
						set GOD_3QUE,10;
						close;
					case 2:
						mes "[エールミット・シャルル]";
						mes "…………";
						mes "………………";
						mes "………………ふう～……";
						mes "それじゃ、仕方ありませんね。";
						mes "交渉は決裂です。";
						set GOD_3QUE,9;
						close;
					}
				case 2:
					mes "[エールミット・シャルル]";
					mes "やけにあっさりと断りますね。";
					mes "こっちはこんなに切実なのに……";
					mes "……自分で探さないのかって？";
					mes "…………それは……";
					mes "………………";
					mes "怖くてできません。";
					next;
					mes "[エールミット・シャルル]";
					mes "彼女は僕を覚えているのでしょうか？";
					mes "僕を憎むのではないでしょうか？";
					mes "恐ろしい、恐ろしいです。";
					mes "彼女が僕をどう思っているのか、";
					mes "何も分からない現実、";
					mes "未来は皆……恐ろしいです。";
					next;
					mes "[エールミット・シャルル]";
					mes "勇気がないと言うのですか。";
					mes "肝っ玉がないと言うのですか。";
					mes "そう、弱虫ですよ、僕は。";
					mes "……そんな僕に唯一できることは";
					mes "お祈り……ただ祈るだけです。";
					next;
					mes "[エールミット・シャルル]";
					mes "僕は弱くて弱くてすごく弱いです。";
					mes "…………";
					mes "彼女を見られないことがこんなに";
					mes "辛いとは思いませんでした。";
					mes "……祈りましょう。";
					mes "これが唯一、僕にできることですから。";
					set GOD_3QUE,9;
					close;
				case 3:
					mes "[エールミット・シャルル]";
					mes "彼女は神に仕える騎士……";
					mes "僕が彼女を最後に見たのは、";
					mes "奥深いあのゲフェンタワーです。";
					mes "ずいぶん前に、聖騎士達は";
					mes "ゲフェンタワーのモンスターを";
					mes "討伐しに行ったことがあります。";
					next;
					mes "[エールミット・シャルル]";
					mes "ゲフェンタワーの地下に隠されている";
					mes "迷宮、それはとても恐ろしかったです。";
					mes "それらも全て、元々は人間が作った";
					mes "ものでしょうが……見るも無惨でした。";
					next;
					mes "[エールミット・シャルル]";
					mes "だからこそ、それを人間の手で";
					mes "始末しなければならないと";
					mes "思ったのかもしれませんね。";
					mes "神の騎士達はそこへ進んでいきました。";
					next;
					mes "[エールミット・シャルル]";
					mes "それが……その時が、";
					mes "彼女の最後です。";
					mes "彼女の、彼女に関するあらゆるものを";
					mes "捜してください。お願いします!!";
					set GOD_3QUE,10;
					close;
				}
			case 2:
				mes "[エールミット・シャルル]";
				mes "……大抵の人はそうですよね。";
				mes "自分とは関係ない人の……";
				mes "しかも面白くない話なんて。";
				mes "……むしろそんな話を進んで";
				mes "聞く人の方が変に思われる、";
				mes "それが世間というものですよね。";
				next;
				mes "[エールミット・シャルル]";
				mes "もう無駄な話に時間を使うのは";
				mes "やめましょう。…………彼の";
				mes "そう、エンリコの封書は、私の";
				mes "話を真剣に聞く気がある方にでも";
				mes "渡してください。";
				set GOD_3QUE,5;
				close;
			}
		}
	}
	else if(GOD_3QUE == 3) {
		mes "[悲しみの青年]";
		mes "…………";
		mes "うう……ごめんなさい、";
		mes "ごめんなさい、ローウェン。";
		mes "僕が悪かった……";
		next;
		mes "["+strcharinfo(0)+"]";
		mes "あの、すみません、";
		mes "人を捜しているのですが……";
		mes "エールミットという方を";
		mes "ご存じでしょうか？";
		next;
		mes "[エールミット・シャルル]";
		mes "…………";
		mes "……どなたです？";
		mes "僕がエールミットです。";
		mes "特に大事な用件でないのなら";
		mes "そっとしておいてくれます？";
		next;
		switch(select("しばらく放っておく","エンリコの封書を渡す")) {
		case 1:
			mes "- なぜかは判らないが、今は";
			mes "声をかけない方がよさそうだ。";
			mes "後でまた訪ねることにしよう。 -";
			set GOD_3QUE,4;
			close;
		case 2:
			mes "[エールミット・シャルル]";
			mes "……これ……この手紙は……";
			mes "ああ、分かりました。";
			mes "でも、それでどうしろと？";
			next;
			mes "- エールミットは一読した後";
			mes "封書を折って返してきた。 -";
			next;
			mes "[エールミット・シャルル]";
			mes "……………………";
			mes "……………………";
			mes "…………ふう～……";
			next;
			mes "[エールミット・シャルル]";
			mes "……………………";
			mes "……………………";
			mes "……君、よければ僕の話を";
			mes "ちょっと聞いてくれますか？";
			next;
			switch(select("喜んで聞きます","遠慮します")) {
			case 1:
				mes "[エールミット・シャルル]";
				mes "ありがとうございます。";
				mes "たとえ通りすがりであっても";
				mes "話を聞いてくれる人は";
				mes "ありがたいです。";
				mes "……これは、古い話です。";
				next;
				mes "[エールミット・シャルル]";
				mes "昔、一人ぼっちの貧しい少年が";
				mes "いました。";
				next;
				mes "[エールミット・シャルル]";
				mes "その少年には両親がいない上、";
				mes "家もありませんでした。少年は";
				mes "シーフギルドやローグギルドで";
				mes "身につけたことを生かして";
				mes "生活しながらも、たった一人で";
				mes "いたずらに時を過ごしていました。";
				next;
				mes "[エールミット・シャルル]";
				mes "まだ幼かったので、少年はその日を";
				mes "生き抜くだけで精一杯だったのです。";
				mes "そんな少年にも、憧れの人はいました。";
				mes "……実際のところ、憧れなのか";
				mes "恋なのかは分かりませんでしたが。";
				next;
				mes "[エールミット・シャルル]";
				mes "少年が彼女を思っていたことを、";
				mes "その彼女は知りませんでした。";
				mes "神を信じ、清くまっすぐに歩んでいた";
				mes "自分とは違うきれいな彼女。";
				next;
				mes "[エールミット・シャルル]";
				mes "少年は遠くから彼女を見ているだけで";
				mes "とても幸せでした……";
				mes "そんなある日……過ちによって";
				mes "彼女は消えてしまったのです。";
				next;
				mes "[エールミット・シャルル]";
				mes "彼女は帰ってきませんでした。";
				mes "そして少年は、ずっとお祈りを";
				mes "しています。大人になった今も";
				mes "大聖堂の隅で彼女のために";
				mes "ずっと祈っています。";
				next;
				mes "[エールミット・シャルル]";
				mes "…………………………";
				mes "……………………";
				mes "…………";
				next;
				mes "[エールミット・シャルル]";
				mes "…………………………";
				mes "…………うう…………";
				mes "捜してください。";
				mes "……彼女を、ローウェンを……";
				mes "……シクシク……";
				next;
				mes "[エールミット・シャルル]";
				mes "君……";
				mes "エンリコに仕事を依頼されたのですか？";
				mes "なら、僕の情報が必要ですよね。";
				mes "………………";
				mes "違いますか？";
				next;
				mes "[エールミット・シャルル]";
				mes "……僕の頼みを聞いてくれれば、";
				mes "僕もそれ相応の情報を提供します。";
				mes "それであなたがどうするかは";
				mes "知りませんが……";
				next;
				mes "[エールミット・シャルル]";
				mes "僕の頼み事は簡単です。";
				mes "……彼女を、ローウェンを";
				mes "捜してください。彼女の品物、";
				mes "足跡、話……彼女に関することなら";
				mes "何でもいいです。";
				next;
				switch(select("う、うーん……","断ります","彼女を最後に見たのはどこです？")) {
				case 1:
					mes "[エールミット・シャルル]";
					mes "……君、話を聞いたついでに";
					mes "僕の頼みを聞いてくれませんか？";
					mes "もう一度考えてみて欲しい。";
					mes "君はローウェンを捜す、";
					mes "僕は君に情報を与える。";
					next;
					mes "[エールミット・シャルル]";
					mes "君がエンリコの仕事を終えたいのなら";
					mes "僕の情報が必要になるでしょう。";
					mes "ならば僕の頼みを聞くのが何よりも";
					mes "君自身のためになるでしょ？";
					next;
					mes "[エールミット・シャルル]";
					mes "……よく考えてください。";
					mes "君は強く熟練の冒険家みたいだから";
					mes "この程度のことは簡単でしょう？";
					mes "君に忘れることができない人がいれば";
					mes "僕の今の気持ちが分かりますね。";
					mes "彼女を、ローウェンを捜してください。";
					next;
					switch(select("……分かりました","やはり気が進みません")) {
					case 1:
						mes "["+strcharinfo(0)+"]";
						mes "いいでしょう。";
						mes "私のできる限りのことはしましょう。";
						mes "捜して欲しいと言うその、";
						mes "ローウェンという女性について";
						mes "もう少し詳しく教えてください。";
						next;
						mes "[エールミット・シャルル]";
						mes "彼女は神に仕える騎士……";
						mes "僕が彼女を最後に見たのは、";
						mes "奥深いあのゲフェンタワーです。";
						mes "ずいぶん前に聖騎士達は";
						mes "ゲフェンタワーのモンスターを";
						mes "討伐しに行きました。";
						next;
						mes "[エールミット・シャルル]";
						mes "それが……その時が、";
						mes "彼女の最後です。";
						mes "彼女の、彼女に関するあらゆるものを";
						mes "捜してください。お願いします!!";
						set GOD_3QUE,10;
						close;
					case 2:
						mes "[エールミット・シャルル]";
						mes "…………";
						mes "………………";
						mes "………………ふう～……";
						mes "それじゃ、仕方ありませんね。";
						mes "交渉は決裂です。";
						set GOD_3QUE,9;
						close;
					}
				case 2:
					mes "[エールミット・シャルル]";
					mes "やけにあっさりと断りますね。";
					mes "こっちはこんなに切実なのに……";
					mes "……自分で探さないのかって？";
					mes "…………それは……";
					mes "………………";
					mes "怖くてできません。";
					next;
					mes "[エールミット・シャルル]";
					mes "彼女は僕を覚えているのでしょうか？";
					mes "僕を憎むのではないでしょうか？";
					mes "恐ろしい、恐ろしいです。";
					mes "彼女が僕をどう思っているのか、";
					mes "何も分からない現実、";
					mes "未来は皆……恐ろしいです。";
					next;
					mes "[エールミット・シャルル]";
					mes "勇気がないと言うのですか。";
					mes "肝っ玉がないと言うのですか。";
					mes "そう、弱虫ですよ、僕は。";
					mes "……そんな僕に唯一できることは";
					mes "お祈り……ただ祈るだけです。";
					next;
					mes "[エールミット・シャルル]";
					mes "僕は弱くて弱くてすごく弱いです。";
					mes "…………";
					mes "彼女を見られないことがこんなに";
					mes "辛いとは思いませんでした。";
					mes "……祈りましょう。";
					mes "これが唯一、僕にできることですから。";
					set GOD_3QUE,9;
					close;
				case 3:
					mes "[エールミット・シャルル]";
					mes "彼女は神に仕える騎士……";
					mes "僕が彼女を最後に見たのは、";
					mes "奥深いあのゲフェンタワーです。";
					mes "ずいぶん前に、聖騎士達は";
					mes "ゲフェンタワーのモンスターを";
					mes "討伐しに行ったことがあります。";
					next;
					mes "[エールミット・シャルル]";
					mes "ゲフェンタワーの地下に隠されている";
					mes "迷宮、それはとても恐ろしかったです。";
					mes "それらも全て、元々は人間が作った";
					mes "ものでしょうが……見るも無惨でした。";
					next;
					mes "[エールミット・シャルル]";
					mes "だからこそ、それを人間の手で";
					mes "始末しなければならないと";
					mes "思ったのかもしれませんね。";
					mes "神の騎士達はそこへ進んでいきました。";
					next;
					mes "[エールミット・シャルル]";
					mes "それが……その時が、";
					mes "彼女の最後です。";
					mes "彼女の、彼女に関するあらゆるものを";
					mes "捜してください。お願いします!!";
					set GOD_3QUE,10;
					close;
				}
			case 2:
				mes "[エールミット・シャルル]";
				mes "……大抵の人はそうですよね。";
				mes "自分とは関係ない人の……";
				mes "しかも面白くない話なんて。";
				mes "……むしろそんな話を進んで";
				mes "聞く人の方が変に思われる、";
				mes "それが世間というものですよね。";
				next;
				mes "[エールミット・シャルル]";
				mes "もう無駄な話に時間を使うのは";
				mes "やめましょう。…………彼の";
				mes "そう、エンリコの封書は、私の";
				mes "話を真剣に聞く気がある方にでも";
				mes "渡してください。";
				set GOD_3QUE,5;
				close;
			}
		}
	}
	mes "[悲しみの青年]";
	mes "…………";
	mes "……うう……ごめんなさい";
	mes "ごめんなさい、ローウェン。";
	mes "僕が悪かった……";
	mes "……今日もあなたのために";
	mes "お祈りをするよ。";
	close;
}

prt_castle.gat,80,52,0	script	人事部	111,{
	if($GodMagingiorde < 50 || $GodBrysinggamen >= 100) {
		mes "[司書]";
		mes "そこで何をしているんですか？";
		mes "むやみに手を触れないでください！";
		close;
	}
	if(GOD_3QUE == 26) {
		mes "["+strcharinfo(0)+"]";
		mes "よし、今のうちに……";
		mes "おや？　この注意表示は何だろう……";
		mes "極秘？　ふむ……何かありそうだな。";
		mes "ちょっと見てみよう。";
		next;
		if(rand(3)) {
			mes "[司書]";
			mes "フニャフニャ……はっ!!";
			mes "そこで何をしているんですか?!";
			mes "すぐに出て行きなさい!!";
			close2;
			warp "prt_castle.gat",94,37;
			end;
		}
		mes "- ……第2部隊所属の";
		mes "ローウェン・エリナは";
		mes "事件発生から3日後に復帰した。";
		mes "作戦中、彼女の不在によって";
		mes "発生した件については";
		mes "別途、責任追求の裁判を設けた。 -";
		next;
		mes "- そこで厳重な処罰を下す事が";
		mes "決定されたが、隊長権限で";
		mes "退役措置に確定。それにより";
		mes "彼女の神聖な力を封印した。 -";
		next;
		mes "["+strcharinfo(0)+"]";
		mes "……力を封印して退役？";
		mes "これじゃあ、事実上の追放と";
		mes "何ら差がないよ。そこまで";
		mes "重い処罰は彼女にとって";
		mes "ある意味、死刑より辛いだろう……";
		mes "この上ない恥辱だったかもしれない。";
		next;
		mes "- ……事件発生から約2年後、";
		mes "ローウェン・エリナの遺品と思われる";
		mes "甲冑と割れた剣、身のまわりの品等が";
		mes "冒険家集団によって発見された。";
		mes "これをもって、ローウェン・エリナは";
		mes "死亡処理とする。 -";
		next;
		mes "- なお、本件は関係者のみ";
		mes "把握している事項である。";
		mes "公式記録上は、作戦中の死亡";
		mes "とされている。 -";
		next;
		mes "["+strcharinfo(0)+"]";
		mes "……クルセイダーの名誉を";
		mes "失墜させたと考えられたのか。";
		mes "何となく歯がゆいな……";
		mes "にしても、これをどう伝えれば……";
		mes "そうだ！　彼女にもう一度";
		mes "会ってみよう。";
		next;
		mes "[司書]";
		mes "フニャフニャ……はっ!!";
		mes "そこで何をしているんですか?!";
		mes "すぐに出て行きなさい!!";
		set GOD_3QUE,30;
		close2;
		warp "prt_castle.gat",94,37;
		end;
	}
	else if(GOD_3QUE == 25) {
		mes "- 司書が居眠りをしている。";
		mes "その隙に記録を探すことにした。";
		mes "……すると、クルセイダー達の";
		mes "身元が記載された名簿を見つけた。";
		mes "その中に「ローウェン・エリナ」";
		mes "という名は、一人だけだった。 -";
		next;
		mes "["+strcharinfo(0)+"]";
		mes "- ローウェン・エリナ。";
		mes "XX期生、第2部隊、22歳女性。 -";
		mes "……知りたいのはそんなこと";
		mes "じゃないのに……うん？";
		mes "- XX年失踪 -> 死亡処理。 -";
		mes "何だ、司書に聞いた内容と同じか。";
		next;
		mes "[司書]";
		mes "フニャフニャ……はっ!!";
		mes "そこで何をしているんですか?!";
		mes "すぐに出て行きなさい!!";
		set GOD_3QUE,26;
		close2;
		warp "prt_castle.gat",94,37;
		end;
	}
	mes "[司書]";
	mes "そこで何をしているんですか？";
	mes "むやみに手を触れないでください！";
	close;
}

prt_castle.gat,84,51,5	script	司書	105,{
	if($GodMagingiorde < 50 || $GodBrysinggamen >= 100) {
		mes "[司書]";
		mes "そこで何をしているんですか？";
		mes "むやみに手を触れないでください！";
		close;
	}
	if(GOD_3QUE > 24 && GOD_3QUE < 27) {
		mes "[司書]";
		mes "…………";
		mes "…………フム……";
		mes "フニャフニャ……";
		mes "スースー……";
		next;
		mes "- 居眠りしているようだ。";
		mes "登録されたクルセイダー達の";
		mes "記録を見る、絶好のチャンス!!";
		mes "起こさないように気をつけよう。 -";
		close;
	}
	else if(GOD_3QUE == 10) {
		mes "[司書]";
		mes "こちらは王室の人事に関する";
		mes "記録書類を保管している所です。";
		mes "申し訳ありませんが、あなたには";
		mes "閲覧権限がございません。";
		next;
		mes "[司書]";
		mes "……はい？";
		mes "人物確認のみをご希望ですか？";
		mes "でしたら、お捜しの方のお名前と";
		mes "ご関係をおっしゃってください。";
		next;
		switch(select("ローウェン：家族","ローウェン：恋人","ロエン：仇","ロエン：友達")) {
		case 1:
			if(Sex) {
				mes "[司書]";
				mes "嘘をつかないでください!!";
				mes "ローウェンという方には";
				mes "男性の家族はおりません。";
				mes "……はっ!!　あ、えっと……";
				mes "…………";
				next;
				mes "[司書]";
				mes "……何を見ているのです？";
				mes "お引き取りください!!";
				close;
			}
			else {
				mes "[司書]";
				mes "本当にローウェンさんのご家族ですか？";
				mes "ご家族の方ならどうして、こちらへ";
				mes "捜しにいらっしゃるのですか？";
				mes "……はい？　別々に暮してて、";
				mes "連絡がしばらくなかったと……";
				mes "ええ、確かに彼女はクルセイダーです。";
				next;
				mes "[司書]";
				mes "なるほど、解りました。";
				mes "……あの、どう申し上げればよいか";
				mes "判りませんが、もしあなたが";
				mes "お捜しの方がローウェン・エリナ";
				mes "でしたら……諦めてください。";
				next;
				mes "[司書]";
				mes "数年前のゲフェン地下討伐作戦で";
				mes "失踪、その後復……いえ";
				mes "死亡処理となっております。";
				mes "お気の毒ですが……";
				mes "故人の冥福をお祈りします。";
				mes "……以上となります。";
				set GOD_3QUE,11;
				close;
			}
		case 2:
			if(Sex) {
				mes "[司書]";
				mes "そうなのですか?!";
				mes "私も故郷に恋人がいますよ。";
				mes "ふふふっ……";
				mes "あ、えっと……ローウェンですね？";
				mes "少々、お待ちください。";
				mes "これ位ならすぐに……あら？";
				next;
				mes "[司書]";
				mes "……クルセイダーでしたよね？";
				mes "お問い合わせの方のフルネームが";
				mes "ローウェン・エリナでしたら";
				mes "捜すことを諦めてください。";
				mes "どう申し上げればよいか……";
				next;
				mes "[司書]";
				mes "落ち着いて聞いてください。";
				mes "ローウェン・エリナ";
				mes "ゲフェン地下討伐作戦中失踪";
				mes "その後復……はっ!!";
				mes "この部分は極秘だった……";
				mes "その方は死亡処理となっています。";
				next;
				mes "[司書]";
				mes "こんな結果になってしまって";
				mes "とても残念です。";
				mes "元気を出してください！";
				set GOD_3QUE,11;
				close;
			}
			else {
				mes "[司書]";
				mes "ひぃぃぃ～っ!!";
				mes "申し訳ありません！";
				mes "申し訳ありません!!";
				mes "私の常識では理解できません!!";
				mes "世の中には様々な方がいますが";
				mes "私まで一緒にしないでください!!";
				next;
				mes "[司書]";
				mes "ひぃぃぃ～っ!!";
				mes "わ、私はまだ純粋なので、";
				mes "冷やかさないでください～!!";
				close;
			}
		case 3:
			mes "[司書]";
			mes "……仇、ですか？";
			mes "ロエンという方は確かにいますが……";
			mes "本当に怨恨のご関係ですか？";
			mes "……申し訳ありませんが";
			mes "何もお教えすることはできません。";
			close;
		case 4:
			mes "[司書]";
			mes "うーむ……ご友人ですか……？";
			mes "ロエン……";
			mes "ロエン・ペルシャがいますね。";
			mes "数年前、ご本人の希望により";
			mes "退役された方です。お住まいは";
			mes "残念ながら不明です。";
			set GOD_3QUE,12;
			close;
		}
	}
	else if(GOD_3QUE > 10 && GOD_3QUE < 13) {
		mes "[司書]";
		mes "私がお教えできることは";
		mes "もうございません。";
		mes "お引き取りください!!";
		close;
	}
	mes "[司書]";
	mes "こちらは王室の人事に関する";
	mes "記録書類を保管している所です。";
	mes "申し訳ありませんが、あなたには";
	mes "閲覧権限がございません。";
	close;
}

prontera.gat,260,354,4	script	女性	101,{
	if($GodMagingiorde < 50 || $GodBrysinggamen >= 100) {
		mes "[女性]";
		mes "あら……あなたもお散歩？";
		mes "でも散歩にしては、ちょっと";
		mes "コースを外れてますよ……";
		close;
	}
	if(GOD_3QUE > 33) {
		mes "[ローサ・エリナ]";
		mes "……あら、以前お会いしましたよね？";
		mes "その、何と言えばいいのか……";
		mes "とりあえず、こちらを見てください。";
		mes "そう、ローウェンの墓碑です。";
		mes "……あなたのおかげのようですね。";
		mes "本当にありがとうございます。";
		close;
	}
	else if(GOD_3QUE == 21) {
		mes "[ローサ・エリナ]";
		mes "何でしょう？";
		mes "……ローウェンからの伝言？";
		mes "え？";
		mes "あの子まだそんなことしてるの……";
		mes "何で、何で……どうして";
		mes "死んでまであんな所にいるのよ!!";
		next;
		mes "[ローサ・エリナ]";
		mes "妹に伝えてください!!";
		mes "もうあなたのために泣き続けるような";
		mes "ことはしないから、安心して";
		mes "安らかに眠りなさいって！";
		mes "全く、あの子はどうしてこの世に";
		mes "未練を残しているんだか……";
		next;
		mes "[ローサ・エリナ]";
		mes "それから大聖堂にいるあの馬鹿にも";
		mes "伝えてください!!　いつまで自分を";
		mes "責め続けるつもりなのかって！";
		mes "私はあなたがどんな人か知りません……";
		mes "でも、ローウェンを知る人だからこそ";
		mes "お話しましょう。";
		next;
		mes "[ローサ・エリナ]";
		mes "ローウェンは……";
		mes "鎧の重さで倒れそうになるほど";
		mes "体の弱い子でした。";
		next;
		mes "[ローサ・エリナ]";
		mes "だからその分、他人より何倍もの";
		mes "努力をして、やっと訓練について";
		mes "いくことができていたのです……";
		mes "いつ倒れてもおかしくないその体で";
		mes "懸命に頑張っていました……";
		next;
		mes "[ローサ・エリナ]";
		mes "それがどうしてかは判らないですが、";
		mes "急にクルセーダーになったのです……";
		mes "確かに芯はまっすぐで神聖な力を";
		mes "受け入れやすかったのでしょうが……";
		mes "そして……ゲフェン地下モンスター";
		mes "討伐作戦中に突然、姿を消しました。";
		next;
		mes "[ローサ・エリナ]";
		mes "それから2年後、妹はこの";
		mes "墓地に眠りました。";
		mes "……冒険家に発見されたのです。";
		mes "壊れた鎧、血だらけのリボン……";
		mes "それらが私の元へ帰ってきました。";
		next;
		mes "[ローサ・エリナ]";
		mes "私には、妹の身に何が起きたのか";
		mes "知りません。……シャルルは妹を";
		mes "とても慕っていました。それで";
		mes "妹の死のショックが大きすぎたのか、";
		mes "あれ以来ずっと、あんな感じなのです。";
		mes "……妹と何かあったのかもしれません。";
		next;
		mes "[ローサ・エリナ]";
		mes "隠された事実がありそうですが……";
		mes "クルセイダー達の仕事を一般人が";
		mes "知ることはできません。";
		mes "かといって、手がかりはもう……";
		mes "昔のことですからね……";
		next;
		mes "[ローサ・エリナ]";
		mes "……たわいもない話を";
		mes "聞いてくれてありがとう。";
		mes "もしもまたあの子に会ったら、";
		mes "私は大丈夫だから、行くべき所へ";
		mes "行きなさいと、伝えてください。";
		set GOD_3QUE,25;
		close;
	}
	else if(GOD_3QUE > 9 && GOD_3QUE < 20) {
		mes "[ローサ・エリナ]";
		mes "この墓地の主を知りたいのですか？";
		mes "……主は……私の妹です。";
		mes "ちょうどいい場所なので、";
		mes "よく散歩に来ます。";
		mes "……え？　そうです。";
		mes "名はローウェンと言います。";
		next;
		mes "[ローサ・エリナ]";
		mes "あなたはローウェンのお友達ですか？";
		mes "うん？　大聖堂の男？　ああ～";
		mes "シャルルのことですね。あの男の";
		mes "言うことは無視してください。妹の死を";
		mes "自分のせいだと思っているんですよ。";
		mes "ショックが大きすぎたのでしょう。";
		next;
		mes "[ローサ・エリナ]";
		mes "もう妹のことは忘れて、自分の生活に";
		mes "戻ってくれるといいのに……";
		mes "……どなたかは存じませんが、わざわざ";
		mes "訪ねてきてくれてありがとう。";
		mes "ローウェンは死んでも会いに来てくれる";
		mes "お友達がいてよかったわ。";
		set GOD_3QUE,11;
		close;
	}
	mes "[ローサ・エリナ]";
	mes "…………";
	mes "今は話をしたくありません。";
	mes "一人にしておいてください。";
	close;
}

prontera.gat,262,353,0	script	墓碑	111,{
	if($GodMagingiorde >= 50) {
		if(GOD_3QUE > 33) {
			mes "　　　　ローウェン・エリナ";
			mes "　";
			mes "　　　　　XXXX. XX. XX.";
			mes "　　";
			mes "　　　　　崇高な魂は";
			mes "　　　　　ヴァルキリーが待つ";
			mes "　　　　　聖地へ旅立った";
			close;
		}
		mes "- 文字がかすれていて";
		mes "読めない。 -";
		close;
	}
	mes "- 普通の石で作られた墓碑だ。 -";
	close;
}

gef_dun01.gat,89,192,0	script	#ローウェンの跡1	111,3,3,{
	if($GodMagingiorde < 50 || $GodBrysinggamen >= 100) {
		mes "- 古い枯れ木だ。 -";
		close;
	}
	if(GOD_3QUE > 20 && GOD_3QUE < 34) {
		mes "- 彼女を呼びますか？ -";
		next;
		if(select("呼ぶ","やめる") == 2) {
			close;
		}
		input '@str$;
		if('@str$ != "ローウェン") {
			close;
		}
		if(GOD_3QUE == 30) {
			mes "[ローウェン・エリナ]";
			mes "……あ、あなたは……";
			mes "ああ……弱くなっています……";
			mes "これは……残留思念と同じもの……";
			mes "もう少し、もう少し奥へ来てください。";
			mes "見せたいものがあります……";
			next;
			mes "- 彼女の声はますます小さくなり";
			mes "これ以上は聞き取れなかった。 -";
			close;
		}
		else if(GOD_3QUE == 25) {
			mes "[ローウェン・エリナ]";
			mes "またお会いしましたね。";
			mes "……ローサには会いましたか？";
			mes "……ふふふ……姉さんらしいですね。";
			mes "伝えてくれてありがとう。";
			mes "……本当は、私も何かしてあげられると";
			mes "良いのですが……";
			next;
			mes "[ローウェン・エリナ]";
			mes "あ……危ないですよ。";
			mes "ここはとても危険な場所です。";
			mes "あなたをお手伝いできないのが";
			mes "とても情けないです……";
			mes "気をつけてくださいね。";
			close;
		}
		else if(GOD_3QUE == 21) {
			mes "[ローウェン・エリナ]";
			mes "……姉に、私の心配はしないで";
			mes "と伝えてください。ローサはずっと";
			mes "私の墓碑を見守っています。";
			mes "……でも、もう休んで欲しい";
			mes "と伝えてください。";
			close;
		}
		mes "[ローウェン・エリナ]";
		mes "用がないのに呼ばないでください。";
		mes "ここは……危険な場所ですよ……";
		close;
	}
	else if(GOD_3QUE == 20) {
		mes "[女性の声]";
		mes "……危ない……";
		mes "危ないですよ……";
		next;
		if(select("無視する","何のこと？") == 1) {
			close;
		}
		mes "[女性の声]";
		mes "……まさか……あなた";
		mes "私の声が聞こえるのですか？";
		mes "……いや、そんなわけは……";
		mes "でも、もし本当なら……";
		mes "よろしければ、私の話を";
		mes "少し聞いていただけます？";
		next;
		if(select("ごめん、今はちょっと無理!!","だ、誰?!") == 1) {
			close;
		}
		mes "[女性の声]";
		mes "あ、落ち着いてください。";
		mes "私自身もびっくりしましたが……";
		mes "私には……肉体がありません……";
		mes "そう……魂です……";
		mes "ずっと彷徨っていました。";
		next;
		mes "[ローウェン]";
		mes "この世に未練があるのです。";
		mes "よろしければ……";
		mes "私の姉、ローサに伝えてください。";
		mes "もう泣かないで……大丈夫だから……";
		mes "ローウェンはもう大丈夫だからと……";
		next;
		mes "[ローウェン]";
		mes "今後、私に会いたければ、大きな声で";
		mes "私の名を呼んでください。";
		mes "「ローウェン」と……";
		set GOD_3QUE,21;
		close;
	}
	mes "- 気持ち悪くねじれた古い枯れ木だ。";
	mes "寒々しく暗い雰囲気が漂っている。";
	mes "そしてなぜか、物悲しい感じがする。 -";
	close;
OnTouch:
	if(GOD_3QUE > 9 && GOD_3QUE < 34)
		emotion 0,"";
	end;
}

gef_dun01.gat,203,48,0	script	#ローウェンの跡2	111,3,3,{
	if($GodMagingiorde < 50 || $GodBrysinggamen >= 100) {
		mes "- 古い枯れ木だ。 -";
		close;
	}
	if(GOD_3QUE > 20 && GOD_3QUE < 34) {
		mes "- 彼女を呼びますか？ -";
		next;
		if(select("呼ぶ","やめる") == 2) {
			close;
		}
		input '@str$;
		if('@str$ != "ローウェン") {
			close;
		}
		if(GOD_3QUE == 31) {
			mes "[ローウェン・エリナ]";
			mes "また来てくれましたね。";
			mes "……また一緒に行ってくださいますか？";
			mes "ぜひ、お願いします。";
			next;
			if(select("もちろんです","すみません、遠慮します") == 2) {
				mes "[ローウェン・エリナ]";
				mes "……そうですか。";
				mes "確かに身の安全が第一ですよね。";
				close;
			}
			mes "[ローウェン・エリナ";
			mes "ありがとう、ありがとう……";
			close2;
			warp "que_god02.gat",47,53;
			end;
		}
		else if(GOD_3QUE == 30) {
			mes "[ローウェン・エリナ]";
			mes "ああ……分かります……";
			mes "あなたの気持ち、私のことを";
			mes "理解しようとしてくれる気持ち、";
			mes "すごく分かります。こんなに";
			mes "私の声を聞いてくださるなんて、";
			mes "とても不思議です。";
			next;
			mes "[ローウェン・エリナ]";
			mes "そうですね……";
			mes "一つ、昔話をしてあげましょう。";
			close2;
			warp "que_god02.gat",47,53;
			end;
		}
		else if(GOD_3QUE == 25) {
			mes "[ローウェン・エリナ]";
			mes "またお会いしましたね。";
			mes "……ローサには会いましたか？";
			mes "……ふふふ……姉さんらしいですね。";
			mes "伝えてくれてありがとう。";
			mes "……本当は、私も何かしてあげられると";
			mes "良いのですが……";
			next;
			mes "[ローウェン・エリナ]";
			mes "あ……危ないですよ。";
			mes "ここはとても危険な場所です。";
			mes "あなたをお手伝いできないのが";
			mes "とても情けないです……";
			mes "気をつけてくださいね。";
			close;
		}
		mes "[ローウェン・エリナ]";
		mes "用がないのに呼ばないでください。";
		mes "ここは……危険な場所ですよ……";
		close;
	}
	else if(GOD_3QUE == 20) {
		mes "[女性の声]";
		mes "……危ない……";
		mes "危ないですよ……";
		next;
		if(select("無視する","何のこと？") == 1) {
			close;
		}
		mes "[女性の声]";
		mes "……まさか……あなた";
		mes "私の声が聞こえるのですか？";
		mes "……いや、そんなわけは……";
		mes "でも、もし本当なら……";
		mes "よろしければ、私の話を";
		mes "少し聞いていただけます？";
		next;
		if(select("ごめん、今はちょっと無理!!","だ、誰?!") == 1) {
			close;
		}
		mes "[女性の声]";
		mes "あ、落ち着いてください。";
		mes "私自身もびっくりしましたが……";
		mes "私には……肉体がありません……";
		mes "そう……魂です……";
		mes "ずっと彷徨っていました。";
		next;
		mes "[ローウェン]";
		mes "この世に未練があるのです。";
		mes "よろしければ……";
		mes "私の姉、ローサに伝えてください。";
		mes "もう泣かないで……大丈夫だから……";
		mes "ローウェンはもう大丈夫だからと……";
		next;
		mes "[ローウェン]";
		mes "今後、私に会いたければ、大きな声で";
		mes "私の名を呼んでください。";
		mes "「ローウェン」と……";
		set GOD_3QUE,21;
		close;
	}
	mes "- 気持ち悪くねじれた古い枯れ木だ。";
	mes "寒々しく暗い雰囲気が漂っている。";
	mes "そしてなぜか、物悲しい感じがする。 -";
	close;
OnTouch:
	if(GOD_3QUE > 9 && GOD_3QUE < 34)
		emotion 0,"";
	end;
}

que_god02.gat,48,55,3	script	ローウェン・エリナ	745,{
	if(GOD_3QUE == 30) {
		mes "[ローウェン・エリナ]";
		mes "……私の姿が見えるのですか？";
		mes "あ……そのようですね……";
		mes "……これは、私の過去になります。";
		mes "まわりをご覧ください。";
		next;
		mes "[ローウェン・エリナ]";
		mes "ここはゲフェンタワーの奥深く。";
		mes "私達は邪悪な気を浄化するため";
		mes "ここゲフェンへ来ました。";
		mes "……私は悲しい、とても悲しいです。";
		mes "どうしてここに残っているのでしょう。";
		next;
		mes "[ローウェン・エリナ]";
		mes "行くことができなかったのです。";
		mes "心とは裏腹に、ここを発つことが";
		mes "できなかったのです。";
		next;
		mes "[ローウェン・エリナ]";
		mes "そしてそんな私のせいで、";
		mes "多くの仲間達が死にました。";
		mes "……彼らのことを思うと、私は";
		mes "眠りにつくことができませんでした。";
		next;
		switch(select("死んだ仲間達は恨んでいるでしょうね","未練があったのですね")) {
		case 1:
			mes "[ローウェン・エリナ]";
			mes "仲間達の恨み……";
			mes "私も初めは、彼らが私を恨むと";
			mes "思いました。だから彼らのために";
			mes "旅に出ました。償いといいますか……";
			mes "仇をとろうと思ったことも";
			mes "ありました。";
			next;
			mes "[ローウェン・エリナ]";
			mes "2年近く、死んだ仲間達の";
			mes "無念を晴らそうと、自分なりに";
			mes "努力をしました…………";
			next;
			mes "["+strcharinfo(0)+"]";
			mes "……作戦失敗後、一人きりで";
			mes "モンスターに立ち向かったの？";
			next;
			mes "[ローウェン・エリナ]";
			mes "はい、そのとおりです。";
			mes "私は、それが仲間達の";
			mes "望みと思ったからです。";
			mes "ところが……";
			mes "……………………";
			mes "こんな姿になってから……";
			next;
			mes "[ローウェン・エリナ]";
			mes "彼らに会えました。";
			mes "……あなたは死者の街";
			mes "ニブルヘイムをご存じですか？";
			mes "私はそこで昔の仲間達に会いました。";
			next;
			mes "[ローウェン・エリナ]";
			mes "けれど、彼らの中には誰も……";
			mes "私を恨む者はいなかったのです……";
			mes "皆、私を気遣うだけ……";
			next;
			menu "どうして？",-;
			mes "[ローウェン・エリナ]";
			mes "分かりません。";
			mes "皆、安らかな眠りにつきました。";
			mes "皆、自らが行くべき所へ行きました。";
			mes "……彼らがニブルヘイムにいたのは";
			mes "もしかしたら、私を待っていたの";
			mes "かもしれません…………";
			next;
			mes "[ローウェン・エリナ]";
			mes "自分たちは大丈夫であり、";
			mes "そして誰も恨んでいないことを";
			mes "知らせたかったのかもしれません。";
			mes "……彼らはヴァルキリーの元へ行き";
			mes "解放されました。しかし、私は";
			mes "行くことができません。";
			next;
			mes "[ローウェン・エリナ]";
			mes "なぜ、なぜでしょうか？";
			close;
		case 2:
			mes "[ローウェン・エリナ]";
			mes "未練……";
			mes "この世に対する未練？";
			mes "それはありません。";
			mes "いや……";
			mes "分かりません……";
			next;
			mes "[ローウェン・エリナ]";
			mes "ニブルヘイムで会った昔の仲間達は";
			mes "皆、ヴァルキリーの元へ帰りました。";
			mes "それがクルセイダーにとっての栄誉。";
			mes "しかし私だけ帰れないのは……";
			mes "やはり私にはその資格が";
			mes "ないのでしょう。";
			next;
			menu "私が帰るのを手伝います！",-;
			mes "[ローウェン・エリナ]";
			mes "あなたが……？";
			mes "どうやって……？";
			next;
			mes "["+strcharinfo(0)+"]";
			mes "ここは過去ですよね？";
			mes "あなたの心は私と共にあります。";
			mes "だから私が一緒に戦います。";
			mes "そして心の鎖を解き、";
			mes "眠りについてください。";
			mes "決して挫けてはいけません。";
			next;
			mes "[ローウェン・エリナ]";
			mes "……………………";
			mes "……ああ、ありがとう。";
			mes "本当にありがとう。";
			next;
			mes "["+strcharinfo(0)+"]";
			mes "それでは行きましょう！";
			set GOD_3QUE,31;
			close;
		}
	}
	else if(GOD_3QUE == 31) {
		mes "[ローウェン・エリナ]";
		mes "あちらの階段を降りてください。";
		mes "……私はあなたの心と共にあります。";
		mes "そしてこれから現れる私の姿は、";
		mes "過去のものです…………";
		close;
	}
	mes "[ローウェン・エリナ]";
	mes "どうしてあなたはここに……。";
	close2;
	warp "geffen.gat",120,101;
	end;
}

que_god02.gat,54,64,4	script	兵士#1_brising	105,1,1,{
	if(GOD_3QUE != 31) {
		mes "[兵士]";
		mes "危険です！";
		mes "これ以上は進入不可です!";
		close;
	}
	mes "[兵士]";
	mes "モンスター討伐作戦に";
	mes "参加する方ですね。";
	mes "今すぐ行きますか？";
	next;
	switch(select("はい、行きます！","ちょっと準備してきます")) {
	case 1:
		mes "[兵士]";
		mes "それではもう少し、";
		mes "近くに来てください。";
		mes "私に近づいてください。";
		close;
	case 2:
		mes "[兵士]";
		mes "準備ができましたら、";
		mes "お越しください。";
		close;
	}
OnTouch:
	if(GOD_3QUE != 31) {
		mes "[兵士]";
		mes "危険です。";
		mes "下がってください";
		close2;
		warp "que_god02.gat",51,59;
		end;
	}
	warp "que_god02.gat",174,49;
	donpcevent "兵士#2_brising::OnStart";
	end;
}

que_god02.gat,55,64,4	script	兵士#2_brising	105,1,1,{
	mes "[兵士]";
	mes "危険です！";
	mes "これ以上は進入不可です！";
	close;
OnStart:
	hideonnpc "兵士#1_brising";
	hideoffnpc "兵士#2_brising";
	initnpctimer;
	end;
OnTimer420000:
	announce "残留思念が弱まっています。",0x9,0x70dbdb;
	end;
OnTimer480000:
	announce "過去の時の流れはもうすぐ消えます。",0x9,0x70dbdb;
	end;
OnTimer540000:
	announce "残留思念で作られた過去は消滅します。",0x9,0x70dbdb;
	end;
OnTimer542000:
	areawarp "que_god02.gat",15,125,185,131,"geffen.gat",120,100;
	end;
OnTimer550000:
	donpcevent "#brising召喚::OnReset";
	end;
OnTimer550500:
	stopnpctimer;
	end;
OnInit:
	hideonnpc "兵士#2_brising";
	end;
}

que_god02.gat,174,49,0	script	#ローウェンの過去	139,0,0,{
OnTouch:
	mes "["+strcharinfo(0)+"]";
	mes "どこ?!　ここは?!";
	mes "ああ、ここが2年前の問題の場所か。";
	mes "なるほど……";
	next;
	mes "[ローウェン・エリナ]";
	mes "はい、これは過去を再現しています。";
	mes "当時、どんな事があったのか、";
	mes "私の身には何が起きていたのか……を。";
	next;
	mes "[ローウェン・エリナ]";
	mes "……ここまでは順調でした。";
	mes "問題はこの次です……";
	next;
	announce "……ど、ドッペルゲンガー!!",0x9,0x9cff00;
	mes "["+strcharinfo(0)+"]";
	mes "ええー!!";
	mes "ドッペルゲンガー?!";
	next;
	mes "["+strcharinfo(0)+"]";
	mes "え……これは何？";
	mes "あなたはあれと戦ったのですか？";
	mes "……ちょ、ちょっと答えてください！";
	mes "…………答えて!!";
	hideoffnpc " #ドッペルゲンガー1";
	hideoffnpc " #ローウェン";
	hideoffnpc " #騎士1";
	hideoffnpc " #騎士2";
	hideoffnpc " #騎士3";
	next;
	mes "[ローウェン・エリナ]";
	mes "ええ……";
	mes "そう、ここ……";
	mes "この時、団長が命令をしたのです……";
	mes "その後……突然、飛ばされて……";
	next;
	announce "皆!!　慌てずに整列しろ!!",0x9,0x9cff00;
	mes "^4E2F2F[聖騎士団団長]";
	mes "各自整列！　散らばるな!";
	mes "近くにいる者が先制して動きを封じろ！";
	mes "後衛は前衛を援護!!^000000";
	emotion 27," #ローウェン";
	emotion 27," #騎士1";
	emotion 27," #騎士2";
	emotion 27," #騎士3";
	emotion 0," #ドッペルゲンガー1";
	mes "[ローウェン・エリナ]";
	mes "……ああ……だめよ……";
	mes "逃げてはいけない……";
	next;
	mes "- その瞬間すさまじい不安を感じた。";
	mes "立ち向かわなければならないという";
	mes "強迫感と抑えきれない程の恐れ。";
	mes "2年前の彼女の震える心を";
	mes "まざまざと感じる。 -";
	next;
	mes "^4E2F2F[聖騎士団団長]";
	mes "攻撃しろ、ローウェン!!";
	mes "グランドクロスを発動しろ!!^000000";
	next;
	misceffect 58," #ローウェン";
	announce "クッ……クックック……愚か者よ……",0x9,0xa8a8a8;
	emotion 0," #ローウェン";
	emotion 0," #騎士1";
	emotion 0," #騎士2";
	emotion 0," #騎士3";
	hideonnpc " #ドッペルゲンガー1";
	hideoffnpc " #ドッペルゲンガー2";
	mes "["+strcharinfo(0)+"]";
	mes "?!";
	next;
	misceffect 58," #ドッペルゲンガー2";
	mes "[男の叫び声]";
	mes "う、うわぁぁ～!!";
	close2;
	warp "que_god02.gat",120,52;
	hideonnpc " #ドッペルゲンガー2";
	hideonnpc " #ローウェン";
	hideonnpc " #騎士1";
	hideonnpc " #騎士2";
	hideonnpc " #騎士3";
	end;
}

que_god02.gat,173,58,4	script	 #ドッペルゲンガー1	739,{}
que_god02.gat,175,55,4	script	 #ドッペルゲンガー2	739,{}
que_god02.gat,175,54,1	script	 #ローウェン	745,{}
que_god02.gat,178,49,1	script	 #騎士1	751,{}
que_god02.gat,168,53,7	script	 #騎士2	734,{}
que_god02.gat,167,58,4	script	 #騎士3	752,{}

que_god02.gat,124,59,7	script	 #エールミット	798,{}

que_god02.gat,120,52,0	script	 #独白	139,0,0,{
OnTouch:
	mes "["+strcharinfo(0)+"]";
	mes "ここはどこ？";
	mes "……うーん……";
	mes "あの人は……？";
	mes "……シャルル、";
	mes "エールミット・シャルル？";
	next;
	mes "[エールミット・シャルル]";
	mes "ああ……だめ、だめだ。";
	mes "姉さん、いけないよ!!";
	mes "出会ってしまう……";
	mes "逃げることもできない……";
	next;
	mes "[エールミット・シャルル]";
	mes "グランドクロスだなんて……";
	mes "死ぬ気なのか?!";
	mes "バカ、バカバカバカ～!!";
	next;
	announce "クッ……クックック……愚か者よ……",0x9,0xa8a8a8;
	mes "[エールミット・シャルル]";
	mes "あ……だめだ！";
	mes "う、うわぁぁ～!!";
	next;
	hideonnpc " #エールミット";
	mes "["+strcharinfo(0)+"]";
	mes "あれ？　どこへ行ったんだ？";
	mes "これは……彼の心？";
	announce "な、ローウェンが消えた!!",0x9,0x9cff00;
	next;
	mes "[ローウェン・エリナ]";
	mes "………………";
	mes "……お解りでしょう？";
	mes "これで……";
	mes "どうしてこうなってしまったのか……";
	close2;
	warp "que_god02.gat",18,127;
	end;
}

que_god02.gat,21,127,3	script	ローウェン・エリナ#2	745,{
	mes "[ローウェン・エリナ]";
	mes "私が馬鹿でした。今やっと";
	mes "シャルルが思い出しましたね。";
	mes "当時の私は、不思議な力によって";
	mes "その場を脱出してしまいました。";
	mes "そして我に返った時は、そばには";
	mes "誰もいませんでした。";
	next;
	mes "[ローウェン・エリナ]";
	mes "一人だけ生き残ってしまった自分を";
	mes "激しく悔やみました。仲間達と";
	mes "一緒に死ぬことすらできず……";
	mes "自分を役立たずの人間としか";
	mes "思えなかったのです。";
	next;
	mes "[ローウェン・エリナ]";
	mes "当時は気づかなかったけれど、";
	mes "でも今なら分かります。";
	mes "私を大事に思ってくれる人々が";
	mes "たくさんいるということを。";
	next;
	mes "[ローウェン・エリナ]";
	mes "事件から3日後、私は自ら団長を";
	mes "訪ねました。……でも愚かでした。";
	mes "あの時の私は、自分のことを";
	mes "戦闘から逃げ出した卑怯者としか";
	mes "考えていなかったのです。";
	next;
	mes "[ローウェン・エリナ]";
	mes "恐ろしくて恐ろしくて……きっと敵を";
	mes "前にして、逃げ出してしまったのだと。";
	mes "その当時、上層部では責任を負わせる";
	mes "相手を捜していました。そうです、";
	mes "どんな仕事でも悪い事態が発生すれば";
	mes "誰かがその責めを負うことになります。";
	next;
	mes "[ローウェン・エリナ]";
	mes "我が子、友人、部下を失った人々の";
	mes "行き場のない怒りの刃は、結局";
	mes "私へと向けられました。";
	mes "……そしてあらゆること、そう、";
	mes "騎士としての全てを諦めなければ";
	mes "ならなかったのです。";
	next;
	mes "[ローウェン・エリナ]";
	mes "どうしてもっと堂々と、自分の思いを";
	mes "表に出せなかったのか……でもあの時は";
	mes "原因を作った私は罰を受けるのが";
	mes "当然だと思ったのです。また自ら";
	mes "仲間達の仇をとるつもりでした……";
	mes "そして自らの地位も取り戻そうと……";
	next;
	mes "[ローウェン・エリナ]";
	mes "あそこへ戻りました。";
	mes "戦ってまた戦って……";
	mes "既に力はありませんでしたが";
	mes "必死に戦いました。";
	mes "また認めてもらうために……";
	next;
	announce "ならば戦いなさい……試練を乗り越えるのです……",0x9,0x70db93;
	mes "[ローウェン・エリナ]";
	mes "え……この声は……？";
	next;
	mes "[ローウェン・エリナ]";
	mes "この私に機会をくださるのですか？";
	mes "……本当ですか？";
	mes "しかし……私にはもう";
	mes "現世に肉体はありません。";
	next;
	mes "["+strcharinfo(0)+"]";
	mes "私が一緒に戦う！";
	mes "さあ、行こう!!";
	close2;
	donpcevent "#brising召喚::OnSummon";
	end;
}

que_god02.gat,17,127,0	script	#brising召喚	139,{
OnInit:
	hideonnpc " #ドッペルゲンガー1";
	hideonnpc " #ドッペルゲンガー2";
	hideonnpc " #騎士1";
	hideonnpc " #騎士2";
	hideonnpc " #騎士3";
	hideonnpc " #ローウェン";
	hideonnpc "ヴァルキリー#1";
	hideoffnpc " #エールミット";
	end;
OnSummon:
	hideonnpc "ローウェン・エリナ#2";
	hideoffnpc "#brising召喚";
	monster "que_god02.gat",34,128," ",1015,1,"#brising召喚::OnKilled";
	monster "que_god02.gat",34,127," ",1015,1,"#brising召喚::OnKilled";
	monster "que_god02.gat",80,127," ",1015,1,"#brising召喚::OnKilled";
	monster "que_god02.gat",102,128," ",1036,1,"#brising召喚::OnKilled";
	monster "que_god02.gat",130,128," ",1036,1,"#brising召喚::OnKilled";
	monster "que_god02.gat",62,128," ",1041,1,"#brising召喚::OnKilled";
	monster "que_god02.gat",64,127," ",1041,1,"#brising召喚::OnKilled";
	monster "que_god02.gat",150,127," ",1041,1,"#brising召喚::OnKilled";
	monster "que_god02.gat",176,127," ",1041,1,"#brising召喚::OnKilled";
	end;
OnKilled:
	set '@count,getmapmobs("que_god02.gat","#brising召喚::OnKilled");
	if('@count == 0) {
		set GOD_3QUE,31;
		hideoffnpc "ヴァルキリー#1";
	}
	end;
OnReset:
	hideonnpc " #ドッペルゲンガー1";
	hideonnpc " #ドッペルゲンガー2";
	hideonnpc " #騎士1";
	hideonnpc " #騎士2";
	hideonnpc " #騎士3";
	hideonnpc " #ローウェン";
	hideoffnpc "兵士#1_brising";
	hideonnpc "兵士#2_brising";
	hideoffnpc " #エールミット";
	hideoffnpc "ローウェン・エリナ#2";
	hideonnpc "ヴァルキリー#1";
	killmonster "que_god02.gat","#brising召喚::OnKilled";
	end;
}

que_god02.gat,178,127,3	script	ヴァルキリー#1	811,{
	if(GOD_3QUE == 31) {
		mes "[ヴァルキリー]";
		mes "とうとう乗り越えましたね、";
		mes "少女よ……";
		mes "あまり時間はありません。";
		mes "過去の時は短い方がよいでしょう。";
		mes "では、最後に問います。";
		next;
		mes "[ヴァルキリー]";
		mes "あなたは、心を縛るものから";
		mes "解放されましたか？";
		mes "私はあなたをずっと";
		mes "待っていましたよ。";
		next;
		switch(select("はい、あなたについてきます","誰に聞いているの？")) {
		case 1:
			mes "[ヴァルキリー]";
			mes "ローウェン・エリナ、悲しみの騎士よ。";
			mes "あなたの心はもろく";
			mes "自らをも傷つけていた……";
			mes "でも、もう大丈夫なようですね。";
			mes "主神の元に、あなたを送りましょう。";
			next;
			mes "[ヴァルキリー]";
			mes "あなたの心、そして精神は、";
			mes "かのヴァルハラで主神のために、";
			mes "あなたが歩んできたその道のごとく";
			mes "……聖戦に備えし戦士に";
			mes "生まれ変わりなさい……";
			misceffect 91,"";
			next;
			mes "[ヴァルキリー]";
			mes "……そして、人間の子よ。";
			mes "あなたはどうしてここにいるのです？";
			next;
			mes "- 事の発端となった";
			mes "溶けない雪の結晶のことから";
			mes "これまでのことを全て";
			mes "ヴァルキリーに話した。 -";
			next;
			mes "[ヴァルキリー]";
			mes "あなたが言いたいことはよく";
			mes "分かりました。……それは多分";
			mes "あの遠い昔の日のことですね。";
			mes "美と愛の女神、美しきフレイヤの";
			mes "ことでしょう。";
			next;
			mes "[ヴァルキリー]";
			mes "女神が流した涙は美しい宝石となり";
			mes "……女神の涙が染みこんだ冷たい雪は";
			mes "自らの存在を守る……";
			next;
			mes "[ヴァルキリー]";
			mes "あなたが捜すべきものは女神の跡です。";
			mes "……千年の平和が終わるのですね。";
			mes "私は人間達がその終わりまで、神々を";
			mes "敬う心を失わないことを願います。";
			next;
			mes "[ヴァルキリー]";
			mes "あなたに会ったことも、既に";
			mes "予定されていた事かもしれませんね。";
			mes "神々が残した強大な力……それを";
			mes "あなた方が正しく使うことを信じ、";
			mes "その鍵を教えましょう。";
			next;
			mes "[ヴァルキリー]";
			mes "訪ねなさい。";
			mes "女神が歩いた冷たい雪道。";
			mes "女神が渡った澄んだ川。";
			mes "女神が通り過ぎた小さな一本道。";
			mes "女神が出会った四人のドワーフ達……";
			next;
			mes "[ヴァルキリー]";
			mes "^4d4dffすらりと伸びたその足に";
			mes "麗しきその髪に";
			mes "輝くその瞳に";
			mes "我らは心、魂を捧げた^000000";
			next;
			mes "[ヴァルキリー]";
			mes "この歌をよく覚えておきなさい。";
			mes "では、あなたを元の世界へ帰します。";
			set GOD_3QUE,34;
			next;
			mes "[ヴァルキリー]";
			mes "オーディンのご加護を……";
			close2;
			hideonnpc " #ドッペルゲンガー1";
			hideonnpc " #ドッペルゲンガー2";
			hideonnpc " #騎士1";
			hideonnpc " #騎士2";
			hideonnpc " #騎士3";
			hideonnpc " #ローウェン";
			hideoffnpc "兵士#1_brising";
			hideonnpc "兵士#2_brising";
			hideoffnpc " #エールミット";
			hideoffnpc "ローウェン・エリナ#2";
			hideonnpc "ヴァルキリー#1";
			warp "geffen.gat",120,101;
			end;
		case 2:
			mes "[ヴァルキリー]";
			mes "くすくす……";
			mes "私はあなたの身を借りて";
			mes "過去を理解し乗り越えた少女に";
			mes "対して問うたのです。";
			mes "……少女よ、答えなさい。";
			next;
			mes "[ヴァルキリー]";
			mes "ローウェン・エリナ、悲しみの騎士よ。";
			mes "あなたの心はもろく";
			mes "自らをも傷つけていた……";
			mes "でも、もう大丈夫なようですね。";
			mes "主神の元に、あなたを送りましょう。";
			next;
			mes "[ヴァルキリー]";
			mes "あなたの心、そして精神は、";
			mes "かのヴァルハラで主神のために、";
			mes "あなたが歩んできたその道のごとく";
			mes "……聖戦に備えし戦士に";
			mes "生まれ変わりなさい……";
			misceffect 91,"";
			next;
			mes "[ヴァルキリー]";
			mes "……そして、人間の子よ。";
			mes "あなたはどうしてここにいるのです？";
			next;
			mes "- 事の発端となった";
			mes "溶けない雪の結晶のことから";
			mes "これまでのことを全て";
			mes "ヴァルキリーに話した。 -";
			next;
			mes "[ヴァルキリー]";
			mes "あなたが言いたいことはよく";
			mes "分かりました。……それは多分";
			mes "あの遠い昔の日のことですね。";
			mes "美と愛の女神、美しきフレイヤの";
			mes "ことでしょう。";
			next;
			mes "[ヴァルキリー]";
			mes "女神が流した涙は美しい宝石となり";
			mes "……女神の涙が染みこんだ冷たい雪は";
			mes "自らの存在を守る……";
			next;
			mes "[ヴァルキリー]";
			mes "あなたが捜すべきものは女神の跡です。";
			mes "……千年の平和が終わるのですね。";
			mes "私は人間達がその終わりまで、神々を";
			mes "敬う心を失わないことを願います。";
			next;
			mes "[ヴァルキリー]";
			mes "あなたに会ったことも、既に";
			mes "予定されていた事かもしれませんね。";
			mes "神々が残した強大な力……それを";
			mes "あなた方が正しく使うことを信じ、";
			mes "その鍵を教えましょう。";
			next;
			mes "[ヴァルキリー]";
			mes "訪ねなさい。";
			mes "女神が歩いた冷たい雪道。";
			mes "女神が渡った澄んだ川。";
			mes "女神が通り過ぎた小さな一本道。";
			mes "女神が出会った四人のドワーフ達……";
			next;
			mes "[ヴァルキリー]";
			mes "^4d4dffすらりと伸びたその足に";
			mes "麗しきその髪に";
			mes "輝くその瞳に";
			mes "我らは心、魂を捧げた^000000";
			next;
			mes "[ヴァルキリー]";
			mes "この歌をよく覚えておきなさい。";
			mes "では、あなたを元の世界へ帰します。";
			set GOD_3QUE,34;
			next;
			mes "[ヴァルキリー]";
			mes "オーディンのご加護を……";
			close2;
			hideonnpc " #ドッペルゲンガー1";
			hideonnpc " #ドッペルゲンガー2";
			hideonnpc " #騎士1";
			hideonnpc " #騎士2";
			hideonnpc " #騎士3";
			hideonnpc " #ローウェン";
			hideoffnpc "兵士#1_brising";
			hideonnpc "兵士#2_brising";
			hideoffnpc " #エールミット";
			hideoffnpc "ローウェン・エリナ#2";
			hideonnpc "ヴァルキリー#1";
			warp "geffen.gat",120,101;
			end;
		}
	}
}

xmas.gat,38,105,0	script	 #brisindwarf1	111,3,3,{
	if($GodMagingiorde < 50 || $GodBrysinggamen >= 100) {
		mes "- 雪がかなり積もっている。 -";
		close;
	}
	if(GOD_3QUE > 39 && GOD_3QUE < 50) {
		mes "- 雪が降っているだけにみえるが";
		mes "何だか目に違和感を感じる…… -";
		next;
		switch(select("まぶたをこすってみる","目を突付いてみる","積もっている雪を突付いてみる","何もしない")) {
		case 1:
			mes "- まぶたをゴシゴシこすってみた。";
			mes "おや、顔についていた雪が……";
			mes "手を触れた途端、溶け始めたが";
			mes "一部、溶けないで残っている部分が";
			mes "ある。そこは何かの文字のように";
			mes "見える…… -";
			next;
			if(select("文字を繋げてみる","やめる") == 2) {
				mes "["+strcharinfo(0)+"]";
				mes "何も起こらない……";
				mes "気のせいか……";
				close;
			}
			mes "["+strcharinfo(0)+"]";
			mes "ちょっと文章を作ってみようかな……";
			next;
			switch(select("我らは心、魂を","麗しきその髪に","捧げた","すらりと伸びたその足に","輝くその瞳に")) {
			case 1:
				mes "["+strcharinfo(0)+"]";
				mes "我らは心、魂を";
				break;
			case 2:
				mes "["+strcharinfo(0)+"]";
				mes "麗しきその髪に";
				break;
			case 3:
				mes "["+strcharinfo(0)+"]";
				mes "捧げた";
				break;
			case 4:
				mes "["+strcharinfo(0)+"]";
				mes "すらりと伸びたその足に";
				set '@point,'@point + 1;
				break;
			case 5:
				mes "["+strcharinfo(0)+"]";
				mes "輝くその瞳に";
				break;
			}
			switch(select("我らは心、魂を","麗しきその髪に","捧げた","すらりと伸びたその足に","輝くその瞳に")) {
			case 1:
				mes "我らは心、魂を";
				break;
			case 2:
				mes "麗しきその髪に";
				set '@point,'@point + 1;
				break;
			case 3:
				mes "捧げた";
				break;
			case 4:
				mes "すらりと伸びたその足に";
				break;
			case 5:
				mes "輝くその瞳に";
				break;
			}
			switch(select("我らは心、魂を","麗しきその髪に","捧げた","すらりと伸びたその足に","輝くその瞳に")) {
			case 1:
				mes "我らは心、魂を";
				break;
			case 2:
				mes "麗しきその髪に";
				break;
			case 3:
				mes "捧げた";
				break;
			case 4:
				mes "すらりと伸びたその足に";
				break;
			case 5:
				mes "輝くその瞳に";
				set '@point,'@point + 1;
				break;
			}
			switch(select("我らは心、魂を","麗しきその髪に","捧げた","すらりと伸びたその足に","輝くその瞳に")) {
			case 1:
				mes "我らは心、魂を";
				set '@point,'@point + 1;
				break;
			case 2:
				mes "麗しきその髪に";
				break;
			case 3:
				mes "捧げた";
				break;
			case 4:
				mes "すらりと伸びたその足に";
				break;
			case 5:
				mes "輝くその瞳に";
				break;
			}
			switch(select("我らは心、魂を","麗しきその髪に","捧げた","すらりと伸びたその足に","輝くその瞳に")) {
			case 1:
				mes "我らは心、魂を";
				break;
			case 2:
				mes "麗しきその髪に";
				break;
			case 3:
				mes "捧げた";
				set '@point,'@point + 1;
				break;
			case 4:
				mes "すらりと伸びたその足に";
				break;
			case 5:
				mes "輝くその瞳に";
				break;
			}
			next;
			if('@point > 4) {
				hideoffnpc "アルフリッグ#1";
				mes "[老けたドワーフ]";
				mes "どいつじゃ?!";
				mes "わしを呼び出した奴は!!";
				close;
			}
			mes "- ……何も起きなかった。 -";
			close;
		case 2:
			mes "["+strcharinfo(0)+"]";
			mes "イタッ!!";
			mes "何をやってるんだ?!";
			close;
		case 3:
			mes "- 木の根に積もっている雪に";
			mes "指を突き立ててみると、";
			mes "何か硬い物にぶつかった。";
			mes "……言い表しがたい痛みを";
			mes "感じた!! -";
			emotion 23,"";
			percentheal -20,0;
			close;
		case 4:
			close;
		}
	}
	mes "- 木に雪が積もっている。 -";
	close;
OnTouch:
	if(GOD_3QUE > 39) {
		emotion 0;
	}
	end;
}

xmas.gat,36,103,4	script	アルフリッグ#1	826,{
	if(GOD_3QUE == 49) {
		mes "[アルフリッグ]";
		mes "……もう何も言わんぞ!!";
		mes "神々にばれたら困るんじゃ!!";
		mes "もうそれ位にしてくれ！";
		close2;
		hideonnpc "アルフリッグ#1";
		end;
	}
	else if(GOD_3QUE == 48) {
		mes "[アルフリッグ]";
		mes "何の用だ、小僧？";
		mes "わしらは全員目覚めた。いつか必ず";
		mes "この時が来ると信じておった。";
		mes "様々な力が合わさり、引き寄せあい";
		mes "変化しようとしておる。";
		next;
		switch(select("挨拶にきました","ブリーシンガメンの材料を知りたい")) {
		case 1:
			mes "[アルフリッグ]";
			mes "本気か？";
			mes "わしは人間のそういう格式がわからん。";
			mes "わしは隠れていなければならぬ。";
			mes "オーディンのカラスに";
			mes "見つかりたくないんじゃよ！";
			next;
			mes "[アルフリッグ]";
			mes "あっちへ行け！";
			mes "しっしっ!!";
			close2;
			hideonnpc "アルフリッグ#1";
			end;
		case 2:
			mes "[アルフリッグ]";
			mes "ブリーシンガメンの材料だと？";
			mes "カッカッカッカ……";
			mes "お前が集めるのか？";
			mes "まぁ、人間用に作るブリーシンガメン";
			mes "なら……可能かもしれん。";
			next;
			mes "[アルフリッグ]";
			mes "千年前、魔族との戦いで、神々の武具の";
			mes "一部が地上に落ちた……";
			mes "ブリーシンガメンの破片と呼ばれるもの";
			mes "……つまり、ブリーシンガメンの力を";
			mes "秘めたものが材料になる。";
			next;
			mes "[アルフリッグ]";
			mes "それは……";
			mes "^4d4dffフレイヤの宝石";
			mes "銀の装飾";
			mes "雪の結晶";
			mes "静かな波";
			mes "流れる空気^000000じゃ。";
			next;
			mes "[アルフリッグ]";
			mes "フレイヤ様の首飾りのように";
			mes "ブリーシンガメンの力となるものを";
			mes "秘めたものがいるんじゃ。";
			next;
			mes "[アルフリッグ]";
			mes "基本となるネックレスはもちろんじゃが";
			mes "首飾りとして装飾するために";
			mes "サファイアのような宝石も必要じゃ。";
			mes "黄金や真珠やオパール、そして強い力を";
			mes "持つ呪われたルビーなどな……";
			next;
			mes "[アルフリッグ]";
			mes "カッカッカッカ……";
			mes "人間のためではない。";
			mes "フレイヤ様のために";
			mes "もう一度鎚を奮おう！";
			mes "わしら兄弟鍛冶屋の閉業じゃ！";
			mes "……カッカッカ……";
			next;
			mes "[アルフリッグ]";
			mes "一つ予言しよう。";
			mes "わしらは目覚めた。";
			mes "だから人間共はいつか必ず";
			mes "ブリーシンガメンを";
			mes "手に入れるだろう。";
			mes "カッカッカ……";
			next;
			mes "[アルフリッグ]";
			mes "わかったら、さっさと行け!!";
			set GOD_3QUE,49;
			close2;
			hideonnpc "アルフリッグ#1";
			end;
		}
	}
	else if(GOD_3QUE == 40) {
		mes "[アルフリッグ]";
		mes "くはー、やれやれ、どれくらい";
		mes "眠っておったかのう。";
		mes "おう、どんな生意気な小僧が";
		mes "このアルフリッグを起こしたんじゃ？";
		mes "お前か？　";
		next;
		mes "[アルフリッグ]";
		mes "誰がわしの居場所を教えた？";
		mes "ロキか？　ヘイムダルか？";
		mes "それともフレイか？";
		next;
		switch(select("ここへ来ただけでどうして……","あの、ヴァルキリーが……")) {
		case 1:
			mes "[アルフリッグ]";
			mes "たわけ!!";
			mes "これだから人間って奴は!!";
			mes "偶然で、あの文章を作れると";
			mes "思っておるのか?!";
			mes "本当のことを言え、小僧！";
			next;
			switch(select("実はヴァルキリーが……","単なる偶然です！")) {
			case 1:
				mes "[アルフリッグ]";
				mes "……ヴァルキリー、ヴァルキリー!!";
				mes "オーディンの娘、あの戦争狂いかっ！";
				mes "オーディンがわしを狙っておるのか?!";
				mes "わしは、間違ってない、";
				mes "何もしておらんぞ!!";
				next;
				mes "- オーディンを恐れ震える";
				mes "アルフリッグに、ここに来るまでの";
				mes "経緯を教えた。 -";
				next;
				mes "[アルフリッグ]";
				mes "……そんなことじゃったのか。";
				mes "人間が神の領域にの……クック……";
				mes "カッカッカ……そいつはいい。";
				mes "しかも、お前が求めているものは";
				mes "遠い昔、わしら兄弟が作ったものじゃ。";
				next;
				mes "[アルフリッグ]";
				mes "クックックック、カーッカッカッカ！";
				mes "やってみるか！";
				mes "クック、カッカッカ、いいぞ、いいぞ！";
				mes "このアルフリッグ、人間に協力しよう。";
				mes "ロキやヘイムダルに虐められるより";
				mes "マシじゃい！";
				next;
				mes "[アルフリッグ]";
				mes "そういえば、フレイはどうした？";
				mes "何か言ってないのか？";
				mes "まあ、いい……カカカ……";
				mes "おい、人間の小僧。知りたくないか？";
				mes "光り輝く首飾り、女神フレイヤ様の";
				mes "首飾りのことを。";
				next;
				mes "[アルフリッグ]";
				mes "もちろん、この世で唯一無二の存在、";
				mes "ブリーシンガメンのことじゃ。";
				mes "わしら一族なら、再びあの秘宝を";
				mes "この世に生み出すことが出来る。";
				mes "素晴しい威力を秘めた、あれをな。";
				next;
				mes "[アルフリッグ]";
				mes "わしは、もう一度あの光を見たい！";
				mes "しかしそのためには、憎たらしいロキと";
				mes "オーディンのせいで眠りについた";
				mes "兄弟を全員、目覚めさせねばなるまい。";
				next;
				mes "[アルフリッグ]";
				mes "ふん、ヘイムダルの奴めも忌々しい！";
				mes "いいか、わしら兄弟を";
				mes "全員起こすんじゃ！";
				mes "そして、世の中にもう一度";
				mes "神々の武具を生み出すのじゃ！";
				next;
				mes "[アルフリッグ]";
				mes "さあ、神と巨人が気付く前に";
				mes "我が弟ドヴァリンを起こすのじゃ!!";
				set GOD_3QUE,41;
				close2;
				hideonnpc "アルフリッグ#1";
				end;
			case 2:
				mes "[アルフリッグ]";
				mes "……偶然？　偶然だと？";
				mes "去れ！";
				mes "二度と来るな!!";
				mes "奴ら……奴らが気がついてはならん！";
				mes "わしは、目覚めてなんかないぞ！";
				close2;
				hideonnpc "アルフリッグ#1";
				end;
			}
		case 2:
			mes "[アルフリッグ]";
			mes "……ヴァルキリー、ヴァルキリー!!";
			mes "オーディンの娘、あの戦争狂いかっ！";
			mes "オーディンがわしを狙っておるのか?!";
			mes "わしは、間違ってない、";
			mes "何もしておらんぞ!!";
			next;
			mes "- オーディンを恐れ震える";
			mes "アルフリッグに、ここに来るまでの";
			mes "経緯を教えた。 -";
			next;
			mes "[アルフリッグ]";
			mes "……そんなことじゃったのか。";
			mes "人間が神の領域にの……クック……";
			mes "カッカッカ……そいつはいい。";
			mes "しかも、お前が求めているものは";
			mes "遠い昔、わしら兄弟が作ったものじゃ。";
			next;
			mes "[アルフリッグ]";
			mes "クックックック、カーッカッカッカ！";
			mes "やってみるか！";
			mes "クック、カッカッカ、いいぞ、いいぞ！";
			mes "このアルフリッグ、人間に協力しよう。";
			mes "ロキやヘイムダルに虐められるより";
			mes "マシじゃい！";
			next;
			mes "[アルフリッグ]";
			mes "そういえば、フレイはどうした？";
			mes "何か言ってないのか？";
			mes "まあ、いい……カカカ……";
			mes "おい、人間の小僧。知りたくないか？";
			mes "光り輝く首飾り、女神フレイヤ様の";
			mes "首飾りのことを。";
			next;
			mes "[アルフリッグ]";
			mes "もちろん、この世で唯一無二の存在、";
			mes "ブリーシンガメンのことじゃ。";
			mes "わしら一族なら、再びあの秘宝を";
			mes "この世に生み出すことが出来る。";
			mes "素晴しい威力を秘めた、あれをな。";
			next;
			mes "[アルフリッグ]";
			mes "わしは、もう一度あの光を見たい！";
			mes "しかしそのためには、憎たらしいロキと";
			mes "オーディンのせいで眠りについた";
			mes "兄弟を全員、目覚めさせねばなるまい。";
			next;
			mes "[アルフリッグ]";
			mes "ふん、ヘイムダルの奴めも忌々しい！";
			mes "いいか、わしら兄弟を";
			mes "全員起こすんじゃ！";
			mes "そして、世の中にもう一度";
			mes "神々の武具を生み出すのじゃ！";
			next;
			mes "[アルフリッグ]";
			mes "さあ、神と巨人が気付く前に";
			mes "我が弟ドヴァリンを起こすのじゃ!!";
			set GOD_3QUE,41;
			close2;
			hideonnpc "アルフリッグ#1";
			end;
		}
	}
	else if(GOD_3QUE == 41) {
		mes "[アルフリッグ]";
		mes "どうしてまだここにいる？";
		mes "ドヴァリンを起こしてこい！";
		next;
		switch(select("ドヴァリンはどこにいるの？","ブリーシンガメンをもっと知りたい")) {
		case 1:
			mes "[アルフリッグ]";
			mes "おお、そうかそうか。";
			mes "かわいそうなわしの弟、ドヴァリン……";
			mes "どこで眠っておったかな……？";
			next;
			mes "[アルフリッグ]";
			mes "わしらは女神を辱しめたという理由で";
			mes "オーディンとヘイムダルに罰せられた。";
			mes "しかし、全てはフレイヤ様の虚栄心と";
			mes "ロキのいたずらで起こったこと";
			mes "じゃがな……";
			next;
			mes "[アルフリッグ]";
			mes "……わしらは女神が歩いた道に";
			mes "隠れた。まあ、わしらは";
			mes "わしらが愛した女神の足元で";
			mes "眠りについたという訳じゃ……";
			next;
			mes "[アルフリッグ]";
			mes "ドヴァリンは、東の一本道の方に";
			mes "いるはずじゃ。女神の香りが";
			mes "留まっている場所じゃ。";
			break;
		case 2:
			mes "[アルフリッグ]";
			mes "ブリーシンガメンは、わしら";
			mes "兄弟が心血を注ぎ、作り出した";
			mes "美しい首飾りのことじゃ。";
			mes "あれ程のもの、再び全く同じに";
			mes "作れるかどうか、正直わからん。";
			next;
			mes "[アルフリッグ]";
			mes "……ドワーフが女神を愛したのは";
			mes "過ちだったのだろうか？";
			mes "フレイヤ様はオーディンだけでなく、";
			mes "全ての神々が愛する女神だったがのう。";
			next;
			mes "[アルフリッグ]";
			mes "……本物のブリーシンガメンに";
			mes "挑戦はできぬが……悪くない話じゃ。";
			mes "カッカッカ……";
			next;
			mes "[アルフリッグ]";
			mes "女神の力を抱く風と水に宝石……";
			mes "すべての力が解放される時！";
			mes "わーっはっはっは!!";
			mes "その時が楽しみじゃわい！";
			next;
			mes "[アルフリッグ]";
			mes "ドヴァリンは東の一本道に眠っておる。";
			mes "女神の香りが留まる、あの場所にな！";
			next;
			mes "[アルフリッグ]";
			mes "……わしらは女神が歩いた道に";
			mes "隠れた。まあ、わしらは";
			mes "わしらが愛した女神の足元で";
			mes "眠りについたという訳じゃ……";
			next;
			mes "[アルフリッグ]";
			break;
		}
		mes "あと二人の弟については、";
		mes "残念じゃが覚えておらん。";
		mes "そしてこの歌は覚えていけ。";
		next;
		mes "[アルフリッグ]";
		mes "^4d4dff風に乗りし芳香に";
		mes "歩むたび流れるその涙に";
		mes "魅惑に震えるその赤き唇に";
		mes "我らは身も心も";
		mes "その全てを与えん。^000000";
		set GOD_3QUE,42;
		close2;
		hideonnpc "アルフリッグ#1";
		end;
	}
	else if(GOD_3QUE == 42) {
		mes "[アルフリッグ]";
		mes "はやく！";
		mes "ロキ！　ヘイムダル！　オーディン！";
		mes "奴らが気がつく前に、ドヴァリンを";
		mes "起こしてくれ!!";
		close2;
		hideonnpc "アルフリッグ#1";
		end;
	}
	else if(GOD_3QUE > 42 && GOD_3QUE < 48) {
		mes "[アルフリッグ]";
		mes "おお、兄弟が全員目覚めたな！";
		mes "ハッハハハハ！";
		mes "人間の作る未来は楽しみじゃのう！";
		close2;
		hideonnpc "アルフリッグ#1";
		end;
	}
	mes "[アルフリッグ]";
	mes "………………";
	mes "……お前に用はない。";
	close2;
	hideonnpc "アルフリッグ#1";
	end;
OnInit:
	hideonnpc "アルフリッグ#1";
	end;
}

prt_fild02.gat,185,269,0	script	 #brisindwarf2	111,3,3,{
	if($GodMagingiorde < 50 || $GodBrysinggamen >= 100) {
		mes "- 平凡な岩だ。 -";
		close;
	}
	if(GOD_3QUE > 41) {
		mes "- 木々が茂って、陰が一番濃く";
		mes "なっている場所に硬い岩がある。";
		mes "その岩の中央は平たくなっている。 -";
		next;
		switch(select("押してみる","手で表面をふいてみる","指で表面をこすってみる","手の平で叩いてみる")) {
		case 1:
			mes "- 平らな部分を押すと";
			mes "岩が動いて穴ができた。";
			mes "……入ってみよう。 -";
			close2;
			warp "prt_fild02.gat",165,224;
			end;
		case 2:
			mes "- 表面の土や苔を手の平で";
			mes "ふいてみた。すると、苔で";
			mes "見えなかったトゲで手を";
			mes "切ってしまった。 -";
			emotion 0,"";
			next;
			mes "["+strcharinfo(0)+"]";
			mes "イタッ！";
			mes "血が出ちゃった……";
			close;
		case 3:
			mes "- 指で表面をこすってみた。";
			mes "デコボコしているが、よく";
			mes "見てみると、何かが刻まれている";
			mes "ようだ。表面の苔を取って";
			mes "更に調べてみると、かすかに";
			mes "文字が見える。 -";
			next;
			mes "["+strcharinfo(0)+"]";
			mes "何かのパズル？";
			mes "もしかして、アルフリッグが";
			mes "言っていたもの……？";
			mes "よし、文章を作ってみよう。";
			next;
			switch(select("歩むたびに流れるその涙に","風に乗りし芳香に","我らは身も心も","魅惑に震えるその赤き唇に","その全てを与えん")) {
			case 1:
				mes "["+strcharinfo(0)+"]";
				mes "歩むたびに流れるその涙に";
				break;
			case 2:
				mes "["+strcharinfo(0)+"]";
				mes "風に乗りし芳香に";
				set '@point,'@point + 1;
				break;
			case 3:
				mes "["+strcharinfo(0)+"]";
				mes "我らは身も心も";
				break;
			case 4:
				mes "["+strcharinfo(0)+"]";
				mes "魅惑に震えるその赤き唇に";
				break;
			case 5:
				mes "["+strcharinfo(0)+"]";
				mes "その全てを与えん";
				break;
			}
			switch(select("歩むたびに流れるその涙に","風に乗りし芳香に","我らは身も心も","魅惑に震えるその赤き唇に","その全てを与えん")) {
			case 1:
				mes "歩むたびに流れるその涙に";
				set '@point,'@point + 1;
				break;
			case 2:
				mes "風に乗りし芳香に";
				break;
			case 3:
				mes "我らは身も心も";
				break;
			case 4:
				mes "魅惑に震えるその赤き唇に";
				break;
			case 5:
				mes "その全てを与えん";
				break;
			}
			switch(select("歩むたびに流れるその涙に","風に乗りし芳香に","我らは身も心も","魅惑に震えるその赤き唇に","その全てを与えん")) {
			case 1:
				mes "歩むたびに流れるその涙に";
				break;
			case 2:
				mes "風に乗りし芳香に";
				break;
			case 3:
				mes "我らは身も心も";
				break;
			case 4:
				mes "魅惑に震えるその赤き唇に";
				set '@point,'@point + 1;
			case 5:
				mes "その全てを与えん";
				break;
			}
			switch(select("歩むたびに流れるその涙に","風に乗りし芳香に","我らは身も心も","魅惑に震えるその赤き唇に","その全てを与えん")) {
			case 1:
				mes "歩むたびに流れるその涙に";
				break;
			case 2:
				mes "風に乗りし芳香に";
				break;
			case 3:
				mes "我らは身も心も";
				set '@point,'@point + 1;
				break;
			case 4:
				mes "魅惑に震えるその赤き唇に";
				break;
			case 5:
				mes "その全てを与えん";
				break;
			}
			switch(select("歩むたびに流れるその涙に","風に乗りし芳香に","我らは身も心も","魅惑に震えるその赤き唇に","その全てを与えん")) {
			case 1:
				mes "歩むたびに流れるその涙に";
				break;
			case 2:
				mes "風に乗りし芳香に";
				break;
			case 3:
				mes "我らは身も心も";
				break;
			case 4:
				mes "魅惑に震えるその赤き唇に";
				break;
			case 5:
				mes "その全てを与えん";
				set '@point,'@point + 1;
				break;
			}
			next;
			if('@point > 4) {
				hideoffnpc "ドヴァリン#1";
				mes "[ドヴァリン]";
				mes "おお!!";
				mes "アルフリッグか?!";
				close;
			}
			mes "- ……何も起きなかった。 -";
			close;
		case 4:
			mes "["+strcharinfo(0)+"]";
			mes "ゴホンゴホン！";
			mes "ゴホッ、ほこりがっ……";
			close;
		}
	}
	mes "- 岩の表面にびっしりと";
	mes "苔が生えている。 -";
	close;
OnTouch:
	if(GOD_3QUE > 41) {
		emotion 0;
	}
	end;
}

prt_fild02.gat,185,270,3	script	ドヴァリン#1	826,{
	if(GOD_3QUE > 43) {
		mes "[ドヴァリン]";
		mes "……お前、なぜわしらを起こす？";
		mes "なぜブリーシンガメンの力を望む？";
		mes "これだけは肝に銘じておけ。";
		mes "わしらのブリーシンガメンは";
		mes "フレイヤ様のためにのみ存在する。";
		next;
		mes "[ドヴァリン]";
		mes "……人々はわしらが首飾りをエサに";
		mes "フレイヤ様をだましたと言う。";
		mes "だが、解って欲しい。";
		mes "わしらは純粋に女神を愛したのだ。";
		close2;
		hideonnpc "ドヴァリン#1";
		end;
	}
	else if(GOD_3QUE == 42) {
		mes "[ドヴァリン]";
		mes "なんだ?!";
		mes "アルフリッグではないな！";
		mes "お前は何者だ？";
		mes "言わなければ、その首はねてくれる!!";
		next;
		switch(select("助けて!!","アルフリッグに頼まれました!!")) {
		case 1:
			mes "[ドヴァリン]";
			mes "とっとと消えろ!!";
			close2;
			hideonnpc "ドヴァリン#1";
			end;
		case 2:
			mes "[ドヴァリン]";
			mes "あ……兄貴が？";
			mes "何だと？";
			mes "ブリーシンガメン?!";
			mes "フレイヤ様とまた会えるのか?!";
			next;
			mes "["+strcharinfo(0)+"]";
			mes "いえ、そうではなくて……";
			next;
			mes "[ドヴァリン]";
			mes "……そうか。";
			mes "……………………";
			mes "フレイヤ様と再び会えなくとも";
			mes "せめてブリーシンガメンだけでも";
			mes "再び見られるのなら……";
			next;
			mes "[ドヴァリン]";
			mes "但し、あくまでブリーシンガメンの";
			mes "偽物を作るのならば構わぬ。";
			mes "だが偽物とはいえ、女神の力は宿る。";
			mes "もちろん、わしらの力は必要だ。";
			next;
			mes "[ドヴァリン]";
			mes "………………";
			mes "わしは、再びこの世に目覚めて";
			mes "彼女の愛を求めても良いのだろうか……";
			next;
			mes "[ドヴァリン]";
			mes "……わからん。";
			mes "しかし、わしは知りたい。";
			mes "神の力を持ち得た人間がどうなるのか。";
			next;
			mes "[ドヴァリン]";
			mes "アルフリッグが協力するのなら";
			mes "わしも協力しよう。";
			mes "よし、お前に、弟ベーリングのことを";
			mes "教えよう。";
			next;
			mes "[ドヴァリン]";
			mes "わしらは、自らフレイヤ様の通った道に";
			mes "隠れた。ここは、過去にフレイヤ様が";
			mes "歩いた小さな一本道。";
			next;
			mes "[ドヴァリン]";
			mes "静かに流れる空気は、あの頃のまま";
			mes "フレイヤ様の香りを残している。";
			mes "この風に彼女の力を感じる……";
			mes "お前ら人間もそういう力を";
			mes "欲するのだろう。";
			next;
			mes "[ドヴァリン]";
			mes "わしは神が嫌いだ。";
			mes "巨人も嫌いだ。";
			mes "だが、人間はそれ程嫌いじゃない。";
			mes "お前らは破壊、そして再生だからな。";
			next;
			mes "[ドヴァリン]";
			mes "わしらが目覚めることで生み出される";
			mes "ものが、どのようになるのか知りたい。";
			next;
			mes "[ドヴァリン]";
			mes "ミョルニール山脈に連なる場所……";
			mes "ここから西、フレイヤ様の涙が";
			mes "たまる場所にベーリングが眠っている。";
			next;
			mes "[ドヴァリン]";
			mes "水の中から声が聞こえたら";
			mes "応えるがいい。";
			mes "合言葉？　正確には知らん。";
			mes "合言葉のヒント？";
			mes "それはオーディンがフレイヤ様に";
			mes "下した命令だ。";
			next;
			mes "[ドヴァリン]";
			mes "ヴァルキリーらがヴァルハラへ";
			mes "連れて行った者達……彼らは";
			mes "安らかな眠りにつくことも";
			mes "新たな生を得ることも出来ない。";
			mes "わしが言えるのはここまでだ。";
			next;
			mes "[ドヴァリン]";
			mes "あとはお前が考えることだ。";
			mes "その鍵とは一体なにか……";
			mes "ハハハッ!!";
			set GOD_3QUE,43;
			close2;
			hideonnpc "ドヴァリン#1";
			end;
		}
	}
	else if(GOD_3QUE == 43) {
		mes "[ドヴァリン]";
		mes "なぜそう何度も呼び出すんだ？";
		mes "わしはもう役目を果たした。";
		mes "既にお前には鍵の欠片を与えた。";
		mes "それを使うも捨てるもお前次第だ。";
		next;
		mes "[ドヴァリン]";
		mes "ベーリングを起こすがいい。";
		mes "フフ……ヒヒ……";
		close2;
		hideonnpc "ドヴァリン#1";
		end;
	}
	end;
OnInit:
	hideonnpc "ドヴァリン#1";
	end;
}

mjolnir_09.gat,85,129,0	script	 #brisindwarf3	111,3,3,{
	if($GodMagingiorde < 50 || $GodBrysinggamen >= 100) {
		mes "- 綺麗な水だ。-";
		mes "- 眺めているだけで涼む。 -";
		close;
	}
	if(GOD_3QUE > 42 && GOD_3QUE < 50) {
		misceffect 116;
		mes "[小さな声]";
		mes "……確認……確認……";
		mes "……アルフリッグ……確認";
		mes "……ドヴァリン……確認";
		mes "定められし運命の歯車が";
		mes "動き出しました。";
		next;
		mes "[小さな声]";
		mes "君、答えてください。";
		mes "オーディンは、美しいフレイヤに";
		mes "命じました。そのためフレイヤは";
		mes "人間に魔法をかけなければ";
		mes "いけませんでした。";
		next;
		mes "[小さな声]";
		mes "女神フレイヤの魔法によって";
		mes "死んでも再び生き返り、";
		mes "永遠に争いを繰り返した人間は";
		mes "果たして何人でしょう？";
		next;
		if(select("20人だ！","わからない……","40人だ！","42人だ！") != 4) {
			misceffect 116;
			mes "[小さな声]";
			mes "…………";
			mes "エラー。エラー。";
			close;
		}
		misceffect 116;
		mes "[小さな声]";
		mes "…………認識。";
		mes "解除、召喚。";
		next;
		hideoffnpc "ベーリング#1";
		mes "[ベーリング]";
		mes "プハー！　溺れ死ぬかと思った！";
		mes "わしを起こしたのは誰だ？";
		close;
	}
	mes "- 青く澄んだ冷たい水だ。-";
	close;
OnTouch:
	if(GOD_3QUE > 42) {
		emotion 0;
	}
	end;
}

mjolnir_09.gat,87,129,3	script	ベーリング#1	826,{
	if(GOD_3QUE > 44) {
		mes "[ベーリング]";
		mes "とうとうわしら兄弟が目覚めるのか……";
		mes "フハハハハハッ!!";
		mes "再びフレイヤ様を、かの美しき女神を";
		mes "感じることができる……";
		next;
		mes "[ベルリン]";
		mes "君のおかげだ。";
		mes "ハハハ……";
		mes "君ら人間の願いが叶い、";
		mes "強い力を手に入れることが";
		mes "できるといいな。頑張れよ！";
		close2;
		hideonnpc "ベーリング#1";
		end;
	}
	else if(GOD_3QUE == 43) {
		mes "[ベーリング]";
		mes "何だ……うわぁぁぁぁ!!";
		mes "何の……いやぁぁぁぁ!!";
		mes "それより君は何者だ？";
		next;
		switch(select("ドヴァリンにあなたを起こせと言われた","そういうあなたは誰？")) {
		case 1:
			mes "[ベーリング]";
			mes "……何だって？";
			mes "ドヴァリンだって?!";
			mes "あいつが起きたってことは、";
			mes "アルフリッグも起きたのか？";
			mes "なんで？　どうして??";
			next;
			mes "["+strcharinfo(0)+"]";
			mes "あの、カクカクシカジカ……";
			mes "このようなことがありまして、";
			mes "あなた達兄弟が全員目覚めたら";
			mes "フレイヤ様の力が宿った";
			mes "ブリーシンガメンを作れると";
			mes "教えられました。";
			next;
			mes "[ベーリング]";
			mes "おお、何と!!";
			mes "フレイヤ様……わしの体も魂も、";
			mes "全てを持ち去った美しき女神よ！";
			mes "わしらが彼女に捧げた、あの輝く";
			mes "首飾りを再び作るというのか……？";
			next;
			mes "[ベーリング]";
			mes "フハハハハハッ！";
			mes "全神々の力を得たとしても、";
			mes "全く同じものを作ることはできん。";
			next;
			menu "いえ、そうじゃなくて……",-;
			mes "[ベーリング]";
			mes "ああ～!!　分かった。";
			mes "そういうことか。フレイヤ様の";
			mes "ブリーシンガメンそっくりに作る";
			mes "人間用のブリーシンガメンか。";
			mes "それでもその威力は";
			mes "凄まじいだろう……";
			next;
			mes "[ベーリング]";
			mes "…………ああ、フレイヤ様。";
			mes "髪の先まで美しかったフレイヤ様……";
			mes "彼女をわずかにでも感じることが";
			mes "できのであれば、わしは喜んで";
			mes "手伝おう。";
			next;
			mes "[ベーリング]";
			mes "彼女を感じられるものが多ければ";
			mes "多いほど、わしの心は躍る。";
			mes "わしの手は、彼女を飾るためなら";
			mes "何でも作り上げるだろう。";
			next;
			mes "[ベーリング]";
			mes "人間にも、フレイヤ様のそのまぶしい";
			mes "美しさを見せてやりたいわい。";
			mes "そのためなら、わしはどんな労力も";
			mes "惜しまん。";
			next;
			mes "[ベーリング]";
			mes "わしらの、最後の兄弟を起こしてくれ！";
			mes "かわいそうなグレール……";
			mes "まだ女神のために採掘を続けて";
			mes "いるのだろう……崩れた坑道で";
			mes "掘り続けているのだろう……";
			next;
			mes "[ベーリング]";
			mes "グレールの目を覚ましてくれ。";
			mes "君に、女神が流した黄金の涙を";
			mes "あげよう。グレールなら、きっと";
			mes "分かってくれるだろう……";
			next;
			mes "[ベーリング]";
			mes "もし、彼が君を信じないようなら";
			mes "この歌を唄ってくれ。";
			mes "いいか？";
			next;
			mes "[ベーリング]";
			mes "^4d4dffその麗しき髪はどの金属でも真似られぬ^000000";
			next;
			mes "[ベーリング]";
			mes "^4d4dff鉄を打つ槌は我らの心臓をも叩く^000000";
			next;
			mes "[ベーリング]";
			mes "^4d4dffその指先は願う、輝く首飾りを^000000";
			next;
			mes "[ベーリング]";
			mes "^4d4dff我らは願う、美しき愛の女神を^000000";
			next;
			mes "[ベーリング]";
			mes "^4d4dff我らは四日四晩、幸せであった^000000";
			next;
			mes "[ベーリング]";
			mes "覚えたか？";
			mes "グレールが愛してやまない";
			mes "女神の涙の歌だ。";
			mes "頼む、グレールの目を覚ましてくれ！";
			misceffect 84,"";
			set GOD_3QUE,44;
			close2;
			hideonnpc "ベーリング#1";
			end;
		case 2:
			mes "[ベーリング]";
			mes "いやいやいや、何のことですか？";
			mes "ドワーフ違いですよ！";
			mes "わし？";
			mes "すまんが、知らない奴に";
			mes "教える名前などない！";
			next;
			mes "["+strcharinfo(0)+"]";
			mes "あの、でも……";
			next;
			mes "[ベーリング]";
			mes "ええいっ!!";
			mes "知らん知らん!!";
			close2;
			hideonnpc "ベーリング#1";
			end;
		}
	}
	else if(GOD_3QUE == 44) {
		mes "[ベーリング]";
		mes "歌を忘れたのか？";
		mes "また教えてやるから、";
		mes "きちんと覚えろよ。";
		next;
		mes "[ベーリング]";
		mes "^4d4dffその麗しき髪はどの金属でも真似られぬ^000000";
		next;
		mes "[ベーリング]";
		mes "^4d4dff鉄を打つ槌は我らの心臓をも叩く^000000";
		next;
		mes "[ベーリング]";
		mes "^4d4dffその指先は願う、輝く首飾りを^000000";
		next;
		mes "[ベーリング]";
		mes "^4d4dff我らは願う、美しき愛の女神を^000000";
		next;
		mes "[ベーリング]";
		mes "^4d4dff我らは四日四晩、幸せであった^000000";
		close2;
		hideonnpc "ベーリング#1";
		end;
	}
	end;
OnInit:
	hideonnpc "ベーリング#1";
	end;
}

mjo_dun02.gat,126,36,0	script	 #brisindwarf4	111,3,3,{
	if($GodMagingiorde < 50 || $GodBrysinggamen >= 100) {
		mes "["+strcharinfo(0)+"]";
		mes "道が途切れている……";
		close;
	}
	if(GOD_3QUE > 45 && GOD_3QUE < 50) {
		mes "[グレール]";
		mes "わしを呼んだか？";
		hideoffnpc "グレール#1";
		close;
	}
	else if(GOD_3QUE == 45) {
		mes "- 証明しろ、という声と共に";
		mes "小さな木炭が一つ降ってきた。";
		mes "何かを書けというのか……？ -";
		next;
		mes "["+strcharinfo(0)+"]";
		mes "ん？";
		mes "何か文字を書くところがある。";
		mes "ちょっと書いてみよう。";
		mes "では、まずは……";
		next;
		input '@song1$;
		if('@song1$ == "その麗しき髪はどの金属でも真似られぬ")
			set '@point,'@point + 1;
		mes "["+strcharinfo(0)+"]";
		mes " " + '@song1$;
		mes "で……";
		mes "次は……";
		next;
		input '@song2$;
		if('@song2$ == "鉄を打つ槌は我らの心臓をも叩く")
			set '@point,'@point + 1;
		mes "["+strcharinfo(0)+"]";
		mes " " + '@song2$;
		mes "で……";
		mes "三番目は……";
		next;
		input '@song3$;
		if('@song3$ == "その指先は願う、輝く首飾りを")
			set '@point,'@point + 1;
		mes "["+strcharinfo(0)+"]";
		mes " " + '@song3$;
		mes "で……";
		mes "四番目は……";
		next;
		input '@song4$;
		if('@song4$ == "我らは願う、美しき愛の女神を")
			set '@point,'@point + 1;
		mes "["+strcharinfo(0)+"]";
		mes " " + '@song4$;
		mes "で……";
		mes "五番目は……";
		next;
		input '@song5$;
		if('@song5$ == "我らは四日四晩、幸せであった")
			set '@point,'@point + 1;
		mes "["+strcharinfo(0)+"]";
		mes " " + '@song5$;
		mes "だな。";
		mes "よし、もう一度確認してみよう。";
		next;
		mes "["+strcharinfo(0)+"]";
		mes '@song1$;
		mes '@song2$;
		mes '@song3$;
		mes '@song4$;
		mes '@song5$;
		next;
		if('@point > 4) {
			hideoffnpc "グレール#1";
			mes "[グレール]";
			mes "ほう～、確かに。";
			set GOD_3QUE,46;
			stopnpctimer;
			close;
		}
		mes "[グレール]";
		mes "……違う!!";
		mes "信用できん。";
		close2;
		warp "mjo_dun02.gat",118,56;
		end;
	}
	mes "- 石炭と土砂が固まっている…… -";
	close;
OnTouch:
	if($GodMagingiorde < 50 || $GodBrysinggamen >= 100) {
		mes "["+strcharinfo(0)+"]";
		mes "道が途切れている……";
		close;
	}
	if(GOD_3QUE == 44) {
		emotion 0,"";
		mes "[男の声]";
		mes "ち、近づくな!!";
		mes "何故、お前からフレイヤ様の";
		mes "ぬくもりが感じられるのだ!?";
		next;
		switch(select("ベーリングがこれをくれました","うわ、びっくりした……")) {
		case 1:
			mes "[男の声]";
			mes "う……こ、これは……";
			mes "兄ベーリングが眠る泉にあった";
			mes "彼女のぬくもり……？";
			mes "ぬ、ならば、それを証明してみろ！";
			set GOD_3QUE,45;
			initnpctimer;
			close;
		case 2:
			mes "[男の声]";
			mes "立ち去れ!!";
			close;
		}
	}
	else if(GOD_3QUE == 45) {
		mes "[男の声]";
		mes "証明してみろと言っただろう？";
		mes "それとも出来ないのか？";
		mes "……わしは銀を掘らなければ……";
		mes "銀を……";
		initnpctimer;
		close;
	}
	warp "mjo_dun02.gat",118,56;
	end;

OnTimer1000:
	announce "グレール:さっさと来ないと、追い出すぞ。早くするのじゃ！",0x9,0x70dbdb;
	end;
OnTimer240000:
	announce "グレール:待ちくたびれたのう。",0x9,0x70dbdb;
	end;
OnTimer298000:
	announce "さよならじゃ、人間。",0x9,0x70dbdb;
	end;
OnTimer300000:
	hideoffnpc "#廃鉱ワープbri";
	hideonnpc "グレール#1";
	hideonnpc "#廃鉱ワープbri";
	end;
OnTimer301000:
	stopnpctimer;
	end;
}

mjo_dun02.gat,124,36,0	script	 #廃鉱ワープbri	139,2,2,{
	warp "mjo_dun02.gat",118,56;
	end;
}

mjo_dun02.gat,126,34,1	script	グレール#1	826,{
	if(GOD_3QUE > 47) {
		mes "[グレール]";
		mes "兄弟の予言通り、";
		mes "いつかブリーシンガメンは";
		mes "人間らの前に現われる。";
		mes "さて、ワシは銀細工でもするかのう。";
		mes "フハハハハッ……";
		close2;
		hideonnpc "グレール#1";
		end;
	}
	else if(GOD_3QUE == 46) {
		mes "[グレール]";
		mes "わしはグレール。";
		mes "フハハハハッ……";
		mes "わしでラストのようじゃな。";
		mes "おや、まだ銀を見つけていないのか。";
		next;
		mes "[グレール]";
		mes "ほう～、女神には黄金がいいじゃと？";
		mes "ふむ、確かにその光は素敵じゃ。";
		mes "でもな、彼女を引き立たせるには";
		mes "銀のようなかすかな光がよい。";
		mes "その方が彼女の金髪はより輝くのじゃ。";
		next;
		mes "[グレール]";
		mes "フハハハハッ……人間";
		mes "面白ことをしてるのう。";
		mes "ああ、人間の仕業ではないが、";
		mes "彼女の面影を感じられるのは";
		mes "よいことじゃ。";
		next;
		mes "[グレール]";
		mes "兄弟がこれですべて集まるのう。";
		mes "ありがとう、人間よ。";
		mes "いつか君らも、神の権威に挑戦する";
		mes "屈強な力というものが判るだろう。";
		next;
		mes "[グレール]";
		mes "では、銀細工をするか。";
		mes "もちろん単に輝く首飾りなんか";
		mes "じゃない。見る者全てをひきつけ、";
		mes "それ自体から美しさがにじみ出る";
		mes "素晴らしい物をじゃ。";
		next;
		mes "[グレール]";
		mes "……もう用は済んだじゃろ？";
		mes "即座に立ち去るがよい！";
		set GOD_3QUE,47;
		close2;
		hideonnpc "グレール#1";
		end;
	}
	else if(GOD_3QUE == 47) {
		mes "[グレール]";
		mes "フハハハハッ……";
		mes "まだいたのか。";
		mes "話はもう済んだじゃろう？";
		mes "これ以上ここにしても無駄じゃ。";
		mes "即座に立ち去るがよい！";
		close2;
		hideonnpc "グレール#1";
		end;
	}
	mes "[グレール]";
	mes "何者じゃ?!";
	close2;
	hideonnpc "グレール#1";
	end;
OnInit:
	hideonnpc "グレール#1";
	end;
}

//============================================================
// 神器4次 ミョルニールの封印クエスト
//- Registry -------------------------------------------------
// GOD_4QUE -> 0～11
// GOD_4QUE_SUB1 ～ GOD_4QUE_SUB4 -> 各ドワーフ進行
//------------------------------------------------------------
prontera.gat,124,297,3	script	シアルビィ	706,{
	if(checkitemblank() == 0) {
		mes "- 所持アイテムの種類数が -";
		mes "- 多いため、アイテムを受けとる -";
		mes "- ことができません。 -";
		mes "- 所持アイテムを減らしてから -";
		mes "- 再度話しかけてください。 -";
		close;
	}
	if(MaxWeight - Weight < 5000) {
		mes "- 所持重量が多いため、アイテムを -";
		mes "- 受けとることができません。 -";
		mes "- 所持アイテムを減らしてから -";
		mes "- 再度話しかけてください。 -";
		close;
	}
	if($GodBrysinggamen < 50) {
		cutin "god_tialpi01",2;
		mes "[シアルビィ]";
		mes "聞こえます……この大陸のどこかで";
		mes "大きな力が現れようとしています……";
		mes "信じられません！";
		mes "なにかが起ころうとしています！";
		next;
		mes "[シアルビィ]";
		mes "でも……まだもう少し時間はかかりそう";
		mes "です。いったい、何が起ころうとして";
		mes "いるのでしょう……。果たして、これは";
		mes "良いことなのか……悪いことなのか……";
		close2;
		cutin "god_tialpi01",255;
		end;
	}
	if(GOD_4QUE == 11) {
		cutin "god_tialpi01",2;
		mes "[シアルビィ]";
		mes "僕の夢が、夢でなくなるのですね……";
		mes "トール様の雷が降る日を楽しみに";
		mes "しています。";
	}
	else if(GOD_4QUE == 10) {
		if(countitem(756) < 50 || countitem(757) < 50) {
			cutin "god_tialpi01",2;
			mes "[シアルビィ]";
			mes "オリデオコン原石とエルニウム原石を";
			mes "50個ずつお願いできますか。";
			mes "よろしくお願いします。";
			close2;
			cutin "god_tialpi01",255;
			end;
		}
		set '@gift,0;
		if(getbaseclass(Class,2) == CLASS_KN) {
			set '@gift,1;
		}
		else if(getbaseclass(Class,2) == CLASS_PR) {
			set '@gift,2;
		}
		else if(getbaseclass(Class,2) == CLASS_WZ){
			set '@gift,3;
		}
		else if(getbaseclass(Class,2) == CLASS_BS){
			set '@gift,4;
		}
		else if(getbaseclass(Class,2) == CLASS_HT){
			set '@gift,5;
		}
		else if(getbaseclass(Class,2) == CLASS_AS){
			set '@gift,6;
		}
		else if(getbaseclass(Class,2) == CLASS_CR){
			set '@gift,7;
		}
		else if(getbaseclass(Class,2) == CLASS_MO){
			set '@gift,8;
		}
		else if(getbaseclass(Class,2) == CLASS_SA){
			set '@gift,9;
		}
		else if(getbaseclass(Class,2) == CLASS_AM){
			set '@gift,10;
		}
		else if(getbaseclass(Class,2) == CLASS_RG){
			set '@gift,11;
		}
		else if(getbaseclass(Class,2) == CLASS_BA){
			set '@gift,12;
		}
		else if(getbaseclass(Class,2) == CLASS_DC){
			set '@gift,13;
		}
		else {
			set '@gift,rand(1,13);
		}
		cutin "god_tialpi01",2;
		mes "[シアルビィ]";
		mes "お礼に、当家に伝わる宝物を差し上げ";
		mes "ます。ご先祖様も、きっと許して";
		mes "くれると思いますし。";
		next;
		mes "[シアルビィ]";
		mes "では、選んでください。";
		mes "自分のために役立つものが良いですか？";
		mes "他の人のために役立てたいですか？";
		next;
		switch(select("自分のため","他の人のため")) {
		case 1:
			mes "[シアルビィ]";
			mes "わかりました。";
			mes "冒険者様の役に立つものですね。";
			mes "うーん、どれがいいかな？";
			mes "これはどうだろう？";
			mes "いや、こっちの方が……";
			break;
		case 2:
			set '@gift,rand(1,13);
			mes "[シアルビィ]";
			mes "わかりました。他の人のためだなんて";
			mes "なんて良い人なんでしょう。";
			mes "うーん、どれがいいかな？";
			mes "これはどうだろう？";
			mes "いや、こっちの方が……";
			break;
		}
		next;
		mes "[シアルビィ]";
		mes "…………";
		mes "うん、これがいいでしょう。";
		next;
		delitem 756,50;
		delitem 757,50;
		set GOD_4QUE,11;
		if('@gift == 1) {
			getitem 1471,1; // ヘルファイア
		}
		else if('@gift == 2) {
			getitem 1526,1; // スラッシュ
		}
		else if('@gift == 3) {
			getitem 1231,1; // バゼラルド
		}
		else if('@gift == 4) {
			getitem 1367,1; // スローター
		}
		else if('@gift == 5) {
			getitem 1722,1; // バリスタ
		}
		else if('@gift == 6) {
			getitem 1230,1; // 錐
		}
		else if('@gift == 7) {
			getitem 1141,1; // 無形剣
		}
		else if('@gift == 8) {
			getitem 1813,1; // カイザーナックル
		}
		else if('@gift == 9) {
			getitem 1557,1; // 黙示録
		}
		else if('@gift == 10) {
			getitem 1235,1; // アゾート
		}
		else if('@gift == 11) {
			getitem 1227,1; // ウィーダーナイフ
		}
		else if('@gift == 12) {
			getitem 1913,1; // エレキギター
		}
		else if('@gift == 13) {
			getitem 1963,1; // ラプチャーローズ
		}
		cutin "god_tialpi01",2;
		mes "[シアルビィ]";
		mes "お疲れ様でした。";
		mes "どうか、これをお役立てください。";
		next;
		mes "[シアルビィ]";
		mes "今一度、この世でトール様の雷が";
		mes "見られる日が来ますように……";
		mes "僕の夢が、ただの夢で終わりません";
		mes "ように……";
	}
	else if(GOD_4QUE_SUB1 == 2 && GOD_4QUE_SUB2 == 2 && GOD_4QUE_SUB3 == 2 && GOD_4QUE_SUB4 == 2) {
		if(GodMjolnir >= 100) {
			cutin "god_tialpi01",2;
			mes "[シアルビィ]";
			mes "聞こえます……この大陸のどこかで";
			mes "大きな力が現われようとしています……";
			mes "信じられません！";
			mes "なにかが起ころうとしています！";
			close2;
			cutin "god_tialpi01",255;
			end;
		}
		cutin "god_tialpi01",2;
		mes "[シアルビィ]";
		mes "四人の鍛冶屋に会ったのですね。";
		mes "気難しい方達だと聞いているのですが…";
		mes "そんな方達とお話ししてこれたなんて、";
		mes "やっぱり冒険者様は凄い方です！";
		next;
		mes "[シアルビィ]";
		mes "僕の夢は実現するのでしょうか？";
		mes "トール様のミョルニールが、本当に";
		mes "現われようとしているのでしょうか？";
		next;
		mes "[シアルビィ]";
		mes "頼みを聞いてくれて、本当にありがとう";
		mes "ございます。大したものではありません";
		mes "が、当家に伝わる宝物を差し上げます。";
		mes "しかし、これは当家先祖代々の品なので";
		mes "上げるとなると、他の親族にも相談";
		mes "しないと……。";
		next;
		mes "[シアルビィ]";
		mes "冒険者様、僕が親戚のみんなに";
		mes "相談している間、";
		mes "オリデオコン原石を50個、";
		mes "エルニウム原石を50個";
		mes "準備してもらえませんか？";
		next;
		mes "[シアルビィ]";
		mes "あ、いえ。もちろん、無理にとは";
		mes "言いませんが。その方が親戚も説得";
		mes "しやすいので、どうかお願いできま";
		mes "せんか？";
		if($GodMjolnir < 100) {		// 受付中
			set $GodMjolnir,$GodMjolnir+1;
			if($GodMjolnir == 50) {
				announce "◆◆大陸に[ミョルニール]の封印が姿を現しました。◆◆",0;
			} else if($GodMjolnir == 100) {
				if($GodSleipnir == 100 && $GodMagingiorde == 100 && $GodBrysinggamen == 100 && $GodMjolnir == 100)
					announce "◆◆[ミョルニール]の封印が解けたことにより全ての封印が解け、神器の作成ができるようになりました。◆◆",0;
				else
					announce "◆◆[ミョルニール]の封印が解けました。◆◆",0;
			}
		}
		set GOD_4QUE,10;
		set GOD_4QUE_SUB1,0;
		set GOD_4QUE_SUB2,0;
		set GOD_4QUE_SUB3,0;
		set GOD_4QUE_SUB4,0;
	}
	else if(GOD_4QUE_SUB1 == 3 || GOD_4QUE_SUB2 == 3 || GOD_4QUE_SUB3 == 3 || GOD_4QUE_SUB4 == 3) {
		cutin "god_tialpi01",2;
		mes "[シアルビィ]";
		mes "ドワーフの鍛冶屋さんを怒らせてしまっ";
		mes "たのですか？　それは良くないです……";
		mes "妹の助言を聞かなかったのですか？";
		mes "ドワーフはとても礼儀にうるさいです。";
		mes "ですから、声を掛ける時は細心の注意が";
		mes "必要です。";
		next;
		mes "[シアルビィ]";
		mes "でも、安心してください。僕達人間が";
		mes "ドワーフ個人個人の区別が難しいように";
		mes "ドワーフも人間の区別が難しいんです。";
		mes "しばらく時間をおいて、もう一度会いに";
		mes "行けば大丈夫でしょう。";
		next;
		mes "[シアルビィ]";
		mes "でも、その前に必ず妹を訪ね、ちゃんと";
		mes "ドワーフのお話を聞いてくださいね。";
		set GOD_4QUE_SUB1,0;
		set GOD_4QUE_SUB2,0;
		set GOD_4QUE_SUB3,0;
		set GOD_4QUE_SUB4,0;
	}
	else if(GOD_4QUE == 1 || GOD_4QUE == 2) {
		cutin "god_tialpi01",2;
		mes "[シアルビィ]";
		mes "よろしくお願いします。";
		mes "頑張ってくださいとしか言えないのが";
		mes "とても悔しいです……";
	}
	else if(GOD_4QUE == 0) {
		if($GodMjolnir >= 100) {
			cutin "god_tialpi01",2;
			mes "[シアルビィ]";
			mes "聞こえます……この大陸のどこかで";
			mes "大きな力が現われようとしています……";
			mes "信じられません！";
			mes "なにかが起ころうとしています！";
			close2;
			cutin "god_tialpi01",255;
			end;
		}
		else if(BaseLevel < 70) {
			cutin "god_tialpi02",2;
			mes "[シアルビィ]";
			mes "僕のご先祖に、トール様の旅のお供を";
			mes "した方がいたそうです。やっぱり、";
			mes "信じられませんよね。だって、人間が";
			mes "神様と一緒に旅したなんて。";
			close2;
			cutin "god_tialpi01",255;
			end;
		}
		cutin "god_tialpi01",2;
		mes "[シアルビィ]";
		mes "冒険者様、冒険者様、僕の話を聞いて";
		mes "ください。昨夜、とっても不思議な夢を";
		mes "見たんです。";
		next;
		mes "[シアルビィ]";
		mes "夢の中で、僕はトール様と一緒でした。";
		mes "その方に仕え、はるか遠い、巨人の";
		mes "大陸へ向かって旅していました。";
		next;
		mes "[シアルビィ]";
		mes "そして、思い出したのです。";
		mes "神々の話、大陸の伝説を……";
		mes "詳しく思い出せないのが残念です。";
		next;
		mes "[シアルビィ]";
		mes "そんな記憶の中に、トール様の武器";
		mes "ミョルニールがありました。";
		mes "その驚くべき能力と、ミョルニールと";
		mes "共にした冒険の記憶……";
		next;
		mes "[シアルビィ]";
		mes "そしてドワーフです。";
		mes "ご存知ですか？　神々の武器はほとんど";
		mes "ドワーフ族が作ったんです。";
		mes "そこで、気になる話が……";
		next;
		mes "[シアルビィ]";
		mes "南に広がる、トール様の武器と同じ";
		mes "名前の山脈……何か関係がないので";
		mes "しょうか？　あと、ミョルニール山脈";
		mes "に、ドワーフの鍛冶屋が住んでいると";
		mes "聞きました。";
		next;
		mes "[シアルビィ]";
		mes "あの、無理な頼みというのは充分";
		mes "承知です。でも、もし良かったら";
		mes "ミョルニール山脈へ行って";
		mes "くれませんか。";
		next;
		mes "[シアルビィ]";
		mes "わかっています、無理を言っている";
		mes "のは。でも僕、これが自分の過去の";
		mes "記憶なのか、夢なのか知りたいんです。";
		mes "どうか、僕の頼みを聞いてください。";
		next;
		switch(select("断る","引き受ける")) {
		case 1:
			cutin "god_tialpi02",2;
			mes "[シアルビィ]";
			mes "……僕のお話を聞いてくれただけでも";
			mes "ありがとうございます。いつかどこかで";
			mes "またお会いできたら嬉しいです。";
			break;
		case 2:
			cutin "god_tialpi01",2;
			mes "[シアルビィ]";
			mes "ありがとうございます！";
			mes "本当にありがとうございます！";
			mes "ああ、冒険者様に会えて良かった！";
			next;
			mes "[シアルビィ]";
			mes "この街の北に、僕の妹が住んでいます。";
			mes "ドワーフについては、僕より詳しいので";
			mes "話を聞きに行ってくれますか？";
			next;
			mes "[シアルビィ]";
			mes "妹に聞けば、どこでドワーフに会ったか";
			mes "教えてくれると思います。冒険者様、";
			mes "どうかよろしくお願い致します。";
			set GOD_4QUE,rand(1,2);
			break;
		}
	}
	close2;
	cutin "god_tialpi02",255;
	end;
}

prt_fild01.gat,196,47,3	script	ロスクヴァ	703,{
	if(GOD_4QUE == 1) {
		mes "[ロスクヴァ]";
		mes "ドワーフの鍛冶屋は、礼儀と規則が";
		mes "大好きです。だから、お話をしたいなら";
		mes "とってもとってもとっても注意して";
		mes "失礼のないように。いいですか？";
		next;
		mes "[ロスクヴァ]";
		mes "今日は太陽の方向がこうだから……";
		mes "東から始めて、北に回ってください。";
		mes "もし何か間違えてしまったら、兄さんを";
		mes "訪ねるといいでしょう。";
		close;
	}
	else if(GOD_4QUE == 2) {
		mes "[ロスクヴァ]";
		mes "ドワーフの鍛冶屋は、礼儀と規則が";
		mes "大好きです。だから、お話をしたいなら";
		mes "とってもとってもとっても注意して";
		mes "失礼のないように。いいですか？";
		next;
		mes "[ロスクヴァ]";
		mes "今日は太陽の方向がこっちだから……";
		mes "北から始めて、東に回ってください。";
		mes "もし何か間違えてしまったら、兄さんを";
		mes "訪ねるといいでしょう。";
		close;
	}
	mes "[ロスクヴァ]";
	mes "ここは、私の両親との思い出の場所。";
	mes "前は、ここにもいっぱい人がいました…";
	mes "楽しいこと、悲しいこと……";
	mes "いっぱいありました。";
	next;
	mes "[ロスクヴァ]";
	mes "父さん母さんも、良くここで色々な人と";
	mes "出会ったと言ってました。でも、その";
	mes "父さんも母さんも、友達も、みんな";
	mes "去って……遠く遠くへ行ってしまい";
	mes "ました……。";
	next;
	mes "[ロスクヴァ]";
	mes "だから……ここが寂しく感じるのかも";
	mes "しれません……";
	close;
}

mjolnir_11.gat,149,247,5	script	ドワーフの鍛冶屋#東	826,{
	if($GodBrysinggamen < 50) {
		mes "[アウストリ]";
		mes "大陸のどこかで、何かが起ころうと";
		mes "しておる……やけにオオカミどもが";
		mes "騒ぎおるわ……";
		close;
	}
	if($GodMjolnir >= 100) {
		mes "[アウストリ]";
		mes "大陸のどこかで、何かが起ころうと";
		mes "しておる……やけにオオカミどもが";
		mes "騒ぎおるわ……";
		close;
	}
	if(GOD_4QUE == 11) {
		mes "[アウストリ]";
		mes "仲間が過去の記憶を探す日、信義ある";
		mes "人間に報いることが出来るはず……";
		mes "その時期は近い……確実に……";
		close;
	}
	else if(GOD_4QUE == 10) {
		mes "[アウストリ]";
		mes "やぁ小僧。何か用か？";
		mes "あの子供の先祖の話だろう。";
		mes "どんな難しい話でも付き合おう。";
		close;
	}
	else if(GOD_4QUE == 1) {
		if(GOD_4QUE_SUB1 == 3 || GOD_4QUE_SUB2 == 3 || GOD_4QUE_SUB3 == 3 || GOD_4QUE_SUB4 == 3) {
			mes "[アウストリ]";
			mes "お前みたいな礼儀知らずと話すこと";
			mes "などない！　とっとと帰れ！";
			close;
		}
		else if(GOD_4QUE_SUB1 == 2) {
			mes "[アウストリ]";
			mes "なんじゃ。";
			mes "これ以上、話す事はないぞ。";
			close;
		}
		else if(GOD_4QUE_SUB2 != 0 || GOD_4QUE_SUB3 != 0 || GOD_4QUE_SUB4 != 0) {
			mes "[アウストリ]";
			mes "何か用か？";
			next;
			switch(select("何でもないです","ドワーフだ……")) {
			case 1:
				mes "[アウストリ]";
				mes "……変な奴じゃ。";
				close;
			case 2:
				mes "[アウストリ]";
				mes "無礼な！";
				mes "とっとと帰れ！";
				set GOD_4QUE_SUB1,3;
				close;
			}
		}
		else if(GOD_4QUE_SUB1 == 1) {
			mes "[アウストリ]";
			mes "何か用か？";
			next;
			switch(select("何でもないです","あの、良ければこれ……")) {
			case 1:
				mes "[アウストリ]";
				mes "……変な奴じゃ。";
				close;
			case 2:
				if(countitem(1005) == 0) {
					mes "[アウストリ]";
					mes "おいおい、もっとはっきり喋らんと";
					mes "聞こえんぞ。鍛冶屋の心が知りたければ";
					mes "それ相応の品を持ってくるんだな。";
					close;
				}
				mes "[アウストリ]";
				mes "おいおい、もっとはっきり喋らんと";
				mes "聞こえんぞ。まぁいい。";
				mes "今日は気分がいい。";
				mes "久しぶりに懐かしい話でもしようか。";
				next;
				while(1) {
					if('@talk_to == 0) {
						mes "[アウストリ]";
						mes "何か聞きたいことはあるか？";
						next;
						switch(select("……","ミョルニールについて")) {
						case 1:
							set '@talk_not,1;
							break;
						case 2:
							break;
						}
					}
					else if('@talk_to == 1) {
						mes "[アウストリ]";
						mes "ミョルニールか。伝説のミョルニールは";
						mes "トール様が使った凄まじい武器。一度";
						mes "振りまわすだけで、空を割り、大地を";
						mes "ふるわせた。";
						next;
						mes "[アウストリ]";
						mes "そのミョルニールだが、実は私の先祖が";
						mes "作った。さて、ミョルニールの柄が";
						mes "どうして短いか……話を聞きたいか？";
						next;
						switch(select("……","はい！","はい？")) {
						default:
							set '@talk_not,1;
							break;
						case 2:
							break;
						}
					}
					else if('@talk_to == 2) {
						mes "[アウストリ]";
						mes "ある日、ロキ様が訪ねてきて、不思議な";
						mes "3つの宝物を、ご先祖に見せてくれた。";
						mes "そして、その宝物より良いものは";
						mes "作れないだろうとおっしゃった。";
						next;
						mes "[アウストリ]";
						mes "実は、ロキ様の宝物もご先祖の一族が";
						mes "作ったものだったんだが。ついつい";
						mes "張り合ってしまってな。ご先祖様も";
						mes "3つ宝物を作ってしまった。";
						mes "聞いているか？";
						next;
						switch(select("……","はい？","はい！")) {
						default:
							set '@talk_not,1;
							break;
						case 3:
							break;
						}
					}
					else if('@talk_to == 3) {
						mes "[アウストリ]";
						mes "その3つの宝物だが、最後にミョル";
						mes "ニールを作っておった。だが途中、変な";
						mes "虫が邪魔しおってな。おかげで手が";
						mes "滑って柄が短くなってしまった……。";
						mes "残念だと思わないか？";
						next;
						switch(select("……","はい？","はい！")) {
						default:
							set '@talk_not,1;
							break;
						case 3:
							break;
						}
					}
					else if('@talk_to == 4) {
						mes "[アウストリ]";
						mes "しかし、ご先祖が作ったミョルニールは";
						mes "トール様の頼もしい力となった。その";
						mes "凄まじさは巨人の一族にさえ恐れられた";
						mes "ほどだ。";
						next;
						mes "[アウストリ]";
						mes "思えば、柄が短かったおかげで、";
						mes "トール様はミョルニールを自在に振り";
						mes "回すことが出来たと言える。";
						mes "どうだ、鍛冶屋としてやり甲斐のあった";
						mes "仕事だと思わないか？";
						next;
						switch(select("……","はい！","はい？")) {
						default:
							set '@talk_not,1;
							break;
						case 2:
							break;
						}
					}
					else if('@talk_to == 5) {
						mes "[アウストリ]";
						mes "そして、この山脈をミョルニールと";
						mes "呼ぶ理由……。千年前、トール様が";
						mes "魔族と戦った時、ミョルニールを地面に";
						mes "振り落としたことがあった。その時に";
						mes "出来たのがミョルニール山脈だ。";
						next;
						mes "[アウストリ]";
						mes "一度振りかざしただけで、大地を割り、";
						mes "平地を震わせ、新しい山脈が生じる";
						mes "ほどの力……。しかし、安心せい。";
						mes "それはトール様だからこそ使えた宝。";
						mes "人間には大きすぎる力だと思わないか？";
						next;
						switch(select("……","はい？","はい！")) {
						default:
							set '@talk_not,1;
							break;
						case 3:
							break;
						}
					}
					else if('@talk_to == 6) {
						mes "[アウストリ]";
						mes "ドワーフ族が、再びそのような宝物を";
						mes "作れるか判らん。もし作れたとしても";
						mes "それはトール様のミョルニールとは似て";
						mes "非なるもの。トール様のミョルニールは";
						mes "人間に扱える品ではない。";
						next;
						mes "[アウストリ]";
						mes "そうだな……あえて言えば、人間に";
						mes "合わせたミョルニールなら……";
						mes "しかし、それでさえ作るのは容易く";
						mes "なかろう。わかるか？";
						next;
						switch(select("……","はい！","はい？")) {
						default:
							set '@talk_not,1;
							break;
						case 2:
							break;
						}
					}
					else if('@talk_to == 7) {
						mes "[アウストリ]";
						mes "少し長かったが、私の話もここまでだ。";
						mes "これ以上はわし等ドワーフでも知らん。";
						mes "ただ最近、世界に大きな変化が";
						mes "起きようとしている。";
						next;
						mes "[アウストリ]";
						mes "その変化が、大陸にどのような影響を";
						mes "及ぼすか……神々なら知っているかも";
						mes "しれんが。わし達ドワーフも、おまえ等";
						mes "人間も、充分に心構えとらんといかん。";
						next;
						switch(select("……","はい？","はい！")) {
						default:
							set '@talk_not,1;
							break;
						case 3:
							break;
						}
					}
					else if('@talk_to == 8) {
						mes "[アウストリ]";
						mes "これでいいか？";
						mes "是非、わしの兄弟も訪ねてみてくれ。";
						mes "道中気を付けてな。";
						set GOD_4QUE_SUB1,2;
						close;
					}
					if('@talk_not == 1) {
						mes "[アウストリ]";
						mes "……人の話を全然聞いておらんな。";
						mes "ふん、気分が悪いわ。とうぶん、人間と";
						mes "話すのはまっぴらごめんだ!!";
						mes "帰った帰った！";
						set GOD_4QUE_SUB1,3;
						close;
					} else {
						set '@talk_to,'@talk_to + 1;
					}
				}
			}
		}
		else if(GOD_4QUE_SUB1 == 0) {
			mes "[アウストリ]";
			mes "何か用か？";
			next;
			switch(select("何でもないです","すみません、少しお話を……")) {
			case 1:
				mes "[アウストリ]";
				mes "……変な奴じゃ。";
				close;
			case 2:
				mes "[アウストリ]";
				mes "鍛冶屋というのは、自分の鎚と金敷を";
				mes "大事にするものだ。わしの話を聞きたい";
				mes "なら、鍛冶屋の心を理解せい。";
				next;
				mes "[アウストリ]";
				mes "鍛冶屋の心を理解できたと、わしに";
				mes "証明できたら、一つ話をしてやろう。";
				set GOD_4QUE_SUB1,1;
				close;
			}
		}
	}
	else if(GOD_4QUE == 2) {
		if(GOD_4QUE_SUB1 == 3 || GOD_4QUE_SUB2 == 3 || GOD_4QUE_SUB3 == 3 || GOD_4QUE_SUB4 == 3) {
			mes "[アウストリ]";
			mes "お前みたいな礼儀知らずと話すこと";
			mes "などない！　とっとと帰れ！";
			close;
		}
		else if(GOD_4QUE_SUB4 == 2) {
			mes "[アウストリ]";
			mes "なんじゃ。";
			mes "これ以上、話す事はないぞ。";
			close;
		}
		else if(GOD_4QUE_SUB1 == 0 || GOD_4QUE_SUB1 == 1 || GOD_4QUE_SUB2 == 0 || GOD_4QUE_SUB2 == 1 || GOD_4QUE_SUB3 == 0 || GOD_4QUE_SUB3 == 1) {
			mes "[アウストリ]";
			mes "何か用か？";
			next;
			switch(select("何でもないです","ドワーフだ……")) {
			case 1:
				mes "[アウストリ]";
				mes "……変な奴じゃ。";
				close;
			case 2:
				mes "[アウストリ]";
				mes "無礼な！";
				mes "とっとと帰れ！";
				set GOD_4QUE_SUB4,3;
				close;
			}
		}
		else if(GOD_4QUE_SUB4 == 1) {
			mes "[アウストリ]";
			mes "何か用か？";
			next;
			switch(select("何でもないです","あの、良ければこれ……")) {
			case 1:
				mes "[アウストリ]";
				mes "……変な奴じゃ。";
				close;
			case 2:
				if(countitem(1005) == 0) {
					mes "[アウストリ]";
					mes "おいおい、もっとはっきり喋らんと";
					mes "聞こえんぞ。鍛冶屋の心が知りたければ";
					mes "それ相応の品を持ってくるんだな。";
					close;
				}
				mes "[アウストリ]";
				mes "おいおい、もっとはっきり喋らんと";
				mes "聞こえんぞ。まぁいい。";
				mes "今日は気分がいい。";
				mes "久しぶりに懐かしい話でもしようか。";
				next;
				while(1) {
					if('@talk_to == 0) {
						mes "[アウストリ]";
						mes "何か聞きたいことはあるか？";
						next;
						switch(select("……","ミョルニールについて")) {
						case 1:
							set '@talk_not,1;
							break;
						case 2:
							break;
						}
					}
					else if('@talk_to == 1) {
						mes "[アウストリ]";
						mes "ミョルニールか。伝説のミョルニールは";
						mes "トール様が使った凄まじい武器。一度";
						mes "振りまわすだけで、空を割り、大地を";
						mes "ふるわせた。";
						next;
						mes "[アウストリ]";
						mes "そのミョルニールだが、実は私の先祖が";
						mes "作った。さて、ミョルニールの柄が";
						mes "どうして短いか……話を聞きたいか？";
						next;
						switch(select("……","はい？","はい！")) {
						default:
							set '@talk_not,1;
							break;
						case 3:
							break;
						}
					}
					else if('@talk_to == 2) {
						mes "[アウストリ]";
						mes "ある日、ロキ様が訪ねてきて、不思議な";
						mes "3つの宝物を、ご先祖に見せてくれた。";
						mes "そして、その宝物より良いものは";
						mes "作れないだろうとおっしゃった。";
						next;
						mes "[アウストリ]";
						mes "実は、ロキ様の宝物もご先祖の一族が";
						mes "作ったものだったんだが。ついつい";
						mes "張り合ってしまってな。ご先祖様も";
						mes "3つ宝物を作ってしまった。";
						mes "聞いているか？";
						next;
						switch(select("……","はい！","はい？")) {
						default:
							set '@talk_not,1;
							break;
						case 2:
							break;
						}
					}
					else if('@talk_to == 3) {
						mes "[アウストリ]";
						mes "その3つの宝物だが、最後にミョル";
						mes "ニールを作っておった。だが途中、変な";
						mes "虫が邪魔しおってな。おかげで手が";
						mes "滑って柄が短くなってしまった……。";
						mes "残念だと思わないか？";
						next;
						switch(select("……","はい！","はい？")) {
						default:
							set '@talk_not,1;
							break;
						case 2:
							break;
						}
					}
					else if('@talk_to == 4) {
						mes "[アウストリ]";
						mes "しかし、ご先祖が作ったミョルニールは";
						mes "トール様の頼もしい力となった。その";
						mes "凄まじさは巨人の一族にさえ恐れられた";
						mes "ほどだ。";
						next;
						mes "[アウストリ]";
						mes "思えば、柄が短かったおかげで、";
						mes "トール様はミョルニールを自在に振り";
						mes "回すことが出来たと言える。";
						mes "どうだ、鍛冶屋としてやり甲斐のあった";
						mes "仕事だと思わないか？";
						next;
						switch(select("……","はい？","はい！")) {
						default:
							set '@talk_not,1;
							break;
						case 3:
							break;
						}
					}
					else if('@talk_to == 5) {
						mes "[アウストリ]";
						mes "そして、この山脈をミョルニールと";
						mes "呼ぶ理由……。千年前、トール様が";
						mes "魔族と戦った時、ミョルニールを地面に";
						mes "振り落としたことがあった。その時に";
						mes "出来たのがミョルニール山脈だ。";
						next;
						mes "[アウストリ]";
						mes "一度振りかざしただけで、大地を割り、";
						mes "平地を震わせ、新しい山脈が生じる";
						mes "ほどの力……。しかし、安心せい。";
						mes "それはトール様だからこそ使えた宝。";
						mes "人間には大きすぎる力だと思わないか？";
						next;
						switch(select("……","はい！","はい？")) {
						default:
							set '@talk_not,1;
							break;
						case 2:
							break;
						}
					}
					else if('@talk_to == 6) {
						mes "[アウストリ]";
						mes "ドワーフ族が、再びそのような宝物を";
						mes "作れるか判らん。もし作れたとしても";
						mes "それはトール様のミョルニールとは似て";
						mes "非なるもの。トール様のミョルニールは";
						mes "人間に扱える品ではない。";
						next;
						mes "[アウストリ]";
						mes "そうだな……あえて言えば、人間に";
						mes "合わせたミョルニールなら……";
						mes "しかし、それでさえ作るのは容易く";
						mes "なかろう。わかるか？";
						next;
						switch(select("……","はい！","はい？")) {
						default:
							set '@talk_not,1;
							break;
						case 2:
							break;
						}
					}
					else if('@talk_to == 7) {
						mes "[アウストリ]";
						mes "少し長かったが、私の話もここまでだ。";
						mes "これ以上はわし等ドワーフでも知らん。";
						mes "ただ最近、世界に大きな変化が";
						mes "起きようとしている。";
						next;
						mes "[アウストリ]";
						mes "その変化が、大陸にどのような影響を";
						mes "及ぼすか……神々なら知っているかも";
						mes "しれんが。わし達ドワーフも、おまえ等";
						mes "人間も、充分に心構えとらんといかん。";
						next;
						switch(select("……","はい！","はい？")) {
						default:
							set '@talk_not,1;
							break;
						case 2:
							break;
						}
					}
					else if('@talk_to == 8) {
						mes "[アウストリ]";
						mes "これでいいか？";
						mes "是非、わしの兄弟も訪ねてみてくれ。";
						mes "道中気を付けてな。";
						set GOD_4QUE_SUB4,2;
						close;
					}
					if('@talk_not == 1) {
						mes "[アウストリ]";
						mes "……人の話を全然聞いておらんな。";
						mes "ふん、気分が悪いわ。とうぶん、人間と";
						mes "話すのはまっぴらごめんだ!!";
						mes "帰った帰った！";
						set GOD_4QUE_SUB4,3;
						close;
					} else {
						set '@talk_to,'@talk_to + 1;
					}
				}
			}
		}
		else if(GOD_4QUE_SUB4 == 0) {
			mes "[アウストリ]";
			mes "何か用か？";
			next;
			switch(select("何でもないです","すみません、少しお話を……")) {
			case 1:
				mes "[アウストリ]";
				mes "……変な奴じゃ。";
				close;
			case 2:
				mes "[アウストリ]";
				mes "鍛冶屋というのは、自分の鎚と金敷を";
				mes "大事にするものだ。わしの話を聞きたい";
				mes "なら、鍛冶屋の心を理解せい。";
				next;
				mes "[アウストリ]";
				mes "鍛冶屋の心を理解できたと、わしに";
				mes "証明できたら、一つ話をしてやろう。";
				set GOD_4QUE_SUB4,1;
				close;
			}
		}
	}
	mes "[アウストリ]";
	mes "今日も愉快な一日になりそうだな!!";
	mes "空気は澄んでいるし、さわやかで";
	mes "いい日だ、わっはっは。";
	mes "さて、今日も金敷と一緒に武器の";
	mes "精錬でもするか！";
	close;
}

mjolnir_09.gat,209,341,3	script	ドワーフの鍛冶屋#南	826,{
	if($GodBrysinggamen < 50) {
		mes "[スドリ]";
		mes "ウオオオオオオオ！ ";
		mes "もっと強い相手と戦ってみたいぞ!!";
		mes "ウオオオオオオオオオォ!!!!";
		close;
	}
	if($GodMjolnir >= 100) {
		mes "[スドリ]";
		mes "今は戦ってる場合じゃないな。";
		mes "もうすぐ…もうすぐだ……。";
		mes "長い間、待ってきた……汗と涙により";
		mes "何かが生まれる時を…………";
		close;
	}
	if(GOD_4QUE == 11) {
		mes "[スドリ]";
		mes "ウオオオオオオオ！ ";
		mes "もっと強い相手と戦ってみたいぞ!!";
		mes "ウオオオオオオオオオォ!!!!";
		close;
	}
	else if(GOD_4QUE_SUB10 == 10) {
		mes "[スドリ]";
		mes "フフフ……人間だろうと、容赦はせん！";
		mes "……が、容赦せんでも、お前には";
		mes "負けたからな。わしもまだまだだ！";
		mes "ウオオオオオオオオオォ!!!!";
		close;
	}
	else if(GOD_4QUE == 1) {
		if(GOD_4QUE_SUB1 == 3 || GOD_4QUE_SUB2 == 3 || GOD_4QUE_SUB3 == 3 || GOD_4QUE_SUB4 == 3) {
			mes "[スドリ]";
			mes "ハーブ摘みにでも来たのか？";
			close;
		}
		else if(GOD_4QUE_SUB2 == 2) {
			mes "[スドリ]";
			mes "素晴しい戦いだった！";
			mes "ウオオオオオオオオオォ!!!!";
			close;
		}
		else if(GOD_4QUE_SUB1 == 0 || GOD_4QUE_SUB1 == 1 || GOD_4QUE_SUB3 != 0 || GOD_4QUE_SUB4 != 0) {
			mes "[スドリ]";
			mes "何か用か？";
			next;
			switch(select("何でもないです","ドワーフだ……")) {
			case 1:
				mes "[スドリ]";
				mes "こんな所で潰す時間があったら";
				mes "友達とでも会ってろや。";
				close;
			case 2:
				mes "[スドリ]";
				mes "今、何て言った？";
				mes "わしの貴重な時間を邪魔するとは";
				mes "いい度胸だ。けっ、帰った帰った！";
				set GOD_4QUE_SUB2,3;
				close;
			}
		}
		else if(GOD_4QUE_SUB2 == 1) {
			mes "[スドリ]";
			mes "よし、戦いだ!! やるぜ!!";
			next;
			set '@n_vit,200;
			set '@p_vit,100;
			while(1) {
				mes "－－－－－－－－－－－－－－－－－";
				mes "スドリ : 残りHP　" +'@n_vit;
				mes strcharinfo(0)+ " : 残りHP　" +'@p_vit;
				mes "－－－－－－－－－－－－－－－－－";
				mes "";
				mes strcharinfo(0)+ "の攻撃!!";
				next;
				switch(select("？！","頭を攻撃!!","胴を攻撃!!","足を攻撃!!","1回休み!!")) {
				case 1:
					set '@p_atk,0;
					break;
				case 2:
					set '@p_atk,1;
					break;
				case 3:
					set '@p_atk,2;
					break;
				case 4:
					set '@p_atk,3;
					break;
				case 5:
					set '@p_atk,4;
					break;
				}
				set '@n_def,rand(1,3);
				set '@damage,rand(15,25);
				if('@p_atk == 1) {
					mes strcharinfo(0)+ "は頭へ攻撃!!";
				}
				else if('@p_atk == 2) {
					mes strcharinfo(0)+ "は胴に攻撃!!";
				}
				else if('@p_atk == 3) {
					mes strcharinfo(0)+ "は足に攻撃!!";
				}
				else if('@p_atk == 4) {
					mes strcharinfo(0)+ "は休憩した!!";
				}
				else {
					mes strcharinfo(0)+ "は転んでしまった!!";
				}
				if('@p_atk == '@n_def) {
					misceffect 336;
					if('@n_def == 1) {
						mes "－－－－－－－－－－－－－－－－－";
						mes "しかし、スドリは小さい体をうまく";
						mes "利用して攻撃をかわした！";
						mes "－－－－－－－－－－－－－－－－－";
						mes "";
						mes strcharinfo(0)+ "の攻撃は当たらなかった！";
					}
					else if('@n_def == 2) {
						mes "－－－－－－－－－－－－－－－－－";
						mes "しかし、スドリは強靭な両腕で";
						mes "攻撃を受け止めた！";
						mes "－－－－－－－－－－－－－－－－－";
						mes "";
						mes strcharinfo(0)+ "の攻撃は当たらなかった！";
					}
					else if('@n_def == 3) {
						mes "－－－－－－－－－－－－－－－－－";
						mes "しかし、スドリは小走りに足への";
						mes "攻撃を避けた！";
						mes "－－－－－－－－－－－－－－－－－";
						mes "";
						mes strcharinfo(0)+ "の攻撃は当たらなかった！";
					}
				}
				else if('@p_atk == 4) {
					misceffect 312,"";
					set '@p_vit,'@p_vit + 10;
					mes "－－－－－－－－－－－－－－－－－";
					mes strcharinfo(0)+ "の体力が 10 回復!!";
					mes "－－－－－－－－－－－－－－－－－";
				}
				else if('@p_atk == 1) {
					misceffect 4;
					set '@n_vit,'@n_vit - '@damage;
					mes "－－－－－－－－－－－－－－－－－";
					mes "スドリの頭に攻撃が命中！";
					mes "－－－－－－－－－－－－－－－－－";
					mes "";
					mes "スドリの体力が " +'@damage+ " 減った!!";
				}
				else if('@p_atk == 2) {
					misceffect 1;
					set '@n_vit,'@n_vit - '@damage;
					mes "－－－－－－－－－－－－－－－－－";
					mes "スドリの胴に攻撃が命中！";
					mes "－－－－－－－－－－－－－－－－－";
					mes "";
					mes "スドリの体力が " +'@damage+ " 減った!!";
				}
				else if('@p_atk == 3) {
					misceffect 3;
					set '@n_vit,'@n_vit - '@damage;
					mes "－－－－－－－－－－－－－－－－－";
					mes "スドリの足に攻撃が命中！";
					mes "－－－－－－－－－－－－－－－－－";
					mes "";
					mes "スドリの体力が " +'@damage+ " 減った!!";
				}
				else if('@p_atk == 0) {
					misceffect 4,"";
					set '@p_vit,'@p_vit - 10;
					mes "－－－－－－－－－－－－－－－－－";
					mes "スキあり！スドリの反撃!!";
					mes "避けられない!!";
					mes "－－－－－－－－－－－－－－－－－";
					mes "";
					mes strcharinfo(0)+ "の体力が 10 減った!!";
					if('@p_vit < 1) {
						mes strcharinfo(0)+ "の敗北!!";
						next;
						break;
					}
				}
				if('@n_vit < 1) {
					mes "スドリを倒した!!";
					next;
					break;
				}
				next;
				mes "－－－－－－－－－－－－－－－－－";
				mes "スドリ : 残りHP　" +'@n_vit;
				mes strcharinfo(0)+ " : 残りHP　" +'@p_vit;
				mes "－－－－－－－－－－－－－－－－－";
				mes "";
				mes "スドリの攻撃!!";
				next;
				switch(select("？！","避ける!!","防御!!","走る!!","反撃!!")) {
				case 1:
					set '@p_def,0;
					break;
				case 2:
					set '@p_def,1;
					break;
				case 3:
					set '@p_def,2;
					break;
				case 4:
					set '@p_def,3;
					break;
				case 5:
					set '@p_def,4;
					break;
				}
				set '@n_atk,rand(1,3);
				set '@damage,rand(20,25);
				if('@n_atk == 1) {
					mes "スドリは頭にむかって攻撃してきた!!";
				}
				else if('@n_atk == 2) {
					mes "スドリは胴めがけて攻撃してきた!!";
				}
				else {
					mes "スドリは足を狙って攻撃してきた!!";
				}
				if('@n_atk == '@p_def) {
					misceffect 336,"";
					if('@p_def == 1) {
						mes "－－－－－－－－－－－－－－－－－";
						mes strcharinfo(0)+ "は素早く避けた！";
						mes "－－－－－－－－－－－－－－－－－";
						mes "";
						mes "スドリの攻撃は当たらなかった！";
					}
					else if('@p_def == 2) {
						mes "－－－－－－－－－－－－－－－－－";
						mes strcharinfo(0)+ "は防御した！";
						mes "スドリの攻撃をかろうじて受け止めた！";
						mes "－－－－－－－－－－－－－－－－－";
						mes "";
						mes "スドリの攻撃は当たらなかった！";
					}
					else if('@p_def == 3) {
						mes "－－－－－－－－－－－－－－－－－";
						mes strcharinfo(0)+ "はジャンプした！";
						mes "スドリの足払いをかわした！";
						mes "－－－－－－－－－－－－－－－－－";
						mes "";
						mes "スドリの攻撃は当たらなかった！";
					}
				}
				else if('@p_def == 4) {
					set '@count,rand(1,4);
					mes "－－－－－－－－－－－－－－－－－";
					mes strcharinfo(0)+ "の反撃!!";
					mes "－－－－－－－－－－－－－－－－－";
					if('@count == 1) {
						misceffect 131,"";
						misceffect 17;
						set '@n_vit,'@n_vit - 20;
						mes "クロスカウンター!!";
						mes "－－－－－－－－－－－－－－－－－";
						next;
						mes "スドリの体力が 20 減った!!";
						if('@n_vit < 1) {
							mes "スドリを倒した!!";
							next;
							break;
						}
					}
					else {
						misceffect 102,"";
						set '@p_vit,'@p_vit - 30;
						mes "スキが出来て、反撃されてしまった！";
						mes "－－－－－－－－－－－－－－－－－";
						next;
						mes strcharinfo(0)+ "の体力が 30 減った!!";
					}
				}
				else if('@n_atk == 1) {
					misceffect 4,"";
					set '@p_vit,'@p_vit - '@damage;
					mes "－－－－－－－－－－－－－－－－－";
					mes "スドリの攻撃が " +strcharinfo(0)+ "の";
					mes "頭に突きささった!!";
					mes "－－－－－－－－－－－－－－－－－";
					mes "";
					mes strcharinfo(0)+ "のHPが " +'@damage+ " 減った!!";
				}
				else if('@n_atk == 2) {
					misceffect 1,"";
					set '@p_vit,'@p_vit - '@damage;
					mes "－－－－－－－－－－－－－－－－－";
					mes "強烈な攻撃が " +strcharinfo(0)+ "の";
					mes "腹に食い込んだ！";
					mes "－－－－－－－－－－－－－－－－－";
					mes "";
					mes strcharinfo(0)+ "のHPが " +'@damage+ " 減った!!";
				}
				else if('@n_atk == 3) {
					misceffect 3,"";
					set '@p_vit,'@p_vit - '@damage;
					mes "－－－－－－－－－－－－－－－－－";
					mes "素早い足払いが" +strcharinfo(0)+ "の";
					mes "体勢を崩した!!";
					mes "－－－－－－－－－－－－－－－－－";
					mes "";
					mes strcharinfo(0)+ "のHPが " +'@damage+ " 減った!!";
				}
				else if('@n_atk == 0) {
					misceffect 1,"";
					set '@p_vit,'@p_vit - '@damage;
					mes "－－－－－－－－－－－－－－－－－";
					mes "強烈な攻撃が " +strcharinfo(0)+ "の";
					mes "腹に食い込んだ！";
					mes "－－－－－－－－－－－－－－－－－";
					mes "";
					mes strcharinfo(0)+ "のHPが " +'@damage+ " 減った!!";
				}
				if('@p_vit < 1) {
					mes strcharinfo(0)+ "の敗北!!";
					next;
					break;
				}
				next;
			}
			if('@p_vit < '@n_vit) {
				mes "[スドリ]";
				mes "ハッハッハッ、まだまだ力不足だ！";
				mes "わしの煮えたぎる血を冷ませる奴は";
				mes "おらんのかぁ！もっと力をつけてこい！";
				mes "わっはっはっはっはー！";
				close;
			}
			else if('@n_vit < '@p_vit) {
				mes "[スドリ]";
				mes "思ったよりずっと強いな……";
				mes "こんな強い人間がいるとはな……";
				mes "わっはっはー！　見事、見事！";
				mes "よし、わしの兄弟にも、おまえの事は";
				mes "教えておいてやろう。";
				mes "達者でな、強い人間よ！";
				set GOD_4QUE_SUB2,2;
				close;
			}
		}
		else if(GOD_4QUE_SUB2 == 0) {
			mes "[スドリ]";
			mes "何か用か？";
			next;
			switch(select("何でもないです","すみません、少しお話を……")) {
			case 1:
				mes "[スドリ]";
				mes "こんな所で潰す時間があったら";
				mes "友達とでも会ってろや。";
				close;
			case 2:
				mes "[スドリ]";
				mes "ほう、人間にしてはイイ眼つきだな。";
				mes "こんな老いぼれに聞きたいことでも";
				mes "あるのか？　だが、わしは言葉で";
				mes "話し合うつもりはないぞ。";
				next;
				mes "[スドリ]";
				mes "わしと語り合うなら武器は捨てろ！";
				mes "拳をかざせ！　拳と拳のぶつかり合い、";
				mes "その行動にこそ真実がある！";
				mes "どうだ、対決するか？　ん？";
				next;
				switch(select("……","お願いします","いえ、怖いです")) {
				case 1:
					mes "[スドリ]";
					mes "返事もしないとは何事だ？";
					mes "ふん、勝手にせい。そんな役立たずのは";
					mes "口と二度と会いたくないわい。";
					set GOD_4QUE_SUB2,3;
					close;
				case 2:
					mes "[スドリ]";
					mes "よし、良くぞ言った！";
					mes "準備する時間をやる。";
					mes "用意が出来次第、決闘だ！";
					mes "イイか、しっかり準備して来いよ。";
					set GOD_4QUE_SUB2,1;
					close;
				case 3:
					mes "[スドリ]";
					mes "勇気が足りないぞ、若い人間。";
					mes "こんな年寄りが恐ろしいか？";
					mes "ワーッハッハッハッハ!!";
					mes "なら、先にお前から攻撃させてやろう。";
					mes "準備が出来たら一戦だ！";
					set GOD_4QUE_SUB2,1;
					close;
				}
			}
		}
	}
	else if(GOD_4QUE == 2) {
		if(GOD_4QUE_SUB1 == 3 || GOD_4QUE_SUB2 == 3 || GOD_4QUE_SUB3 == 3 || GOD_4QUE_SUB4 == 3) {
			mes "[スドリ]";
			mes "ハーブ摘みにでも来たのか？";
			close;
		}
		else if(GOD_4QUE_SUB3 == 2) {
			mes "[スドリ]";
			mes "素晴しい戦いだった！";
			mes "ウオオオオオオオオオォ!!!!";
			close;
		}
		else if(GOD_4QUE_SUB1 == 0 || GOD_4QUE_SUB1 == 1 || GOD_4QUE_SUB2 == 0 || GOD_4QUE_SUB2 == 1 || GOD_4QUE_SUB4 != 0) {
			mes "[スドリ]";
			mes "何か用か？";
			next;
			switch(select("何でもないです","ドワーフだ……")) {
			case 1:
				mes "[スドリ]";
				mes "こんな所で潰す時間があったら";
				mes "友達とでも会ってろや。";
				close;
			case 2:
				mes "[スドリ]";
				mes "今、何て言った？";
				mes "わしの貴重な時間を邪魔するとは";
				mes "いい度胸だ。けっ、帰った帰った！";
				set GOD_4QUE_SUB3,3;
				close;
			}
		}
		else if(GOD_4QUE_SUB3 == 1) {
			mes "[スドリ]";
			mes "よし、戦いだ!! やるぜ!!";
			next;
			set '@n_vit,200;
			set '@p_vit,100;
			while(1) {
				mes "－－－－－－－－－－－－－－－－－";
				mes "スドリ : 残りHP　" +'@n_vit;
				mes strcharinfo(0)+ " : 残りHP　" +'@p_vit;
				mes "－－－－－－－－－－－－－－－－－";
				mes "";
				mes strcharinfo(0)+ "の攻撃!!";
				next;
				switch(select("？！","頭を攻撃!!","胴を攻撃!!","足を攻撃!!","1回休み!!")) {
				case 1:
					set '@p_atk,0;
					break;
				case 2:
					set '@p_atk,1;
					break;
				case 3:
					set '@p_atk,2;
					break;
				case 4:
					set '@p_atk,3;
					break;
				case 5:
					set '@p_atk,4;
					break;
				}
				set '@n_def,rand(1,3);
				set '@damage,rand(15,25);
				if('@p_atk == 1) {
					mes strcharinfo(0)+ "は頭へ攻撃!!";
				}
				else if('@p_atk == 2) {
					mes strcharinfo(0)+ "は胴に攻撃!!";
				}
				else if('@p_atk == 3) {
					mes strcharinfo(0)+ "は足に攻撃!!";
				}
				else if('@p_atk == 4) {
					mes strcharinfo(0)+ "は休憩した!!";
				}
				else {
					mes strcharinfo(0)+ "は転んでしまった!!";
				}
				if('@p_atk == '@n_def) {
					misceffect 336;
					if('@n_def == 1) {
						mes "－－－－－－－－－－－－－－－－－";
						mes "しかし、スドリは小さい体をうまく";
						mes "利用して攻撃をかわした！";
						mes "－－－－－－－－－－－－－－－－－";
						mes "";
						mes strcharinfo(0)+ "の攻撃は当たらなかった！";
					}
					else if('@n_def == 2) {
						mes "－－－－－－－－－－－－－－－－－";
						mes "しかし、スドリは強靭な両腕で";
						mes "攻撃を受け止めた！";
						mes "－－－－－－－－－－－－－－－－－";
						mes "";
						mes strcharinfo(0)+ "の攻撃は当たらなかった！";
					}
					else if('@n_def == 3) {
						mes "－－－－－－－－－－－－－－－－－";
						mes "しかし、スドリは小走りに足への";
						mes "攻撃を避けた！";
						mes "－－－－－－－－－－－－－－－－－";
						mes "";
						mes strcharinfo(0)+ "の攻撃は当たらなかった！";
					}
				}
				else if('@p_atk == 4) {
					misceffect 312,"";
					set '@p_vit,'@p_vit + 10;
					mes "－－－－－－－－－－－－－－－－－";
					mes strcharinfo(0)+ "の体力が 10 回復!!";
					mes "－－－－－－－－－－－－－－－－－";
				}
				else if('@p_atk == 1) {
					misceffect 4;
					set '@n_vit,'@n_vit - '@damage;
					mes "－－－－－－－－－－－－－－－－－";
					mes "スドリの頭に攻撃が命中！";
					mes "－－－－－－－－－－－－－－－－－";
					mes "";
					mes "スドリの体力が " +'@damage+ " 減った!!";
				}
				else if('@p_atk == 2) {
					misceffect 1;
					set '@n_vit,'@n_vit - '@damage;
					mes "－－－－－－－－－－－－－－－－－";
					mes "スドリの胴に攻撃が命中！";
					mes "－－－－－－－－－－－－－－－－－";
					mes "";
					mes "スドリの体力が " +'@damage+ " 減った!!";
				}
				else if('@p_atk == 3) {
					misceffect 3;
					set '@n_vit,'@n_vit - '@damage;
					mes "－－－－－－－－－－－－－－－－－";
					mes "スドリの足に攻撃が命中！";
					mes "－－－－－－－－－－－－－－－－－";
					mes "";
					mes "スドリの体力が " +'@damage+ " 減った!!";
				}
				else if('@p_atk == 0) {
					misceffect 4,"";
					set '@p_vit,'@p_vit - 10;
					mes "－－－－－－－－－－－－－－－－－";
					mes "スキあり！スドリの反撃!!";
					mes "避けられない!!";
					mes "－－－－－－－－－－－－－－－－－";
					mes "";
					mes strcharinfo(0)+ "の体力が 10 減った!!";
					if('@p_vit < 1) {
						mes strcharinfo(0)+ "の敗北!!";
						next;
						break;
					}
				}
				if('@n_vit < 1) {
					mes "スドリを倒した!!";
					next;
					break;
				}
				next;
				mes "－－－－－－－－－－－－－－－－－";
				mes "スドリ : 残りHP　" +'@n_vit;
				mes strcharinfo(0)+ " : 残りHP　" +'@p_vit;
				mes "－－－－－－－－－－－－－－－－－";
				mes "";
				mes "スドリの攻撃!!";
				next;
				switch(select("？！","避ける!!","防御!!","走る!!","反撃!!")) {
				case 1:
					set '@p_def,0;
					break;
				case 2:
					set '@p_def,1;
					break;
				case 3:
					set '@p_def,2;
					break;
				case 4:
					set '@p_def,3;
					break;
				case 5:
					set '@p_def,4;
					break;
				}
				set '@n_atk,rand(1,3);
				set '@damage,rand(20,25);
				if('@n_atk == 1) {
					mes "スドリは頭にむかって攻撃してきた!!";
				}
				else if('@n_atk == 2) {
					mes "スドリは胴めがけて攻撃してきた!!";
				}
				else {
					mes "スドリは足を狙って攻撃してきた!!";
				}
				if('@n_atk == '@p_def) {
					misceffect 336,"";
					if('@p_def == 1) {
						mes "－－－－－－－－－－－－－－－－－";
						mes strcharinfo(0)+ "は素早く避けた！";
						mes "－－－－－－－－－－－－－－－－－";
						mes "";
						mes "スドリの攻撃は当たらなかった！";
					}
					else if('@p_def == 2) {
						mes "－－－－－－－－－－－－－－－－－";
						mes strcharinfo(0)+ "は防御した！";
						mes "スドリの攻撃をかろうじて受け止めた！";
						mes "－－－－－－－－－－－－－－－－－";
						mes "";
						mes "スドリの攻撃は当たらなかった！";
					}
					else if('@p_def == 3) {
						mes "－－－－－－－－－－－－－－－－－";
						mes strcharinfo(0)+ "はジャンプした！";
						mes "スドリの足払いをかわした！";
						mes "－－－－－－－－－－－－－－－－－";
						mes "";
						mes "スドリの攻撃は当たらなかった！";
					}
				}
				else if('@p_def == 4) {
					set '@count,rand(1,4);
					mes "－－－－－－－－－－－－－－－－－";
					mes strcharinfo(0)+ "の反撃!!";
					mes "－－－－－－－－－－－－－－－－－";
					if('@count == 1) {
						misceffect 131,"";
						misceffect 17;
						set '@n_vit,'@n_vit - 20;
						mes "クロスカウンター!!";
						mes "－－－－－－－－－－－－－－－－－";
						next;
						mes "スドリの体力が 20 減った!!";
						if('@n_vit < 1) {
							mes "スドリを倒した!!";
							next;
							break;
						}
					}
					else {
						misceffect 102,"";
						set '@p_vit,'@p_vit - 30;
						mes "スキが出来て、反撃されてしまった！";
						mes "－－－－－－－－－－－－－－－－－";
						next;
						mes strcharinfo(0)+ "の体力が 30 減った!!";
					}
				}
				else if('@n_atk == 1) {
					misceffect 4,"";
					set '@p_vit,'@p_vit - '@damage;
					mes "－－－－－－－－－－－－－－－－－";
					mes "スドリの攻撃が " +strcharinfo(0)+ "の";
					mes "頭に突きささった!!";
					mes "－－－－－－－－－－－－－－－－－";
					mes "";
					mes strcharinfo(0)+ "のHPが " +'@damage+ " 減った!!";
				}
				else if('@n_atk == 2) {
					misceffect 1,"";
					set '@p_vit,'@p_vit - '@damage;
					mes "－－－－－－－－－－－－－－－－－";
					mes "強烈な攻撃が " +strcharinfo(0)+ "の";
					mes "腹に食い込んだ！";
					mes "－－－－－－－－－－－－－－－－－";
					mes "";
					mes strcharinfo(0)+ "のHPが " +'@damage+ " 減った!!";
				}
				else if('@n_atk == 3) {
					misceffect 3,"";
					set '@p_vit,'@p_vit - '@damage;
					mes "－－－－－－－－－－－－－－－－－";
					mes "素早い足払いが" +strcharinfo(0)+ "の";
					mes "体勢を崩した!!";
					mes "－－－－－－－－－－－－－－－－－";
					mes "";
					mes strcharinfo(0)+ "のHPが " +'@damage+ " 減った!!";
				}
				else if('@n_atk == 0) {
					misceffect 1,"";
					set '@p_vit,'@p_vit - '@damage;
					mes "－－－－－－－－－－－－－－－－－";
					mes "強烈な攻撃が " +strcharinfo(0)+ "の";
					mes "腹に食い込んだ！";
					mes "－－－－－－－－－－－－－－－－－";
					mes "";
					mes strcharinfo(0)+ "のHPが " +'@damage+ " 減った!!";
				}
				if('@p_vit < 1) {
					mes strcharinfo(0)+ "の敗北!!";
					next;
					break;
				}
				next;
			}
			if('@p_vit < '@n_vit) {
				mes "[スドリ]";
				mes "ハッハッハッ、まだまだ力不足だ！";
				mes "わしの煮えたぎる血を冷ませる奴は";
				mes "おらんのかぁ！もっと力をつけてこい！";
				mes "わっはっはっはっはー！";
				close;
			}
			else if('@n_vit < '@p_vit) {
				mes "[スドリ]";
				mes "思ったよりずっと強いな……";
				mes "こんな強い人間がいるとはな……";
				mes "わっはっはー！　見事、見事！";
				mes "よし、わしの兄弟にも、おまえの事は";
				mes "教えておいてやろう。";
				mes "達者でな、強い人間よ！";
				set GOD_4QUE_SUB3,2;
				close;
			}
		}
		else if(GOD_4QUE_SUB3 == 0) {
			mes "[スドリ]";
			mes "何か用か？";
			next;
			switch(select("何でもないです","すみません、少しお話を……")) {
			case 1:
				mes "[スドリ]";
				mes "こんな所で潰す時間があったら";
				mes "友達とでも会ってろや。";
				close;
			case 2:
				mes "[スドリ]";
				mes "ほう、人間にしてはイイ眼つきだな。";
				mes "こんな老いぼれに聞きたいことでも";
				mes "あるのか？　だが、わしは言葉で";
				mes "話し合うつもりはないぞ。";
				next;
				mes "[スドリ]";
				mes "わしと語り合うなら武器は捨てろ！";
				mes "拳をかざせ！　拳と拳のぶつかり合い、";
				mes "その行動にこそ真実がある！";
				mes "どうだ、対決するか？　ん？";
				next;
				switch(select("……","お願いします","いえ、怖いです")) {
				case 1:
					mes "[スドリ]";
					mes "返事もしないとは何事だ？";
					mes "ふん、勝手にせい。そんな役立たずのは";
					mes "口と二度と会いたくないわい。";
					set GOD_4QUE_SUB3,3;
					close;
				case 2:
					mes "[スドリ]";
					mes "よし、良くぞ言った！";
					mes "準備する時間をやる。";
					mes "用意が出来次第、決闘だ！";
					mes "イイか、しっかり準備して来いよ。";
					set GOD_4QUE_SUB3,1;
					close;
				case 3:
					mes "[スドリ]";
					mes "勇気が足りないぞ、若い人間。";
					mes "こんな年寄りが恐ろしいか？";
					mes "ワーッハッハッハッハ!!";
					mes "なら、先にお前から攻撃させてやろう。";
					mes "準備が出来たら一戦だ！";
					set GOD_4QUE_SUB3,1;
					close;
				}
			}
		}
	}
	mes "[スドリ]";
	mes "戦いとは、己の全てを賭け、相手に";
	mes "自分の存在を証明する崇高な行為。";
	mes "お前はそんな心を持っているか、人間？";
	close;
}

mjolnir_01.gat,35,136,7	script	ドワーフの鍛冶屋#西	826,{
	if($GodBrysinggamen < 50) {
		mes "[ベストリ]";
		mes "自分の夢は自分のもの……欲するなら";
		mes "その手でつかまねばならない……。";
		mes "他の誰が何と言おうとも、それが自分の";
		mes "意思ならば、やり通さなければ。";
		mes "そう思わない？";
		close;
	}
	if($GodMjolnir >= 100) {
		mes "[ベストリ]";
		mes "今日は精錬どころじゃなさそうだ……";
		mes "だれかが、とんでもないことをしようと";
		mes "しているよ……";
		close;
	}
	if(GOD_4QUE == 11) {
		mes "[ベストリ]";
		mes "一生懸命働いた後の汗って最高ー!!";
		mes "これこそ生き甲斐!!";
		mes "そう思わない？";
		close;
	}
	else if(GOD_4QUE == 10) {
		mes "[ベストリ]";
		mes "自分の夢は自分のもの……欲するなら";
		mes "その手でつかまねばならない……。";
		mes "他の誰が何と言おうとも、それが自分の";
		mes "意思ならば、やり通さなければ。";
		mes "そう思わない？";
		close;
	}
	else if(GOD_4QUE == 1) {
		if(GOD_4QUE_SUB1 == 3 || GOD_4QUE_SUB2 == 3 || GOD_4QUE_SUB3 == 3 || GOD_4QUE_SUB4 == 3) {
			mes "[ベストリ]";
			mes "次に来る人間は、ちょっとはマシだと";
			mes "良いな～。どいつもこいつも、大雑把っ";
			mes "ていうか、根性が無いって言うか～。";
			close;
		}
		else if(GOD_4QUE_SUB3 == 2) {
			mes "[ベストリ]";
			mes "すべてを完璧に準備できたとしても、";
			mes "運命の女神がそっぽを向けば、全部";
			mes "台無し。でもね、やることを精一杯";
			mes "やらないと、運命の女神は自分のほうを";
			mes "見ることさえしちゃくれないんだよ。";
			close;
		}
		else if(GOD_4QUE_SUB1 == 0 || GOD_4QUE_SUB1 == 1 || GOD_4QUE_SUB2 == 0 || GOD_4QUE_SUB2 == 1 || GOD_4QUE_SUB4 != 0) {
			mes "[ベストリ]";
			mes "何か用？";
			next;
			switch(select("何でもないです","ドワーフだ……")) {
			case 1:
				mes "[ベストリ]";
				mes "欲しい物は自分で探せ！";
				mes "そして、自分で手に入れろ！";
				close;
			case 2:
				mes "[ベストリ]";
				mes "その態度は何様のつもり?!";
				mes "あんたなんかは、ホルグレン程度が";
				mes "お似合いだ！";
				set GOD_4QUE_SUB3,3;
				close;
			}
		}
		else if(GOD_4QUE_SUB3 == 1) {
			mes "[ベストリ]";
			mes "よし!!　何を精錬する？";
			mes "このドキドキ……抑えることなんて";
			mes "出来やしない！";
			next;
			set '@part,select(getequipname(1),getequipname(2),getequipname(3),getequipname(4),getequipname(5),
						getequipname(6),getequipname(7),getequipname(8),getequipname(9),getequipname(10));
			if(getequipisequiped('@part) == 0)
				close;
			if(getequipisenableref('@part) == 0) {
				mes "[ベストリ]";
				mes "これ、精錬できないじゃないさ。";
				mes "これをいったいどうしろと？";
				close;
			}
			if(getequiprefinerycnt('@part) >= 10) {
				mes "[ベストリ]";
				mes "これ以上の精錬は無理だよ。";
				close;
			}
			if(getequippercentrefinery('@part) == 100) {
				mes "[ベストリ]";
				mes "オイオイ！ これは精錬するには";
				mes "簡単すぎる！　言ったろ、挑戦だよ";
				mes "ち・ょ・う・せ・ん!!";
				mes "あたいは挑戦を求めてるんだ！";
				close;
			}
			if((getequipweaponlv('@part) <= 1) && (getequipweaponlv('@part) >= 3 )){
				mes "[ベストリ]";
				mes "これはあたいが精錬したいレベルの";
				mes "武器じゃないね。レベル4の武器を";
				mes "持ってきな！";
				close;
			}
			if(getequipweaponlv('@part) == 0){
				mes "[ベストリ]";
				mes "これは、防具じゃないか！";
				mes "おいおい、武器って言っただろう。";
				mes "レベル4の武器を持ってきな！";
				close;
			}
			mes "[ベストリ]";
			mes "よし、最後に確認だ。";
			mes "精錬して壊れてしまうと、その武器は";
			mes "二度と戻ってこないって判ってるな？";
			mes "武器に付属したカードや属性なんかも";
			mes "^ff0000全部消えちゃう^000000。その覚悟があるなら、";
			mes "ここはビシっと挑戦しようじゃないか！";
			next;
			if(select("挑戦します!!","……やめます。") == 2) {
				mes "[ベストリ]";
				mes "そんな意気地なしで、よくこの厳しい";
				mes "世の中を渡ってきたね。";
				mes "あっそう、やめろやめちまえ。";
				close;
			}
			if(countitem(984) > 0) {
				delitem 984,1;
			}
			else {
				mes "[ベストリ]";
				mes "あ、基本的なことをド忘れしてた。";
				mes "レベル4武器の精錬にはオリデオ";
				mes "コンが必要だ。";
				mes "ちゃんと持ってくるように。";
				close;
			}
			if(getequippercentrefinery('@part) > rand(100)) {
				mes "[ベストリ]";
				mes "ハッ！ハッ!!ハッ！ハッ!!ハッ！";
				successrefitem '@part;
				next;
				emotion 18;
				mes "[ベストリ]";
				mes "ワッハッハッハッ、あたいってば最高！";
				mes "お前も嬉しいだろ、な、な？";
			}
			else {
				mes "[ベストリ]";
				mes "ハッ！ハッ!!ハッ！ハッ!!ハッ！";
				failedrefitem '@part;
				next;
				emotion 23;
				mes "[ベストリ]";
				mes "ウアアアアアアアアアーッ!!";
				next;
				mes "[ベストリ]";
				mes "う、うん、大丈夫。";
				mes "今日は運が悪いみたい。";
				mes "ふ、でも挫けない！これこそ精錬魂!!";
			}
			next;
			mes "[ベストリ]";
			mes "あたいが出来るのはここまでさ。";
			mes "あたいの兄弟にあったら、元気で";
			mes "やってるって伝えてやってよ。";
			mes "おまえも、あんまり無理すんなよ。";
			mes "じゃあな。";
			set GOD_4QUE_SUB3,2;
			close;
		}
		else if(GOD_4QUE_SUB3 == 0) {
			mes "[ベストリ]";
			mes "何か用？";
			next;
			switch(select("何でもないです","すみません、少しお話を……")) {
			case 1:
				mes "[ベストリ]";
				mes "欲しい物は自分で探せ！";
				mes "そして、自分で手に入れろ！";
				close;
			case 2:
				mes "[ベストリ]";
				mes "…………ん？";
				mes "今、良く聞こえなかったんだけど。";
				mes "ちゃんと朝ごはん食べてる？";
				mes "あたいは、見ての通り鍛冶屋だ。";
				mes "でもね、鍛冶よりもっと好きなことが";
				mes "一つだけあるのさ。";
				next;
				mes "[ベストリ]";
				mes "それは……挑戦すること！";
				mes "例えば、既に精錬された武器を";
				mes "もっともっと精錬するとか、ボロボロの";
				mes "防具を精錬するとか、限界まで使われた";
				mes "兜を……";
				next;
				mes "[ベストリ]";
				mes "えー、ごほん。とにかく！";
				mes "あたいは世界で精錬が一番好き！";
				mes "限界に挑むあのドキドキ感！";
				mes "それが精錬！";
				next;
				mes "[ベストリ]";
				mes "よし、おまえに会ったのも何かの縁。";
				mes "あたいが特別にお前の武器を精錬して";
				mes "あげよう！　しかも無料で！";
				mes "武器と精錬材料だけ準備すればいいよ。";
				mes "いい話だろ？";
				next;
				mes "[ベストリ]";
				mes "ただし！ドキドキのない精錬はしない。";
				mes "あたいは究極のワクワクが欲しい!!";
				mes "それを満たすのはレベル4武器のみ！";
				mes "他の武器は、どこの誰でも精錬できる";
				mes "からね。";
				set GOD_4QUE_SUB3,1;
				close;
			}
		}
	}
	else if(GOD_4QUE == 2) {
		if(GOD_4QUE_SUB1 == 3 || GOD_4QUE_SUB2 == 3 || GOD_4QUE_SUB3 == 3 || GOD_4QUE_SUB4 == 3) {
			mes "[ベストリ]";
			mes "次に来る人間は、ちょっとはマシだと";
			mes "良いな～。どいつもこいつも、大雑把っ";
			mes "ていうか、根性が無いって言うか～。";
			close;
		}
		else if(GOD_4QUE_SUB2 == 2) {
			mes "[ベストリ]";
			mes "すべてを完璧に準備できたとしても、";
			mes "運命の女神がそっぽを向けば、全部";
			mes "台無し。でもね、やることを精一杯";
			mes "やらないと、運命の女神は自分のほうを";
			mes "見ることさえしちゃくれないんだよ。";
			close;
		}
		else if(GOD_4QUE_SUB1 == 0 || GOD_4QUE_SUB1 == 1 || GOD_4QUE_SUB3 != 0 || GOD_4QUE_SUB4 != 0) {
			mes "[ベストリ]";
			mes "何か用？";
			next;
			switch(select("何でもないです","ドワーフだ……")) {
			case 1:
				mes "[ベストリ]";
				mes "欲しい物は自分で探せ！";
				mes "そして、自分で手に入れろ！";
				close;
			case 2:
				mes "[ベストリ]";
				mes "その態度は何様のつもり?!";
				mes "あんたなんかは、ホルグレン程度が";
				mes "お似合いだ！";
				set GOD_4QUE_SUB2,3;
				close;
			}
		}
		else if(GOD_4QUE_SUB2 == 1) {
			mes "[ベストリ]";
			mes "よし!!　何を精錬する？";
			mes "このドキドキ……抑えることなんて";
			mes "出来やしない！";
			next;
			set '@part,select(getequipname(1),getequipname(2),getequipname(3),getequipname(4),getequipname(5),
						getequipname(6),getequipname(7),getequipname(8),getequipname(9),getequipname(10));
			if(getequipisequiped('@part) == 0)
				close;
			if(getequipisenableref('@part) == 0) {
				mes "[ベストリ]";
				mes "これ、精錬できないじゃないさ。";
				mes "これをいったいどうしろと？";
				close;
			}
			if(getequiprefinerycnt('@part) >= 10) {
				mes "[ベストリ]";
				mes "これ以上の精錬は無理だよ。";
				close;
			}
			if(getequippercentrefinery('@part) == 100) {
				mes "[ベストリ]";
				mes "オイオイ！ これは精錬するには";
				mes "簡単すぎる！　言ったろ、挑戦だよ";
				mes "ち・ょ・う・せ・ん!!";
				mes "あたいは挑戦を求めてるんだ！";
				close;
			}
			if((getequipweaponlv('@part) <= 1) && (getequipweaponlv('@part) >= 3 )){
				mes "[ベストリ]";
				mes "これはあたいが精錬したいレベルの";
				mes "武器じゃないね。レベル4の武器を";
				mes "持ってきな！";
				close;
			}
			if(getequipweaponlv('@part) == 0){
				mes "[ベストリ]";
				mes "これは、防具じゃないか！";
				mes "おいおい、武器って言っただろう。";
				mes "レベル4の武器を持ってきな！";
				close;
			}
			mes "[ベストリ]";
			mes "よし、最後に確認だ。";
			mes "精錬して壊れてしまうと、その武器は";
			mes "二度と戻ってこないって判ってるな？";
			mes "武器に付属したカードや属性なんかも";
			mes "^ff0000全部消えちゃう^000000。その覚悟があるなら、";
			mes "ここはビシっと挑戦しようじゃないか！";
			next;
			if(select("挑戦します!!","……やめます。") == 2) {
				mes "[ベストリ]";
				mes "そんな意気地なしで、よくこの厳しい";
				mes "世の中を渡ってきたね。";
				mes "あっそう、やめろやめちまえ。";
				close;
			}
			if(countitem(984) > 0) {
				delitem 984,1;
			}
			else {
				mes "[ベストリ]";
				mes "あ、基本的なことをド忘れしてた。";
				mes "レベル4武器の精錬にはオリデオ";
				mes "コンが必要だ。";
				mes "ちゃんと持ってくるように。";
				close;
			}
			if(getequippercentrefinery('@part) > rand(100)) {
				mes "[ベストリ]";
				mes "ハッ！ハッ!!ハッ！ハッ!!ハッ！";
				successrefitem '@part;
				next;
				emotion 18;
				mes "[ベストリ]";
				mes "ワッハッハッハッ、あたいってば最高！";
				mes "お前も嬉しいだろ、な、な？";
			}
			else {
				mes "[ベストリ]";
				mes "ハッ！ハッ!!ハッ！ハッ!!ハッ！";
				failedrefitem '@part;
				next;
				emotion 23;
				mes "[ベストリ]";
				mes "ウアアアアアアアアアーッ!!";
				next;
				mes "[ベストリ]";
				mes "う、うん、大丈夫。";
				mes "今日は運が悪いみたい。";
				mes "ふ、でも挫けない！これこそ精錬魂!!";
			}
			next;
			mes "[ベストリ]";
			mes "あたいが出来るのはここまでさ。";
			mes "あたいの兄弟にあったら、元気で";
			mes "やってるって伝えてやってよ。";
			mes "おまえも、あんまり無理すんなよ。";
			mes "じゃあな。";
			set GOD_4QUE_SUB2,2;
			close;
		}
		else if(GOD_4QUE_SUB2 == 0) {
			mes "[ベストリ]";
			mes "何か用？";
			next;
			switch(select("何でもないです","すみません、少しお話を……")) {
			case 1:
				mes "[ベストリ]";
				mes "欲しい物は自分で探せ！";
				mes "そして、自分で手に入れろ！";
				close;
			case 2:
				mes "[ベストリ]";
				mes "…………ん？";
				mes "今、良く聞こえなかったんだけど。";
				mes "ちゃんと朝ごはん食べてる？";
				mes "あたいは、見ての通り鍛冶屋だ。";
				mes "でもね、鍛冶よりもっと好きなことが";
				mes "一つだけあるのさ。";
				next;
				mes "[ベストリ]";
				mes "それは……挑戦すること！";
				mes "例えば、既に精錬された武器を";
				mes "もっともっと精錬するとか、ボロボロの";
				mes "防具を精錬するとか、限界まで使われた";
				mes "兜を……";
				next;
				mes "[ベストリ]";
				mes "えー、ごほん。とにかく！";
				mes "あたいは世界で精錬が一番好き！";
				mes "限界に挑むあのドキドキ感！";
				mes "それが精錬！";
				next;
				mes "[ベストリ]";
				mes "よし、おまえに会ったのも何かの縁。";
				mes "あたいが特別にお前の武器を精錬して";
				mes "あげよう！　しかも無料で！";
				mes "武器と精錬材料だけ準備すればいいよ。";
				mes "いい話だろ？";
				next;
				mes "[ベストリ]";
				mes "ただし！ドキドキのない精錬はしない。";
				mes "あたいは究極のワクワクが欲しい!!";
				mes "それを満たすのはレベル4武器のみ！";
				mes "他の武器は、どこの誰でも精錬できる";
				mes "からね。";
				set GOD_4QUE_SUB2,1;
				close;
			}
		}
	}
	mes "[ベストリ]";
	mes "わっはっは、お前のド頭を精錬して";
	mes "やろうかい？　わっはっはっは!!";
	mes "冗談、冗談だよ。";
	next;
	mes "[ベストリ]";
	mes "精錬～精錬～♪ 精錬っは楽っしいな♪";
	mes "失敗～しても、成功夢見て頑張るの～♪";
	mes "今日も精錬、明日も精錬、最高の装備を";
	mes "生み出すの～♪";
	close;
}

mjolnir_12.gat,18,18,7	script	ドワーフの鍛冶屋#北	826,{
	if($GodBrysinggamen < 50) {
		mes "[ノストリ]";
		mes "人間に提供するエルニウムや";
		mes "オリデオコンはない！";
		mes "だって、だって、ベストリが全部";
		mes "持ってっちゃったんだもん！";
		close;
	}
	if($GodMjolnir >= 100) {
		mes "[ノストリ]";
		mes "何だろう……風のにおいが変わった……";
		mes "深い洞窟の中で、まどろんでいるような";
		mes "……なんだろう…………";
		close;
	}
	if(GOD_4QUE == 11) {
		mes "[ノストリ]";
		mes "ヘヘヘ。ドワーフは人間より才能が";
		mes "あるのさ。神様が、人間じゃなくて";
		mes "私達一族に武器の依頼をしたってことが";
		mes "証明しているでしょう？";
		mes "だから私達は武器を作り続けるの！";
		close;
	}
	else if(GOD_4QUE == 10) {
		mes "[ノストリ]";
		mes "人間に提供するエルニウムや";
		mes "オリデオコンはない！";
		mes "だって、だって、ベストリが全部";
		mes "持ってっちゃったんだもん！";
		close;
	}
	else if(GOD_4QUE == 1) {
		if(GOD_4QUE_SUB1 == 3 || GOD_4QUE_SUB2 == 3 || GOD_4QUE_SUB3 == 3 || GOD_4QUE_SUB4 == 3) {
			mes "[ノストリ]";
			mes "ラララ～　ラララ～　ララリララ～♪";
			mes "今日もミョルニールは綺麗だな～♪";
			mes "雑音なんて聞こえない～　ララ～♪";
			mes "誰も気にならない～　ラララ～♪";
			close;
		}
		else if(GOD_4QUE_SUB4 == 2) {
			mes "[ノストリ]";
			mes "バナナがおいしい季節だね～。";
			mes "あ、でもカボチャもおいしいよね！";
			mes "ね、ね、ね？";
			close;
		}
		else if(GOD_4QUE_SUB1 == 0 || GOD_4QUE_SUB1 == 1 || GOD_4QUE_SUB2 == 0 || GOD_4QUE_SUB2 == 1 || GOD_4QUE_SUB3 == 0 || GOD_4QUE_SUB3 == 1){
			mes "[ノストリ]";
			mes "何か用～？";
			next;
			switch(select("何でもないです","ドワーフだ……")) {
			case 1:
				mes "[ノストリ]";
				mes "変なの～。";
				mes "こんな所で遊んでちゃだめよ～。";
				close;
			case 2:
				mes "[ノストリ]";
				mes "ラララ～　ラララ～　ララリララ～♪";
				mes "今日もミョルニールは綺麗だな～♪";
				mes "雑音なんて聞こえない～　ララ～♪";
				mes "誰も気にならない～　ラララ～♪";
				set GOD_4QUE_SUB4,3;
				close;
			}
		}
		else if(GOD_4QUE_SUB4 == 1) {
			if(countitem(501) == 0) {
				mes "[ノストリ]";
				mes "あああ、喉が渇いた～。";
				mes "あれ、どこに置いたかな？";
				mes "私の大事な赤ポーション……";
				mes "さっぱりしたい時は赤ポーション！";
				close;
			}
			delitem 501,1;
			mes "[ノストリ]";
			mes "うわ～、ありがとう！";
			mes "私の大好きな大好きな赤ポーション～！";
			mes "うん、お礼に大事な昔話をしてあげる。";
			mes "とっても面白いんだよ。";
			next;
			while(1) {
				if('@talk_to == 0) {
					mes "[ノストリ]";
					mes "トール様が巨人の大陸に旅立った時の";
					mes "お話です。ウトガルドに辿り着いた";
					mes "トール様一行は、巨人の館で、巨人の";
					mes "王と勝負をしました。";
					next;
					mes "[ノストリ]";
					mes "1番目の勝負は食べ比べ。";
					mes "トール様はすでにたくさん食べた";
					mes "後だったので、代わりにロキ様が";
					mes "勝負を受けました。";
					next;
					mes "[ノストリ]";
					mes "でも、相手はどれだけ食べても";
					mes "次から次へと食べ物どころか、お皿も";
					mes "ペロリと飲み込んでしまったのです。";
					mes "ロキ様は負けてしまいました。";
					next;
					mes "[ノストリ]";
					mes "実は、巨人は魔法を使って、勝負相手を";
					mes "実際とは違う者に見せていたのでした。";
					mes "さて、次から次へと何でも飲み込む者の";
					mes "正体はなんでしょう？";
					next;
					switch(select("欲望","海","火","豚")) {
					default:
						set '@talk_not,1;
						break;
					case 3:
						break;
					}
				}
				else if('@talk_to == 1) {
					mes "[ノストリ]";
					mes "なーんと、火だったの！";
					next;
					mes "[ノストリ]";
					mes "さて、次の勝負はかけっこ。";
					mes "トール様の召使だった少年シアルヴィが";
					mes "勝負しました。シアルビィも人間とは";
					mes "言え、トール様と一緒に旅して来た身。";
					mes "負けるはずないのに、どうしても相手を";
					mes "追い越せません。";
					next;
					mes "[ノストリ]";
					mes "何回走っても、シアルビィは勝つことが";
					mes "出来ませんでした。さてさて、少年は";
					mes "いったい、何とかけっこしていたので";
					mes "しょう？";
					next;
					switch(select("言葉","思考","風","オオカミ")) {
					default:
						set '@talk_not,1;
						break;
					case 2:
						break;
					}
				}
				else if('@talk_to == 2) {
					mes "[ノストリ]";
					mes "なぁ～んと、自分の思考と";
					mes "かけっこしてたの！";
					next;
					mes "[ノストリ]";
					mes "次、巨人は自分のお婆ちゃんと";
					mes "勝負しなさいと言いました。";
					mes "これを受けて立ったのがトール様！";
					mes "トール様が年寄りに負けるなんて";
					mes "考えられませんよね!?";
					next;
					mes "[ノストリ]";
					mes "でもね、トール様はお婆ちゃんとの";
					mes "力比べに負けて、地に膝をついて";
					mes "しまったの。";
					next;
					mes "[ノストリ]";
					mes "これも巨人の魔法だったんだけど。";
					mes "お婆さんの姿をしていたけれど、";
					mes "お婆さんじゃなかったの。";
					mes "そう、誰にも打ち負かすことが";
					mes "出来ない存在……なんだか判る？";
					next;
					switch(select("呪い","大地","心","老い")) {
					default:
						set '@talk_not,1;
						break;
					case 4:
						break;
					}
				}
				else if('@talk_to == 3) {
					mes "[ノストリ]";
					mes "そう、老い！";
					mes "誰だって必ず年を取るんだから、";
					mes "老いには勝てないの。";
					next;
					mes "[ノストリ]";
					mes "結局、全ての勝負に敗れたトール様は";
					mes "その地を去ることになったんだけど、";
					mes "巨人の王は最後に真実を教えたのね。";
					mes "もちろん、トール様は激怒したんだけど";
					mes "その時には、巨人の王は館こと";
					mes "消えちゃったんだって……";
					next;
					mes "[ノストリ]";
					mes "このお話で大事なのは2つ。";
					mes "1つは、目に見えることばかりが";
					mes "全てじゃないこと。";
					mes "そして、世の中には自分より強い者が";
					mes "いっぱいいるから、過信せず自惚れず、";
					mes "努力する姿勢を忘れないこと。";
					next;
					mes "[ノストリ]";
					mes "そこに存在しているからって、";
					mes "そればかりが世の中全てじゃない。";
					mes "もしかしたら、それは幻かもしれない。";
					next;
					mes "[ノストリ]";
					mes "ああ、ごめんごめん。";
					mes "つい長話ししちゃった。";
					mes "あのね、幻を追い求める人がいたら";
					mes "このお話をしてあげて。巨人の幻と";
					mes "戦って負けた、トール様の話……";
					set GOD_4QUE_SUB4,2;
					close;
				}
				if('@talk_not == 1) {
					mes "[ノストリ]";
					mes "おや～、あれ～。なんの話だっけ？";
					mes "ま、いっか。";
					mes "また後で赤ポーションでも飲みながら";
					mes "お喋りしようね～。";
					close;
				}
				else {
					set '@talk_to,'@talk_to + 1;
				}
			}
		}
		else if(GOD_4QUE_SUB4 == 0) {
			mes "[ノストリ]";
			mes "何か用～？";
			next;
			switch(select("何でもないです","すみません、少しお話を……")) {
			case 1:
				mes "[ノストリ]";
				mes "変なの～。";
				mes "こんな所で遊んでちゃだめよ～。";
				close;
			case 2:
				mes "[ノストリ]";
				mes "うーん、なんでかな。";
				mes "最近、私のところにやたらと";
				mes "人間が来るような？　そのほうが";
				mes "退屈しないから、大歓迎だけどね～。";
				next;
				mes "[ノストリ]";
				mes "でも、お喋りすると喉が渇くんだよね。";
				mes "やっぱり、気持ちよくお話ししたいし。";
				mes "ねぇねぇ、大好きな赤ポーションを";
				mes "おごってくれたら、とっても面白い";
				mes "お話を教えてあげる～。";
				set GOD_4QUE_SUB4,1;
				close;
			}
		}
	}
	else if(GOD_4QUE == 2) {
		if((GOD_4QUE_SUB1 == 3) || (GOD_4QUE_SUB2 == 3) || (GOD_4QUE_SUB3 == 3) || (GOD_4QUE_SUB4 == 3)){
			mes "[ノストリ]";
			mes "ラララ～　ラララ～　ララリララ～♪";
			mes "今日もミョルニールは綺麗だな～♪";
			mes "雑音なんて聞こえない～　ララ～♪";
			mes "誰も気にならない～　ラララ～♪";
			close;
		}
		else if(GOD_4QUE_SUB1 == 2) {
			mes "[ノストリ]";
			mes "バナナがおいしい季節だね～。";
			mes "あ、でもカボチャもおいしいよね！";
			mes "ね、ね、ね？";
			close;
		}
		else if(GOD_4QUE_SUB2 != 0 || GOD_4QUE_SUB3 != 0 || GOD_4QUE_SUB4 != 0) {
			mes "[ノストリ]";
			mes "何か用～？";
			next;
			switch(select("何でもないです","ドワーフだ……")) {
			case 1:
				mes "[ノストリ]";
				mes "変なの～。";
				mes "こんな所で遊んでちゃだめよ～。";
				close;
			case 2:
				mes "[ノストリ]";
				mes "ラララ～　ラララ～　ララリララ～♪";
				mes "今日もミョルニールは綺麗だな～♪";
				mes "雑音なんて聞こえない～　ララ～♪";
				mes "誰も気にならない～　ラララ～♪";
				set GOD_4QUE_SUB1,3;
				close;
			}
		}
		else if(GOD_4QUE_SUB1 == 1) {
			if(countitem(501) == 0) {
				mes "[ノストリ]";
				mes "あああ、喉が渇いた～。";
				mes "あれ、どこに置いたかな？";
				mes "私の大事な赤ポーション……";
				mes "さっぱりしたい時は赤ポーション！";
				close;
			}
			delitem 501,1;
			mes "[ノストリ]";
			mes "うわ～、ありがとう！";
			mes "私の大好きな大好きな赤ポーション～！";
			mes "うん、お礼に大事な昔話をしてあげる。";
			mes "とっても面白いんだよ。";
			next;
			while(1) {
				if('@talk_to == 0) {
					mes "[ノストリ]";
					mes "伝説によると、私達ドワーフのご先祖に";
					mes "とても勇ましく賢い方がいたんだって。";
					mes "名前はアルヴィス。図書館のように";
					mes "知識がいっぱいで、ジークフリードの";
					mes "ように勇ましかったとか。";
					next;
					mes "[ノストリ]";
					mes "ところが、アルヴィスは届かない夢を";
					mes "見てしまいました。なんと、神々の";
					mes "武器を鍛えた見返りに、トール様の娘と";
					mes "結婚したいと言ったんです！";
					mes "もちろん、トール様は大反対！";
					mes "でも、アルヴィスは屈しませんでした。";
					next;
					mes "[ノストリ]";
					mes "そこで、トール様はアルヴィスが娘に";
					mes "相応しいかテストするといい、質問を";
					mes "しました。えと、なんだっけ……";
					mes "あ、そうだそうだ。";
					mes "「私達が踏んでいるこの地を、";
					mes "人間は何と呼ぶか？」";
					next;
					switch(select("ユミルの肉体","大地","土","地球")) {
					default:
						set '@talk_not,1;
						break;
					case 2:
						break;
					}
				}
				else if('@talk_to == 1) {
					mes "[ノストリ]";
					mes "そう、大地です。";
					mes "そしてトール様は次の質問をしました。";
					mes "「大地を覆っている丸いものを、";
					mes "巨人は何と呼ぶか？」";
					next;
					switch(select("ユミルの頭","空","雲","高い家")) {
					default:
						set '@talk_not,1;
						break;
					case 4:
						break;
					}
				}
				else if('@talk_to == 2) {
					mes "[ノストリ]";
					mes "そうそう、高い家って言うんですって！";
					mes "巨人は大きいから、そういうふうに";
					mes "見えるんでしょうね～。そして、";
					mes "トール様はもう一つ質問をしました。";
					mes "「毎晩、空に浮かぶ丸いものを、";
					mes "神々は何と呼ぶか？」";
					next;
					switch(select("タイヤ","月","偽物の太陽","旅人")) {
					default:
						set '@talk_not,1;
						break;
					case 3:
						break;
					}
				}
				else if('@talk_to == 3) {
					mes "[ノストリ]";
					mes "そうなんですよ～！";
					mes "神々は月を、偽物の太陽と呼びます。";
					next;
					mes "[ノストリ]";
					mes "アルヴィスは、トール様の質問が";
					mes "あまりに簡単すぎて、油断してしまった";
					mes "のでしょうね～。なんと、トール様が";
					mes "質問している間に、太陽が昇ってきて";
					mes "いたのです。ドワーフは太陽の光を直接";
					mes "あびると、石になってしまうのです……";
					next;
					mes "[ノストリ]";
					mes "このお話で大事なのは2つ。";
					mes "1つは、大きすぎる夢を見ないこと。";
					mes "もう1つは、慢心しないこと……判る？";
					mes "世の中が自分の思い通りになるなんて";
					mes "大間違いなんだから。";
					next;
					mes "[ノストリ]";
					mes "自分の度量に相応しく暮らすのが一番。";
					mes "運命の糸は長いかもしれないけど、";
					mes "それはいつ切れるか判らないんだから。";
					next;
					mes "[ノストリ]";
					mes "ああ、ごめんごめん。";
					mes "つい長話ししちゃった。";
					mes "あのね、慢心しちゃった人がいたら";
					mes "このお話をしてあげて。利口で愚か";
					mes "だった、私のご先祖さまのお話……";
					set GOD_4QUE_SUB1,2;
					close;
				}
				if('@talk_not == 1) {
					mes "[ノストリ]";
					mes "おや～、あれ～。なんの話だっけ？";
					mes "ま、いっか。";
					mes "また後で赤ポーションでも飲みながら";
					mes "お喋りしようね～。";
					close;
				}
				else {
					set '@talk_to,'@talk_to + 1;
				}
			}
		}
		else if(GOD_4QUE_SUB1 == 0) {
			mes "[ノストリ]";
			mes "何か用～？";
			next;
			switch(select("何でもないです","すみません、少しお話を……")) {
			case 1:
				mes "[ノストリ]";
				mes "変なの～。";
				mes "こんな所で遊んでちゃだめよ～。";
				close;
			case 2:
				mes "[ノストリ]";
				mes "うーん、なんでかな。";
				mes "最近、私のところにやたらと";
				mes "人間が来るような？　そのほうが";
				mes "退屈しないから、大歓迎だけどね～。";
				next;
				mes "[ノストリ]";
				mes "でも、お喋りすると喉が渇くんだよね。";
				mes "やっぱり、気持ちよくお話ししたいし。";
				mes "ねぇねぇ、大好きな赤ポーションを";
				mes "おごってくれたら、とっても面白い";
				mes "お話を教えてあげる～。";
				set GOD_4QUE_SUB1,1;
				close;
			}
		}
	}
	mes "[ノストリ]";
	mes "私はドワーフの鍛冶屋、ノストリ。";
	mes "一族の中で、北の鍛冶屋だよ。";
	mes "ここから先は、私の許可を得ないと";
	mes "通しません！";
	next;
	mes "[ノストリ]";
	mes "えへへ、冗談冗談。";
	close;
}

//====================================================================
// 神器作成クエスト
//====================================================================
-	script	グルンブルティ#created	-1,{
	mes "[ドワーフ・グルンブルティ]";
	mes "フン！　人間、何の用だ？";
	mes "故郷の地を離れ、はるか遠いこの";
	mes "ミッドガルドで暮らさなきゃいけない";
	mes "なんて本当に苦痛だ!!　しかも何で";
	mes "つまらん人間の相手をしなきゃ";
	mes "いけないんだ!?";
	next;
	switch(select("ドワーフについて知りたい","ここで何してるの？","武具製作を依頼したい","話をやめる")) {
	case 1:
		mes "[ドワーフ・グルンブルティ]";
		mes "フン！　面倒だね。";
		mes "人間がわしらドワーフのことを知って";
		mes "どうするんだ？　人間と違ってわしらは";
		mes "この退屈なミッドガルドとは比較に";
		mes "ならないほど不毛な地で生きている";
		mes "種族なんだぞ。";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "貴様らが誇る技術と知識は、元々全て";
		mes "わしらの物だった。しかもそれだけ";
		mes "じゃない。はるか昔、神々が使った";
		mes "武具も全てわしらの先祖様が";
		mes "作ったものだ。";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "わしらドワーフは、そういった優れた";
		mes "知識や技術を持っていた……だが";
		mes "運命に従い、巨人が住む不毛な地で";
		mes "生きることにしたんだ。";
		close;
	case 2:
		mes "[ドワーフ・グルンブルティ]";
		mes "ここで何してるかって？";
		mes "フハハハハッ！";
		mes "少なくとも貴様に会うためじゃない。";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "お前みたいな奴を相手にするのは";
		mes "わしの恥だからな。ああ、";
		mes "怖がらなくてもいい。フハハッ！";
		mes "弱いくせに、それぞれ自分の方が強いと";
		mes "誇示する愚かな種族だよ、人間は。";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "不毛な地……わしの故郷。今となっては";
		mes "このミッドガルドからは行けない所だ。";
		mes "わしの故郷へ通じる唯一の道は";
		mes "イグドラシルの樹にあった。";
		mes "だが、1000年前の大きな戦争以来、";
		mes "その道が判らなくなってしまった……";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "不本意ではあるが、このミッドガルドで";
		mes "暮らすしかない……せめてわしの故郷と";
		mes "環境が似ているこの洞窟でな。";
		close;
	case 3:
		if($GodSleipnir < 100 || $GodMagingiorde < 100 || $GodBrysinggamen < 100 || $GodMjolnir < 100) {
			if($GodSleipnir >= 50 && $GodMagingiorde >= 50 && $GodBrysinggamen >= 50 && $GodMjolnir >= 50 && getcharid(0) == getguildmasterid(getcharid(2))) {
				mes "[ドワーフ・グルンブルティ]";
				mes "フム、仕方ない。";
				mes "特別に材料を教えてやる。";
				mes "何について知りたいんだ？";
				next;
				switch(select("ブリーシンガメン","メギンギョルド","スレイプニール","ミョルニール")) {
				case 1:
					mes "[ドワーフ・グルンブルティ]";
					mes "^0000FFフレイヤの宝石 4個";
					mes "銀の装飾 4個";
					mes "雪の結晶 3個";
					mes "静かな波 3個";
					mes "流れる空気 3個";
					mes "サファイア 2個^000000";
					next;
					mes "[ドワーフ・グルンブルティ]";
					mes "^0000FF真珠 3個";
					mes "オパール 10個";
					mes "呪われたルビー 5個";
					mes "黄金 20個";
					mes "ネックレス 1個^000000";
					break;
				case 2:
					mes "[ドワーフ・グルンブルティ]";
					mes "^0000FFグレイプニール 1個";
					mes "黄金 20個";
					mes "サファイア 10個";
					mes "オリデオコン 10個";
					mes "ベルト 1個^000000";
					break;
				case 3:
					mes "[ドワーフ・グルンブルティ]";
					mes "^0000FF未知の歯車 3個";
					mes "天使の羽毛 5個";
					mes "魚の魂 3個";
					mes "太陽神の象徴 4個";
					mes "魂の息吹 3個";
					mes "黄金 20個";
					next;
					mes "[ドワーフ・グルンブルティ]";
					mes "エルニウム 10個";
					mes "ブーツ[1] 1個^000000";
					break;
				case 4:
					mes "[ドワーフ・グルンブルティ]";
					mes "^0000FFトールのグローブ 2個";
					mes "アイアンメイデン 4個";
					mes "ヴァルキリーの怒り 5個";
					mes "嵐の徴兆 5個";
					mes "押し寄せる波 5個";
					mes "オリデオコン 20個";
					next;
					mes "[ドワーフ・グルンブルティ]";
					mes "エルニウム 5個";
					mes "黄金 40個";
					mes "スタナー 1個^000000";
					break;
				}
				next;
				mes "[ドワーフ・グルンブルティ]";
				mes "以上が必要なものだ。";
				mes "たとえ材料が揃ったとしても、";
				mes "大量に作れるわけじゃない。";
				mes "また期が熟さなければできん。";
				mes "人間、解ったか？";
				mes "フハハハッ！";
				close;
			}
			mes "[ドワーフ・グルンブルティ]";
			mes "つまらん人間にわしら一族の技術を";
			mes "見せられるわけがない!!　そんな";
			mes "自尊心が傷つくような事なんぞできん！";
			mes "邪魔だ、どっかいけ！　貴様らが";
			mes "好きなモンスターとでも遊んでろ!!";
			close;
		}
		if(getcharid(0) != getguildmasterid(getcharid(2))) {
			mes "[ドワーフ・グルンブルティ]";
			mes "つまらん人間、しかもギルドマスター";
			mes "ですらない奴に、わしら一族の技術を";
			mes "見せられるわけがない!!　貴様の";
			mes "^0000FFギルドマスター^000000を連れてくるんだな！";
			close;
		}
		mes "[ドワーフ・グルンブルティ]";
		mes "つまらん人間にわしら一族の技術を";
		mes "見せる事は、自尊心が傷つくが……";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "ギルドマスターであり、しかも封印が";
		mes "全て解けた今ならば、手伝ってやっても";
		mes "いいだろう。";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "その前に、神器アイテムを作るのに";
		mes "必要な材料を全て持っているか";
		mes "確認しろ！　無駄な奴をわしの";
		mes "作業室に入れたくはないからな。";
		next;
		if(getcharid(0) == getguildmasterid(getcharid(2))) {
			if(countitem(7073)>=4 && countitem(7077)>=4 && countitem(7088)>=3 && countitem(7090)>=3 && countitem(7092)>=3 && countitem(726)>=2 && countitem(722)>=3 && countitem(727)>=10 && countitem(724)>=5 && countitem(969)>=20 && countitem(2603)>=1) {
				set '@gain,2630;
				break;
			}
			if(countitem(7058)>=1 && countitem(969)>=20 && countitem(726)>=10 && countitem(984)>=10 && countitem(2627)>=1) {
				set '@gain,2629;
				break;
			}
			if(countitem(7076)>=3 && countitem(7079)>=5 && countitem(7083)>=3 && countitem(7086)>=4 && countitem(7087)>=3 && countitem(969)>=20 && countitem(985)>=10 && countitem(2406)>=1) {
				set '@gain,2410;
				break;
			}
			if(countitem(7074)>=2 && countitem(7075)>=4 && countitem(7078)>=5 && countitem(7089)>=5 && countitem(7091)>=5 && countitem(984)>=20 && countitem(985)>=5 && countitem(969)>=40 && countitem(1522)>=1) {
				set '@gain,1530;
				break;
			}
		}
		break;
	case 4:
		mes "[ドワーフ・グルンブルティ]";
		mes "フハハハー！";
		mes "帰ってママにでもミルクを";
		mes "もらうんだな！";
		close;
	}
	if('@gain) {
		mes "[ドワーフ・グルンブルティ]";
		mes "フムム……";
		mes "^0000FF" +getitemname('@gain)+ "^000000を作るつもりだな。";
		mes "そうか……";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "我が身を削る思いがするが";
		mes "無知な貴様がかわいそうだから";
		mes "特別に製作依頼を受けてやる。";
		mes "向こうへ行ったらすぐに";
		mes "^0000FF地下作業室^000000へ来い！";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "さあ、行け！";
		mes "^0000FF全ての封印が解けた今だけ^000000";
		mes "^FF0000神器アイテムを一個^000000";
		mes "作れるからな。急ぐんだ！";
		close2;
		warp "que_god01.gat",214,62;
		end;
	}
	mes "[ドワーフ・グルンブルティ]";
	mes "…………";
	next;
	mes "[ドワーフ・グルンブルティ]";
	mes "…………";
	next;
	mes "[ドワーフ・グルンブルティ]";
	mes "…………";
	next;
	mes "[ドワーフ・グルンブルティ]";
	mes "おい?!　材料が足りないじゃないか!?";
	mes "まさか何が必要か分からないのか？";
	mes "仕方ない、材料を教えてやろう！";
	next;
	switch(select("ブリーシンガメン","メギンギョルド","スレイプニール","ミョルニール")) {
	case 1:
		mes "[ドワーフ・グルンブルティ]";
		mes "^0000FFフレイヤの宝石 4個";
		mes "銀の装飾 4個";
		mes "雪の結晶 3個";
		mes "静かな波 3個";
		mes "流れる空気 3個";
		mes "サファイア 2個^000000";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "^0000FF真珠 3個";
		mes "オパール 10個";
		mes "呪われたルビー 5個";
		mes "黄金 20個";
		mes "ネックレス 1個^000000";
		break;
	case 2:
		mes "[ドワーフ・グルンブルティ]";
		mes "^0000FFグレイプニール 1個";
		mes "黄金 20個";
		mes "サファイア 10個";
		mes "オリデオコン 10個";
		mes "ベルト 1個^000000";
		break;
	case 3:
		mes "[ドワーフ・グルンブルティ]";
		mes "^0000FF未知の歯車 3個";
		mes "天使の羽毛 5個";
		mes "魚の魂 3個";
		mes "太陽神の象徴 4個";
		mes "魂の息吹 3個";
		mes "黄金 20個";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "エルニウム 10個";
		mes "ブーツ[1] 1個^000000";
		break;
	case 4:
		mes "[ドワーフ・グルンブルティ]";
		mes "^0000FFトールのグローブ 2個";
		mes "アイアンメイデン 4個";
		mes "ヴァルキリーの怒り 5個";
		mes "嵐の徴兆 5個";
		mes "押し寄せる波 5個";
		mes "オリデオコン 20個";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "エルニウム 5個";
		mes "黄金 40個";
		mes "スタナー 1個^000000";
		break;
	}
	next;
	mes "[ドワーフ・グルンブルティ]";
	mes "以上が必要なものだ。";
	mes "今頃こんなことを聞いてるなんて";
	mes "遅いぞ！　この機会を逃すと";
	mes "いつ作れるかわからんぞ!!";
	mes "ほら、急げ!!";
	close;
}
gld_dun01.gat,28,85,0	duplicate(グルンブルティ#created)	グルンブルティ	826
gld_dun02.gat,85,84,0	duplicate(グルンブルティ#created)	グルンブルティ	826
gld_dun03.gat,92,105,0	duplicate(グルンブルティ#created)	グルンブルティ	826
gld_dun04.gat,268,230,0	duplicate(グルンブルティ#created)	グルンブルティ	826

que_god01.gat,215,127,3	script	地下作業室入口::cquegod	111,{
	mes "[入口案内]";
	mes "一番早い人、一人だけが神様に近づける";
	close;
OnInit:
	waitingroom "地下作業室入口",2,"cquegod::OnWarp",1;
	end;
OnWarp:
	disablewaitingroomevent;
	warpwaitingpc "que_god01.gat",155,62,1;
	initnpctimer "グルンブルティ#god";
	end;
}

que_god01.gat,154,112,4	script	グルンブルティ#god	826,{
	if($GodSleipnir < 100 || $GodMagingiorde < 100 || $GodBrysinggamen < 100 || $GodMjolnir < 100) {
		mes "[ドワーフ・グルンブルティ]";
		mes "神器アイテムは既に誕生しているぞ。";
		mes "新たな神器アイテムを作るには";
		mes "封印が再び解けるのを待つしかない！";
		mes "つまり、今は作れないってことだ！";
		mes "フハハハッ！";
		close;
	}
	if(getcharid(0) != getguildmasterid(getcharid(2))) {
		// 未調査
		mes "[ドワーフ・グルンブルティ]";
		mes "ここへはどうやって入った？";
		mes "貴様はギルドマスターではないだろう。";
		mes "出て行くがいい！";
		close;
	}
	mes "[ドワーフ・グルンブルティ]";
	mes "我が身を削る思いがするが";
	mes "無知な貴様がかわいそうだから";
	mes "特別に製作依頼を受けてやる。";
	next;
	mes "[ドワーフ・グルンブルティ]";
	mes "但し、先ほど作業室に入った時から";
	mes "^FF000010分以内^000000に製作を完了させるんだ。";
	mes "わしは忙しいし、^0000FF封印が解けている";
	mes "時間もあまり長くない^000000からな。";
	next;
	mes "[ドワーフ・グルンブルティ]";
	mes "まあ、貴様が時間稼ぎをしたとしても";
	mes "他人に先を越されるだけだがな。";
	mes "さあ、どの武具を作りたいんだ？";
	next;
	switch(select("ブリーシンガメン","メギンギョルド","スレイプニール","ミョルニール")) {
	case 1:
		// 未調査
		mes "[ドワーフ・グルンブルティ]";
		mes "ブリーシンガメン!!";
		mes "つまらん人間があの貴い宝を";
		mes "手に入れようとするとは！";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "ブリーシンガメンはその昔、女神";
		mes "フレイヤが首にかけていた物だ。";
		mes "そんな貴い物をフレイヤ以外の者が";
		mes "身につけるなんて本来、有り得ない";
		mes "ことだ！";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "だが、宝自ら主人を選択する。";
		mes "つまり、一番大事なのは";
		mes "ブリーシンガメン自身が";
		mes "貴様を選ぶかどうかだな。";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "わしならわしらの偉い先祖様のように";
		mes "ブリーシンガメンを作ることができる。";
		mes "本当に作って欲しいのか？";
		mes "ちなみに材料は次の通りだ。";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "^0000FFフレイヤの宝石 4個^000000";
		mes "^0000FF銀の装飾 4個^000000";
		mes "^0000FF雪の結晶 3個^000000";
		mes "^0000FF静かな波 3個^000000";
		mes "^0000FF流れる空気 3個^000000";
		mes "^0000FFサファイア 2個^000000";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "^0000FF真珠 3個^000000";
		mes "^0000FFオパール 10個^000000";
		mes "^0000FF呪われたルビー 5個^000000";
		mes "^0000FF黄金 20個^000000";
		mes "^0000FFネックレス 1個^000000";
		setarray '@need,7073,7077,7088,7090,7092,726,722,727,724,969,2603;
		setarray '@amount,4,4,3,3,3,2,3,10,5,20,1;
		set '@gain,2630;
		break;
	case 2:
		mes "[ドワーフ・グルンブルティ]";
		mes "メギンギョルド!!";
		mes "つまらん人間があの貴い宝を";
		mes "手に入れようとするとは！";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "メギンギョルドはその昔、勇猛な神";
		mes "トールが身につけていた物だ。";
		mes "そんな貴い物をトール以外の者が";
		mes "身につけるなんて本来、有り得ない";
		mes "ことだ！";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "だが、宝自ら主人を選択する。";
		mes "つまり、一番大事なのは";
		mes "メギンギョルド自身が";
		mes "貴様を選ぶかどうかだな。";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "わしならわしらの偉い先祖様のように";
		mes "メギンギョルドを作ることができる。";
		mes "本当に作って欲しいのか？";
		mes "ちなみに材料は次の通りだ。";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "^0000FFグレイプニール 1個^000000";
		mes "^0000FF黄金 20個^000000";
		mes "^0000FFサファイア 10個^000000";
		mes "^0000FFオリデオコン 10個^000000";
		mes "^0000FFベルト 1個^000000";
		setarray '@need,7058,969,726,984,2627;
		setarray '@amount,1,20,10,10,1;
		set '@gain,2629;
		break;
	case 3:
		// 未調査
		mes "[ドワーフ・グルンブルティ]";
		mes "スレイプニール!!";
		mes "つまらん人間が主神オーディンの愛馬";
		mes "スレイプニールを望むのか！";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "さすがのわしでも、生命を作ることは";
		mes "できない。だが、スレイプニールの様な";
		mes "優れた脚力を持つ履物なら作ることが";
		mes "できる。";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "もちろんそれだけでも貴様には";
		mes "十分過ぎる宝のはずだ。";
		mes "本当に作って欲しいのか？";
		mes "ちなみに材料は次の通りだ。";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "^0000FF未知の歯車 3個^000000";
		mes "^0000FF天使の羽毛 5個^000000";
		mes "^0000FF魚の魂 3個^000000";
		mes "^0000FF太陽神の象徴 4個^000000";
		mes "^0000FF魂の息吹 3個^000000";
		mes "^0000FF黄金 20個^000000";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "エルニウム 10個";
		mes "ブーツ[1] 1個";
		setarray '@need,7076,7079,7083,7086,7087,969,985,2406;
		setarray '@amount,3,5,3,4,3,20,10,1;
		set '@gain,2410;
		break;
	case 4:
		mes "[ドワーフ・グルンブルティ]";
		mes "ミョルニール!!";
		mes "宝中の宝。神々すら恐れる";
		mes "至高の武器を望むのか!?";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "作ってやってもいいが、貴様が";
		mes "扱いきれるものなのか？";
		mes "最強の勇士トールの名に負けない";
		mes "自信でもあるのか？";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "フハハハッ！";
		mes "人間は貪欲だからこそ、そんな";
		mes "分の過ぎた願いを抱けるのだろうな。";
		mes "まあいい、実際に手に入れば";
		mes "己の限界がわかるだろう。";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "本当に作って欲しいのか？";
		mes "ちなみに材料は次の通りだ。";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "^0000FFトールのグローブ 2個^000000";
		mes "^0000FFアイアンメイデン 4個^000000";
		mes "^0000FFヴァルキリーの怒り 5個^000000";
		mes "^0000FF嵐の徴兆 5個^000000";
		mes "^0000FF押し寄せる波 5個^000000";
		mes "^0000FFオリデオコン 20個^000000";
		next;
		mes "[ドワーフ・グルンブルティ]";
		mes "エルニウム 5個";
		mes "黄金 40個";
		mes "スタナー 1個";
		setarray '@need,7074,7075,7078,7089,7091,984,985,969,1522;
		setarray '@amount,2,4,5,5,5,20,5,40,1;
		set '@gain,1530;
		break;
	}
	next;
	if(select(getitemname('@gain)+ "を作る","取り消す") == 2) {
		// 未調査
		mes "[ドワーフ・グルンブルティ]";
		mes "いいか？";
		mes "一度神器を作成したら、";
		mes "また期が熟さなければできんぞ。";
		close;
	}
	for(set '@i,0; '@i<getarraysize('@need); set '@i,'@i+1) {
		if(countitem('@need['@i]) < '@amount['@i]) {
			// 未調査
			mes "[ドワーフ・グルンブルティ]";
			mes "貴様が欲しい神器は本当にそれか?!";
			mes "わしは忙しい!!";
			mes "貴様の都合に付き合う暇は無い！";
			mes "時間が無い。早く確かめろ！";
			close;
		}
	}
	mes "[ドワーフ・グルンブルティ]";
	mes "フハハッ！";
	mes "人間のためにこの技術を";
	mes "使うことになるとはな!!";
	mes "フン！　少し待ってろ！";
	next;
	if(Weight*100/MaxWeight >= 50) {
		mes "‐所持アイテムの重量が重い為";
		mes "　危険です。";
		mes "　所持アイテムを減らしてから、";
		mes "　再度話しかけてください‐";
		close;
	}
	if($GodSleipnir < 100 || $GodMagingiorde < 100 || $GodBrysinggamen < 100 || $GodMjolnir < 100) {
		mes "[ドワーフ・グルンブルティ]";
		mes "神器アイテムは既に誕生しているぞ。";
		mes "新たな神器アイテムを作るには";
		mes "封印が再び解けるのを待つしかない！";
		mes "つまり、今は作れないってことだ！";
		mes "フハハハッ！";
		close;
	}
	for(set '@i,0; '@i<getarraysize('@need); set '@i,'@i+1)
		delitem '@need['@i],'@amount['@i];
	getitem '@gain,1;
	set $GodSleipnir,0;
	set $GodMagingiorde,0;
	set $GodBrysinggamen,0;
	set $GodMjolnir,0;
	announce "ギルド[" + GetGuildName(getcharid(2)) + "]のギルドマスター[" + getguildmaster(getcharid(2)) + "]によって、神器アイテム[" +getitemname('@gain)+ "]が誕生しました。",0;
	mes "[ドワーフ・グルンブルティ]";
	mes "完成だ!!";
	switch('@gain) {
	case 2630:	// ブリーシンガメン
		mes "おお、神々しい光だな。";
		mes "さすがに貴様の存在自体も霞む。";
		mes "但し決して忘れるな。";
		break;
	case 2629:	// メギンギョルド
		mes "さすがに重々しい威厳を感じる。";
		mes "見ているだけでも圧倒されるな。";
		mes "但し決して忘れるな。";
		break;
	case 2410:	// スレイプニール
		mes "おお、羽よりも軽いぞ！　履いても";
		mes "ほとんど重さを感じないだろう。";
		mes "但し決して忘れるな。";
		break;
	case 1530:	// ミョルニール
		mes "見た目が小さいからといって";
		mes "軽んじるな！　このミョルニールより";
		mes "優れた武器はこの世に存在しない。";
		mes "そして、決して忘れるな。";
		break;
	}
	mes "宝は自ら主人を選ぶのだぞ。";
	close2;
	warp "prontera.gat",156,325;
	end;
OnTimer10000:
	announce "グルンブルティ: 貴様に与えられた時間は今から10分だ！　早く走ってこい！",0x9;
	end;
OnTimer610000:
	announce "グルンブルティ: 遅い！　次の奴に会うことにする。",0x9;
	end;
OnTimer612000:
	areawarp "que_god01.gat",150,60,158,89,"prontera.gat",156,324;
	areawarp "que_god01.gat",136,90,173,108,"prontera.gat",156,324;
	areawarp "que_god01.gat",136,109,173,127,"prontera.gat",156,324;
	end;
OnTimer615000:
	stopnpctimer;
	enablewaitingroomevent "cquegod";
	end;
}
