//= Athena Script ==============================================================
// Ragnarok Online Kiel Hyre Quest Script     by Blaze
//= Registry ===================================================================
// KH_QUE -> 0～56
//==============================================================================

//============================================================
// 配達NPC
//------------------------------------------------------------
yuno_in01.gat,35,179,4	script	主人	46,3,3,{
	switch(KH_QUE) {
	case 0:
		mes "[バンド]";
		mes "…………";
		next;
		mes "[バンド]";
		mes "あ……";
		break;
	case 1:
		set '@str$,"何か困っているのですか？";
		mes "[バンド]";
		break;
	case 2:
	case 3:
 		mes "[バンド]";
		mes "時間に遅れないようにしてください。";
		mes "「^FF0000キル・ハイル学院^000000」の";
		mes "「^FF0000リコル・レイン婦人^000000」は気難しく、";
		mes "少しでも遅れると大変な事になります。";
		close;
	case 4:
		if(KH_QUE_SUB&0x1 == 0) {
			mes "[バンド]";
			mes "配達お疲れ様でした。";
			mes "本当に助かりました。";
			mes "よろしければ、少ないですが";
			mes "手数料と思って受け取ってください。";
			next;
			menu "できれば料理用ワインを……",-;
			mes "[バンド]";
			mes "おや、こちらのほうがいいですか？";
			mes "わかりました。";
			mes "少々お待ちください。";
			next;
			mes "ごそごそ……";
			mes "がさごそ……";
			mes "……";
			next;
			mes "[バンド]";
			mes "はい、どうぞ。";
			mes "お金も受け取ってください。";
			mes "私の感謝の気持ちです。";
			mes "どうもありがとうございました。";
			getitem 7487,1;
			set Zeny,Zeny+1000;
			set KH_QUE_SUB,KH_QUE_SUB|0x01;
			close;
		}
	default:
		mes "[バンド]";
		mes "以前は本当に助かりました。";
		mes "また、機会があれば";
		mes "よろしくお願いします。";
		close;
	}
	mes "いらっしゃいませ。";
	mes "何にしますか？";
	next;
	switch(select("ビール","カクテル","焼酎",'@str$,"今はまだ……")) {
	case 1:
		mes "[バンド]";
		mes "ビールですね。";
		mes "少々お待ちください。";
		next;
		mes "-………………-";
		next;
		mes "[バンド]";
		mes "お待たせしました。";
		mes "これは特製、";
		mes "「シュバルツピオ」といいます。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "シュバルツピオ……";
		mes "-鮮やかで濃い茶色が";
		mes "ガラスのコップの中できらめいている-";
		next;
		percentheal 0,-5;
		mes "[" +strcharinfo(0)+ "]";
		mes "ごく……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……へぇ…………";
		mes "おいしい。";
		next;
		mes "[バンド]";
		mes "ハハ。";
		mes "気に入られたようですね。";
		close;
	case 2:
		mes "[バンド]";
		mes "……";
		mes "お客様、申し訳ありません。";
		mes "ただいま在庫が無く……";
		mes "近いうちに";
		mes "準備しておきます。";
		close;
	case 3:
		mes "[バンド]";
		mes "……？";
		mes "「焼酎」ですか……";
		mes "お客様、申し訳ありません。";
		mes "そういったお酒は扱っておりません。";
		close;
	case 4:
		break;
	case 5:
		mes "[バンド]";
		mes "わかりました。";
		mes "決まり次第お呼びください。";
		close;
	}
	mes "[バンド]";
	mes "え……それは……";
	mes "どうやら独り言を聞かれたようですね。";
	mes "……実は配達職員がケガをしまして、";
	mes "入荷する商品と出荷する商品が";
	mes "溜まってきています……";
	next;
	mes "[バンド]";
	mes "入荷の方は取引先が";
	mes "何とかしてくださるそうですが……";
	mes "問題は出荷の方なのです。";
	mes "「キル・ハイル学院」に";
	mes "配達しなければならない品物が……";
	next;
	mes "[バンド]";
	mes "うーん……";
	next;
	if(select("大変ですね","私がお手伝いしましょうか？")==1) {
		mes "[バンド]";
		mes "えぇ、そうなんです……";
		mes "あ、申し訳ありません。";
		mes "無駄話がすぎましたね。";
		close;
	}
	mes "[バンド]";
	mes "え？";
	mes "それは助かりますが……";
	mes "少し厄介なことなのです。";
	mes "よろしいのでしょうか？";
	next;
	if(select("勿論です","少し考えてみます")==2) {
		mes "[バンド]";
		mes "…………";
		mes "わかりました……";
		close;
	}
	mes "[バンド]";
	mes "本当ですか？";
	mes "ありがとうございます。";
	next;
	mes "[バンド]";
	mes "では、配達する品物と";
	mes "受取人の名前をお教えします。";
	next;
	mes "[バンド]";
	mes "配達する品物は「^0000FF料理用ワイン^000000」";
	mes "そして、受取人は";
	mes "「キル・ハイル学院」の";
	mes "「^FF0000リコル・レイン婦人^000000」です。";
	next;
	mes "[バンド]";
	mes "それでは、";
	mes "よろしくお願いいたします。";
	getitem 7487,1;
	set KH_QUE,2;
	close;
OnTouch:
	if(KH_QUE == 0 && BaseLevel >= 70) {
		mes "[バンド]";
		mes "困りましたね……";
		mes "これはどうすれば……";
		set KH_QUE,1;
		close;
	}
	end;
}

yuno.gat,217,114,6	script	可愛い子供	96,{
	if(KH_QUE < 4) {
		mes "[スズ]";
		mes "トーストいかがでしゅか～";
		mes "あったかのほっかほかでちゅよ～";
		close;
	}
	if(KH_QUE == 4 && KH_QUE_SUB&0x2 == 0) {
		mes "[スズ]";
		mes "いらっちゃいまて～";
		mes "トーストはいかがでしゅか？";
		next;
		if(select("エリーの頼みできました","いいえ")==2) {
			mes "[スズ]";
			mes "またきてね～";
			close;
		}
		mes "[スズ]";
		mes "ん～？";
		mes "^FF0000エリー^000000姉たまの？";
		next;
		mes "[スズ]";
		mes "も～、大体わかりまつよ。";
		mes "ま～た実習の材料を落とちたんでちょ？";
		mes "ホント、^FF0000エリー^000000姉たまは";
		mes "おっちょこちょいでつね。";
		next;
		mes "[スズ]";
		mes "わかりまちた！";
		mes "^FF0000エリー^000000姉たまのために";
		mes "もう一度材料をあげまつよ。";
		next;
		mes "[スズ]";
		mes "……っと言いたいのでつが……";
		mes "ちょうど材料が切れてまちた。";
		mes "よかったらリヒタルゼンの精米所まで";
		mes "材料を取りに行ってもらえましゅか？";
		next;
		mes "[スズ]";
		mes "ジュノーのトーストショップと言えば";
		mes "小麦粉とたまごをもらえりゅはずでつ。";
		set KH_QUE_SUB,KH_QUE_SUB|0x2;
		close;
	}
	if(KH_QUE == 4 && KH_QUE_SUB&0x4 == 0) {
		mes "[スズ]";
		mes "リヒタルゼンの精米所で小麦粉と";
		mes "たまごを受け取ってきてくだたい。";
		mes "ジュノーのトーストショップから";
		mes "きたと言えばわかりゅと思いましゅ。";
		close;
	}
	if(KH_QUE == 4 && KH_QUE_SUB&0x8 == 0) {
		mes "[スズ]";
		mes "お疲れさまでちた。";
		mes "これがあなたの小麦粉とたまごでつ。";
		mes "^FF0000エリー^000000姉たまに";
		mes "がんばれって言っておいてくだちゃい。";
		delitem 7488,1;
		getitem 7488,1;
		set KH_QUE_SUB,KH_QUE_SUB|0x8;
		close;
	}
	mes "[スズ]";
	mes "焼きたてほっかほかの";
	mes "トーストはいかがでちゅか～？";
	close;
}

lighthalzen.gat,366,301,4	script	精米所の主人	46,{
	if(KH_QUE < 4 || (KH_QUE == 4 && KH_QUE_SUB&0x2 == 0)) {
		mes "[ミルス]";
		mes "何だ？";
		mes "今は忙しいから後にしてくれ。";
		close;
	}
	if(KH_QUE == 4 && KH_QUE_SUB&0x6 == 0x2) {
		mes "[ミルス]";
		mes "何だ？";
		mes "今は忙しいから後にしてくれ。";
		next;
		if(select("ジュノーのトーストショップから……","…………")==2) {
			mes "[ミルス]";
			mes "……なんだ、まだいたのか。";
			mes "どっか行ってくれないか。";
			close;
		}
		mes "[ミルス]";
		mes "ああ……";
		mes "おちびちゃんのとこのやつか。";
		mes "ちょっと待っててくれ。";
		next;
		mes "[ミルス]";
		mes "ったく……";
		mes "あれをどこに置きやがった……";
		mes "あのやろぅ、働きもしねぇで……";
		next;
		mes "[ミルス]";
		mes "あぁ、あったあった。";
		mes "わかってるだろうが、";
		mes "たまごは割れやすいから気をつけろよ。";
		getitem 7488,1;
		set KH_QUE_SUB,KH_QUE_SUB|0x4;
		close;
	}
	mes "[ミルス]";
	mes "ったく、忙しい……";
	mes "毎日毎日働いてばかりだ。";
	mes "たまには遊びに行きてぇ。";
	close;
}

lighthalzen.gat,366,289,2	script	精米所の助手	84,{
	if(KH_QUE < 4 || (KH_QUE == 4 && KH_QUE_SUB&0x2 == 0)) {
		mes "[クス]";
		mes "チッ……";
		mes "大して忙しくもないくせに";
		mes "忙しいふりをしやがって……";
		mes "ぶつぶつ……";
		close;
	}
	if(KH_QUE == 4 && KH_QUE_SUB&0x6 == 0x2) {
		mes "[クス]";
		mes "わッ!?";
		mes "あ、遊んでねぇよ！";
		mes "ほら見ろ！　働いてるだろ！";
		mes "ったく……ぶつぶつ……";
		close;
	}
	mes "[クス]";
	mes "あ～";
	mes "ジュノーのトーストショップね。";
	mes "知ってる知ってる。";
	mes "あそこの女の子、可愛いよなぁ。";
	mes "……ウヘヘ…………";
	close;
}

//============================================================
// キル・ハイル学院NPC1
//------------------------------------------------------------
yuno_fild08.gat,196,196,5	script	少女	102,{
	mes "[少女]";
	mes "あーぁ、私も「^0000FFキル・ハイル学院^000000」に";
	mes "入学したいのになー";
	mes "どうしてお母さんは";
	mes "私を孤児にしてくれなかったの……";
	next;
	menu "キル・ハイル学院？",-;
	mes "[少女]";
	mes "ん？　この建物のことよ。";
	mes "孤児だけが入学できる学院。";
	next;
	mes "[少女]";
	mes "学院を建てた人は";
	mes "「^FF0000キル・ハイル^000000」といって、";
	mes "変な機械をたくさん作って";
	mes "大儲けしたんだって。";
	next;
	mes "[少女]";
	mes "それで……えーっと、社会福祉？";
	mes "孤児たちのためにこの学院を";
	mes "建てたんだってさ。";
	next;
	mes "[少女]";
	mes "この学院を卒業すれば";
	mes "良い企業に就職できるって言うけど……";
	mes "あーぁ、私も学院に入学したーい。";
	close;
}

yuno_fild08.gat,158,194,6	script	ガードマン#kh	852,{
	if(KH_QUE > 15) {
		mes "[ガードマン]";
		mes "一般人は立ち入り禁止です。";
		mes "用件、または約束が無い限り";
		mes "学院内への立ち入りは許可できません。";
		close;
	}
	if(KH_QUE > 2) {
		mes "[ガードマン]";
		mes "まだ用件が";
		mes "終わっていないのですか？";
		close2;
		warp "kh_school.gat",71,155;
		end;
	}
	mes "[ガードマン]";
	mes "ここは「^0000FFキル・ハイル学院^000000」。";
	mes "一般人は立ち入り禁止です。";
	mes "用件、または約束が無い限り";
	mes "学院内への立ち入りは許されません。";
	if(KH_QUE < 2)
		close;
	next;
	if(select("配達にきました","…………")==2) {
		mes "[ガードマン]";
		mes "用件が無いなら";
		mes "学院から離れてください。";
		close;
	}
	mes "[ガードマン]";
	mes "配達ですか？";
	mes "まずは受取人の名前。";
	mes "次に配達品が何か";
	mes "おっしゃってください。";
	next;
	input '@str$;
	if(substr('@str$,0,6) != "リコル") {
		mes "[ガードマン]";
		mes '@str$;
		mes "という方は、当学院において";
		mes "受取人に登録されていません。";
		mes "配達先を間違っていませんか？";
		close;
	}
	input '@str$;
	mes "[ガードマン]";
	mes "^0000FF" +'@str$+ "^000000を";
	mes "^FF0000リコル・レイン婦人^000000にですか？";
	mes "確認するのでしばらくお待ちください。";
	next;
	mes "-ガードマンは後にある";
	mes "何かを操作している-";
	next;
	mes "[ガードマン]";
	mes "はい。正門です。";
	mes "^FF0000リコル・レイン婦人^000000への配達です。";
	mes "確認をお願いします。";
	mes "配達品は";
	mes "^0000FF" +'@str$+ "^000000です。";
	next;
	mes "[ガードマン]";
	mes "……はい……はい……";
	mes "……はい。わかりました。";
	next;
	if('@str$ != "料理用ワイン") {
		mes "[ガードマン]";
		mes "確認した所、^FF0000リコル・レイン婦人^000000は";
		mes "そのような品物は";
		mes "注文したことがないとのことです。";
		next;
		mes "[ガードマン]";
		mes "受取人、品物を";
		mes "よく確認してみてください。";
		close;
	}
	mes "[ガードマン]";
	mes "確認させてもらいます";
	mes "「^FF0000リコル・レイン婦人^000000」宛ての";
	mes "「^0000FF料理用ワイン^000000」。";
	mes "間違いありませんね？";
	next;
	menu "はい",-;
	mes "[ガードマン]";
	mes "確認できました。";
	mes "直接受け取るそうなので";
	mes "学院内への立ち入りを許可します。";
	close2;
	warp "kh_school.gat",71,155;
	end;
}
yuno_fild08.gat,158,185,0	duplicate(ガードマン#kh)	ガードマン	852

kh_school.gat,57,142,6	script	学生	893,3,3,{
	mes "[ラシ]";
	mes "ん？……誰？";
	mes "学院内は立ち入り禁止って";
	mes "知らないの？";
	close;
OnTouch:
	mes "[ラシ]";
	mes "ねぇねぇ。";
	mes "あのうわさ聞いた？";
	next;
	mes "[クィネシャ]";
	mes "うん？";
	mes "あのうわさ？";
	next;
	mes "[ラシ]";
	mes "そうそう。";
	mes "幽霊が現われたんだって～";
	mes "幽霊よ幽霊……";
	next;
	mes "[クィネシャ]";
	mes "え……幽霊……？";
	mes "……まさかぁ……";
	next;
	mes "[ラシ]";
	mes "本当の事らしいよ。";
	mes "隣のクラスの「アシ」って子。";
	mes "知ってる？";
	mes "あの子、最近見ないじゃない。";
	mes "どうやら幽霊を見て……";
	next;
	mes "[クィネシャ]";
	mes "それ本当なの？";
	mes "恐～い……";
	mes "ねぇ、そんな話もうやめよ？";
	close;
}

kh_school.gat,57,139,0	script	学生	893,{
	emotion 19;
	mes "[クィネシャ]";
	mes "うん……";
	mes "うん……あそこ……";
	mes "そうそう……";
	mes "うんうん……";
	close;
}

kh_school.gat,176,60,4	script	婦人	101,{
	if(KH_QUE != 2) {
		mes "[リコル・レイン]";
		mes "用事を終えたのでしたら";
		mes "はやくお帰りください。";
		mes "まったく、最近の人は……";
		close;
	}
	mes "[リコル・レイン]";
	mes "何か御用ですか？";
	next;
	if(select("配達に来ました","何でもないです")==2) {
		mes "[リコル・レイン]";
		mes "ここは部外者";
		mes "立ち入り禁止なのですから、";
		mes "むやみに歩き回らないでください。";
		close;
	}
	mes "[リコル・レイン]";
	mes "あぁ、そうでしたね。";
	mes "予想以上の遅れです。";
	mes "次からはちゃんと約束の時間に";
	mes "届けるようにしてください。";
	mes "また遅れるようでしたら";
	mes "取引先を変えさせてもらいます。";
	next;
	mes "[リコル・レイン]";
	mes "それに……";
	mes "[????]";
	mes "ふぇ？　……ふわわわ!?";
	next;
	mes "-ガチャ　どてん！-";
	mes "[????]";
	mes "あぃ……たたたたたぁ～";
	next;
	mes "………………";
	mes "…………";
	mes "……";
	next;
	mes "[リコル・レイン]";
	mes "ふぅ……「^FF0000エリー^000000」。";
	mes "またこんなことを……";
	mes "一体いつまで遊んでいるのですか？";
	mes "今日の夕方までクッキーができないと";
	mes "今学期は留年ですよ。";
	mes "わかっているのですか？";
	next;
	mes "[エリー]";
	mes "ふ、ふえぇぇぇ!?";
	mes "そ……それだけは……";
	next;
	mes "[リコル・レイン]";
	mes "「^FF0000エリー^000000」!!";
	next;
	mes "[エリー]";
	mes "ふぇ！";
	mes "わ……わかりました！";
	mes "先生！";
	next;
	mes "[リコル・レイン]";
	mes "よろしい。";
	mes "…………さて。";
	mes "荷物は受け取ったので";
	mes "あなたはお引取りください。";
	mes "学院内に長居されては困ります。";
	delitem 7487,1;
	set KH_QUE,3;
	close;
}

kh_school.gat,179,39,0	script	可愛い学生	895,{
	cutin "kh_elly01",2;
	switch(KH_QUE) {
	default:
		cutin "kh_elly03",2;
		mes "[エリー]";
		mes "ふぇ!?　ふわわわッ！";
		mes "……ッホ……";
		mes "まーた落とすとこだったぁ～";
		mes "あぶないあぶない。";
		break;
	case 3:
		cutin "kh_elly03",2;
		mes "[エリー]";
		mes "あー、ぅー……";
		mes "どうしよ、どうしよぅ～";
		mes "ふぇぇ……";
		next;
		if(select("どうしたの？","…………")==2) {
			mes "[エリー]";
			mes "ふぇぇぇぇ……";
			break;
		}
		mes "[エリー]";
		mes "ふぇ？";
		mes "そ……それが……";
		mes "クッキーを作らないといけないのに、";
		mes "材料を落としちゃって……";
		mes "ふ……ふぇ……";
		mes "今日の夕方までなのに～";
		next;
		if(select("私が手伝おうか？","それは……ねぇ……")==2) {
			mes "[エリー]";
			mes "ふぇぇ……";
			mes "ど、どうしよう……";
			mes "ふぇ……";
			mes "あ、そうだ！";
			next;
			menu "????",-;
			mes "[エリー]";
			mes "あの……";
			mes "配達屋さんですよね？";
			mes "よかったら手伝ってください！";
			mes "ね？　お願い！";
			mes "お願いします！";
			next;
			mes "-少女は急に私の腕を取り";
			mes "頼み始めた-";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "え？";
			mes "ぁ……いや……その……";
			mes "アハハ……";
			next;
			mes "[エリー]";
			mes "ね？　ね？";
			mes "手伝って！";
			mes "お願い！";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "アハハー…………";
			next;
			if(select("手伝ってあげる","断る")==2) {
				mes "[" +strcharinfo(0)+ "]";
				mes "ごめん。";
				mes "仕事が忙しくて……";
				next;
				cutin "kh_elly04",2;
				emotion 28;
				mes "[エリー]";
				mes "ふぇ？";
				mes "そうなんですか……";
				mes "無理言ってごめんなさい。";
				mes "…………ふぇぇ……";
				mes "どうしよう…………";
				break;
			}
		}
		cutin "kh_elly02",2;
		mes "[エリー]";
		mes "ふええええ～～～!?";
		mes "ほ……ホント？";
		mes "ほんとにホント!?";
		mes "あ、ありがとう！";
		mes "ありがとう、ありがとう、ありがとう、";
		mes "ありがとう！";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "え？　うん……ハハ……";
		next;
		mes "[エリー]";
		mes "エヘッ、エヘヘ。";
		mes "ありがと！";
		mes "エヘヘ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "ア、アハハ……";
		mes "それで……";
		mes "何を手伝えばいいかな？";
		next;
		cutin "kh_elly03",2;
		mes "[エリー]";
		mes "ふぇ……それが……";
		mes "実は、さっきクッキーの材料を";
		mes "落としちゃったから";
		mes "材料を集めてこないと……";
		next;
		mes "[エリー]";
		mes "私が持ってた";
		mes "最後の材料だったから……";
		mes "ふ、ふぇぇ……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "あぁぁ、大丈夫！　大丈夫だから！";
		mes "ほら、ちゃんと最後まで話して。";
		mes "クッキーの材料を集めてくればいいの？";
		next;
		mes "[エリー]";
		mes "うん……";
		mes "……でも……";
		mes "いきなりこんなこと";
		mes "お願いするなんて……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "気にしなくていいから。";
		mes "早く材料を教えて。";
		mes "早くしないと神経質なご婦人に";
		mes "留年させられちゃうよ？";
		next;
		cutin "kh_elly01",2;
		mes "[エリー]";
		mes "ふぇ!?";
		mes "は、はい！";
		mes "え……っと……材料は……";
		mes "^FF0000小麦粉1、たまご1、チーズ2、";
		mes "料理用ワイン1、ミルク7、カカオ5^000000";
		mes "これだけ必要です！";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "う……ん……";
		mes "ちょっと多いね……";
		next;
		cutin "kh_elly04",2;
		mes "[エリー]";
		mes "ふぇぇ……";
		mes "ご、ごめんなさい……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "あ……いや、大丈夫だよ。";
		mes "それにしても……";
		mes "珍しい物もあるけど、";
		mes "その材料はどこで手に入るの？";
		next;
		cutin "kh_elly03",2;
		mes "[エリー]";
		mes "「^0000FF小麦粉^000000」と「^0000FFたまご^000000」は";
		mes "^009C00ジュノー^000000にいる「^0000FFトーストショップ^000000」に";
		mes "お願いすればくれるはずです。";
		mes "「^0000FF料理用ワイン^000000」は同じ^009C00ジュノー^000000の";
		mes "「^FF0000酒店^000000」に置いてあります。";
		next;
		mes "[エリー]";
		mes "「^0000FFカカオ^000000」は「^FF0000ヨーヨー^000000」という";
		mes "動物から手に入るらしいです。";
		next;
		mes "[エリー]";
		mes "ごめんなさい。";
		mes "沢山あって大変だと思うけど……";
		mes "よろしくお願いします！";
		set KH_QUE,4;
		break;
	case 4:
		if(KH_QUE_SUB < 0xF || countitem(548) < 2 || countitem(519) < 7 || countitem(7182) < 5) {
			mes "[エリー]";
			mes "「^0000FF小麦粉^000000」と「^0000FFたまご^000000」は";
			mes "^009C00ジュノー^000000にいる「^0000FFトーストショップ^000000」に";
			mes "お願いすればくれるはずです。";
			mes "「^0000FF料理用ワイン^000000」は同じ^009C00ジュノー^000000の";
			mes "「^FF0000酒店^000000」に置いてあります。";
			next;
			mes "[エリー]";
			mes "「^0000FFカカオ^000000」は「^FF0000ヨーヨー^000000」という";
			mes "動物から手に入るらしいです。";
			mes "沢山あって大変だと思うけど……";
			mes "よろしくお願いします！";
			break;
		}
		cutin "kh_elly02",2;
		mes "[エリー]";
		mes "ふぇ!?";
		mes "もう集まったの!?";
		mes "エヘヘ……";
		mes "本当にありがと！";
		mes "エヘヘッ。";
		next;
		emotion 2;
		mes "[エリー]";
		mes "エヘヘ……";
		mes "ふぇ！";
		mes "そ、そうだ！　早く作らないと！";
		mes "ちょ、ちょっと待っててね。";
		mes "ふぇぇぇ……";
		delitem 7488,1;
		delitem 548,2;
		delitem 7487,1;
		delitem 519,7;
		delitem 7182,5;
		set KH_QUE,5;
		set KH_QUE_SUB,0;
		break;
	case 5:
		mes "[エリー]";
		mes "じゃんじゃじゃ～ん。";
		mes "エリー特製クッキーの完成～";
		mes "エッヘッヘ～";
		next;
		mes "[エリー]";
		mes "ありがとう。";
		mes "おかげで助かっちゃった。";
		mes "エヘヘッ……";
		mes "本当にありがと……";
		next;
		mes "[エリー]";
		mes "ふぇ!?";
		mes "そういえば名前！";
		mes "名前言うの忘れてた！";
		mes "私はエルリシャ。";
		mes "^FF0000エリー^000000がニックネームなの。";
		mes "よろしくね。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "私は^0000FF" +strcharinfo(0)+ "^000000。";
		mes "よろしく。";
		next;
		cutin "kh_elly02",2;
		mes "[エリー]";
		mes "エヘヘッ……";
		mes strcharinfo(0)+ " さんだね。";
		mes "よかったらコレ、もらって。";
		mes "感謝の気持ちだよ。";
		getitem 538,5;
		set KH_QUE,6;
		break;
	case 6:
		mes "[エリー]";
		mes "ふぇ……あ……";
		mes "……ごめんなさい！";
		mes "またお願いができちゃった。";
		mes "……いい……かなぁ？";
		next;
		if(select("お願い？","ごめん。今は忙しくて……")==2) {
			cutin "kh_elly03",2;
			mes "[エリー]";
			mes "ふぇ!?";
			mes "……ふぇぇ……";
			mes "それじゃ仕方ないよね……";
			mes "ふぇぇ…………";
			break;
		}
		mes "[エリー]";
		mes "うん……その……";
		mes "私にはとっても大好きな";
		mes "お爺ちゃんがいるの。";
		mes "とっても……とっても大切な人。";
		next;
		mes "[エリー]";
		mes strcharinfo(0)+ "さんが";
		mes "手伝ってくれたおかげで、";
		mes "初めてクッキーが上手に焼けたの！";
		mes "いっつもクッキーは";
		mes "失敗しちゃってたから……";
		mes "エヘヘッ……";
		next;
		mes "[エリー]";
		mes "だから……だから……";
		mes "お爺ちゃんにこのクッキーを";
		mes "食べてもらいたいの！";
		mes "お爺ちゃん、きっと";
		mes "すごく喜ぶと思うの！";
		next;
		mes "[エリー]";
		mes "できれば私が";
		mes "直接渡したいんだけど、";
		mes "学院を出るのは許されてないから……";
		mes "クッキーも焼きたてじゃないと";
		mes "味が落ちちゃうと思うし……";
		next;
		mes "[エリー]";
		mes "…………";
		mes "………………";
		mes "ふぇぇ…………";
		next;
		if(select("わかった、渡してくるよ","今はちょっと忙しいんだ")==2) {
			cutin "kh_elly03",2;
			mes "[エリー]";
			mes "ふぇぇ……";
			mes "それじゃ仕方ないよね……";
			break;
		}
		cutin "kh_elly02",2;
		mes "[エリー]";
		mes "ふぇ！　あ、ありがとう！";
		mes "本当にありがと！";
		mes strcharinfo(0)+ "さんは優しいね。";
		mes "エヘッ……";
		mes "エヘヘッ……";
		next;
		mes "[エリー]";
		mes "お爺ちゃんは「^0000FFキル・ハイルの別荘^000000」に";
		mes "住んでいるの。";
		mes "エリーからの贈り物って言えば";
		mes "会ってくれるはずだよ。";
		set KH_QUE,7;
		break;
	case 7:
		mes "[エリー]";
		mes "「^FF0000キル・ハイルの別荘^000000」は";
		mes "「^FF0000この学院の北^000000」にあるよ。";
		break;
	case 8:
		cutin "kh_elly03",2;
		mes "[エリー]";
		mes "ふぇ？";
		mes "お爺ちゃんが出張中？";
		mes "…………";
		next;
		mes "[エリー]";
		mes "おっかしいなぁ……";
		mes "出張なんて聞いてないのに……";
		mes "今日は別荘にいるはずなんだけどなぁ。";
		next;
		cutin "kh_elly04",2;
		mes "[エリー]";
		mes "あの……";
		mes "もう一度行ってもらえないかな？";
		mes "今度はこの鍵を使って。";
		mes "この鍵を使えば別荘の中に";
		mes "入れるよ。";
		getitem 7489,1;
		set KH_QUE,9;
		break;
	case 9:
	case 10:
		mes "[エリー]";
		mes "変だなぁ……";
		mes "ちゃんといるって";
		mes "言ってたのに……";
		mes "ふ、ふぇぇ…………";
		break;
	case 11:
		mes "[エリー]";
		mes "え？";
		mes "これは……";
		mes "…………";
		next;
		mes "-エリーは封筒を開けて";
		mes "中の手紙を読み始めた-";
		next;
		mes "-エリーへ-";
		mes "息子と話すことがあるので、";
		mes "本家にいるキエルに会いに行く。";
		mes "もしこの手紙を残した日から";
		mes "一週間以上連絡が無かったら、";
		mes "お前のために残しておいた";
		mes "物を持って学院を出なさい。";
		next;
		mes "それは別荘の書斎に隠しておいた。";
		mes "お前に信頼できる友人がいるなら、";
		mes "その人に頼んで、別荘に残した";
		mes "いくつかのメッセージを辿って";
		mes "荷物を探してもらうといい。";
		next;
		mes "もしかすると";
		mes "危ない目にあうかも知れない……";
		mes "しかし、お前が信じている";
		mes "友人なら大丈夫だと";
		mes "私も信じるとしよう……";
		next;
		mes "ただ、学院の学生や関係者はだめだ。";
		mes "彼らはキエルと関係があるかもしれん。";
		mes "必ず学院と関わりの無い者にしか";
		mes "この手紙の事は話してはならない。";
		mes "わかるな、エリー。";
		mes "では、気を付けて行動しなさい。";
		next;
		cutin "kh_elly03",2;
		mes "[エリー]";
		mes "お爺ちゃん……";
		mes "前にあった日から";
		mes "もう10日も経っているよ……";
		mes "……お爺ちゃん、何かあったの？";
		mes "私……どうすれば…………";
		mes "ふ……ふぇ…………";
		delitem 7490,1;
		set KH_QUE,12;
		break;
	case 12:
		cutin "kh_elly03",2;
		mes "[エリー]";
		mes "ふぇぇ…………";
		next;
		switch(select("お爺さんについて聞いてみる","息子というキエルについて聞いてみる","学院について聞いてみる")) {
		case 1:
			mes "[" +strcharinfo(0)+ "]";
			mes "エリーのお爺さんって、";
			mes "どんな人なの？";
			mes "何か複雑な事情が";
			mes "あるみたいだけど……";
			next;
			mes "[エリー]";
			mes "…………";
			mes "私のお爺ちゃんはキル・ハイル。";
			mes "財団の会長である";
			mes "「^FF0000キル・ハイル^000000」会長。";
			next;
			mes "[エリー]";
			mes "でも、孤児だった私を";
			mes "小さい頃から大事にしてくれた";
			mes "親のような人……";
			mes "厳しそうに見えるけど";
			mes "誰よりも暖かくて……優しい人……";
			next;
			mes "[エリー]";
			mes "それなのに……";
			mes "……お爺ちゃん……";
			mes "無事なの……？";
			break;
		case 2:
			mes "[" +strcharinfo(0)+ "]";
			mes "手紙に書いてある";
			mes "お爺さんの息子さん、";
			mes "「^0000FFキエル^000000」ってどんな人？";
			mes "お爺さんと仲が悪いみたいだけど……";
			next;
			mes "[エリー]";
			mes "「^0000FFキエル^000000」さんの事は";
			mes "私も良く知らないの。";
			mes "学院内での行事の時、";
			mes "そのたった一度でしか見たことないの。";
			next;
			mes "[エリー]";
			mes "でも……顔だけは忘れられない……";
			mes "冷たい銀髪とすごく恐い目つき。";
			mes "鋭くて刺さりそうな視線で";
			mes "みんなを見てた……";
			next;
			mes "[エリー]";
			mes "男だけどきれいな顔に白い肌を";
			mes "持った綺麗な人。";
			mes "学院の中にも「^0000FFキエル^000000」さんに憧れる";
			mes "人は多いみたい。";
			next;
			mes "[エリー]";
			mes "でも、お爺ちゃんと「^0000FFキエル^000000」さんは";
			mes "仲がとっても悪かったみたい。";
			next;
			mes "[エリー]";
			mes "お爺ちゃんは「^0000FFキエル^000000」さんの";
			mes "話が出るとすぐに怒ってた。";
			mes "詳しい事は聞けなかったけど";
			mes "何度も言い争ってるみたい。";
			next;
			mes "[エリー]";
			mes "どうして仲が悪いんだろ……";
			mes "あんなに綺麗な人と";
			mes "優しいお爺ちゃんなのに……";
			break;
		case 3:
			mes "[" +strcharinfo(0)+ "]";
			mes "この学院は一体どんな所？";
			mes "学院にしては保安が徹底的。";
			mes "施設もすごくしっかりしてる";
			mes "ように見えるんだけど。";
			next;
			mes "[エリー]";
			mes "ここは、キル・ハイル財団が建てた";
			mes "孤児たちのための専門学院。";
			mes "志望する職業の専門教育を";
			mes "受けることができるの。";
			next;
			mes "[エリー]";
			mes "あ、私はカプラサービスと";
			mes "キル・ハイル本社の秘書職を";
			mes "志望してるの。";
			mes "「^0000FFエリシア^000000」さんのように";
			mes "素敵な女性になるのが夢！";
			mes "エヘヘッ……";
			next;
			mes "[エリー]";
			mes "でも……ふぇ……";
			mes "最近、学院の中で";
			mes "変な事が起きてるの。";
			mes "みんな、一人でいるのを";
			mes "恐がるぐらい…………";
			next;
			cutin "kh_elly02",2;
			mes "[エリー]";
			mes "でも、私は大丈夫！";
			mes "いざとなったら";
			mes "「" +strcharinfo(0)+ "」さんが";
			mes "助けてくれるはずだもんね！";
			mes "エヘヘッ……";
			next;
			if(select("^0000FFエリシア^000000さん？","変な事？")==1) {
				mes "[エリー]";
				mes "お爺ちゃんの秘書。";
				mes "すっごく綺麗なんだから！";
				break;
			}
			cutin "kh_elly04",2;
			mes "[エリー]";
			mes "……これは外部の人に";
			mes "話しちゃいけないって";
			mes "言われてるんだけど……";
			mes "「" +strcharinfo(0)+ "」さんは";
			mes "私にとって特別な人だから";
			mes "話してあげるね。";
			next;
			mes "[エリー]";
			mes "……最近、学院内に幽霊が";
			mes "出るの！";
			mes "…………";
			mes "……ふぇ……信じてないでしょ！";
			mes "本当の事なんだからね！";
			next;
			mes "[エリー]";
			mes "あのね、幽霊は毎晩";
			mes "学院の中をうろついてるの。";
			mes "その幽霊と出会っちゃったら最後。";
			mes "幽霊の呪いの言葉を聞いた途端、";
			mes "体が人形みたいに固まっちゃうの！";
			next;
			mes "[エリー]";
			mes "学院内のある部屋に泊まっていた";
			mes "私の友達「マヨ」も幽霊に出会って";
			mes "人形みたいにされちゃったの……";
			mes "後で「マヨ」が医務室に移されたって";
			mes "聞いて、先生がいない時に医務室に";
			mes "行ってみたの…………";
			next;
			mes "[エリー]";
			mes "……ベッド上に「マヨ」はいた……";
			mes "でも……いくら話しかけても";
			mes "全然返事が無くて……";
			mes "何の反応も無い……";
			mes "本当に……人形みたいだったの！";
			next;
			mes "[エリー]";
			mes "……その瞬間、";
			mes "私はとても恐くなって";
			mes "医務室から逃げ出したの……";
			next;
			mes "[エリー]";
			mes "私もその幽霊に出会っちゃったら、";
			mes "そんな風になっちゃうの？";
			mes "「" +strcharinfo(0)+ "」さんの事も";
			mes "わからなくなっちゃうの？";
			next;
			cutin "kh_elly02",2;
			mes "[エリー]";
			mes "うぅん……そんなことない！";
			mes "私がもし幽霊と出会って";
			mes "呪われちゃっても、";
			mes "「" +strcharinfo(0)+ "」さんが";
			mes "きっと助けてくれるよね！";
			mes "エヘヘッ……";
			next;
			mes "[エリー]";
			mes "私が固まっちゃっても、";
			mes "「" +strcharinfo(0)+ "」さんが";
			mes "「^FF0000エリー、起きて^000000」";
			mes "って言ってくれれば";
			mes "きっとすぐに動けるようになるよ。";
			mes "エヘヘッ……";
			next;
			mes "[エリー]";
			mes "「^FF0000エリー、起きて^000000」だよ。";
			mes "何か他の変な事言われたら";
			mes "怒ってずっと人形のままなんだから！";
			mes "……なんてね。";
			next;
			mes "[エリー]";
			mes "エヘヘッ……";
			mes "それじゃ「" +strcharinfo(0)+ "」さんも";
			mes "困っちゃうでしょ？";
			set KH_QUE,13;
			break;
		}
		break;
	case 13:
		cutin "kh_elly04",2;
		mes "[エリー]";
		mes "ふぇ!?　大変！";
		mes "課題の提出時間忘れてた！";
		mes "私、もうリコル・レイン先生に";
		mes "会いに行かないと。";
		next;
		mes "[エリー]";
		mes "あの……よかったら別荘に行って";
		mes "^FF0000お爺ちゃんが残してくれた物^000000を";
		mes "探してもらえないかな？";
		mes "私が信じられる人は";
		mes "「" +strcharinfo(0)+ "」さん";
		mes "しかいないの……";
		next;
		mes "[リコル・レイン]";
		mes "……リー！";
		mes "…………エリー!!";
		mes "課題の提出時間ですよ！";
		mes "今が何時なのか、";
		mes "わかっているのですか！";
		next;
		mes "[エリー]";
		mes "ふぇえぇ!?";
		mes "ごめんね！";
		mes "もう行かないと！";
		next;
		mes "[エリー]";
		mes "ぁ!?　そうそう！";
		mes "今日の夕方頃、";
		mes "寮の私の部屋にきて。";
		mes "まだ話したいことがあるから！";
		next;
		mes "[エリー]";
		mes "寮は学院の後ろにあるの。";
		mes "私の部屋は寮の南側の2階。";
		mes "玄関から一番奥の部屋で、";
		mes "梯子で上がってこれるの。";
		mes "戻ったら窓は開けておくからね！";
		set KH_QUE,14;
		break;
	case 14:
	case 15:
		mes "[エリー]";
		mes "ほらほら、早く行って！";
		mes "先生が怒っちゃうよ!?";
		break;
	}
	close2;
	cutin "kh_elly01",255;
	end;
}

//============================================================
// キル・ハイルの別荘NPC
//------------------------------------------------------------
yuno_fild02.gat,93,210,4	script	ガードマン	85,{
	mes "[ガードマン]";
	mes "ここは私有地です。";
	mes "許可無しに立ち入らないでもらいたい。";
	if(KH_QUE != 7)
		close;
	next;
	if(select("^FF0000キル・ハイル^000000さんに会いたい","わかりました")==2) {
		mes "[ガードマン]";
		mes "さようなら。";
		close;
	}
	mes "[ガードマン]";
	mes "約束されていますか？";
	next;
	if(select("はい","いいえ")==2) {
		mes "[ガードマン]";
		mes "約束がなければ会う事はできません。";
		mes "お引き取りください。";
		close;
	}
	mes "[ガードマン]";
	mes "……申し訳ありませんが、";
	mes "主人は出張中です。";
	mes "お引き取りください。";
	set KH_QUE,8;
	close;
}

yuno_fild02.gat,75,218,0	script	門	111,{
	if(KH_QUE >= 10) {
		mes "-鍵が開いている-";
		next;
		if(select("入る","入らない")==2)
			close;
		warp "kh_vila.gat",188,18;
		end;
	}
	mes "-扉には鍵が掛けられている-";
	if(KH_QUE != 9)
		close;
	next;
	if(select("エリーの鍵を使う","ほおっておく")==2) {
		mes "…………";
		close;
	}
	mes "-鍵を使って扉を開けると、";
	mes "扉の間に挟まっていたのか……";
	mes "何かが書かれた紙切れが落ちた-";
	mes "-しかし、紙切れは拾う間もなく、";
	mes "風に吹かれて飛んでいってしまった-";
	next;
	mes "-一瞬の事だったが、確か";
	mes "「^FF0000前に6歩、左に3歩、";
	mes "前に3歩、左に4歩^000000」";
	mes "と書かれていた-";
	mes "-何の事かわからないが、";
	mes "覚えておいた方がいいだろう-";
	set KH_QUE,10;
	close2;
	warp "kh_vila.gat",188,18;
	end;
}

yuno_fild02.gat,109,218,0	script	門	111,{
	mes "-扉には鍵が掛けられている-";
	if(KH_QUE != 9)
		close;
	next;
	if(select("エリーの鍵を使う","ほおっておく")==2) {
		mes "…………";
		close;
	}
	mes "-エリーから受け取った";
	mes "鍵とは違うようだ-";
	close;
}

kh_vila.gat,179,11,0	script	#手紙	139,1,1,{
OnTouch:
	if(KH_QUE == 10) {
		mes "-床に落ちている";
		mes "「^FF0000手紙^000000」を拾い上げた-";
		getitem 7490,1;
		set KH_QUE,11;
		close;
	}
	mes "-何も無いようだ-";
	close;
}

kh_vila.gat,184,20,0	script	本#kiel	111,{
	if(KH_QUE != 14 || rand(5)) {
		mes "-本がある-";
		close;
	}
	mes "-本棚から一冊の本を取り出すと";
	mes "階段横の壁から通路が現われた-";
	misceffect 316,"壁#kiel";
	set KH_QUE,15;
	close;
}
kh_vila.gat,181,20,0	duplicate(本#kiel)	本	111
kh_vila.gat,178,20,0	duplicate(本#kiel)	本	111
kh_vila.gat,175,19,0	duplicate(本#kiel)	本	111

kh_vila.gat,191,14,0	script	壁#kiel	111,{
	if(KH_QUE >= 20) {
		mes "通路が塞がれている。";
		close;
	}
	if(KH_QUE < 15) {
		mes "-ただの壁のように見える-";
		mes "-だが、どこか違和感を感じるのは";
		mes "気のせいだろうか？-";
		close;
	}
	mes "-秘密の通路が続いている-";
	next;
	if(select("奥に行く","使わない")==2)
		close;
	warp "kh_vila.gat",17,177;
	end;
}

kh_vila.gat,16,175,0	script	箱	111,{
	mes "-おいしくて栄養価の高い";
	mes "ペットフード自動販売機-";
	mes "-あなたの可愛いペットのために！-";
	mes "-市販とは一味違うその旨さ！-";
	next;
	mes "-使用方法-";
	mes "-投入口に1100Zenyを入れて、";
	mes "ダイヤルを右に2度回してください-";
	mes "-おいしくて栄養価の高い";
	mes "ペットフードが出てきます-";
	next;
	if(select("試してみる","やめておく")==2) {
		mes "-なんだか怪しそうに見える-";
		mes "-やめておこう-";
		close;
	}
	if(Zeny < 1000) {
		mes "-Zenyが足りない-";
		close;
	}
	mes "-少し高いようだが試してみよう-";
	next;
	mes "-…………-";
	mes "-ただのペットフードにしか見えない-";
	set Zeny,Zeny-1000;
	getitem 537,1;
	close;
}

kh_vila.gat,30,184,0	script	リンゴ箱	111,{
	mes "-おいしそうなリンゴが";
	mes "いっぱいに盛られている-";
	next;
	if(select("持って行く","持って行かない")==2) {
		mes "-なんだか怪しそうに見える-";
		mes "-やめておこう-";
		close;
	}
	mes "-りんごを手にしようとした瞬間、";
	mes "嫌な臭いがしてきた-";
	mes "-……ま、まさか……-";
	next;
	mes "-このリンゴは危険すぎる-";
	mes "-やめておこう-";
	close;
}

kh_vila.gat,44,126,0	script	地図	111,{
	if(KH_QUE_SUB&0x004 || KH_QUE >= 17) {
		mes "-メッセージが書かれた紙を";
		mes "見つけた所だ-";
		mes "-メッセージをもう一度";
		mes "確認してみようか？-";
		next;
		if(select("確認する","必要ない")==2) {
			mes "-その必要はなさそうだ-";
			close;
		}
		callsub L_Routine;
		close;
	}
	if(KH_QUE_SUB&0x002) {
		mes "-やかんに入っている熱湯を、";
		mes "地図を固定している草にかけてみた-";
		mes "-……粘着力が弱まったのか、";
		mes "地図が少しぐらついた-";
		next;
		mes "-地図を壁から外そうと";
		mes "ほんの少しだけずらした瞬間、";
		mes "丸められた紙が転がり落ちてきた-";
		next;
		mes "-紙にはメッセージが書かれている-";
		next;
		callsub L_Routine;
		next;
		mes "-……意味がわからない-";
		mes "-ただ、重要な事だけは確かだろう-";
		set KH_QUE_SUB,KH_QUE_SUB|0x004;
		close;
	}
	mes "-古い地図が描かれている-";
	next;
	if(select("気にしない","もう少し見てみる")==1) {
		mes "-あまり重要ではないだろう-";
		close;
	}
	mes "-よく見てみると、";
	mes "一部分だけが";
	mes "微かに浮き出ているようだ-";
	mes "-地図の裏に何かあるのだろうか？-";
	next;
	mes "-地図は壁に";
	mes "堅く固定されている-";
	mes "-どうやら草のような物体に";
	mes "固定されているようだ-";
	mes "-草の粘着力を弱めれたら";
	mes "地図を外す事ができそうだ-";
	set KH_QUE_SUB,KH_QUE_SUB|0x001;
	close;
L_Routine:
	mes "^0000FF水が乾き、地が割れば";
	mes "彼女の心臓に行く道は開かれる";
	mes "彼女の心臓は透明なクリスタル";
	mes "彼女のいる所は北の海のように冷たい";
	mes "我は彼女を探すため";
	mes "4本の剣を持って銀の蛇と決闘する^000000";
	next;
	mes "^0000FF1番目：黒い怒り";
	mes "2番目：黒い愛";
	mes "3番目：黒い希望";
	mes "4番目：黒い絶望^000000";
	next;
	mes "^0000FF彼女がいる所を訪ねるため";
	mes "彼女をこの手に抱くため";
	mes "我は4本の剣を持って";
	mes "銀の蛇と決闘する^000000";
	return;
}

kh_vila.gat,33,184,0	script	やかん	111,{
	if(KH_QUE_SUB&0x002 || KH_QUE >= 17) {
		mes "-やかんがあった場所だ-";
		close;
	}
	mes "-熱そうなお湯が入っているやかんだ-";
	mes "-湯気がゆらゆらと立ち昇っている-";
	if(KH_QUE_SUB&0x001 == 0)
		close;
	next;
	mes "-……熱湯……-";
	mes "-これで地図を固定している草を";
	mes "なんとかできないだろうか？-";
	next;
	if(select("試みてみる","あまり期待できない")==2) {
		mes "-他の方法を探してみよう-";
		close;
	}
	mes "-^FF0000熱湯の入ったやかんを手に入れた^000000-";
	mes "-やけどをしないように注意しよう-";
	set KH_QUE_SUB,KH_QUE_SUB|0x002;
	close;
}

kh_vila.gat,39,41,0	script	淀み	111,{
	if(KH_QUE_SUB&0x008 || KH_QUE >= 17) {
		mes "-ボタンを押した時、";
		mes "階段の方から「カシャン」と";
		mes "軽い音が聞こえた気がした-";
		close;
	}
	mes "-冷たそうな水が溜まっている-";
	next;
	if(KH_QUE_SUB&0x004 == 0) {
		mes "-……飲むのは無理だろう-";
		close;
	}
	mes "-獅子の像と二つの取っ手が見える-";
	mes "-引くことができそうだが……-";
	next;
	if(select("引いてみる","やめておく")==2) {
		mes "-むやみに触らない方がいいだろう-";
		close;
	}
	mes "-どっちを引いてみようか？-";
	next;
	if(select("右側の取っ手","左側の取っ手")==1) {
		mes "-取っ手を引っ張ると、";
		mes "獅子の口から水が流れ始めた-";
		mes "-しかし、すぐに流れは止まった-";
		mes "-…………-";
		mes "-他に変化はなさそうだ-";
		close;
	}
	mes "-取っ手を引っ張ると、";
	mes "底に穴が開き、溜まっていた水が";
	mes "全て流れていった-";
	mes "-水の無くなった底には";
	mes "緑色のコケがびっしりと生えている-";
	next;
	if(select("特になにもなさそうだ","もう少しよく見る")==1) {
		mes "-……気持ち悪くなりそうだ-";
		close;
	}
	mes "-よく見ると隅の方に";
	mes "小さなボタンがあった-";
	next;
	if(select("押してみる","……ほおっておく")==2) {
		mes "-何が起こるかわからない-";
		mes "-むやみに触らない方がいいだろう-";
		close;
	}
	mes "-ボタンを押すと「カシャン」";
	mes "と何か軽い音が聞こえた-";
	mes "-^FF0000廊下の階段^000000の方からだった-";
	set KH_QUE_SUB,KH_QUE_SUB|0x008;
	close;
}

kh_vila.gat,118,143,0	script	机	111,{
	if(KH_QUE_SUB&0x010 || KH_QUE >= 17) {
		mes "-机の上に本や紙切れが";
		mes "散らばっている-";
		mes "-難しそうな内容ばかりだ-";
		close;
	}
	mes "-机の上に本や紙切れが";
	mes "散らばっている-";
	mes "-人工動力の製法と利用方法……-";
	mes "-大賢者バルムントの論文集……-";
	mes "-工場用自動機械の活用方法……-";
	mes "-高級魔法スクロールの製法……-";
	mes "-エリーのために……-";
	next;
	mes "「エリー？」";
	mes "-白紙のページばかりの本を";
	mes "よく調べると、一切れの紙が";
	mes "挟まっているのを見つけた-";
	mes "紙には「キル・ハイル企業の文章」";
	mes "だけが写っている。";
	mes "……一応持っていこう。";
	next;
	mes "「^FF0000キル・ハイルの紋章が写った紙^000000」";
	mes "を獲得した。";
	set KH_QUE_SUB,KH_QUE_SUB|0x010;
	close;
}

kh_vila.gat,123,170,0	script	棚	111,{
	if(KH_QUE_SUB&0x020 || KH_QUE >= 17) {
		mes "-キル・ハイルの紋章が写った紙に";
		mes "隠された詩を見つけた所だ-";
		mes "-もう一度読んでみようか？-";
		next;
		if(select("そんな時間はない","読んでみる")==1) {
			mes "-はやく他の所を調べに行こう-";
			close;
		}
		callsub L_Routine;
		close;
	}
	mes "-様々な色の液体が注がれた";
	mes "試験管が置かれている-";
	mes "-何に使われるのだろうか？-";
	if(KH_QUE_SUB&0x010 == 0)
		close;
	next;
	mes "-……そういえば、";
	mes "どこかで読んだ本に、";
	mes "特定の液体に反応するインクがあると";
	mes "書いてあった気がする……-";
	next;
	if(select("そんなものあるわけが……","キル・ハイルの紋章が写った紙に……")==1) {
		mes "そんな便利な物、あるわけない-";
		close;
	}
	setarray '@str$[1],"赤","青","黄","緑";
	if(select("赤色の液体を落としてみる","青色の液体を落としてみる","黄色い液体を落としてみる","緑色の液体を落としてみる","やめておく")==5) {
		mes "そんな便利な物、あるわけない-";
		close;
	}
	mes "-" +'@str$[@menu]+ "色の液体が紙の表面に沿って";
	mes "流れていく-";
	if(@menu != 2) {
		mes "-不思議なことに";
		mes "液体は紙を濡らさなかったが、";
		mes "紙に変化は無いみたいだ-";
		close;
	}
	mes "-すると、液体が流れた跡から";
	mes "小さい文字が次々と現れた-";
	next;
	callsub L_Routine;
	next;
	mes "-…………-";
	mes "-なんだろう……";
	mes "-妙に気になる詩だ-";
	set KH_QUE_SUB,KH_QUE_SUB|0x020;
	close;
L_Routine:
	mes "^0000FF-1番目-";
	mes "銀の蛇は銑鉄で作られし者";
	mes "冷たい体と堅い頭を持つ";
	mes "我は怒りを持って蛇の頭に振り下ろす";
	mes "銀の蛇は眠りにつく^000000";
	next;
	mes "^0000FF-2番目-";
	mes "銀の蛇は魔法で作られし者";
	mes "魔法の体と姑息な頭を持つ";
	mes "我は愛を持って蛇の心臓を突く";
	mes "銀の蛇は眠りにつく^000000";
	next;
	mes "^0000FF-3番目-";
	mes "銀の蛇は血と肉で作られし者";
	mes "暖かい体と柔らかい頭を持つ";
	mes "我は希望を持って蛇の体を抱く";
	mes "銀の蛇は眠りにつく^000000";
	next;
	mes "^0000FF-4番目-";
	mes "銀の蛇は器のない者";
	mes "その体と頭は誰にも見えない";
	mes "我は絶望を持って虚空へ投げつける";
	mes "銀の蛇がどうなったか誰もわからない";
	mes "……誰にもわからない……^000000";
	next;
	mes "^0000FF我が名は「^FF0000道を失った小さな悪魔^0000FF」";
	mes "汝、四本の剣を持って";
	mes "暗黒の中の彼女を訪ねよ^000000";
	return;
}

kh_vila.gat,136,68,0	script	剣飾り	111,{
	if(KH_QUE_SUB&0x040 || KH_QUE >= 17) {
		mes "-隠し研究所へ？-";
		next;
		if(select("移動する","移動しない")==2) {
			mes "-もう少し調べ回ってみよう-";
			close;
		}
		warp "kh_vila.gat",178,72;
		end;
	}
	mes "-刃が違う4本の剣と";
	mes "銀で出来た4匹の蛇の像がある-";
	if(KH_QUE_SUB&0x004 == 0)
		close;
	if(KH_QUE_SUB&0x020 == 0)
		mes "-地図の裏にあった紙に隠された詩と";
	else {
		mes "-キル・ハイルの紋章が写った紙に";
		mes "隠されていた詩と";
	}
	mes "どこか同じ気がする-";
	next;
	if(select("やはり関係はなさそうだ","もう少しよくみる")==1) {
		mes "-恐らく偶然だろう-";
		close;
	}
	mes "-蛇の像をよく見てみると、";
	mes "1匹ごとに何かが刺し込めそうな";
	mes "穴が開いている-";
	next;
	if(select("穴をよく調べる","飾ってある剣を刺してみる")==1) {
		mes "-……剣以外に";
		mes "刺せるものは無さそうだ-";
		close;
	}
	if(KH_QUE_SUB&0x008 == 0) {
		mes "-飾ってある剣は";
		mes "何かに引っかかっているようだ-";
		mes "-どうやっても取れそうに無い-";
		close;
	}
	if(KH_QUE_SUB&0x020 == 0) {
		mes "-特に変化はない-";
		mes "-何か法則でもあるのだろうか？-";
		close;
	}
	mes "-どの剣をどこに刺そうか？-";
	next;
	for(set '@i,0; '@i<4; set '@i,'@i+1) {
		switch('@i) {
		case 0: mes "-光り輝く剣を抜いた-"; break;
		case 1: mes "-ガラスの剣を抜いた-"; break;
		case 2: mes "-鉄の剣を抜いた-"; break;
		case 3: mes "-錆びた剣を抜いた-"; break;
		}
		next;
		set '@order['@i],select("1番目の蛇","2番目の蛇","3番目の蛇","4番目の蛇");
	}
	if('@order[0] != 2 || '@order[1] != 4 || '@order[2] != 1 || '@order[3] != 3) {
		mes "-……何の変化もない-";
		mes "-剣を戻しておこう-";
		close;
	}
	mes "-ヴぅ……ン……-";
	mes "-急に低い音が聞こえたかと思うと、";
	mes "体がどこか遠くに行く感じがした-";
	set KH_QUE_SUB,KH_QUE_SUB|0x040;
	close2;
	warp "kh_vila.gat",178,72;
	end;
}

kh_vila.gat,179,68,0	script	試験管	111,{
	mes "-キル・ハイル学院の制服を着た";
	mes "男の子が試験管に入っている-";
	close;
}

kh_vila.gat,185,68,0	script	試験管	111,{
	if(KH_QUE_SUB&0x080 || KH_QUE >= 17) {
		mes "-^FF00004772961^000000？-";
		mes "-一体何の数字だろう？-";
		mes "-…………-";
		if(KH_QUE_SUB == 0x3FF) {
			mes "-一通り調べ尽くしたようだ-";
			mes "-エリーに会いに行こう-";
			close;
		}
		mes "-まだ何かありそうだ-";
		mes "-もっと色んな所を調べてみよう-";
		close;
	}
	if(KH_QUE_SUB&0x040 == 0)
		end;
	mes "-!?-";
	mes "-老人が試験管に入っている！-";
	mes "-…………-";
	mes "-試験管の下に赤色ボタンがある-";
	next;
	if(select("ボタンを押す","もう少し調べる")==2) {
		mes "-念のため、周りをよく調べよう-";
		close;
	}
	mes "-ボタンを押すと、";
	mes "試験管の中の老人が";
	mes "話しかけてきた-";
	next;
	mes "「………………」";
	mes "「お前は誰だ……」";
	mes "「見慣れぬ奴だ……」";
	mes "「お前が我が友なら、";
	mes "我が名を知っているな？」";
	next;
	input '@str$;
	if('@str$ != "道を失った小さな悪魔") {
		mes "「それは私の名前ではない……」";
		close;
	}
	mes "「……この数字を覚えておけ。」";
	mes "「^FF00004,7,7,2,9,6,1^000000」";
	next;
	mes "-^FF00004772961^000000-";
	mes "-一体何の数字だろう？-";
	if(KH_QUE == 15)
		set KH_QUE,16;
	set KH_QUE_SUB,KH_QUE_SUB|0x080;
	close;
}

kh_vila.gat,181,178,4	script	怖そうな犬	81,7,3,{
	end;
OnTouch:
	mes "グルルルルルル……";
	next;
	mes "-荒々しい唸り声を上げている-";
	mes "-無事に通り抜けれるのか？-";
	next;
	if(select("試してみる","諦める")==2) {
		mes "-さすがに危険すぎる-";
		mes "-この先は諦めよう-";
		close2;
		warp "kh_vila.gat",126,70;
		end;
	}
	if(countitem(537)) {
		mes "-そういえば、ペットフードを";
		mes "持っている-";
		next;
		if(select("ペットフードを使ってみる","そんなものは使わない")==1) {
			mes "-恐る恐るペットフードを";
			mes "犬の前に投げ捨てると、";
			mes "犬は尻尾を振りながら";
			mes "ペットフードを食べ始めた-";
			mes "-今のうちに通り抜けよう-";
			close2;
			delitem 537,1;
			warp "kh_vila.gat",173,182;
			end;
		}
	}
	mes "-恐る恐る近づいてみた-";
	mes "-犬のうなり声が";
	mes "大きくなっている気がする-";
	next;
	mes "-犬の横を通り抜けようと……-";
	mes "-…………-";
	mes "ワン！　ワン！　ワン！";
	mes "ワン！　ワン！　ワン！　ワン！";
	next;
	mes "-………………-";
	mes "-階段を降りるまで";
	mes "犬に追い回された-";
	close2;
	warp "kh_vila.gat",126,70;
	end;
}

kh_vila.gat,115,186,0	script	引き出し	111,{
	if(KH_QUE_SUB&0x100 || KH_QUE >= 17) {
		if(KH_QUE_SUB == 0x3FF) {
			mes "-一通り調べたみたいだ-";
			mes "-そろそろエリーに会いに行こう-";
			close;
		}
		mes "-^009CFF黄色のカードキー^000000を";
		mes "見つけた引き出しだ-";
		close;
	}
	mes "-何度も使われたような";
	mes "痛んだ引き出しがある-";
	next;
	if(select("引き出しを引いてみる","ほおっておく")==2) {
		mes "-他の所を探してみよう-";
		close;
	}
	mes "-引き出しの中には";
	mes "黄色のカードキーがあった-";
	getitem 7492,1;
	set KH_QUE_SUB,KH_QUE_SUB|0x100;
	close;
}

kh_vila.gat,14,55,0	script	とっくり	111,{
	if(countitem(7329)) {
		mes "-古い銅の鍵を手に入れた瓶だ-";
		mes "-……やはり高そうに見える-";
		close;
	}
	mes "-高そうな瓶がある-";
	mes "-……どうする？-";
	next;
	switch(select("瓶を割ってみる","よく見てみる","ほおっておく")) {
	case 1:
		mes "-とても高そうだ……-";
		mes "-さすがに壊すのはまずいだろう-";
		close;
	case 2:
		mes "-…………-";
		mes "-何か入っているのだろうか？-";
		next;
		mes "-瓶をそっと振ってみると";
		mes "「ジィン」と鈍い音がした-";
		mes "-やはり何かが入っているようだ-";
		next;
		mes "-「^FF0000古い銅の鍵^000000」を手に入れた-";
		getitem 7329,1;
		close;
	case 3:
		mes "-……高そうだ-";
		mes "-むやみに触らない方がいいだろう-";
		close;
	}
}

kh_vila.gat,107,126,0	script	箱	111,{
	if(countitem(7516) || KH_QUE >= 17) {
		mes "-^009C00緑色のカードキー^000000が入っていた箱だ-";
		close;
	}
	mes "-堅い箱が置かれている-";
	mes "-箱を開けると、中にもう一つ";
	mes "箱が入っていた-";
	next;
	mes "-中の箱は鍵が掛かっている-";
	if(countitem(7329) < 1)
		close;
	mes "-古い銅の鍵で開けれそうだ-";
	next;
	if(select("開けてみる","開けない")==2) {
		mes "-何が入っているかわからない-";
		mes "-やめておいたほうがいいだろう-";
		close;
	}
	mes "-「カチャン」-";
	next;
	mes "-箱の中には";
	mes "緑色のカードキーが入っていた-";
	delitem 7329,1;
	getitem 7516,1;
	close;
}

kh_vila.gat,181,138,0	script	本棚	111,{
	if(KH_QUE_SUB&0x200 || KH_QUE >= 17) {
		if(KH_QUE_SUB == 0x3FF) {
			mes "-一通り調べたようだ-";
			mes "-そろそろエリーに会いに行こう-";
			close;
		}
		mes "-まだ調べたりない-";
		mes "-もっと色んな所を調べてみよう-";
		close;
	}
	mes "-本で一杯になった本棚だ-";
	mes "-隙間がまったくない-";
	if(countitem(7516) < 1 && countitem(7329) < 1)
		close;
	mes "-…………-";
	next;
	mes "-………………？-";
	mes "-「エリーのために」-";
	mes "-エリー？-";
	next;
	if(select("本を読んでみる","ほおっておく")==2) {
		mes "-他に目ぼしい本はなさそうだ-";
		close;
	}
	mes "-本を読もうとしたが、";
	mes "知らない文字で読めなかった-";
	mes "-本を元の場所に戻そうとしたら、";
	mes "本棚の奥に何か硬い鉄板のような";
	mes "物があるのが目に写った-";
	next;
	if(select("もう少しよく見る","壁だろう")==2) {
		mes "-本を元に戻しておいた-";
		close;
	}
	mes "-周りの本を取り出すと、";
	mes "隠し金庫が出てきた-";
	mes "-穴が二つある-";
	next;
	if(select("持っている鍵を試してみる","……鍵が合いそうもない")==2) {
		mes "-鍵を探してみよう-";
		close;
	}
	for(set '@i,1; '@i <= 2; set '@i,'@i+1) {
		mes "-" +'@i+ "つ目の穴-";
		next;
		set '@order['@i],select((countitem(7516)? "緑色のカードキー": "古い銅の鍵"),"エリーの鍵");
	}
	if('@order[1] != 2 || '@order[2] != 1 || countitem(7516) < 1) {
		mes "-開かない-";
		close;
	}
	mes "-「カチャン」と軽い音がして";
	mes "金庫が開いた-";
	mes "-金庫の中には鉄の箱が入っていた-";
	next;
	mes "-^FF0000鉄の箱^000000を手に入れた-";
	delitem 7489,1;
	delitem 7516,1;
	getitem 7491,1;
	if(KH_QUE == 15)
		set KH_QUE,16;
	set KH_QUE_SUB,KH_QUE_SUB|0x200;
	close;
}

//============================================================
// キル・ハイル学院NPC2
//------------------------------------------------------------
yuno_fild08.gat,69,185,0	script	窓	111,{
	if(KH_QUE > 55) {
		mes "-窓は閉まっている-";
		close;
	}
	if(KH_QUE < 14) {
		mes "-誰の部屋だろう-";
		mes "-窓から部屋の中にある女の子らしい";
		mes "可愛い模様のカーテンが見える-";
		close;
	}
	if(KH_QUE < 16) {
		mes "-エリーが言ってた部屋だ-";
		mes "-梯子は見当たらない-";
		mes "-まだ戻ってないみたいだ-";
		close;
	}
	if(KH_QUE == 16) {
		if(KH_QUE_SUB < 0x3FF) {
			mes "-まだ十分な情報を得ていない-";
			mes "-エリーのためにもう一度";
			mes "別荘を調べてみよう-";
			close;
		}
		mes "-エリーが言ってた部屋だ-";
		mes "-まだ梯子は無いようだ-";
		mes "-……ん？　窓が少し開いている-";
		mes "-配水管を使えば";
		mes "登れないこともないが……-";
		next;
	}
	if(select("配水管を登る","他の方法を探してみる")==2) {
		mes "-周りに使えそうな物はない-";
		close;
	}
	if(rand(5)) {
		mes "-…………ドサッ-";
		mes "-配水管から滑り落ちてしまった-";
		percentheal -10,0;
		close;
	}
	mes "-配水管を登って、";
	mes "エリーの部屋に忍び込んだ-";
	close2;
	warp "kh_school.gat",185,185;
	end;
}

kh_school.gat,188,185,0	script	窓	111,{
	warp "yuno_fild08.gat",69,183;
	end;
}

kh_school.gat,175,176,0	script	クッキーかご	111,{
	if(KH_QUE == 55) {
		mes "-クッキーかごを眺めていたら、";
		mes "開きっぱなしの窓からの風で";
		mes "クッキーかごが少し揺れた-";
		mes "-その時、もう一通の手紙が";
		mes "まだ隠されていたのに気づいた-";
		mes "-恐らく……エリーが書いた";
		mes "^FF0000手紙^000000のようだ-";
		next;
		mes "-" +strcharinfo(0)+ "さんへ……-";
		mes "いつもドジばっかりして、";
		mes "先生に怒られてるエリーだけど、";
		mes "今日のクッキーはよくできてるって";
		mes "先生に褒められちゃったよ。";
		mes "エヘヘッ……";
		next;
		mes "これもみーんな";
		mes strcharinfo(0)+ "さんが";
		mes "手伝ってくれたおかげ！";
		mes "本当にありがと！";
		next;
		mes strcharinfo(0)+ "さん";
		mes "みたいな人を見ると、";
		mes "世の中にはとっても良い方が";
		mes "たくさんいる気がするよ。";
		next;
		mes strcharinfo(0)+ "さんは……";
		mes "とってもあったかな人で……";
		mes "エリーは大好きだよ！";
		mes "エヘヘッ……";
		next;
		mes "もし、お爺ちゃんに会えたら";
		mes " " +strcharinfo(0)+ "さんを";
		mes "紹介させてね。";
		mes "お爺ちゃんも";
		mes strcharinfo(0)+ "さん";
		mes "に会えたら、きっと笑顔になるよ。";
		next;
		mes strcharinfo(0)+ "さん。";
		mes "最後に一つだけ……";
		mes "よかったら、いつまでも……";
		mes "エリーの大切な人になって！";
		mes "……エヘヘッ……恥ずかしいな。";
		mes "私も" +strcharinfo(0)+ "さんを";
		mes "笑顔にさせちゃうようにがんばるよ！";
		next;
		mes "-かごの中のクッキーから";
		mes "いまだにエリーの温もりが";
		mes "感じとれる気がする-";
		mes "-私はクッキーを一つ取り出して";
		mes "一口食べてみた-";
		next;
		mes "-………………-";
		mes "-湿気ってはいたが、";
		mes "甘いチョコレートの味が";
		mes "口いっぱいに広がった……-";
		mes "-………………-";
		next;
		mes "-いつのまにか、私は泣いていた-";
		next;
		mes "-…………-";
		mes "-ここにはいたくない……-";
		set KH_QUE,56;
		close2;
		warp "yuno_fild08.gat",69,183;
		end;
	}
	if(KH_QUE != 16) {
		mes "-湿気ったクッキーが盛られている-";
		close;
	}
	mes "-エリーのクッキーかごだ-";
	mes "-山のように盛られている";
	mes "クッキーの間に、白い何かが見える-";
	mes "-クッキーを一つどかしてみたら、";
	mes "^FF0000メッセージ^000000が書かれた";
	mes "紙切れを見つけた-";
	next;
	if(select("読んで見る","ほおっておく")==2) {
		mes "…………";
		close;
	}
	mes "黒い服を着た変な男が";
	mes "学院の中を歩いてる……";
	mes "男の呪文か何かを聞くと";
	mes "みんな人形みたいに固まってく！";
	mes "恐い……恐いよ……";
	next;
	mes "今、自分の部屋に隠れて";
	mes "このメッセージを書いてるの。";
	mes "窓は開けておいたよ。";
	mes "……このメッセージには";
	mes "気づいてもらえるかな？";
	next;
	mes "私も、皆みたいになっちゃうのかな？";
	mes "……やだ！　そんなのやだ！";
	mes "!?　誰か来てる！";
	mes "やだ…………";
	mes "やだ！　やだ！　やだ！";
	mes "「" +strcharinfo(0)+ "」さん！";
	set KH_QUE,17;
	set KH_QUE_SUB,0;
	close;
}

kh_school.gat,177,180,4	script	エリー	895,{
	if(KH_QUE < 17) {
		mes "[エリー]";
		mes "……………………";
		next;
		mes "[エリー]";
		mes "……………………";
		close;
	}
	switch(KH_QUE) {
	case 17:
		mes "[エリー]";
		mes "……………………";
		next;
		mes "-エリーが固まっている……-";
		mes "-どうすればいいんだ……-";
		next;
		switch(select("エリーに触れてみる","言葉をかけてみる","ほおっておく")) {
		case 1:
			mes "-私は震える手でエリーの";
			mes "腕を軽く揺らしてみた-";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "エリー？　エリー？";
			next;
			mes "-何の反応もない-";
			mes "-どうすればいいんだ……-";
			close;
		case 2:
			input '@str$;
			break;
		case 3:
			break;
		}
		mes "[エリー]";
		mes "……………………";
		next;
		if('@str$ == "エリー、起きて") {
			mes "-その瞬間、エリーの握っていた";
			mes "手が軽く開いて、";
			mes "^0000FF小さな黄金の鍵^000000と";
			mes "^0000FFボタン^000000がこぼれ落ちた-";
			mes "-……これは？-";
			delitem 7491,1;
			getitem 7493,1;
			getitem 7494,1;
			set KH_QUE,18;
			close;
		}
		mes "-何の反応もない-";
		close;
	case 18:
		mes "-エリーから得た^FF0000黄金の鍵^000000で";
		mes "^0000FF鉄の箱^000000を開けられそうだ-";
		next;
		mes "-^FF0000黄金の鍵^000000で^0000FF鉄の箱^000000を開けた-";
		mes "-箱の中には^009C00手紙^000000と";
		mes "^0000FF青色のカードキー^000000が入っていた-";
		break;
	case 19:
	case 20:
	case 21:
	case 22:
	case 23:
	case 24:
	case 25:
		mes "-箱の中に入っていた手紙には";
		mes "次のように書かれている-";
		break;
	default:
		mes "[エリー]";
		mes "……………………";
		close;
	}
	next;
	mes "-エリーへ-";
	mes "エリーよ、キエルはタブーを犯した。";
	mes "私の希望だった君たちを、";
	mes "身勝手な欲望で改造を施している。";
	mes "私はこの愚行を止めなければならない。";
	next;
	mes "お前がこの箱を見つけたという事は、";
	mes "私に何かあったという事だ。";
	mes "だから、この箱を通して";
	mes "私の命を君に委ねることにする。";
	mes "君にしか開けられないこの箱なら";
	mes "安心して委ねられる。";
	next;
	mes "エリー、落ち着いて読んで欲しい。";
	mes "エリー……君は……";
	mes "……君は人間ではない。";
	mes "嘘のようだが、これは事実だ。";
	mes "詳しい事は、工場に行けば";
	mes "わかるはずだ。";
	next;
	mes "工場の入口は^0000FF寮のそばの墓地^000000にある。";
	mes "そして、工場の隠し部屋にいる";
	mes "^0000FFエリシア^000000を探しなさい。";
	mes "彼女の保安システムに、";
	mes "君の名前を入力しておいた。";
	mes "彼女なら、私を探し出す事が";
	mes "できるだろう。";
	if(KH_QUE == 18) {
		getitem 7495,1;
		set KH_QUE,19;
	}
	close;
}

yuno_fild08.gat,71,170,0	script	墓	111,{
	if(KH_QUE >= 55 && countitem(7509)) {
		mes "-墓の一部が微かに光っている-";
		next;
		if(select("^FF0000虹色のカードキー^000000を使う","ほおっておく")==1) {
			mes "-カードキーを使うと、";
			mes "奥に続く通路が開いた-";
			next;
			if(select("進む","やめておく")==1) {
				warp "kh_dun01.gat",3,230;
				end;
			}
		}
		mes "………………";
		close;
	}
	if(KH_QUE >= 20) {
		mes "-工場へ通じる通路が開いている-";
		next;
		if(select("入る","入らない")==2) {
			mes "-今は行かなくていいだろう-";
			close;
		}
		warp "kh_dun01.gat",3,230;
		end;
	}
	if(KH_QUE < 19) {
		mes "-誰かのお墓だ-";
		close;
	}
	mes "-墓地の周りを調べると、";
	mes "隠し通路が見つかった-";
	next;
	mes "-よく見ると、";
	mes "何かが入れられそうな小さな穴と、";
	mes "0から9までの数字盤がある-";
	next;
	mes "-小さな穴に何を入れる？-";
	next;
	input '@str$;
	if('@str$ != "黄色のカードキー") {
		mes "-何の反応もない-";
		close;
	}
	mes "-「^0000FF黄色のカードキー^000000」を入れると";
	mes "「ピ」という音の後に声が流れ出た-";
	mes "「^009C00暗証番号^000000を入力してください。」";
	next;
	mes "-数字を入力しよう-";
	next;
	input '@str$;
	if('@str$ != "4772961") {
		mes "「承認エラー。」";
		mes "「再度入力してください。」";
		close;
	}
	mes "「承認完了。」";
	mes "「ようこそ、^FF0000キル・ハイル^000000様。」";
	mes " ";
	mes "-「ピー」という音とともに";
	mes "通路が現われた-";
	set KH_QUE,20;
	close;
}

//============================================================
// 機械人形工場NPC
//------------------------------------------------------------
kh_dun01.gat,235,48,0	script	硬いドア#kiel	111,{
	if(KH_QUE >= 24) {
		mes "-頑丈で重いドアだ-";
		close;
	}
	mes "-硬そうなドアがある-";
	next;
	if(select("アイテムを使う","ほおっておく")==2) {
		mes "-気にしなくていいだろう-";
		close;
	}
	input '@str$;
	if(strnpcinfo(2) != "kiel" || '@str$ != "青色のカードキー") {
		mes "-開きそうもない-";
		close;
	}
	mes "-ドアが開いた-";
	close2;
	warp "kh_school.gat",119,144;
	end;
}
kh_dun01.gat,6,18,0	duplicate(硬いドア#kiel)	硬いドア	111
kh_dun01.gat,6,30,0	duplicate(硬いドア#kiel)	硬いドア	111
kh_dun01.gat,6,60,0	duplicate(硬いドア#kiel)	硬いドア	111
kh_dun01.gat,6,133,0	duplicate(硬いドア#kiel)	硬いドア	111
kh_dun01.gat,6,164,0	duplicate(硬いドア#kiel)	硬いドア	111
kh_dun01.gat,76,233,0	duplicate(硬いドア#kiel)	硬いドア	111
kh_dun01.gat,106,233,0	duplicate(硬いドア#kiel)	硬いドア	111
kh_dun01.gat,235,70,0	duplicate(硬いドア#kiel)	硬いドア	111
kh_dun01.gat,235,93,0	duplicate(硬いドア#kiel)	硬いドア	111
kh_dun01.gat,235,114,0	duplicate(硬いドア#kiel)	硬いドア	111

kh_school.gat,119,149,4	script	美しい女性	894,{
	cutin "kh_ellisia",2;
	if(KH_QUE != 20) {
		mes "[エリシア]";
		mes "……はやく行きましょう。";
		close2;
		cutin "kh_ellisia",255;
		warp "kh_school.gat",120,180;
		end;
	}
	mes "[エリシア]";
	mes "…………";
	mes "あなたは私の記憶に無い方ですね。";
	next;
	mes "[エリシア]";
	mes "キル・ハイル様のお話では";
	mes "ここに入ることが許可されている人は、";
	mes "^FF0000初期タイプのエリー^000000と";
	mes "^FF0000エリーの友人^000000だけです。";
	next;
	mes "[エリシア]";
	mes "^FF0000エリー^000000の姿は見当たりませんね。";
	mes "彼女に何かあったのですか？";
	mes "そして、あなたは";
	mes "^FF0000エリーの友人^000000なのですか？";
	next;
	mes "[エリシア]";
	mes "もしそうなら、あなたが";
	mes "^FF0000エリーの友人^000000である事を";
	mes "証明できる物を見せていただけますか？";
	next;
	switch(select("黄色のカードキー","青色のカードキー","黄金の鍵","文様が描かれたボタン","…………？")) {
	default:
		mes "[エリシア]";
		mes "それでは^FF0000エリーの友人^000000だと";
		mes "証明することはできません。";
		mes "他の物を見せていただけますか？";
		close2;
		cutin "kh_ellisia",255;
		end;
	case 3:
		mes "[エリシア]";
		mes "キル・ハイル様が^FF0000エリー^000000に託した";
		mes "鍵ですね。";
		mes "わかりました。";
		mes "あなたは間違いなく";
		mes "^FF0000エリーの友人^000000です。";
		next;
		mes "[エリシア]";
		mes "……お待ちしておりました。";
		mes "どうぞこちらへ。";
		close2;
		cutin "kh_ellisia",255;
		warp "kh_school.gat",120,180;
		end;
	case 4:
		mes "[エリシア]";
		mes "それは!?";
		mes "^0000FFキエル^000000様の紋章！";
		mes "私を奪いにいらっしゃったのですか!?";
		close2;
		cutin "kh_ellisia",255;
		monster "kh_school.gat",118,145,"爆弾",1745,5;
		end;
	case 5:
		mes "[エリシア]";
		mes "………………";
		close2;
		cutin "kh_ellisia",255;
		end;
	}

}
kh_school.gat,117,149,4	script	美しい女性	894,{}
kh_school.gat,118,149,4	script	美しい女性	894,{}
kh_school.gat,120,149,4	script	美しい女性	894,{}
kh_school.gat,121,149,4	script	美しい女性	894,{}

kh_school.gat,122,186,4	script	美しい女性	894,{
	cutin "kh_ellisia",2;
	switch(KH_QUE) {
	default:
		cutin "kh_ellisia",255;
		warp "yuno_fild08.gat",73,172;
		end;
	case 20:
		mes "[エリシア]";
		mes "さっそくですが、";
		mes "事態の説明をさせていただきます。";
		mes "^FF0000キル・ハイル^000000様は現在、";
		mes "工場のどこかに監禁されて";
		mes "いらっしゃいます。";
		next;
		mes "[エリシア]";
		mes "^FF0000キル・ハイル^000000様の救出に";
		mes "協力していただけませんか？";
		next;
		if(select("工場とは一体……？","^FF0000キル・ハイル^000000さんに何が？")==1) {
			mes "[エリシア]";
			mes "キル・ハイル企業の秘密事業、";
			mes "自動機械人形を作る工場です。";
			mes "あなたが今見ている私や";
			mes "「キル・ハイル学院」の学生は皆、";
			mes "人間ではありません。";
			mes "「機械人形」です。";
			next;
			mes "[エリシア]";
			mes "人間と酷似していますが、";
			mes "肉体的、精神的に勝る自動機械人形を";
			mes "人間社会に提供する事が、";
			mes "私たち「キル・ハイル企業」の目標、";
			mes "理念なのです。";
			close2;
			cutin "kh_ellisia",255;
			end;
		}
		mes "[エリシア]";
		mes "^0000FFキエル^000000様は人形たちに";
		mes "「改造」を施しました。";
		mes "その事実を知った^FF0000キル・ハイル^000000様が";
		mes "^0000FFキエル^000000様の行動を";
		mes "咎めにいらっしゃいましたが、";
		mes "未だ帰られておりません。";
		next;
		mes "[エリシア]";
		mes "^FF0000キル・ハイル^000000様は";
		mes "^0000FFキエル^000000様の手に捕らわれる事を";
		mes "予測しておられました。";
		mes "そこで、私をここに残し複製の人形を";
		mes "連れて行きました。";
		next;
		mes "[エリシア]";
		mes "^FF0000キル・ハイル^000000様の生体反応は";
		mes "受信できますので、^FF0000キル・ハイル^000000様は";
		mes "無事でいらっしゃいます。";
		mes "どうか^FF0000キル・ハイル^000000様が";
		mes "捕らわれている所を";
		mes "探し出してください。";
		next;
		mes "[エリシア]";
		mes "秘密工場を自由に出入りできる";
		mes "^FF0000カードキー^000000を差し上げます。";
		mes "^FF0000キル・ハイル^000000様を見つけたら";
		mes "私に知らせてください。";
		getitem 7496,1;
		set KH_QUE,21;
		close2;
		cutin "kh_ellisia",255;
		end;
	case 21:
		mes "[エリシア]";
		mes "急いで^FF0000キル・ハイル^000000様を";
		mes "お探しください。";
		close2;
		cutin "kh_ellisia",255;
		warp "kh_dun01.gat",22,216;
		end;
	case 22:
		mes "[エリシア]";
		mes "キル・ハイル様は見つかりましたか？";
		next;
		mes "-私は彼女にキル・ハイルが";
		mes "監禁されていた場所を教え、";
		mes "彼から託された^FF0000金属の破片^000000を";
		mes "彼女に渡した-";
		next;
		mes "[エリシア]";
		mes "ありがとうございます。";
		mes " ";
		mes "-^0000FFエリシア^000000は";
		mes "^FF0000金属のパーツ^000000を";
		mes "自分の手首に埋め込んだ-";
		next;
		mes "[エリシア]";
		mes "………………";
		mes "^FF0000キル・ハイル^000000様の暗号を確認。";
		mes "B_2_3地域、生体反応正常。";
		mes "…………";
		mes "同封文書確認。";
		mes "改造人形設計図、送信完了。";
		delitem 7497,1;
		set KH_QUE,23;
		close2;
		cutin "kh_ellisia",255;
		end;
	case 23:
		mes "[エリシア]";
		mes "…………お待たせしました。";
		mes "私は今から^FF0000キル・ハイル^000000様の";
		mes "ご命令を遂行します。";
		mes "後ほど、^0000FFリヒタルゼンの";
		mes "「キル・ハイル邸宅」^000000まで";
		mes "お越しください。";
		next;
		mes "[エリシア]";
		mes "なお、失礼ですが、";
		mes "あなたが保持しているカードキーは";
		mes "保安上、回収させていただきます。";
		next;
		mes "[エリシア]";
		mes "邸宅玄関で^FF0000黄金の鍵^000000を";
		mes "お見せくだされば、";
		mes "邸宅の中に入れるようになります。";
		delitem 7492,1;
		delitem 7495,1;
		delitem 7496,1;
		set KH_QUE,24;
		close2;
		cutin "kh_ellisia",255;
		warp "yuno_fild08.gat",73,172;
		end;
	}
}

kh_dun01.gat,163,223,4	script	看板	857,{
	mes "-ペット禁止-";
	close;
}

kh_dun01.gat,200,220,0	script	MonsterWarp#kiel1	139,5,20,{
	end;
OnTouchNPC:
	warp "kh_dun01.gat",178,138;
	end;
}
kh_dun01.gat,190,220,0	duplicate(MonsterWarp#kiel1)	MonsterWarp#kiel2	139,5,20
kh_dun01.gat,180,220,0	duplicate(MonsterWarp#kiel1)	MonsterWarp#kiel3	139,5,20
kh_dun01.gat,210,220,0	duplicate(MonsterWarp#kiel1)	MonsterWarp#kiel4	139,5,20
kh_dun01.gat,220,220,0	duplicate(MonsterWarp#kiel1)	MonsterWarp#kiel5	139,5,20

kh_dun01.gat,166,223,0	script	機械装置#kiel1	111,{
	mes "-何かを入れることができる";
	mes "機械装置だ-";
	if(KH_QUE < 21 || KH_QUE > 23)
		close;
	next;
	input '@str$;
	if('@str$ != "赤色のカードキー") {
		mes "-何の反応もない-";
		close;
	}
	mes "-カードキーを入れると";
	mes "ドアがあいた-";
	close2;
	if(strnpcinfo(2) != "")
		warp "kh_dun01.gat",170,227;
	else
		warp "kh_dun01.gat",165,204;
	end;
}
kh_dun01.gat,162,206,0	duplicate(機械装置#kiel1)	機械装置	111

kh_dun01.gat,224,233,0	script	ドア	139,5,5,{
OnTouch:
	if(KH_QUE != 21) {
		mes "[キル・ハイル]";
		mes "………………";
		close;
	}
	mes "[????]";
	mes "………………";
	next;
	mes "-扉の向こう側から、";
	mes "誰かの話し声が聞こえる-";
	next;
	mes "[????]";
	mes "……^0000FFキエル^000000……";
	mes "……お前は……どうして……";
	next;
	mes "-……^FF0000キル・ハイル^000000さんだろうか？-";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "^FF0000キル・ハイル^000000さん？";
	next;
	mes "[キル・ハイル]";
	mes "……誰かね？";
	next;
	mes "[" +strcharinfo(0)+ "]";
	mes "私は…………";
	next;
	mes "-^FF0000キル・ハイル^000000さんに";
	mes "^FF0000エリー^000000と^0000FFエリシア^000000さんの";
	mes "話を伝えた-";
	next;
	mes "[キル・ハイル]";
	mes "……そうか。";
	mes "エリーは…………";
	mes "………………";
	next;
	mes "[キル・ハイル]";
	mes "………………";
	mes "これを持って行きたまえ。";
	mes "^0000FFエリシア^000000に渡すだけでいい。";
	next;
	mes "-扉のすき間から";
	mes "^FF0000金属のパーツ^000000が出てきた-";
	getitem 7497,1;
	set KH_QUE,22;
	next;
	mes "[キル・ハイル]";
	mes "………………";
	close;
}

kh_dun01.gat,44,203,0	script	機械装置#kiel2	111,{
	if(countitem(7509) < 1 || KH_QUE < 26) {
		mes "-大きなドアがある-";
		close;
	}
	mes "-カードキーが使えるドアだ-";
	next;
	input '@str$;
	if('@str$ != "虹色のカードキー") {
		mes "-開かない-";
		close;
	}
	mes "-「虹色のカードキー」を使うと、";
	mes "大きなドアが開いて、";
	mes "階段が現われた-";
	next;
	if(select("降りる","降りない")==2) {
		mes "-時間が経つと、門が閉まった-";
		close;
	}
	warp "kh_dun02.gat",41,198;
	end;
}
kh_dun01.gat,36,195,0	duplicate(機械装置#kiel2)	機械装置	111

//============================================================
// キル・ハイル邸NPC
//------------------------------------------------------------
kh_mansion.gat,78,54,4	script	執事	109,{
	if(KH_QUE < 24) {
		mes "[執事]";
		mes "こちらは個人住宅です。";
		mes "お引取りください。";
		close2;
		warp "lighthalzen.gat",188,201;
		end;
	}
	switch(KH_QUE) {
	case 24:
	case 25:
		mes "[執事]";
		mes "主人のお客様ですか？";
		mes "では、その証拠をお見せください。";
		next;
		if(select("黄金の鍵を見せる","????")==2) {
			mes "[執事]";
			mes "……お引取りください。";
			close2;
			warp "lighthalzen.gat",188,201;
			end;
		}
		mes "[執事]";
		mes strcharinfo(0)+ " 様ですね。";
		mes "お待ちしておりました。";
		mes "ご案内させていただきます。";
		close2;
		warp "kh_mansion.gat",21,14;
		end;
	default:
		mes "[執事]";
		mes "…………";
		mes "主人に会われますか？";
		next;
		if(select("はい","いいえ")==2) {
			mes "[執事]";
			mes "お待ちしております。";
			close;
		}
		mes "[執事]";
		mes "こちらへどうぞ。";
		close2;
		warp "kh_mansion.gat",21,14;
		end;
	case 33:
	case 34:
	case 35:
	case 36:
		mes "[執事]";
		mes "ようこそおいでくださいました。";
		mes "主人に会われますか？";
		mes "それとも……";
		next;
		if(select("^FF0000キル・ハイル^000000さんと話を……","^0000FFミッチェル^000000を……")==1) {
			mes "[執事]";
			mes "承知いたしました。";
			mes "こちらへどうぞ。";
			close2;
			warp "kh_mansion.gat",21,14;
			end;
		}
		mes "[執事]";
		mes "…………";
		mes "いい情報を入手できたようですね。";
		next;
		mes "-周辺を見回す執事の目つきが";
		mes "急に鋭くなった-";
		next;
		mes "[執事]";
		mes "……厄介な虫はいないようですね。";
		mes "では、こちらへ……";
		close2;
		warp "kh_mansion.gat",20,86;
		end;
	}
}

kh_mansion.gat,22,28,4	script	キル・ハイル	903,{
	cutin "kh_kyel01",2;
	switch(KH_QUE) {
	case 24:
		mes "[キル・ハイル]";
		mes "ほぅ……";
		mes "君が" +strcharinfo(0)+ "か？";
		mes "今回の助力、感謝している。";
		next;
		mes "[キル・ハイル]";
		mes "ふむ……";
		mes "聞きたい事がありそうな顔だな。";
		next;
		mes "[キル・ハイル]";
		mes "知りたい事があるなら遠慮なく";
		mes "聞きたまえ。";
		mes "ただ、私にも用事があるから……";
		mes "そうだな、三つまでなら";
		mes "どんな質問にも答えよう。";
		for(set '@i,0; '@i<3; set '@i,'@i+1) {
			next;
			switch(select("機械人形とは……？","^0000FFキエル^000000という人は……？","^FF0000エリー^000000が持っていたこれは？")) {
			case 1:
				mes "[キル・ハイル]";
				mes "32年前……";
				mes "私が20歳の時から魂を捧げて";
				mes "研究してきた研究物だ。";
				mes "大賢者バルムントが作ろうとした";
				mes "人間と酷似し、人間のように行動する、";
				mes "人間の手によって作られた人形。";
				next;
				mes "[キル・ハイル]";
				mes "外見はガーディアンと似ているように";
				mes "見えるかも知れないが、";
				mes "自分の意思が無く、";
				mes "命令無しでは動く事もできない";
				mes "ガーディアンとは違い、自ら考え";
				mes "行動できる現代科学の傑作である。";
				next;
				mes "[キル・ハイル]";
				mes "もっと詳しく知りたいのなら";
				mes "^0000FFエリシア^000000に聞きたまえ。";
				break;
			case 2:
				mes "[キル・ハイル]";
				mes "^0000FFキエル^000000は私が唯一愛した女性との間に";
				mes "生まれた、たった一人の息子だ。";
				mes "彼女はあいつを産んで";
				mes "死んでしまった……";
				mes "^0000FFキエル^000000は天才的な機械の設計能力を";
				mes "持っている。";
				next;
				mes "[キル・ハイル]";
				mes "^FF0000エリー^000000のような第3世代の機械人形も";
				mes "^0000FFキエル^000000が設計した物だ。";
				mes "しかし今は……第3世代の機械人形を";
				mes "改造して、本来とは違う用途で";
				mes "使用している……";
				next;
				mes "[キル・ハイル]";
				mes "私はそれを止めようとしたが、";
				mes "逆に捕らえられ、";
				mes "あの場所に監禁されていた。";
				mes "一体、あいつが何を望んでいるのか……";
				mes "何故あんな行動をしたのか、";
				mes "私にはまだわかっていない。";
				break;
			case 3:
				mes "[キル・ハイル]";
				mes "……その紋章は^0000FFキエル^000000の紋章だな。";
				mes "黒い服の男が持っていたのか？";
				mes "そいつは^0000FFキエル^000000個人の用心棒、";
				mes "「カイゾ」かも知れんな。";
				next;
				mes "[キル・ハイル]";
				mes "いつの間にか^0000FFキエル^000000が";
				mes "勝手に雇っていた正体不明の男だ。";
				mes "常に黒い服を着て姿を隠している。";
				mes "私もあやつの顔は見たことが無い。";
				break;
			}
		}
		next;
		mes "[キル・ハイル]";
		mes "ふぅ……";
		mes "質問はこれ位でいいかな？";
		set KH_QUE,25;
		break;
	case 25:
		mes "[キル・ハイル]";
		mes "あと……";
		mes "これは感謝の気持ちだ。";
		mes "大した物ではないが、";
		mes "受け取ってくれたまえ。";
		delitem 7493,1;
		delitem 7494,1;
		getitem 12105,1;
		if(checkre())
			getexp 70000,0;
		else
			getexp 700000,0;
		set KH_QUE,26;
		break;
	case 26:
	case 27:
	case 28:
	case 29:
	case 30:
		mes "[キル・ハイル]";
		mes "他に聞きたいことがあるのかね？";
		break;
	case 31:
	case 32:
	case 33:
		mes "[キル・ハイル]";
		mes "何か話でもあるかね？";
		next;
		mes "-まだ確かな情報はない-";
		break;
	case 34:
		mes "[キル・ハイル]";
		mes "ふむ……";
		mes strcharinfo(0)+ "君";
		mes "だったな？";
		mes "何の用かな？";
		next;
		menu "^0000FFエリシア^000000について",-;
		mes "[" +strcharinfo(0)+ "]";
		mes "ジュノーのある廃屋で";
		mes "^0000FFエリシア^000000とまったく同じ顔の";
		mes "肖像画を見つけました。";
		next;
		cutin "kh_kyel02",2;
		mes "[キル・ハイル]";
		mes "………………";
		mes "何が言いたいのかわからない。";
		mes "それがどうかしたのかね？";
		next;
		cutin "kh_kyel03",2;
		mes "[キル・ハイル]";
		mes "世の中には似ている人がいる。";
		mes "その不思議な偶然が";
		mes "私に話したいことかね？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……いいえ。";
		mes "肖像画の女性と^0000FFエリシア^000000は";
		mes "同一人物ではないかと";
		mes "言っているのです。";
		next;
		mes "[キル・ハイル]";
		mes "……ハッハッハッハ！";
		mes "君は一体何を言っているのかね？";
		mes "^0000FFエリシア^000000の外見は";
		mes "私が直接デザインしたものだ。";
		next;
		mes "[キル・ハイル]";
		mes "そうだな……肖像画なら……";
		mes "誰かが^0000FFエリシア^000000の姿を見て";
		mes "ついつい書き残したというのはわかる。";
		mes "画家は自分が気に入った被写体なら";
		mes "何でも描きたがるものだ。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "それにしては、その肖像画は";
		mes "とても古かったようですが……";
		mes "私の見た肖像画は、約30年前の";
		mes "物だったし、その女性の名前も";
		mes "「^0000FFエリシア^000000」";
		mes "ジュノーに実在していた女性です。";
		next;
		cutin "kh_kyel02",2;
		mes "[キル・ハイル]";
		mes "………………";
		next;
		cutin "kh_kyel01",2;
		mes "[" +strcharinfo(0)+ "]";
		mes "私には確信があります。";
		mes "彼女があのエリシアのモデル。";
		mes "そして、あなたが唯一";
		mes "愛した女性ではないかと……";
		next;
		mes "[キル・ハイル]";
		mes "………………";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……一人の貧しい男が";
		mes "一人の女性を愛しました。";
		mes "しかし、彼女は他の男を";
		mes "愛していた。";
		mes "もちろん、";
		mes "その男も彼女を愛していた。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "彼女が愛した男は";
		mes "貧しい男とは比べられない程の";
		mes "富と権力を持った人でした。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "しかし、皮肉なことに、";
		mes "彼女が愛した人には";
		mes "親が決めた婚約者がいた。";
		mes "ある日、その男は";
		mes "彼女を裏切って、婚約者と";
		mes "結婚してしまった。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "彼女はその裏切りに";
		mes "耐えることができず、";
		mes "冷たい川にその身を投げた。";
		mes "そして彼女を愛した貧しい男は";
		mes "復讐を誓ったんです。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "男には特別な技術が";
		mes "一つだけありました。";
		mes "その技術は、どの企業も";
		mes "切望していた技術です。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "男はその技術を企業に売り、";
		mes "企業はその代価として";
		mes "男の復讐を手伝ったのです。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "裏切った男はジェームズ。";
		mes "可憐な少女はエリシア。";
		mes "そして……";
		mes "貧しい男はキル・ハイル……";
		next;
		cutin "kh_kyel03",2;
		mes "[キル・ハイル]";
		mes "クックックッ……";
		mes "ハッハッハッハッハッハ！";
		mes "すごい想像力ではないか。";
		mes "^0000FFエリシア^000000とその女性の";
		mes "名前が同じ、似た容姿というだけで";
		mes "そんな話を考えたのか？";
		next;
		mes "[キル・ハイル]";
		mes "もしかしたら、随分昔に";
		mes "私がその女性を見たのかも知れない。";
		mes "それで、無意識の内に";
		mes "^0000FFエリシア^000000をその女性そっくりに";
		mes "作り上げたのかもしれないな。";
		next;
		mes "[キル・ハイル]";
		mes "しかも、私がその女性を愛した？";
		mes "それは君の妄想に過ぎない。";
		mes "その女性と私が同じ場所で";
		mes "過ごしていたという証拠が";
		mes "一体どこにあるのかね？";
		next;
		menu "小屋で見つけた肖像画を見せる",-;
		cutin "kh_kyel02",2;
		mes "[キル・ハイル]";
		mes "な!?……これは!?";
		mes "…………どこでこれを……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "キル・ハイルさん。";
		mes "これはあなたの肖像画。";
		mes "今の反応を見ても明らかです。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "「^0000FFエリシア^000000」の死体を見つけた";
		mes "漁師さんが教えてくれました。";
		mes "彼女の指輪を取りに来た男が";
		mes "住んでいた家。";
		mes "そこで見つけた肖像画です。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "あなたはその女性がはめていた指輪を";
		mes "現価以上の、ありえないほどの大枚を";
		mes "払って買い取ったそうですね。";
		mes "そんなこと、彼女を知らない人に";
		mes "できる事なのでしょうか？";
		next;
		cutin "kh_kyel03",2;
		mes "[キル・ハイル]";
		mes "………………";
		mes "随分よく調べたな…………";
		next;
		mes "[キル・ハイル]";
		mes "……そうだ。";
		mes "機械人形^0000FFエリシア^000000は";
		mes "死んだ^0000FFエリシア^000000をモデルに";
		mes "作られている。";
		mes "彼女を愛しているから……";
		next;
		mes "[キル・ハイル]";
		mes "しかし、私がジェームズを";
		mes "追い込んだのは君の錯覚だ。";
		mes "私はただの機械工学者だ。";
		mes "他の事に興味はない。";
		next;
		mes "[キル・ハイル]";
		mes "彼を憎んだのは事実だが";
		mes "それは若かった時の事だ。";
		mes "それに、私にはロシミエル家のような";
		mes "由緒正しい家系を潰す程の";
		mes "力は持っていない。";
		next;
		cutin "kh_kyel02",2;
		mes "-確かな証拠が必要みたいだ-";
		next;
		menu "ロシミエル家の肖像画",-;
		mes "[" +strcharinfo(0)+ "]";
		mes "本当にそうなのでしょうか？";
		mes "これを見てください。";
		mes "この肖像画はロシミエル家の廃屋で";
		mes "見つけた物です。";
		mes "恐らく、ロシミエル家……";
		mes "いえ、正しくはジェームズの家族です。";
		next;
		mes "-^FF0000キル・ハイル^000000は";
		mes "肖像画をちらっと見た-";
		next;
		cutin "kh_kyel03",2;
		mes "[キル・ハイル]";
		mes "……それがどうした？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "^FF0000キル・ハイル^000000さん。";
		mes "あなたが持っている懐中時計……";
		mes "随分古い物ですね。";
		mes "この肖像画の中に同じような";
		mes "物があるみたいですが……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "どうしてあなたがこの懐中時計を";
		mes "持っているのですか？";
		next;
		cutin "kh_kyel02",2;
		mes "[キル・ハイル]";
		mes "………………";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "-これは効いたみたいだ！-";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "確かに、あなたにロシミエル家を";
		mes "追い込む力は無いかもしれない……";
		mes "ですが！";
		mes "あなたの支援者である";
		mes "レッケンベルなら、その程度の事";
		mes "簡単にできてしまうのでは!?";
		next;
		cutin "kh_kyel03",2;
		mes "[キル・ハイル]";
		mes "……やるではないか。";
		mes "そう、その通り。";
		mes "私があいつを追い込んだ……";
		mes "あいつを！　……だが！";
		mes "それは裏切られ、全てに絶望した";
		mes "^0000FFエリシア^000000のためだ！";
		next;
		mes "[キル・ハイル]";
		mes "ジェームズが彼女を";
		mes "裏切らなかったら……";
		mes "彼女と幸せに暮らしたら……";
		mes "彼女が自殺しなかったら……";
		next;
		mes "[キル・ハイル]";
		mes "……ふん！";
		mes "あんな奴は地獄に落ちればいい！";
		mes "私の復讐のどこが悪い！";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "彼女は自殺したのではありません。";
		mes "だから……";
		mes "あなたの復讐は間違っています！";
		next;
		mes "[キル・ハイル]";
		mes "何だと!?";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……これを見てください。";
		next;
		menu "ジェームズのメモを見せる",-;
		mes "[キル・ハイル]";
		mes "……こんな紙が何だ！";
		mes "こんな紙切れ一つで、";
		mes "ジェームズが彼女を";
		mes "裏切らなかったとでも言うのか？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "いいえ。";
		mes "裏切らなかったという話を";
		mes "しているのではありません。";
		mes "問題は紙に書かれた日付です。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "紙切れには、ジェームズは彼女と";
		mes "一緒に逃げ出すと書いてあります。";
		mes "それは30年前の8月20日……";
		mes "そして、彼女の死体が発見された日も";
		mes "8月20日です。";
		mes "変じゃありませんか？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "8月20日の朝に、彼女の死体が";
		mes "見つかったというのは事実。";
		mes "つまり、彼女は8月19日の夜に";
		mes "死んだという事になります……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "どうして彼女は";
		mes "愛する男が一緒に逃げるといった";
		mes "その前日の夜に、冷たい川に";
		mes "飛びこまなければならないんですか？";
		next;
		mes "[キル・ハイル]";
		mes "……その男を信じることが";
		mes "できなかったのだろう。";
		mes "……ただ……それだけだ。";
		mes "…………";
		mes "……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "………………";
		mes "…………";
		mes "……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……いいえ。";
		mes "彼女はそんな理由で";
		mes "川に飛び込むはずがありません。";
		mes "この手紙に嘘があるとは";
		mes "思えません。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "恐らく……";
		mes "前日、すなわち8月19日に";
		mes "彼女が川へ来た理由は、";
		mes "あなたが彼女を呼んだからです。";
		next;
		mes "[キル・ハイル]";
		mes "…………ッ!?……";
		mes "ふざけるのも大概にしないか！";
		mes "私がその日彼女を呼んだという証拠が";
		mes "どこにあるというのだ!!";
		next;
		menu "K.Hのメッセージ",-;
		mes "[" +strcharinfo(0)+ "]";
		mes "証拠ならここにあります。";
		mes "この手紙には8月19日の夜、";
		mes "彼女と初めて会った場所で待つという";
		mes "内容が書かれています。";
		mes "そこが……川だったんでしょうね。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "ここに使われているイニシャルK.H、";
		mes "あなたの肖像画に書いていたのと";
		mes "同じイニシャルです。";
		mes "…………";
		mes "一体、あなたと彼女の間に";
		mes "何があったんですか？";
		next;
		cutin "kh_kyel02",2;
		mes "[キル・ハイル]";
		mes "………………";
		mes "…………";
		mes "……";
		next;
		cutin "kh_kyel03",2;
		mes "[キル・ハイル]";
		mes "フ……ハハハ……";
		mes "そう……あの晩……";
		mes "…………";
		next;
		cutin "kh_kyel01",2;
		mes "[キル・ハイル]";
		mes "あの晩、彼女は";
		mes "川辺に来てくれた。";
		mes "私はそんな彼女に";
		mes "裏切り者のジェームズを忘れて";
		mes "私と一緒に暮らそうと言った。";
		next;
		mes "[キル・ハイル]";
		mes "ところが、彼女はジェームズは";
		mes "自分を裏切らなかったし、自分と";
		mes "一緒に逃げだす事を";
		mes "約束したと言ったんだ。";
		next;
		mes "[キル・ハイル]";
		mes "その言葉を聞いた時の";
		mes "私の気持ちがわかるか？";
		mes "フフ……本当に悲惨だった。";
		next;
		mes "[キル・ハイル]";
		mes "そんな時、彼女がしていた";
		mes "指輪を見た瞬間……";
		mes "……そうだな……行き場の無い";
		mes "怒りが爆発したとでも言うべきか……";
		mes "私は、彼女から指輪を奪って";
		mes "川に投げ捨てようとした。";
		next;
		mes "[キル・ハイル]";
		mes "彼女はそんな私から";
		mes "指輪を取り戻そうとしたのだろう。";
		mes "彼女らしい、弱々しい抵抗だった……";
		mes "しかし、何日も続いた暴雨で";
		mes "脆くなっていた地面が……";
		mes "………………";
		next;
		menu "………………",-;
		mes "[キル・ハイル]";
		mes "ク……クック……";
		mes "ハーッハッハッハ！";
		mes "…………ククク……";
		mes "……ハハ……";
		mes "………………";
		delitem 7499,1;
		delitem 7500,1;
		delitem 7501,1;
		delitem 7502,1;
		delitem 7503,1;
		set KH_QUE,35;
		break;
	case 35:
		mes "[キル・ハイル]";
		mes "……翌日……";
		mes "彼女の死体が見つかった。";
		mes "あの指輪は握ったままだった。";
		mes "……ハハ……";
		next;
		mes "[キル・ハイル]";
		mes "何を考えていたのか、";
		mes "私はその指輪を買い取るため、";
		mes "貯金を全て漁師に支払った。";
		mes "そして……";
		mes "呪われたジュノーを去った。";
		next;
		mes "[キル・ハイル]";
		mes "ジュノーを去った後、";
		mes "あちこちを放浪しながら考えた。";
		mes "なぜ私がこんな目にあったのか。";
		mes "なぜ！　どうして！";
		mes "……全て……全てあの男……";
		mes "ジェームズが悪い！";
		next;
		cutin "kh_kyel03",2;
		mes "[キル・ハイル]";
		mes "絶対に許すことができなかった。";
		mes "私には無い、ありとあらゆる物を";
		mes "持っているというのに、";
		mes "^0000FFエリシア^000000まで手にしようとした";
		mes "その金持ちが……";
		next;
		mes "[キル・ハイル]";
		mes "奴があらゆる物を失った時、";
		mes "どれだけ醜くなるのか、";
		mes "死んだ^0000FFエリシア^000000に";
		mes "見せてやりたかった！";
		next;
		mes "[キル・ハイル]";
		mes "それで……";
		mes "第1世代の機械人形……";
		mes "^0000FFエリシア^000000の設計図を持って";
		mes "レッケンベルに行った。";
		next;
		mes "[キル・ハイル]";
		mes "レッケンベルは私が望む物、";
		mes "全てを提供してくれた。";
		mes "金、権力、人脈……";
		mes "そしてロシミエル家を潰す";
		mes "方法までな……";
		next;
		mes "[キル・ハイル]";
		mes "汚い事だとはわかっていた。";
		mes "監視、暗殺、スパイ……";
		mes "いつ裏切るかも知れない人間が";
		mes "私の周りに沢山現れた。";
		next;
		mes "[キル・ハイル]";
		mes "フフッ……ここまで調べられた";
		mes "君の後ろにも誰かいるようだな。";
		mes "そいつらは何を望んでいるのかね？";
		mes "私の命か？";
		mes "それとも機械人形の設計図？";
		mes "そのどちらもかね？　ハハハッ";
		next;
		menu "彼らは……",-;
		cutin "kh_kyel01",2;
		mes "[" +strcharinfo(0)+ "]";
		mes "あなたとレッケンベルの関係。";
		mes "そして、^0000FFキエル^000000についての";
		mes "情報を望んでいます。";
		next;
		mes "[キル・ハイル]";
		mes "^0000FFキエル^000000か……";
		mes "君には見当がついているのだろ？";
		mes "あいつの正体について……";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "やはり……機械人形ですか？";
		mes "第2世代の……";
		next;
		mes "[キル・ハイル]";
		mes "正解だ。";
		mes "^0000FFキエル^000000は圧縮魔法スクロールを";
		mes "最初に使用した第2世代の機械人形だ。";
		mes "多くの失敗と間違いを勝ち抜いた";
		mes "唯一の第2世代……";
		next;
		mes "[キル・ハイル]";
		mes "だからこそ、";
		mes "私はあいつに愛着があった。";
		mes "私と^0000FFエリシア^000000の名を取り、";
		mes "^0000FFキエル^000000と名づけてやった。";
		next;
		mes "[キル・ハイル]";
		mes "そして、今では第3世代の機械人形を";
		mes "任せられる程の技術を持った。";
		mes "しかし……";
		mes "私は良い人間を生み出すことは";
		mes "できなかったようだ。";
		mes "そう、良い後継者なだけだ……";
		next;
		menu "………………",-;
		mes "[キル・ハイル]";
		mes "私は^0000FFキエル^000000の天才的な学習能力、";
		mes "強い力、感情の不安定さを危惧した。";
		next;
		mes "[キル・ハイル]";
		mes "そこで、第3世代には人間と酷似した";
		mes "筋力と学習能力を付与し、";
		mes "集団生活を通じて人間の感情を";
		mes "学ぶようにした。";
		next;
		mes "[キル・ハイル]";
		mes "ところが、^0000FFキエル^000000が改造した";
		mes "第3世代の人形たちは、";
		mes "そのコントロールを";
		mes "完全に無視している。";
		next;
		mes "[キル・ハイル]";
		mes "^0000FFキエル^000000が作った改造機械人形。";
		mes "人間の姿をした殺人兵器。";
		mes "そう、誰も見分けることができない";
		mes "人間の姿をした……";
		next;
		mes "[キル・ハイル]";
		mes "モンスターに似ている能力を搭載、";
		mes "機械と融合された子供達……";
		mes "それはレッケンベルがした";
		mes "人間の生体実験のようだ……";
		next;
		mes "[キル・ハイル]";
		mes "考えて見るといい。";
		mes "人間が人間の尊厳を";
		mes "認めない世界を……";
		next;
		mes "[キル・ハイル]";
		mes "そういえば……君は";
		mes "私が思い出したくない過去に触れたな。";
		mes "そう、君は私の尊厳を踏みにじった。";
		mes "私はこう見えて、";
		mes "とても怒っているのだよ。";
		next;
		mes "[キル・ハイル]";
		mes "……君が私の望みを";
		mes "一つだけ叶えたら、";
		mes "許してやってもいいだろう。";
		next;
		menu "望み？",-;
		mes "[キル・ハイル]";
		mes "そうだ……";
		mes "君に調査を頼んだ者たちの";
		mes "目的とそう変わらない事だろう。";
		next;
		menu "????",-;
		mes "[キル・ハイル]";
		mes "……^0000FFキエル^000000を止めてくれ。";
		mes "これ以上私が作った子供たちが";
		mes "壊されるのは見たくない。";
		next;
		menu "承諾する",-,"頼みを受け入れる",-,"うなずく",-;
		mes "[キル・ハイル]";
		mes "ありがとう。";
		mes "^0000FFキエル^000000はこの邸宅の地下にいる。";
		next;
		mes "[キル・ハイル]";
		mes "あいつを……第2世代の機械人形を";
		mes "開発した場所。";
		mes "今はキエルに改造され、私でさえ";
		mes "奥に行く事はできなくなった。";
		next;
		mes "[キル・ハイル]";
		mes "そこから、あいつを探し出してくれ。";
		mes "そして、あいつの心臓から";
		mes "ある物を取り出してくるんだ。";
		mes "それであいつの暴走は止まる。";
		next;
		menu "ある物？",-;
		mes "[キル・ハイル]";
		mes "^0000FFエリシア^000000の指輪……";
		mes "全ての始まりとなった物。";
		mes "私はあいつの心臓を作りながら、";
		mes "ジェームズへの恨みと私の思いを";
		mes "忘れないために、あいつの心臓に";
		mes "その指輪を埋め込んだ。";
		next;
		mes "[キル・ハイル]";
		mes "普通の武器であいつを止めるのは";
		mes "まず不可能だ。";
		mes "第2世代のボディーの動力を";
		mes "止めるようにする機械を使え。";
		next;
		cutin "kh_kyel03",2;
		mes "[キル・ハイル]";
		mes "これを^0000FFキエル^000000の体に";
		mes "接触させれば、あいつはしばらくの間";
		mes "満足に動けなくなる。";
		mes "その間に、あいつの胸を開いて";
		mes "指輪を抜き出すんだ。";
		mes "……頼んだぞ。";
		getitem 7504,1;
		set KH_QUE,36;
		next;
		mes "[キル・ハイル]";
		mes "準備ができたら";
		mes "^0000FFキエル^000000の部屋まで送ろう。";
		break;
	default:
		if(KH_QUE < 36 || KH_QUE > 54) {
			mes "[キル・ハイル]";
			mes "…………";
			break;
		}
		mes "[キル・ハイル]";
		mes "準備はできたのかね？";
		next;
		if(select("はい","いいえ")==2) {
			mes "[キル・ハイル]";
			mes "準備が整ったらきたまえ。";
			break;
		}
		mes "[キル・ハイル]";
		mes "……頼んだぞ。";
		close2;
		cutin "kh_kyel01",255;
		enablenpc "キエルの部屋入口#kiel";
		initnpctimer;
		end;
	case 54:
		mes "[キル・ハイル]";
		mes "来たか……";
		mes "^0000FFキエル^000000はどうした？";
		next;
		mes "-^FF0000キル・ハイル^000000に、";
		mes "今までの事を話した-";
		mes "^FF0000キル・ハイル^000000は沈痛な顔をしている-";
		next;
		mes "[キル・ハイル]";
		mes "あいつが……ついに第4世代を……";
		mes "それ程までにあいつの能力は……";
		next;
		mes "[キル・ハイル]";
		mes "とりあえず、例を言おう。";
		mes strcharinfo(0)+ "君……";
		mes "ありがとう。";
		next;
		mes "[キル・ハイル]";
		mes "私もじっとしてはいられないな。";
		mes "あいつが私に挑戦するというなら";
		mes "私も誠意を尽くしてあいつを";
		mes "阻んでやらなければならない。";
		next;
		mes "[キル・ハイル]";
		mes "よかったらこれを受け取ってくれ。";
		mes "私の感謝の気持ちだ。";
		next;
		mes "[キル・ハイル]";
		mes "そして、恥知らずではあるが、";
		mes "一つ頼みがある。";
		mes "私は工場に監禁されていた時、";
		mes "^0000FFキエル^000000のような姿をした";
		mes "機械人形を見たことがある。";
		next;
		mes "[キル・ハイル]";
		mes "あの時は^0000FFキエル^000000が気まぐれで作った";
		mes "自分のコピーかと思ったが……";
		mes "君の話を聞くと、それはどうやら";
		mes "第4世代の試作品のようだ。";
		next;
		mes "[キル・ハイル]";
		mes "工場の深層部まで入ることができる";
		mes "カードキーをあげよう。";
		mes "君には工場を調査してもらいたい。";
		mes "私は崩れた^0000FFキエル^000000の部屋を";
		mes "どうにかして調べてみる。";
		next;
		mes "[キル・ハイル]";
		mes "十分に気をつけたまえ。";
		delitem 7508,1;
		getitem 7509,1;
		getitem 616,1;
		if(checkre())
			getexp 100000,0;
		else
			getexp 1300000,0;
		set KH_QUE,55;
		break;
	}
	close2;
	cutin "kh_kyel01",255;
	end;
OnTimer30000:
	stopnpctimer;
	disablenpc "キエルの部屋入口#kiel";
	end;
}

kh_mansion.gat,18,30,4	script	エリシア	894,{
	cutin "kh_ellisia",2;
	switch(KH_QUE) {
	case 24:
		mes "[エリシア]";
		mes "ようこそおいでくださいました。";
		mes strcharinfo(0)+ "様、";
		mes "^FF0000キル・ハイル^000000様から";
		mes "お話がございます。";
		break;
	case 25:
	case 26:
		mes "[エリシア]";
		mes "機械人形に関する説明が";
		mes "必要ですか？";
		next;
		if(select("はい","いいえ")==2) {
			mes "[エリシア]";
			mes "何かあればお申し付けください。";
			break;
		}
		mes "[エリシア]";
		mes "機械人形とは、自己も持った";
		mes "人形を意味しています。";
		mes "過去、多くの賢者たちが研究し、";
		mes "繰り返し失敗してきた機械工学の";
		mes "最高品です。";
		next;
		mes "[エリシア]";
		mes "私のマスターである^FF0000キル・ハイル^000000様は";
		mes "20歳から研究を始めています。";
		mes "現在、機械人形は3種類あり、";
		mes "それぞれを第1世代、第2世代、第3世代";
		mes "の機械人形と区別されています。";
		next;
		switch(select("第1世代？","第2世代？","第3世代？")) {
		case 1:
			mes "[エリシア]";
			mes "この私「^0000FFエリシア^000000」が";
			mes "^FF0000キル・ハイル^000000様が作られた";
			mes "第1世代の機械人形です。";
			next;
			mes "[エリシア]";
			mes "純粋機械骨格に人工心臓を入れ、";
			mes "科学的に作られた人工肌を持ってます。";
			next;
			mes "[エリシア]";
			mes "頭脳には魔法スクロールを応用した";
			mes "「記憶スクロール」を組み込んだ";
			mes "球形機械頭脳を使用しています。";
			next;
			mes "[エリシア]";
			mes "機械骨格を使用しているため、";
			mes "重量が大きくなる。";
			mes "また、限定的なスクロール容量なため、";
			mes "複雑な学習ができず、";
			mes "人間的な感情表現が不可能という";
			mes "二つの欠点があります。";
			break;
		case 2:
			mes "[エリシア]";
			mes "第1世代同様に、";
			mes "^FF0000キル・ハイル^000000様が作られた";
			mes "機械人形です。";
			next;
			mes "[エリシア]";
			mes "第2世代の機械人形は";
			mes "セージのスクロール作成、";
			mes "アルケミストのホムンクルス製造";
			mes "等を応用した新しい機械人形です。";
			next;
			mes "[エリシア]";
			mes "第1世代同様に機械骨格と";
			mes "人工心臓を動力源としていますが、";
			mes "ホムンクルス製法を利用した";
			mes "人工ボディーを備えています。";
			next;
			mes "[エリシア]";
			mes "また、「記憶スクロール」の";
			mes "10万倍以上の容量と効率性を持った";
			mes "「圧縮記憶スクロール」によって、";
			mes "より人間に近い学習が可能です。";
			next;
			mes "[エリシア]";
			mes "しかし、圧縮記憶スクロールに";
			mes "不備があり、人間型ボディーと";
			mes "機械骨格の間に適合がとれず、";
			mes "6年程度で機能を停止してしまいます。";
			break;
		case 3:
			mes "[エリシア]";
			mes "第2世代の機械人形と違い、";
			mes "第3世代は";
			mes "^FF0000キル・ハイル^000000様の息子である";
			mes "^0000FFキエル^000000様が設計された物です。";
			next;
			mes "[エリシア]";
			mes "機械骨格を使わない";
			mes "純粋なホムンクルスのボディー。";
			mes "擬似ユミルの心臓の欠片を改造した";
			mes "人工心臓を動力源としているため、";
			mes "人間のような生体機能を持つことが";
			mes "可能となりました。";
			next;
			mes "[エリシア]";
			mes "記憶スクロールは、";
			mes "第2世代に使われた";
			mes "「圧縮記憶スクロール」を";
			mes "改造した物を使用しております。";
			next;
			mes "[エリシア]";
			mes "第2世代のスクロールより";
			mes "性能は落ちますが、安定性は上がり";
			mes "生産コストを抑えた";
			mes "量産型「圧縮スクロール」です。";
			next;
			mes "[エリシア]";
			mes "あなたが会った「^FF0000エリー^000000」が";
			mes "第3世代のプロトタイプです。";
			mes "現在は工場で大量販売のため、";
			mes "量産型機械人形シリーズの";
			mes "生産を終えた状態です。";
			next;
			mes "[エリシア]";
			mes "新しく導入した学習方法として、";
			mes "学院という場で共同生活を経験し、";
			mes "最適化のテストを行っています。";
			break;
		}
		break;
	default:
		mes "[エリシア]";
		mes "………………";
		break;
	}
	close2;
	cutin "kh_ellisia",255;
	end;
}

lighthalzen.gat,188,200,0	script	邸宅前	139,3,1,{
OnTouch:
	if(KH_QUE != 26 && KH_QUE != 27)
		end;
	mes "-邸宅を出た瞬間、";
	mes "頭に衝撃を受けて";
	mes "意識を失った-";
	close2;
	heal -Hp+1,0;
	warp "kh_mansion.gat",30,75;
	end;
}

kh_mansion.gat,25,79,4	script	謎のある女	727,3,3,{
L_Start:
	switch(KH_QUE) {
	case 26:
		mes "-………………-";
		mes "-頭に軽い痛みがある-";
		mes "-意識がハッキリすると、";
		mes "目の前に一人の女性が立っていた-";
		next;
		mes "[??????]";
		mes "フフ、お目覚めになりましたか？";
		mes "意外と頑丈なんですね。";
		mes "だからと言って、";
		mes "暴れないでください。";
		next;
		mes "[??????]";
		mes "でないと、あなたの安全は";
		mes "保障できなくなります。";
		mes "今の状況は理解できていますか？";
		mes "私はシュバルツバルド情報部";
		mes "所属の者です。";
		next;
		mes "[??????]";
		mes "最近、「レッケンベル」と";
		mes "「キル・ハイル企業」の間で";
		mes "何か動きがあるようなので、";
		mes "調査の中だったのです。";
		next;
		mes "[??????]";
		mes "そのため、キル・ハイルの邸宅を";
		mes "監視していた所、";
		mes "あなたが^FF0000キル・ハイル^000000と単独で";
		mes "話しているとの報告を受けました。";
		mes "そこで、少々強引な方法でしたが、";
		mes "あなたをここへ連れて来ました。";
		next;
		mes "[??????]";
		mes "……強引だったのは謝罪します。";
		mes "ですが……";
		mes "あなたは^FF0000キル・ハイル^000000と";
		mes "どんな関係なのですか？";
		next;
		if(select("今までの事を話す","わからない")==1) {
			mes "-あなたは、今までにあった事を";
			mes "正直に彼女に話した-";
			mes "-^FF0000エリー^000000の話をする時、";
			mes "ふと自分の声がだんだんと";
			mes "無くなっていくのに気づいた-";
			mes "…………";
			mes "……";
			next;
			mes "[??????]";
			mes "うん……そう……";
			mes "彼女は残念だったわね……";
			next;
			mes "[??????]";
			mes "彼女のような犠牲者を増やさないため、";
			mes "この事件を解決するため、";
			mes "あなたが私たちを手伝ってくれたら";
			mes "とても助かるんだけど……";
			mes "どうかしら？";
		}
		else {
			mes "[??????]";
			mes "本当にわからないの？";
			mes "^FF0000キル・ハイル^000000と単独で会える人なんて";
			mes "そう多くはないのよ？";
			mes "あなたに迷惑はかけないから、";
			mes "知っていることを話して。";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "………………";
			next;
			mes "[??????]";
			mes "あなたが黙っていたら問題は";
			mes "解決されなくなるの。";
			mes "あなたの助けがあれば";
			mes "仕事も早く終わるのよ。";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "………………";
			next;
			mes "[??????]";
			mes "そう……しょうがないわね……";
			mes "それなら、私たちの方からも";
			mes "情報を提供するわ。";
			mes "だから、あなたが知っている情報も";
			mes "見返りとして私たちに提供して。";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "え？";
			mes "あの……ちょっと!?";
			next;
			mes "[??????]";
			mes "そんな難しく考えなくていいわ。";
			mes "お互いに知っている情報が";
			mes "同じになるだけ。";
			mes "じゃ、私たちが知っている情報から";
			mes "話すわね。";
			next;
			mes "[??????]";
			mes "…………";
			mes "^FF0000キル・ハイル^000000はあらゆる";
			mes "自動機械を生産販売する";
			mes "「キル・ハイル」企業の会長よ。";
			next;
			mes "[??????]";
			mes "そんな彼も、";
			mes "初めはアインブロックで";
			mes "小さな工場を開いていた。";
			mes "しかし、ある日レッケンベルが";
			mes "キル・ハイルと接触した。";
			mes "一種の子会社のような概念よ。";
			next;
			mes "[??????]";
			mes "実はそこがミソ。";
			mes "重要開発者たちがいなくなったため、";
			mes "当時のレッケンベル最大事業だった";
			mes "ガーディアンの修理を";
			mes "「^FF0000キル・ハイル^000000」に";
			mes "任せるようになったの。";
			next;
			mes "[??????]";
			mes "そこに、偶然以外の";
			mes "何か別の要因があったかは";
			mes "わかっていないわ。";
			next;
			mes "[??????]";
			mes "とにかく、";
			mes "そこで予想外の後継者が生まれた。";
			mes "彼の名は「^0000FFキエル^000000」。";
			next;
			mes "[??????]";
			mes "しかし、キル・ハイルは未婚。";
			mes "もしかすると、キル・ハイルの秘書";
			mes "^0000FFエリシア^000000との子供かと";
			mes "推測できないこともないけど……";
			next;
			mes "[??????]";
			mes "後継者「^0000FFキエル^000000」は";
			mes "完璧な姿を見せつけたわ。";
			mes "外見、体力、技術……どれ一つ";
			mes "欠けていない……";
			next;
			mes "[??????]";
			mes "そして、何故かわからないけど";
			mes "「^0000FFキエル^000000」は唐突にある事業を始めた。";
			mes "事業と言うのはおかしいけど……";
			mes "福祉施設を兼ねた";
			mes "専門学院を設立したのよ。";
			next;
			mes "[??????]";
			mes "社会福祉と公言してね。";
			mes "そこで、政府や他の競争関係にあった";
			mes "企業はその学院に";
			mes "学生に偽装させた調査員を";
			mes "潜入させようとした。";
			next;
			mes "[??????]";
			mes "しかし、その全てが入学を";
			mes "拒否された";
			mes "孤児に偽装した書類、優れた成績……";
			mes "何一つ通じなかった。";
			mes "まるで……あらかじめ決められた";
			mes "子供だけしか入学できないように……";
			next;
			mes "[??????]";
			mes "そしてつい先日、";
			mes "その「^0000FFキエル^000000」が";
			mes "レッケンベル関係者や関連企業の";
			mes "社長たちを集めた";
			mes "極秘集会を行っているの。";
			next;
			mes "[??????]";
			mes "いくら極秘集会とはいえ、";
			mes "私たちも大まかな情報は得ているわ。";
			mes "その集会で「^0000FFキエル^000000」は";
			mes "新しいプロジェクトを発表した。";
			next;
			mes "[??????]";
			mes "それが機械人形。";
			mes "ガーディアンと違い、";
			mes "自己を持って行動できる機械人形。";
			next;
			mes "[??????]";
			mes "ところが、不思議なことに";
			mes "そんな重要な集会だというのに";
			mes "会長である「^FF0000キル・ハイル^000000」は";
			mes "姿を現さなかった。";
			mes "彼の秘書である「^0000FFエリシア^000000」もね。";
			next;
			mes "[??????]";
			mes "そもそも、その集会の数日前から";
			mes "「^FF0000キル・ハイル^000000」の行方が";
			mes "わからなかった……";
			mes "っと思ったら、いつのまにか彼は";
			mes "邸宅に姿を現わしている";
			mes "まるで何事もなかったようにね。";
			next;
			mes "[??????]";
			mes "すると、今度は「^0000FFキエル^000000」が";
			mes "研究を言い訳に公式の席を外している。";
			next;
			mes "[??????]";
			mes "どう見ても不自然すぎるわ。";
			mes "まるで二人が入れ替わっているみたい。";
			mes "それに、集会の裏でどんな陰謀が";
			mes "あるのかもわからないし。";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "彼らの背後には";
			mes "レッケンベルがあるからですね。";
			next;
			mes "[??????]";
			mes "あら、ようやく話す気になった？";
			mes "じゃあそろそろあなたの番かしらね。";
			mes "どうぞ、楽に話すといいわ。";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "え……あ……そんなつもりじゃ……";
			mes "………………";
			mes "-しかし、彼女の情報は";
			mes "とても貴重だった-";
			mes "-私も仕方なく話を始めた-";
			mes "………………";
			next;
			mes "-^FF0000エリー^000000にであった事-";
			mes "-^0000FFエリシア^000000、^FF0000キル・ハイル^000000について-";
			mes "-今までの全てを話した-";
			mes "…………";
			mes "……";
			next;
			mes "[??????]";
			mes "ん…………";
			mes "すごいわね……";
			mes "機械人形がそこまで…………";
			next;
			mes "[??????]";
			mes "ねぇ。";
			mes "あなたが私たちを手伝ってくれたら";
			mes "とても助かるんだけど……";
			mes "どうかしら？";
		}
		next;
		if(select("手伝う","…………")==2) {
			mes "[??????]";
			mes "やっぱり……そうよね……";
			mes "うんうん……沈黙は肯定よね。";
			mes "フフ……";
			next;
			mes "[" +strcharinfo(0)+ "]";
			mes "え？";
			mes "あの……ちょっと!?";
			next;
			mes "[??????]";
			mes "そう心配しないでいいわ。";
			mes "あなたの安全は私たちが保障する。";
			mes "あなたはただ、私たちに協力して";
			mes "調査さえしてくれればいいのよ。";
			next;
			menu "……わかりました",-;
			mes "[" +strcharinfo(0)+ "]";
			mes "…………";
			mes "わかりました。";
			next;
			mes "[??????]";
		}
		else {
			mes "[??????]";
			mes "あら、意外と物わかりがいいのね。";
		}
		mes "フフ……";
		mes "あ、まだ自己紹介をしてなかったわね。";
		mes "私はシュバルツバルド情報部所属の";
		mes "「^0000FFミッチェル・ライラ^000000」";
		mes "よろしくね。";
		set KH_QUE,27;
		close;
	case 27:
		mes "[ミッチェル]";
		mes "それでは、";
		mes "いくつか手がかりを上げるわ。";
		mes "ジュノーで30年程前、";
		mes "^FF0000キル・ハイル^000000の秘書、";
		mes "^0000FFエリシア^000000を";
		mes "見たという女性がいるの。";
		next;
		mes "[ミッチェル]";
		mes "しかし、彼女の話によると、";
		mes "^0000FFエリシア^000000は30年前に自殺し、";
		mes "今の^FF0000キル・ハイル^000000の秘書である";
		mes "^0000FFエリシア^000000は";
		mes "30年前の彼女とまったく同じ";
		mes "姿をしているとのこと。";
		next;
		mes "[ミッチェル]";
		mes "そこで一つの仮定。";
		mes "^0000FFエリシア^000000のモデルが";
		mes "まさに彼女ではないかという事。";
		mes "だから、あなたはジュノーに行って";
		mes "^0000FFエリシア^000000について調べて欲しいの。";
		next;
		mes "[ミッチェル]";
		mes "情報があつまったら、";
		mes "キル・ハイル邸宅にいる執事に";
		mes "声を掛ければ、";
		mes "私の所まで案内してくれるわ。";
		next;
		mes "[ミッチェル]";
		mes "準備が整ったら、専用飛行船で";
		mes "ジュノーまで送ってあげるわよ。";
		set KH_QUE,28;
		close;
	case 28:
		mes "[ミッチェル]";
		mes "どう？";
		mes "準備はできた？";
		next;
		if(select("はい","いいえ")==2) {
			mes "[ミッチェル]";
			mes "準備ができたら言って。";
			close;
		}
		mes "[ミッチェル]";
		mes "それじゃ、お願いね。";
		close2;
		warp "yuno.gat",54,209;
		end;
	case 33:
		mes "[ミッチェル]";
		mes "ああ、お帰りなさい。";
		mes "何かいい情報があった？";
		next;
		mes "-あなたはジュノーで得た情報を";
		mes "詳しく話した-";
		next;
		mes "[ミッチェル]";
		mes "そう…………";
		mes "やっぱりあなたに頼んでよかったわ。";
		mes "有力な情報よ。";
		mes "そこで、最後のお願いがあるの。";
		next;
		mes "[ミッチェル]";
		mes "その話を^FF0000キル・ハイル^000000にすれば、";
		mes "^0000FFキエル^000000の正体と";
		mes "レッケンベルとの関係を";
		mes "知る事ができるかもしれないの。";
		mes "お願い、力を貸して。";
		next;
		mes "[ミッチェル]";
		mes "大丈夫。";
		mes "危なくなったら私のチームが";
		mes "フォローに入る。";
		mes "本当に無理はしなくていいから。";
		set KH_QUE,34;
		next;
		warp "kh_mansion.gat",83,50;
		end;
	default:
		mes "[ミッチェル]";
		mes "はやく行きましょう。";
		next;
		warp "kh_mansion.gat",83,50;
		end;
	}
OnTouch:
	if(KH_QUE == 26)
		goto L_Start;
	end;
}

//============================================================
// ロシミエル邸NPC
//------------------------------------------------------------
yuno.gat,257,140,4	script	妙なお婆さん	846,{
	if(KH_QUE > 30) {
		mes "[お婆さん]";
		mes "眠くないかい？　^0000FFエリシア^000000。";
		mes "ん？　お腹が空いてるの？";
		mes "それじゃあご飯にしないとねぇ……";
		close;
	}
	if(KH_QUE != 28) {
		mes "[お婆さん]";
		mes "うちの子はどこに行ったの？";
		mes "どこ……どこなの？";
		if(countitem(7500) < 1)
			close;
		next;
		menu "もしかして……",-;
		cutin "kh_ellisia_port",1;
		mes "-お婆さんに^0000FFエリシア^000000の";
		mes "肖像画を見せてみた-";
		next;
		cutin "kh_ellisia_port",255;
		mes "[お婆さん]";
		mes "ん？";
		mes "あぁ！";
		mes "エリー！　^0000FFエリシア^000000!!";
		mes "私のエリーを知っている!?";
		mes "うちの子はどこにいるの!?!";
		next;
		mes "[お婆さん]";
		mes "うちの子……エリーは";
		mes "昨日、家を出てから帰ってこないのよ！";
		mes "うちの子がどこにいるかわかったら";
		mes "教えてちょうだい！";
		next;
		mes "-……お婆さんは";
		mes "肖像画を見た一瞬だけ";
		mes "正気を取り戻したようだが、";
		mes "またすぐに独り言を";
		mes "つぶやき始めた-";
		close;
	}
	mes "[お婆さん]";
	mes "あぁ、もう泣かないで。";
	mes "そんなに泣かれたら";
	mes "眠れないじゃない。";
	mes "まったくもう……";
	next;
	mes "[お婆さん]";
	mes "ほら、泣き止んで。";
	mes "泣かない、泣かない。";
	mes "そんなに泣いてたら";
	mes "水の中の魚まで";
	mes "眠れなくなっちゃうわよ。";
	next;
	if(select("何をしているんですか？","子供がよく泣くのですか？")==1) {
		mes "[お婆さん]";
		mes "うん？";
		mes "あぁ……うちの子が泣き止まなくて、";
		mes "全然寝られないのよ。";
		mes "この子が寝ると私も安心して";
		mes "仕事ができるのに……";
		next;
		mes "[お婆さん]";
		mes "子供が寝ないから仕事ができなくて";
		mes "生活が台無しなのよ……";
		next;
		menu "子供はどこにいるのですか？",-;
		mes "[お婆さん]";
		mes "ん？";
		mes "あ！　まったくどこ行ってたの！";
		mes "どれだけ心配したか……";
		mes "遊びに行ってばかりいるんじゃないの！";
		next;
		mes "[お婆さん]";
		mes "ごめんなさいね。";
		mes "迷惑かけちゃって。";
		mes "ほら、はやく帰るよ！";
		mes "まったくもう……";
	}
	else {
		mes "[お婆さん]";
		mes "うん？　うん……";
		mes "子供が寒いって泣いてねぇ。";
		mes "そんなに寒いなら";
		mes "すぐに帰って来ればいいのに。";
		next;
		mes "[お婆さん]";
		mes "どうしてそんなに水が好きなの……";
		mes "ほら、エリシア。";
		mes "こっちに来て早く寝なさい。";
		next;
		mes "[お婆さん]";
		mes "早く寝てくれないと";
		mes "仕事ができないじゃない……";
	}
	sc_start SC_CURSE,30000,1;
	set KH_QUE,29;
	close;
}

yuno.gat,250,132,7	script	おばさん	711,{
	if(KH_QUE < 29) {
		mes "[おばさん]";
		mes "はぁ……";
		mes "最近、年のせいか";
		mes "なんだか疲れるわぁ……";
		close;
	}
	switch(KH_QUE) {
	case 29:
		mes "[おばさん]";
		mes "んー……";
		mes "なんだか天気が悪いわね。";
		next;
		if(select("…………","あのお婆さんの事でちょっと……")==1) {
			mes "[おばさん]";
			mes "私も年をとったわねぇ……";
			mes "……はぁ…………";
			close;
		}
		mes "[おばさん]";
		mes "ん？　あぁ……あの人？";
		mes "あの人ならよく知ってるよ。";
		mes "私の友達のお母さん。";
		mes "「^0000FFエリシア^000000」……";
		mes "若い頃に死んじゃったの……";
		mes "本当に良い子だったのに……";
		next;
		mes "[おばさん]";
		mes "あの日以来、あのお婆さんは";
		mes "ショックであんな風に";
		mes "なってしまったのよ…………";
		next;
		menu "^0000FFエリシア^000000さんは……",-;
		mes "[おばさん]";
		mes "^0000FFエリシア^000000は……";
		mes "本当にきれいだったわ……";
		mes "女の私が言うぐらいよ。";
		next;
		mes "[おばさん]";
		mes "だから、周囲の男たちからも";
		mes "人気があったの。";
		mes "特にあのロシミエル家の長男、";
		mes "ジェームズが熱中してたわ。";
		mes "聞いた話だとプロポーズを";
		mes "したらしいんだけど……";
		next;
		mes "[おばさん]";
		mes "数日後に^0000FFエリシア^000000が";
		mes "死んだせいか、ロシミエル家は";
		mes "破産したの。";
		mes "…………";
		next;
		menu "ロシミエル？",-;
		mes "[おばさん]";
		mes "ああ……ロシミエルは";
		mes "ジュノーの中でも由緒ある家門。";
		mes "でも……";
		mes "^0000FFエリシア^000000が死んだ後、";
		mes "息子のジェームズが事業を失敗して、";
		mes "破産したのよ……";
		next;
		mes "[おばさん]";
		mes "その時、邸宅を管理していた私に";
		mes "鍵を任せられたのよ……";
		next;
		menu "邸宅に入ることはできますか？",-;
		mes "[おばさん]";
		mes "うーん……本当はできないけど……";
		mes "あなたは^0000FFエリシア^000000を";
		mes "知っているし、信じて鍵を預けるわ。";
		mes "市の役員が来る前に";
		mes "鍵を返してちょうだいね。";
		getitem 7498,1;
		set KH_QUE,30;
		close;
	case 30:
		if(countitem(7499) < 1 || countitem(7500) < 1 || countitem(7501) < 1 || countitem(7502) < 1) {
			mes "[おばさん]";
			mes "行くなら早く行って、";
			mes "鍵を返してね。";
			close;
		}
		mes "[おばさん]";
		mes "終わったの？";
		mes "お金になりそうな物は";
		mes "ほとんどなかったでしょ。";
		mes "ずいぶん前に多くの人が";
		mes "持って行っちゃったのよ。";
		next;
		menu "^0000FFエリシア^000000はなぜ……？",-;
		mes "[おばさん]";
		mes "ああ……";
		mes "前にロシミエルの長男、";
		mes "ジェームズが^0000FFエリシア^000000と";
		mes "結婚を約束したって言わなかった？";
		next;
		mes "[おばさん]";
		mes "でも、実はジェームズには";
		mes "親が決めた婚約者がいたのよ。";
		mes "それで、ジェームズはその";
		mes "婚約者と結婚してしまったのよ。";
		next;
		mes "[おばさん]";
		mes "^0000FFエリシア^000000は随分と傷ついてね……";
		mes "自殺してしまったのよ……";
		next;
		menu "もうちょっと詳しく……",-;
		mes "[おばさん]";
		mes "それなら私より「キル・ハイル学院」の";
		mes "南で暮らしている漁師さんに";
		mes "聞いてみるといいわ。";
		mes "その人が川で^0000FFエリシア^000000の";
		mes "死体を見つけたのよ。";
		mes "あとはその人に聞いてみなさい。";
		delitem 7498,1;
		set KH_QUE,31;
		close;
	default:
		mes "[おばさん]";
		mes "ふぅ……洗濯物しないと。";
		close;
	}
}

yuno.gat,273,141,0	script	ロシミエル邸入口	45,1,1,{
	if(KH_QUE == 30)
		warp "kh_rossi.gat",20,92;
	else
		warp "yuno.gat",270,141;
	end;
}

kh_rossi.gat,23,23,0	script	テーブル	111,{
	if(KH_QUE != 30)
		end;
	if(countitem(7499)) {
		mes "-肖像画があった机だ-";
		close;
	}
	cutin "kh_family_port",1;
	mes "-机をよく調べると、";
	mes "引き出しを開けることができた-";
	mes "-引き出しの中には";
	mes "肖像画が入っていた-";
	getitem 7499,1;
	close2;
	cutin "kh_family_port",255;
	end;
}

kh_rossi.gat,92,40,0	script	書棚	111,{
	if(KH_QUE != 30)
		end;
	if(countitem(7500)) {
		mes "-女性の肖像画を見つけた棚だ-";
		close;
	}
	mes "-鍵が掛かった引き出しがある-";
	next;
	if(select("鍵を使う","ほおっておく")==1) {
		if(select("1つ目の引き出し","2つ目の引き出し")==1) {
			cutin "kh_ellisia_port",2;
			mes "-机をよく調べると、";
			mes "引き出しを開けることができた-";
			mes "-引き出しの中には";
			mes "肖像画が入っていた-";
			getitem 7500,1;
			close2;
			cutin "kh_ellisia_port",255;
			end;
		}
	}
	mes "-特に何も無い-";
	close;
}

kh_rossi.gat,144,286,0	script	机	111,{
	if(KH_QUE != 30)
		end;
	mes "-3個の引き出しがある机だ-";
	next;
	switch(select("1個目の引き出し","2個目の引き出し","3個目の引き出し","気にしない")) {
	case 1:
		mes "-何かにひっかかって開かない-";
		close;
	case 2:
		if(countitem(7501)) {
			mes "-引き出しの中は空っぽだ-";
			close;
		}
		mes "-引き出しの中に手紙があった-";
		next;
		mes "-「k.h」というイニシャルの人が";
		mes "^0000FFエリシア^000000に送る手紙のようだ-";
		getitem 7501,1;
		close;
	case 3:
		mes "-引き出しの中に手紙があった-";
		next;
		mes "-手紙の内容は、ジェームズが";
		mes "^0000FFエリシア^000000にプロポーズする";
		mes "ものだった-";
		mes "-^0000FFエリシア^000000はジェームズから";
		mes "婚約指輪を受けとったようだ-";
		close;
	case 4:
		mes "………………";
		close;
	}
}

kh_rossi.gat,148,288,0	script	本棚	111,{
	if(KH_QUE != 30)
		end;
	if(countitem(7502)) {
		mes "-ほこりの積もった本がある-";
		close;
	}
	mes "-本棚にしまわれた本の間に";
	mes "ジェームズのメッセージが";
	mes "挟まっているのを見つけた-";
	getitem 7502,1;
	close;
}

yuno_fild12.gat,232,222,6	script	老けた漁師	709,{
	if(KH_QUE > 31) {
		mes "[漁師]";
		mes "なんだよ忘れたのか？";
		mes "ったく若いくせによ。";
		mes "もう一度言ってやるから";
		mes "ちゃんと覚えろよな。";
		next;
		mes "[漁師]";
		mes "「^FF0000北東の方角^000000」にある";
		mes "「^FF0000警備隊野営地^000000」の小屋";
		mes "わかったな？";
		close;
	}
	if(KH_QUE < 31) {
		mes "[漁師]";
		mes "あーぁ、釣れんなぁ。";
		mes "めっきり魚の数が減りやがってよぉ。";
		close;
	}
	mes "[漁師]";
	mes "ん？";
	mes "何だお前？";
	mes "何か俺に用か？";
	mes "頼みごとがあるなら何かくれよ。";
	mes "何か。";
	next;
	mes "[漁師]";
	mes "ふぅー";
	mes "そういえば最近、";
	mes "新鮮なさしみを食ってないなー";
	mes "あー、腹減ったー";
	if(countitem(544) < 10)
		close;
	next;
	mes "[漁師]";
	mes "ん？";
	mes "それを俺にくれるのか？";
	mes "ほんとか？";
	mes "へっへっへ……ありがとよ。";
	mes "おっと、何か用があるんだろ？";
	mes "遠慮なく言いな。";
	delitem 544,10;
	next;
	menu "30年前にここで……",-;
	mes "[漁師]";
	mes "ん？　ああ……まだ覚えてるよ。";
	mes "30年前の8月20日のことだろ？";
	mes "あれはよく憶えている。";
	mes "何せ女房の誕生日だからよ。";
	mes "へへ。";
	next;
	mes "[漁師]";
	mes "それで、女房に何か";
	mes "贈り物でもするかって思って";
	mes "朝早くから網を投げに来てたんだ。";
	next;
	mes "[漁師]";
	mes "ところが、妙に網が重くて";
	mes "「大物だ！」って思って";
	mes "引き上げてみたら、";
	mes "なんと、女の死体を引き上げちまった。";
	next;
	mes "[漁師]";
	mes "驚いてジュノー警備隊に届けたよ。";
	mes "後から聞いたんだけど、その女は";
	mes "好きだった男に裏切られて";
	mes "自殺しちまったんだと。";
	mes "ったく、悪い男もいるもんだぜ。";
	next;
	mes "[漁師]";
	mes "それで、その女の死体を警備隊";
	mes "がジュノーに持っていく途中に、";
	mes "ぎゅっと握られていたその女の手から";
	mes "何か光る物が落ちたんだ。";
	next;
	mes "[漁師]";
	mes "ところが、警備隊の誰も";
	mes "気付きやしなかったら、";
	mes "警備隊がいなくなってから、";
	mes "こっそりとそれを探してみたんだ。";
	next;
	mes "[漁師]";
	mes "すると、すごく高そうな";
	mes "指輪が落ちていたんだ。";
	next;
	mes "[漁師]";
	mes "これをどうするかって思ったけどよ。";
	mes "死体が指輪しててもしょうがないだろ？";
	mes "なら、生きてる俺の役に立つ方が";
	mes "いいってもんじゃねぇか？";
	next;
	mes "[漁師]";
	mes "それで、指輪を売って女房への";
	mes "贈り物でも買おうと思っていたら、";
	mes "ある男が一心不乱にこっちに";
	mes "走ってくるじゃないか。";
	next;
	mes "[漁師]";
	mes "すると、その男は鬼気迫る感じで";
	mes "俺に女の死体を引き上げた本人か";
	mes "聞いてきてよ。";
	mes "ちょっと恐かったから、素直に";
	mes "そうだって言ったんだ。";
	next;
	mes "[漁師]";
	mes "そしたら、指輪を拾わなかったか？";
	mes "と聞いてきやがった。";
	mes "俺は知らん振りをしたね。";
	next;
	mes "[漁師]";
	mes "すると、その男はどうしてもその指輪が";
	mes "必要だと何度も言ってくるんだ。";
	mes "指輪は高く買うとも言った。";
	next;
	mes "[漁師]";
	mes "それなら、こいつに高く";
	mes "買ってもらおうと思ってよ。";
	mes "まぁ、男の気迫に負けたってのも";
	mes "あったけどな。";
	mes "その男に指輪を売ったんだ。";
	next;
	mes "[漁師]";
	mes "そしたら、予想外の大金をくれてよ。";
	mes "後で村のやつから聞いたら、";
	mes "故障した機械を修理しながら";
	mes "細々と暮らす人だったってよ。";
	mes "その後、どっかいっちまったらしい。";
	next;
	mes "[漁師]";
	mes "まぁ、俺の知ってるのはこれぐらいだ。";
	next;
	menu "その男の名前は？",-;
	mes "[漁師]";
	mes "ん？　名前？";
	mes "あー、聞いた……か？";
	mes "う～ん、どっちにしろ";
	mes "覚えてないなぁ。";
	next;
	mes "[漁師]";
	mes "何せ30年前だしな。";
	mes "あぁ、でも住んでた場所は覚えている。";
	mes "確か、「^FF0000北東の方角^000000」にある";
	mes "「^FF0000警備隊野営地^000000」の小屋";
	mes "だったよ。";
	set KH_QUE,32;
	close;
}

yuno_fild09.gat,158,217,0	script	木板	111,{
	if(KH_QUE != 32) {
		mes "-沢山の木の板が";
		mes "草むらの中に落ちている-";
		close;
	}
	mes "-木の板が落ちている-";
	mes "-木の板にはK.Hという字が";
	mes "書いている-";
	next;
	cutin "kh_kyel_port",2;
	mes "-木の板をひっくり返すと、";
	mes "どこかで見たような若い男の";
	mes "肖像画が描かれていた-";
	mes "-……どこか^FF0000キル・ハイル^000000さんに";
	mes "似ている気がする-";
	getitem 7503,1;
	set KH_QUE,33;
	next;
	cutin "kh_kyel_port",255;
	mes "-ある程度情報が集まったみたいだ-";
	mes "-「ミッチェル」に会いに行こう-";
	close;
}

//============================================================
// キエルの部屋NPC
//------------------------------------------------------------
kh_mansion.gat,27,27,0	script	キエルの部屋入口#kiel	45,1,1,{
	warp "kh_kiehl01.gat",10,31;
	end;
OnInit:
	disablenpc;
	end;
}

kh_kiehl01.gat,17,39,0	script	受信機#kiel	111,{
	if('mob)
		end;
	mes "-……ジ……ジジ……ジ……-";
	if(KH_QUE == 36) {
		mes "-雑音まみれの受信機から";
		mes "誰かの声が流れてきた-";
		next;
		mes "[????]";
		mes "おやおや。";
		mes "見慣れない顔ですね……";
		mes "父に送られた刺客……でしょうか。";
		next;
		mes "[????]";
		mes "フフ……";
		mes "そうですね……";
		mes "ここまで無事に来れたら、";
		mes "私のスクロールを差し上げましょう。";
		mes "あなたの力、見せて頂きますよ。";
		set KH_QUE,37;
	}
	close2;
	set 'mob,'mob+2;
	monster "kh_kiehl01.gat",17,33,"エリセル",1739,1,"受信機#kiel::OnKilled";
	monster "kh_kiehl01.gat",18,33,"エリオット",1740,1,"受信機#kiel::OnKilled";
	end;
OnKilled:
	set 'mob,'mob-1;
	if('mob == 0)
		dropitem "kh_kiehl01.gat",19,36,7506,1,0;
	end;
}

kh_kiehl01.gat,13,40,0	script	花瓶	111,{
	if(KH_QUE < 38) {
		mes "-花瓶が置かれている-";
		if(KH_QUE != 37)
			close;
		next;
		switch(select("花瓶を手にもつ","花瓶を壊す","花瓶をひっくり返す")) {
		case 1:
			mes "-何も起きない-";
			close;
		case 2:
			mes "-……割れない-";
			mes "-レッケンベルの特製品か？-";
			close;
		case 3:
			set KH_QUE,38;
			break;
		}
	}
	mes "-花瓶の底に";
	mes "文字が書かれている-";
	mes "^FF0000-全ては彼女のために-";
	mes "-全ては思い出のために-";
	mes "-愛しい君の事は忘れない……-";
	close;
}

kh_kiehl01.gat,19,24,0	script	箱	111,{
	if(KH_QUE >= 39) {
		mes "-箱の中にはもう何も無い-";
		close;
	}
	mes "-箱が開かない-";
	mes "-よく見ると、箱には";
	mes "文字が沢山並んでいる-";
	next;
	input '@str$;
	if('@str$ != "エリシア" || KH_QUE != 38) {
		mes "「ピー！」";
		mes "「暗号が違います！」";
		close;
	}
	mes "-箱を開けると、";
	mes "「チャリン」という音がした-";
	mes "-箱の中には";
	mes "^FF0000小さな鍵^000000が入っていた-";
	getitem 7505,1;
	set KH_QUE,39;
	close;
}

kh_kiehl01.gat,44,33,0	script	大きなドア#kiel1	111,{
	if(KH_QUE < 39 || KH_QUE > 53) {
		mes "-ドアに鍵が掛かっている-";
		close;
	}
	mes "-ドアが開いた-";
	enablenpc "kiehlwarp1";
	initnpctimer;
	close;
OnTimer30000:
	stopnpctimer;
	disablenpc "kiehlwarp1";
	end;
}
kh_kiehl01.gat,43,33,0	script	kiehlwarp1	45,1,1,{
	warp "kh_kiehl01.gat",55,34;
	end;
OnInit:
	disablenpc;
	end;
}

kh_kiehl01.gat,174,40,0	script	大きなドア#kiel2	111,{
	if(KH_QUE >= 40 && KH_QUE <= 53) {
		enablenpc "kiehlwarp2";
		initnpctimer;
		end;
	}
	if(KH_QUE < 39 || KH_QUE > 53) {
		mes "-ドアに鍵が掛かっている-";
		close;
	}
	mes "-ドアに鍵が掛かっている-";
	mes "-鍵穴が一つある-";
	next;
	input '@str$;
	if('@str$ != "小さな鍵") {
		mes "-ドアは開かない-";
		close;
	}
	mes "-^FF0000鍵^000000を差し込むと";
	mes "ドアが開いた-";
	delitem 7505,1;
	set KH_QUE,40;
	enablenpc "kiehlwarp2";
	initnpctimer;
	close;
OnTimer30000:
	stopnpctimer;
	disablenpc "kiehlwarp2";
	end;
}
kh_kiehl01.gat,174,39,0	script	kiehlwarp2	45,1,1,{
	warp "kh_kiehl01.gat",173,52;
	end;
OnInit:
	disablenpc;
	end;
}

kh_kiehl01.gat,77,107,0	script	大きなドア#kiel3	111,{
	if(KH_QUE < 40 || KH_QUE > 53) {
		mes "-ドアに鍵が掛かっている-";
		close;
	}
	mes "-ドアに鍵が掛かっている-";
	mes "-何かの切れ目がある-";
	next;
	input '@str$;
	if('@str$ != "黒色のカードキー" || countitem(7506) < 1) {
		mes "-ドアは開かない-";
		close;
	}
	mes "-^0000FF黒色のカードキー^000000を通すと、";
	mes "ドアが開いた-";
	delitem 7506,1;
	enablenpc "kiehlwarp3";
	initnpctimer;
	close;
OnTimer30000:
	stopnpctimer;
	disablenpc "kiehlwarp3";
	end;
}
kh_kiehl01.gat,78,107,0	script	kiehlwarp3	45,1,1,{
	warp "kh_kiehl01.gat",68,107;
	end;
OnInit:
	disablenpc;
	end;
}
kh_kiehl01.gat,15,177,0	script	機械人形	111,{}
kh_kiehl01.gat,15,181,0	script	機械人形	111,{}
kh_kiehl01.gat,15,182,0	script	機械人形	111,{}
kh_kiehl01.gat,15,178,0	script	機械人形#kiel	111,{
	if('mob)
		end;
	mes "-試験管に触れると、";
	mes "機械人形が飛び出してきた-";
	close2;
	set 'mob,'mob+3;
	monster "kh_kiehl01.gat",18,181,"エリオット",1740,1,"機械人形#kiel::OnKilled";
	monster "kh_kiehl01.gat",18,180,"エリセル",1739,2,"機械人形#kiel::OnKilled";
	monster "kh_kiehl01.gat",18,179,"エリオット",1740,1,"機械人形#kiel::OnKilled";
	end;
OnKilled:
	set 'mob,'mob-1;
	if('mob == 0)
		dropitem "kh_kiehl01.gat",18,179,7506,1,0;
	end;
}

kh_kiehl01.gat,42,178,0	script	大きなドア#kiel4	111,{
	if(KH_QUE < 40 || KH_QUE > 53) {
		mes "-ドアに鍵が掛かっている-";
		close;
	}
	mes "-ドアに鍵が掛かっている-";
	mes "-何かの切れ目がある-";
	next;
	input '@str$;
	if('@str$ != "黒色のカードキー" || countitem(7506) < 1) {
		mes "-ドアは開かない-";
		close;
	}
	mes "-^0000FF黒色のカードキー^000000を通すと、";
	mes "ドアが開いた-";
	delitem 7506,1;
	enablenpc "kiehlwarp4";
	initnpctimer;
	close;
OnTimer30000:
	stopnpctimer;
	disablenpc "kiehlwarp4";
	end;
}
kh_kiehl01.gat,41,178,0	script	kiehlwarp4	45,1,1,{
	//warp "kh_kiehl01.gat",47,171;	//スタック位置なので位置補正
	warp "kh_kiehl01.gat",47,178;
	end;
OnInit:
	disablenpc;
	end;
}

kh_kiehl01.gat,166,187,0	script	大きなドア#kiel5	111,{
	if('mob)
		end;
	if(getnpctimer(1,"キエル#kiel1")) {
		mes "-ドアはびくともしない-";
		mes "-開けるのは無理みたいだ-";
		close;
	}
	switch(KH_QUE) {
	default:
		mes "-動かない大きなドアがある-";
		close;
	case 40:
	case 41:
	case 42:
	case 43:
		mes "-大きなドアがある-";
		mes "-ドアの奥から、";
		mes "微かな物音が聞こえる-";
		next;
		menu "ドアを押す",-,"ドアを引く",-,"ドアを蹴る",-,"ドアに軽く触れる",-,"ドアを調べる",-;
		mes "-ドアに触れた瞬間、";
		mes "機械人形が出現した-";
		mes "-何か装置でもあるのか？-";
		set KH_QUE,KH_QUE+1;
		close2;
		set 'mob,'mob+2;
		monster "kh_kiehl01.gat",165,183,"エリオット",1740,1,"大きなドア#kiel5::OnKilled";
		monster "kh_kiehl01.gat",163,183,"エリセル",1739,1,"大きなドア#kiel5::OnKilled";
		end;
	case 44:
	case 45:
	case 46:
	case 47:
		mes "-ドアがほんの少しだけ開いている-";
		mes "-何かでこじあければ";
		mes "通れるようになるかもしれない-";
		if(countitem(7507) < 1)
			close;
		next;
		if(select("鋼鉄","さびた鉄の片","硬い鉄の欠片","ねじ","やめておく")!=3) {
			mes "-ドアは開かない-";
			close;
		}
		if(KH_QUE < 47) {
			mes "-ドアが少しだけ開いた-";
			mes "-もうちょっとがんばれば";
			mes "通れるようになりそうだ-";
		}
		else {
			mes "^0000FF-硬い鉄の欠片を何度も";
			mes "使って、ようやく";
			mes "通り抜けれるだけの空間ができた-^000000";
		}
		delitem 7507,1;
		set KH_QUE,KH_QUE+1;
		close;
	case 48:
	case 49:
	case 50:
	case 51:
	case 52:
	case 53:
		mes "-ドアの奥に進みますか？-";
		next;
		if(select("はい","いいえ")==2)
			close;
		enablenpc "kiehlwarp5";
		initnpctimer;
		close;
	}
OnKilled:
	set 'mob,'mob-1;
	end;
OnTimer30000:
	stopnpctimer;
	disablenpc "kiehlwarp5";
	end;
}
kh_kiehl01.gat,166,186,0	script	kiehlwarp5	45,1,1,{
	if(KH_QUE >= 48 && KH_QUE <= 53) {
		enablenpc "kiehlwarp5";
		initnpctimer "キエル#kiel1";
		switch(KH_QUE) {
		case 51:
		case 52:
			hideoffnpc "ミッチェル#kiel";
			for(set '@i,1; '@i<=5; set '@i,'@i+1)
				hideoffnpc "要員#kiel"+'@i;
			break;
		case 53:
			enablenpc "kiehlwarp6";
			break;
		}
	}
	warp "kh_kiehl02.gat",49,6;
	end;
OnInit:
	disablenpc;
	end;
}

kh_kiehl02.gat,49,10,0	script	トラップ	139,4,2,{
	if(KH_QUE != 48)
		end;
	monster "kh_kiehl02.gat",46,13,"アリセル",1739,1;
	monster "kh_kiehl02.gat",47,13,"アリオット",1740,1;
	monster "kh_kiehl02.gat",48,13,"アリセル",1739,1;
	monster "kh_kiehl02.gat",49,13,"アリオット",1740,1;
	monster "kh_kiehl02.gat",50,13,"アリセル",1739,1;
	monster "kh_kiehl02.gat",51,13,"アリオット",1740,1;
	monster "kh_kiehl02.gat",52,13,"アリセル",1739,1;
	monster "kh_kiehl02.gat",53,13,"アリオット",1740,1;
	set KH_QUE,49;
	end;
}

kh_kiehl02.gat,50,52,4	script	キエル#kiel1	902,{
	cutin "kh_kiel01",2;
	switch(KH_QUE) {
	default:
		mes "[キエル]";
		mes "……お静かに願います……";
		break;
	case 49:
		mes "[キエル]";
		mes "お待ちしておりました。";
		mes "このような所まで";
		mes "いらっしゃるとは、";
		mes "大変光栄です。";
		next;
		mes "[キエル]";
		mes "さて、先ほどお話した通り、";
		mes "私のスクロールでも";
		mes "差し上げたい所ですが……";
		next;
		mes "[キエル]";
		mes "残念ながら、";
		mes "これを抜き取ってしまったら";
		mes "私はそれこそただの人形。";
		mes "申し訳ありませんが、";
		mes "少々抵抗させてもらいます。";
		close2;
		cutin "kh_kiel01",255;
		hideonnpc;
		set KH_QUE,50;
		set getvariableofnpc('mob,"kielmob"),10;
		monster "kh_kiehl02.gat",49,51,"エリオット",1740,2,"kielmob::OnKilled";
		monster "kh_kiehl02.gat",49,51,"エリセル",1739,2,"kielmob::OnKilled";
		monster "kh_kiehl02.gat",49,51,"コンスタント",1745,1,"kielmob::OnKilled";
		monster "kh_kiehl02.gat",50,51,"エリオット",1740,2,"kielmob::OnKilled";
		monster "kh_kiehl02.gat",50,51,"エリセル",1739,2,"kielmob::OnKilled";
		monster "kh_kiehl02.gat",50,51,"コンスタント",1745,1,"kielmob::OnKilled";
		end;
	case 50:
		cutin "kh_kiel03",2;
		mes "[キエル]";
		mes "流石……ですね。";
		mes "父の刺客だけあって、";
		mes "実力がおありのようだ。";
		next;
		mes "[キエル]";
		mes "さて……このまま遊んでいても";
		mes "つまらない事ですし、";
		mes "父があなたに何を言ったのか";
		mes "お聞かせ願えますか？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "^FF0000キル・ハイル^000000さんは";
		mes "あなたを止めてくれと言いました。";
		mes "彼は自分の過去に苦しんでます。";
		mes "^0000FFキエル^000000……";
		mes "こんな事はやめて、私と一緒に";
		mes "お父さんの元に帰ってください！";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "あなたは同族を苦しめている。";
		mes "そんなの、間違っている！";
		next;
		cutin "kh_kiel01",2;
		mes "[キエル]";
		mes "同族……ですか？";
		mes "……フフ……";
		mes "それは人間であるあなた方も";
		mes "同じではありませんか？";
		mes "神の創造物である人間。";
		mes "人間の創造物である機械人形。";
		next;
		mes "[キエル]";
		mes "自分の利益のため、";
		mes "同じ人間を殺し、実験するあなたたち。";
		mes "私の願いのため、";
		mes "人形を必要としている者に提供する私。";
		mes "どこが違うというのです？";
		next;
		mes "[キエル]";
		mes "私の作った人形は人間と似ていますが、";
		mes "学習に対して何も感じる事がない。";
		mes "痛みも苦痛も感じることはない。";
		mes "そう作られているのです。";
		next;
		mes "[キエル]";
		mes "しかし人間は違う。";
		mes "目の前で苦痛を感じ、";
		mes "訴える自分の同族である「人間」を";
		mes "あなたたちは無視している。";
		mes "慈悲深いのがどちらなのか、";
		mes "明らかではありませんか？";
		next;
		cutin "kh_kiel04",2;
		mes "[キエル]";
		mes "申し訳ありませんが、";
		mes "あなたの提案は却下させて頂きます。";
		mes "歪んだ愛情のため、";
		mes "他人の家庭を破滅させてしまう。";
		mes "そんな父が、私よりまともに人形を";
		mes "扱えるとは到底考えられません。";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……そう。";
		mes "彼は過ちを犯してしまった。";
		mes "でも^0000FFキエル^000000！";
		mes "あなたが手を組んでいる";
		mes "レッケンベルこそ、";
		mes "そんな人間の代表なんだ！";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "彼らともう関わらないで！";
		mes "彼らに協力するほど、";
		mes "不幸になる人が増えてしまう！";
		next;
		cutin "kh_kiel02",2;
		mes "[キエル]";
		mes "…………";
		mes "あなたがここで最初に見た部屋。";
		mes "どんな部屋だったのか覚えていますか？";
		mes "……五つ揃った子供用品が";
		mes "いくつもあったでしょう……";
		next;
		mes "[キエル]";
		mes "そこは私が";
		mes "初めて作られた時の部屋です。";
		mes "ですが、どうして";
		mes "私一人しかいないというのに、";
		mes "五つも同じ物が揃っているのか、";
		mes "あなたにわかりますか？";
		next;
		mes "[" +strcharinfo(0)+ "]";
		mes "……!?";
		next;
		mes "[キエル]";
		mes "最初の第2世代として作られた";
		mes "機械人形は5体。";
		mes "私たちはレッケンベルから派遣された";
		mes "職員から教育を受けた。";
		next;
		mes "[キエル]";
		mes "機械人形である私たちでも";
		mes "耐え難い教育でした……";
		mes "強化実験。学習能力実験。";
		mes "状況による感情表現の学習……";
		next;
		mes "[キエル]";
		mes "初期不良だったのか、";
		mes "それとも偏った教育のためか……";
		mes "4体の機械人形が学習、";
		mes "実験中に機能を停止しました。";
		next;
		mes "[キエル]";
		mes "そして、唯一生き残ったのが";
		mes "この私です。";
		mes "父は、それまで名前もなかった私に";
		mes "^0000FFキエル^000000という名を";
		mes "与えてくださいました。";
		next;
		cutin "kh_kiel03",2;
		mes "[キエル]";
		mes "レッケンベル。";
		mes "彼らの非人道的な行いは";
		mes "誰よりも知っていますよ。";
		mes "そう……この身をもってね。";
		mes "しかし、私は恨んでいません。";
		next;
		mes "[キエル]";
		mes "それが人間の本質。";
		mes "人より上に立つ者の";
		mes "本性だからです！";
		next;
		mes "[キエル]";
		mes "……さて、";
		mes "これぐらいにしておきましょう。";
		mes "あなたはなかなか面白い方だ。";
		mes "このまま帰ってくださるなら、";
		mes "出口までご案内しましょう。";
		close2;
		cutin "kh_kiel01",255;
		set KH_QUE,51;
		hideoffnpc "ミッチェル#kiel";
		for(set '@i,1; '@i<=5; set '@i,'@i+1)
			hideoffnpc "要員#kiel"+'@i;
		end;
	case 51:
		mes "[ミッチェル]";
		mes "そうはいかないわ！";
		mes "^0000FFキエル・ハイル^000000！";
		mes "お前を不法武器製造と";
		mes "密輸入の容疑で逮捕する！";
		next;
		mes "[キエル]";
		mes "……おやおや。";
		mes "困りましたね。";
		mes "これでは私も";
		mes "抵抗しなければならない。";
		mes "……仕方ありません。";
		next;
		mes "[キエル]";
		mes "邪魔なあなたたちは";
		mes "しばしの間お休みください。";
		next;
		mes "[ミッチェル]";
		mes "な!?　これは!!";
		misceffect 404,"ミッチェル#kiel";
		for(set '@i,1; '@i<=5; set '@i,'@i+1)
			misceffect 404,"要員#kiel"+'@i;
		next;
		cutin "kh_kiel03",2;
		mes "[キエル]";
		mes "さて。";
		mes "これではあなたも";
		mes "帰ることはできませんね？";
		mes "……では、もう一度";
		mes "お相手願います。";
		close2;
		cutin "kh_kiel01",255;
		hideonnpc;
		set KH_QUE,52;
		set getvariableofnpc('mob,"kielmob"),1;
		monster "kh_kiehl02.gat",50,52,"キエル",1733,1,"kielmob::OnKilled";
		end;
	case 52:
		cutin "kh_kiel02",2;
		mes "[キエル]";
		mes "……フッフッフッフ……";
		mes "やはり、あなたの実力は";
		mes "想定しがたいものがあります。";
		next;
		cutin "kh_kiel03",2;
		mes "[キエル]";
		mes "フフ……ですが。";
		mes "あなたに私を捕まえる事はできません。";
		mes "なぜなら、私と一緒に";
		mes "あの世へと行く事になるからです！";
		mes "あぁ……私には魂が無いので";
		mes "行くのはあなただけですね……フフ。";
		next;
		mes "[ミッチェル]";
		mes "!!!!";
		announce "キリキリキリキリ　ドドーン!!　ガシャ！　ガチャン！　ガチャン！",9,0xFF0000;
		next;
		mes "[ミッチェル]";
		mes "!!!!";
		mes "この音は!?";
		mes "しまった！　閉じ込められた！";
		next;
		mes "[キエル]";
		mes "クックックック……";
		mes "どうです？";
		mes "面白い仕掛けでしょう。";
		next;
		mes "[ミッチェル]";
		mes "ッ……";
		mes "早く！";
		mes "^FF0000キル・ハイル^000000から受け取った";
		mes "装置を使うのよ！";
		next;
		mes "[キエル]";
		mes "フフ……";
		mes "何をしても無駄ですよ。";
		mes "なにせ、自爆装置を持っているのは";
		mes "私ではありませんから。";
		mes "フフフ……";
		announce "WARNING　WARNING",9,0xFF0000;
		next;
		mes "[ミッチェル]";
		mes "なッ!?";
		mes "まだ他にだれか……";
		mes "まさか！";
		mes "レッケンベルがここに!?";
		next;
		mes "[????]";
		mes "レッケンベルではありませんよ。";
		mes "フフ……";
		mes "本体までお見せしているというのに。";
		next;
		mes "[ミッチェル]";
		mes "誰！";
		mes "姿を見せなさい！";
		next;
		mes "[????]";
		mes "まだわからないのですか？";
		mes "それとも、私の声が";
		mes "わからないとでも？";
		next;
		mes "[ミッチェル]";
		mes "な……";
		mes "まさか!!";
		next;
		hideoffnpc "キエル#kiel2";
		next;
		cutin "kh_kiel01",0;
		mes "[キエル]";
		mes "いたずらが過ぎましたね。";
		mes "改めてご挨拶させていただきます。";
		mes "^0000FFキエル・ハイル^000000と申します。";
		next;
		mes "[ミッチェル]";
		mes "……なぜ？";
		mes "どうして^0000FFキエル^000000が二人いるの!?";
		next;
		cutin "kh_kiel03",2;
		mes "[キエル]";
		mes "フフ……お忘れですか？";
		mes "私は機械人形ですよ。";
		mes "^0000FFミッチェル・ライラ^000000さん。";
		next;
		mes "[ミッチェル]";
		mes "!?";
		mes "私の名前を……";
		mes "どうやって!?";
		next;
		mes "[キエル]";
		mes "おやおや。";
		mes "スパイがあなたたちだけと";
		mes "本気で思っているのですか？";
		next;
		mes "[覆面の男]";
		mes "申し訳ありません。ミッチェル様。";
		next;
		mes "[ミッチェル]";
		mes "ボルケウス！";
		mes "あなたが……どうして!?";
		mes "重傷を負ってまで";
		mes "大統領を助けたあなたが！";
		next;
		mes "[ボルケウス]";
		mes "信用を得るためなら何でもする。";
		mes "ミッチェル様。";
		mes "身近な人間から気を付けろと言った";
		mes "あなた自身が、私を信用しているのは";
		mes "見てて面白かった。";
		next;
		mes "[ミッチェル]";
		mes "そんな……";
		mes "あぁ……申し訳ありません、閣下……";
		next;
		mes "[キエル]";
		mes "紳士的ではありませんね、カイゾ。";
		mes "…………おっと。";
		mes "フフ、残念ですが、";
		mes "もう時間が無いようです。";
		next;
		cutin "kh_kiel01",2;
		mes "[キエル]";
		mes "自爆装置が作動してから";
		mes "5分後にこの部屋は消滅します。";
		mes "^0000FFミッチェル・ライラ^000000さんは";
		mes "私たちと一緒に来ていただきましょう。";
		next;
		mes "[キエル]";
		mes "私はシュバルツバルドの大統領が";
		mes "何を考えているのか";
		mes "知りたいのです……フフ。";
		next;
		mes "[キエル]";
		mes "カイゾ、^0000FFミッチェル^000000さんを";
		mes "丁重にお連れしてください。";
		next;
		mes "[ボルケウス-カイゾ]";
		mes "……了解した。";
		next;
		mes "[ミッチェル]";
		mes "くそ！";
		mes "離せ！";
		mes "離せ、ボルケウス!!";
		next;
		hideonnpc "ミッチェル#kiel";
		for(set '@i,1; '@i<=5; set '@i,'@i+1)
			hideonnpc "要員#kiel"+'@i;
		next;
		cutin "kh_kiel02",2;
		mes "[キエル]";
		mes "さて……";
		mes "あちらの問題も片付いた事ですし……";
		mes "少々私とお話をしましょうか？";
		next;
		mes "[キエル]";
		mes "あぁ、失礼しました。";
		mes "あなたにはもう時間が";
		mes "ないようですね。";
		mes "フフフ……";
		next;
		mes "[キエル]";
		mes "ここはすぐ崩れるので";
		mes "早く逃げた方がいいでしょう。";
		next;
		mes "[キエル]";
		mes "ついで……と言ってはなんですが……";
		mes "父に一つ伝言をお願いできますか？";
		next;
		mes "[キエル]";
		mes "恐らく……父は私の本体にある";
		mes "^FF0000指輪^000000を持って来るように";
		mes "頼んだのではないですか？";
		mes "私も、指輪を初めて見た時は";
		mes "とても驚きました。";
		next;
		cutin "kh_kiel04",2;
		mes "[キエル]";
		mes "大切な物だったようですね。";
		mes "私が壊してしまうと思って";
		mes "気が気ではなかったでしょう。";
		next;
		cutin "kh_kiel01",2;
		mes "[キエル]";
		mes "23年間御苦労さまでした。";
		mes "もうお休みください。";
		mes "……この私、^0000FFキエル^000000。";
		next;
		misceffect 372;
		next;
		mes "[キエル]";
		mes "……攻撃する意思がない証として、";
		mes "本体をここに残していきます。";
		mes "さぁ、どうぞ。";
		mes "^FF0000指輪^000000を回収して";
		mes "父にお伝えください。";
		next;
		mes "[キエル]";
		mes "「あなたに作られた";
		mes "体を返したのですから、";
		mes "もうこれ以上、あなたとは";
		mes "何の縁もない。";
		mes "さようなら……」";
		next;
		mes "[キエル]";
		mes "私はすでに、父の設計図に縛られた";
		mes "第2世代の人形ではありません。";
		mes "私自身で開発した新しい体。";
		mes "この私自身が第4世代なのです。";
		next;
		mes "[キエル]";
		mes "あなたの頭では少々難しいでしょうが、";
		mes "父にはわかるはずですよ。";
		mes "さて、もう残り3分しかありません。";
		mes "失礼ながら、私はこれで……";
		mes "また、お会いしましょう……フフフ。";
		next;
		hideonnpc "キエル#kiel2";
		enablenpc "kiehlwarp6";
		delitem 7504,1;
		setnpctimer 1999000;
		set KH_QUE,53;
		break;
	case 53:
		cutin "kh_kiel02",2;
		mes "-まったく動かない^0000FFキエル^000000の";
		mes "本体から^FF0000指輪^000000を取り出した-";
		getitem 7508,1;
		set KH_QUE,54;
		break;
	case 54:
	case 55:
	case 56:
		cutin "kh_kiel02",2;
		mes "-^0000FFキエル^000000の本体だけが残っている-";
		break;
	}
	close2;
	cutin "kh_kiel01",255;
	end;
OnTimer1200000:
	areawarp "kh_kiehl02.gat",0,0,100,100,"lighthalzen.gat",193,202;
	killmonster "kh_kiehl02.gat","All";
	disablenpc "kiehlwarp6";
	hideonnpc "ミッチェル#kiel";
	for(set '@i,1; '@i<=5; set '@i,'@i+1)
		hideonnpc "要員#kiel"+'@i;
	hideonnpc "キエル#kiel2";
	hideoffnpc;
	set 'mob,0;
	stopnpctimer;
	end;
OnTimer2000000:
	announce "爆発まで、あと3分",9,0xFF0000;
	end;
OnTimer2060000:
	announce "爆発まで、あと2分",9,0xFF0000;
	end;
OnTimer2120000:
	announce "爆発まで、あと1分",9,0xFF0000;
	end;
OnTimer2150000:
	announce "爆発まで、あと30秒",9,0xFF0000;
	end;
OnTimer2160000:
	announce "爆発まで、あと20秒",9,0xFF0000;
	end;
OnTimer2170000:
	announce "爆発まで、あと10秒",9,0xFF0000;
	end;
OnTimer2175000:
	announce "5",9,0xFF0000;
	end;
OnTimer2176000:
	announce "4",9,0xFF0000;
	end;
OnTimer2177000:
	announce "3",9,0xFF0000;
	end;
OnTimer2178000:
	announce "2",9,0xFF0000;
	end;
OnTimer2179000:
	announce "1",9,0xFF0000;
	end;
OnTimer2180000:
	announce "ピーーー",9,0xFF0000;
	areawarp "kh_kiehl02.gat",0,0,100,100,"lighthalzen.gat",193,202;
	killmonster "kh_kiehl02.gat","All";
	disablenpc "kiehlwarp6";
	hideonnpc "ミッチェル#kiel";
	for(set '@i,1; '@i<=5; set '@i,'@i+1)
		hideonnpc "要員#kiel"+'@i;
	hideonnpc "キエル#kiel2";
	hideoffnpc;
	set 'mob,0;
	stopnpctimer;
	end;
}

kh_kiehl02.gat,0,0,0	script	kielmob	-1,{
OnKilled:
	set 'mob,'mob-1;
	if('mob == 0)
		hideoffnpc "キエル#kiel1";
	end;
}

kh_kiehl02.gat,49,55,6	script	ミッチェル#kiel	727,{
	end;
OnInit:
	hideonnpc;
	end;
}
kh_kiehl02.gat,53,52,4	duplicate(ミッチェル#kiel)	要員#kiel1	880
kh_kiehl02.gat,51,49,1	duplicate(ミッチェル#kiel)	要員#kiel2	880
kh_kiehl02.gat,47,50,0	duplicate(ミッチェル#kiel)	要員#kiel3	880
kh_kiehl02.gat,46,53,6	duplicate(ミッチェル#kiel)	要員#kiel4	880
kh_kiehl02.gat,48,53,5	duplicate(ミッチェル#kiel)	キエル#kiel2	902

kh_kiehl02.gat,49,56,0	script	kiehlwarp6	45,1,1,{
	warp "lighthalzen.gat",193,202;
	end;
OnInit:
	disablenpc;
	end;
}
